Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_FontSubstitute Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Types
enum  | Identification : unsigned char {
 Identification::Unset = 0, Identification::FontCharacteristics = 1, Identification::PostScriptName = 2, Identification::QuartetName = 3,
 Identification::QuartetFace = 4, Identification::FamilyName = 5, Identification::FamilyFace = 6
 }
MissingFontIdentification enumerates the ways a missing font can be specified. The method that is used determines on the context where the font is referenced. A ON_FontSubstitute class can support multiple ways. More...
 Public Member Functions
ON_FontSubstitute ()=default
ON_FontSubstitute (const ON_FontSubstitute &)=default
~ON_FontSubstitute ()=default
void  | ClearFamily ()
void  | ClearFontCharacteristicsHash ()
void  | ClearPostScriptName ()
void  | ClearQuartet ()
void  | CopyFamily (const ON_FontSubstitute &src)
void  | CopyFontCharacteristicsHash (const ON_FontSubstitute &src)
void  | CopyPostScriptName (const ON_FontSubstitute &src)
void  | CopyQuartet (const ON_FontSubstitute &src)
void  | Dump (ON_TextLog &text_log) const
bool  | HasFamilyFace () const
bool  | HasFamilyName () const
bool  | HasFontCharacteristicsHash () const
bool  | HasPostScriptName () const
bool  | HasQuartetFace () const
bool  | HasQuartetName () const
bool  | IsSet () const
bool  | IsUnset () const
bool  | IsValid (bool bTestLookup, ON_TextLog &error_log) const
ON_Font::Stretch  | MissingFamilyFaceStretch () const
ON_Font::Style  | MissingFamilyFaceStyle () const
ON_Font::Weight  | MissingFamilyFaceWeight () const
const ON_wString  | MissingFamilyName () const
const ON_SHA1_Hash  | MissingFontCharacteristicsHash () const
const ON_wString  | MissingPostScriptName () const
bool  | MissingQuartetFaceIsBold () const
bool  | MissingQuartetFaceIsItalic () const
ON_FontFaceQuartet::Member  | MissingQuartetFaceMember () const
const ON_wString  | MissingQuartetName () const
ON_FontSubstitute &  | operator= (const ON_FontSubstitute &)=default
const unsigned  | RuntimeSerialNumber () const
const ON_Font *  | SubstituteFont () const
 Static Public Member Functions
static unsigned  | AddQuartetSubstitution (const ON_wString missing_quartet_name, const ON_FontFaceQuartet installed_font_quartet)
static const ON_FontSubstitute *  | AddSubstitution (const ON_FontSubstitute s)
static int  | CompareFamilyFace (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareFamilyFacePointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | CompareFamilyName (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareFamilyNamePointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | CompareFontCharacteristicsHash (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareFontCharacteristicsHashPointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | ComparePostScriptName (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | ComparePostScriptNamePointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | CompareQuartetFace (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareQuartetFacePointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | CompareQuartetName (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareQuartetNamePointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static int  | CompareRuntimeSerialNumber (const ON_FontSubstitute *lhs, const ON_FontSubstitute *rhs)
static int  | CompareRuntimeSerialNumberPointer (const ON_FontSubstitute *const *lhs, const ON_FontSubstitute *const *rhs)
static const ON_FontSubstitute  | CreateFromFamilyWeightStretchStyle (const ON_wString missing_font_family_name, ON_Font::Weight missing_font_family_weight, ON_Font::Stretch missing_font_family_stretch, ON_Font::Style missing_font_family_style, const ON_Font *substitute_font)
static const ON_FontSubstitute  | CreateFromMissingFontCharacteristics (const ON_Font *missing_font_characteristics, const ON_Font *substitute_font)
static const ON_FontSubstitute  | CreateFromPostScriptName (const ON_wString missing_font_postscript_name, const ON_Font *substitute_font)
static const ON_FontSubstitute  | CreateFromQuartetFace (const ON_wString missing_font_quartet_name, bool missing_font_quartet_face_is_bold, bool missing_font_quartet_face_is_italic, const ON_Font *substitute_font)
static const ON_FontSubstitute  | CreateFromQuartetFace (const ON_wString missing_font_quartet_name, ON_FontFaceQuartet::Member missing_font_quartet_member, const ON_Font *substitute_font)
static const ON_FontSubstitute  | CreateFromQuartetName (const ON_wString missing_font_quartet_name, const ON_Font *substitute_font)
static const ON_Font *  | DefaultSubstitute ()
static void  | DumpSubstitutions (ON_TextLog &text_log)
static const ON_FontSubstitute *  | FindSubstitutionFromFamilyFace (const ON_wString missing_font_family_name, ON_Font::Weight weight, ON_Font::Stretch stretch, ON_Font::Style style, bool bReturnClosestFace)
static const ON_FontSubstitute *  | FindSubstitutionFromFamilyName (const ON_wString missing_font_family_name)
static const ON_FontSubstitute *  | FindSubstitutionFromFont (const ON_Font *missing_font)
static const ON_FontSubstitute *  | FindSubstitutionFromHash (const ON_SHA1_Hash missing_font_characteristics_hash)
static const ON_FontSubstitute *  | FindSubstitutionFromPostScriptName (const ON_wString missing_font_postscript_name)
static const ON_FontSubstitute *  | FindSubstitutionFromQuartetFace (const ON_wString missing_font_quartet_name, bool bBoldMember, bool bItalicMember, bool bReturnClosestFace)
static const ON_FontSubstitute *  | FindSubstitutionFromQuartetFace (const ON_wString missing_font_quartet_name, ON_FontFaceQuartet::Member member, bool bReturnClosestFace)
static const ON_FontSubstitute *  | FindSubstitutionFromQuartetName (const ON_wString missing_font_quartet_name)
static bool  | FontSubstitutionsAreValid (ON_TextLog &error_log)
static void  | IterateSubstitutions (ON__UINT_PTR callback_context, bool(*callback)(ON__UINT_PTR, const ON_FontSubstitute *))
static ON_FontSubstitute::Identification  | MissingFontIdentificationFromUnsigned (unsigned missing_font_identification_as_unsigned)
static unsigned  | RemoveAllSubstitutions ()
static bool  | RemoveSubstitution (const ON_FontSubstitute *&s)
static bool  | SetDefaultSubstitute (const ON_Font *installed_font)
static unsigned int  | SubstitutionsCount ()
 Static Public Attributes
static const ON_FontSubstitute  | Unset
Member Enumeration Documentation
◆ Identification
 enum ON_FontSubstitute::Identification : unsigned char
strong
MissingFontIdentification enumerates the ways a missing font can be specified. The method that is used determines on the context where the font is referenced. A ON_FontSubstitute class can support multiple ways.
Enumerator
Unset
Unset value.
FontCharacteristics
Font characteristics hash used to identify the missing font.
PostScriptName
PostScript name used to identify the missing font. On Apple platforms the PostScript name typically identifies a unique face. On Windows platforms a group of simulated fonts, like Bahnschrift, can have the same PostScript name.
QuartetName
Font face quartet (Windows LOGFONT) name used to identify the missing font. A font face quartet has up to four faces (regular, bold, italic, bold-italic). The absolute font weight cannot be used to reliably determine if a quartet face is bold. For example, Arial Black has a very high weight but is the regular face in its quartet.
QuartetFace
Quartet name (Windows LOGFONT) name and face (regular, bold, italic, bold-italic) used to identify the missing font. The absolute font weight cannot be used to reliably determine if a quartet face is bold. For example, Arial Black has a very high weight but is the regular face in its quartet.
FamilyName
Family name used to identify the missing font. A family can contain many faces with different weights, stretches, and styles.
FamilyFace
Family face (name, weight, stretch, and style) used to identify the missing font.
Constructor & Destructor Documentation
◆ ON_FontSubstitute() [1/2]
 ON_FontSubstitute::ON_FontSubstitute  |  ( |   | )
default
◆ ~ON_FontSubstitute()
 ON_FontSubstitute::~ON_FontSubstitute  |  ( |   | )
default
◆ ON_FontSubstitute() [2/2]
 ON_FontSubstitute::ON_FontSubstitute  |  ( |  const ON_FontSubstitute &  |   | )
default
Member Function Documentation
◆ AddQuartetSubstitution()
 static unsigned ON_FontSubstitute::AddQuartetSubstitution  |  ( |  const ON_wString  |  missing_quartet_name,
|  const ON_FontFaceQuartet  |  installed_font_quartet
)
static
Description: Add a quartet of subsitutions. Returns: Number of substitutions added.
◆ AddSubstitution()
 static const ON_FontSubstitute* ON_FontSubstitute::AddSubstitution  |  ( |  const ON_FontSubstitute  |  s | )
static
Description: Add a font subsitution to the application.
◆ ClearFamily()
 void ON_FontSubstitute::ClearFamily  |  ( |   | )
◆ ClearFontCharacteristicsHash()
 void ON_FontSubstitute::ClearFontCharacteristicsHash  |  ( |   | )
◆ ClearPostScriptName()
 void ON_FontSubstitute::ClearPostScriptName  |  ( |   | )
◆ ClearQuartet()
 void ON_FontSubstitute::ClearQuartet  |  ( |   | )
◆ CompareFamilyFace()
 static int ON_FontSubstitute::CompareFamilyFace  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font family face (name and with/weight/style settings). ON_FontSubstitute classes with empty family names names are sorted last.
◆ CompareFamilyFacePointer()
 static int ON_FontSubstitute::CompareFamilyFacePointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CompareFamilyName()
 static int ON_FontSubstitute::CompareFamilyName  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font family name (ignores with/weight/style settings). ON_FontSubstitute classes with empty family names names are sorted last.
◆ CompareFamilyNamePointer()
 static int ON_FontSubstitute::CompareFamilyNamePointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CompareFontCharacteristicsHash()
 static int ON_FontSubstitute::CompareFontCharacteristicsHash  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font characteristics hash. ON_FontSubstitute classes with unset font characteristics are sorted last.
◆ CompareFontCharacteristicsHashPointer()
 static int ON_FontSubstitute::CompareFontCharacteristicsHashPointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ ComparePostScriptName()
 static int ON_FontSubstitute::ComparePostScriptName  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font Postscript names (ingores case) ON_FontSubstitute classes with empty PostScript names are sorted last.
◆ ComparePostScriptNamePointer()
 static int ON_FontSubstitute::ComparePostScriptNamePointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CompareQuartetFace()
 static int ON_FontSubstitute::CompareQuartetFace  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font quartet face (name and bold/italic settings). ON_FontSubstitute classes with empty quartet names names are sorted last.
◆ CompareQuartetFacePointer()
 static int ON_FontSubstitute::CompareQuartetFacePointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CompareQuartetName()
 static int ON_FontSubstitute::CompareQuartetName  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares missing font quartet names (ignores bold and italic settings). ON_FontSubstitute classes with empty quartet names names are sorted last.
◆ CompareQuartetNamePointer()
 static int ON_FontSubstitute::CompareQuartetNamePointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CompareRuntimeSerialNumber()
 static int ON_FontSubstitute::CompareRuntimeSerialNumber  |  ( |  const ON_FontSubstitute *  |  lhs,
|  const ON_FontSubstitute *  |  rhs
)
static
Description: Compares the values ON_FontSubstitute::RuntimeSerialNumber(). ON_FontSubstitute classes with unset font characteristics are sorted last.
◆ CompareRuntimeSerialNumberPointer()
 static int ON_FontSubstitute::CompareRuntimeSerialNumberPointer  |  ( |  const ON_FontSubstitute *const *  |  lhs,
|  const ON_FontSubstitute *const *  |  rhs
)
static
◆ CopyFamily()
 void ON_FontSubstitute::CopyFamily  |  ( |  const ON_FontSubstitute &  |  src | )
◆ CopyFontCharacteristicsHash()
 void ON_FontSubstitute::CopyFontCharacteristicsHash  |  ( |  const ON_FontSubstitute &  |  src | )
◆ CopyPostScriptName()
 void ON_FontSubstitute::CopyPostScriptName  |  ( |  const ON_FontSubstitute &  |  src | )
◆ CopyQuartet()
 void ON_FontSubstitute::CopyQuartet  |  ( |  const ON_FontSubstitute &  |  src | )
◆ CreateFromFamilyWeightStretchStyle()
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromFamilyWeightStretchStyle  |  ( |  const ON_wString  |  missing_font_family_name,
|  ON_Font::Weight  |  missing_font_family_weight,
|  ON_Font::Stretch  |  missing_font_family_stretch,
|  ON_Font::Style  |  missing_font_family_style,
|  const ON_Font *  |  substitute_font
)
static
Description: Many newer fonts like Apple's Helvetica Nueue and Windows' Bahnschrift have familys of a dozen or so faces and use weight, stretch, and style attributes to identify the various faces. Parameters: missing_font_family_name - [in] missing_font_family_weight - [in] missing_font_family_stretch - [in] missing_font_family_style - [in]
substitute_font - [in] This must be an installed font from ON_Font::InstalledFontList()
◆ CreateFromMissingFontCharacteristics()
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromMissingFontCharacteristics  |  ( |  const ON_Font *  |  missing_font_characteristics,
|  const ON_Font *  |  substitute_font
)
static
Parameters: missing_font_characteristics - [in] An ON_Font with all characteristics reliably set. Typically this is an ON_Font that was an installed font on another device. substitute_font - [in] This must be an installed font from ON_Font::InstalledFontList()
◆ CreateFromPostScriptName()
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromPostScriptName  |  ( |  const ON_wString  |  missing_font_postscript_name,
|  const ON_Font *  |  substitute_font
)
static
Parameters: substitute_font - [in] This must be an installed font from ON_Font::InstalledFontList()
◆ CreateFromQuartetFace() [1/2]
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromQuartetFace  |  ( |  const ON_wString  |  missing_font_quartet_name,
|  bool  |  missing_font_quartet_face_is_bold,
|  bool  |  missing_font_quartet_face_is_italic,
|  const ON_Font *  |  substitute_font
)
static
Description: Create from a quartet face (Windows LOGFONT) description. A quartet is a group of four faces (regular, bold, italic, bold-italic). On Windows this quartet is called a logical font or LOGFONT. There is no Apple OS analogue. Every quartet has a regular face but is is common for light and heavy fonts to not have bold members. Parameters: missing_font_quartet_name - [in] Quartet name. On Windows this is the Windows LOGFONT name. This name is guessed at on Apple platforms. missing_font_quartet_face_is_bold - [in] true if this is the bold or bold-italic member in the quartet. false if this is the regular or italic member in the quartet. missing_font_quartet_face_is_italic - [in] true if this is the italic or bold-italic member in the quartet. false if this is the regular or bold member in the quartet. substitute_font - [in] This must be an installed font from ON_Font::InstalledFontList()
◆ CreateFromQuartetFace() [2/2]
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromQuartetFace  |  ( |  const ON_wString  |  missing_font_quartet_name,
|  ON_FontFaceQuartet::Member  |  missing_font_quartet_member,
|  const ON_Font *  |  substitute_font
)
static
◆ CreateFromQuartetName()
 static const ON_FontSubstitute ON_FontSubstitute::CreateFromQuartetName  |  ( |  const ON_wString  |  missing_font_quartet_name,
|  const ON_Font *  |  substitute_font
)
static
Description: Create from a quartet face (Windows LOGFONT) description. A quartet is a group of four faces (regular, bold, italic, bold-italic). On Windows this quartet is called a logical font or LOGFONT. There is no Apple OS analogue. Every quartet has a regular face but is is common for light and heavy fonts to not have bold members. Parameters: missing_font_quartet_name - [in] Quartet name. On Windows this is the Windows LOGFONT name. This name is guessed at on Apple platforms. substitute_font - [in] This must be an installed font from ON_Font::InstalledFontList()
◆ DefaultSubstitute()
 static const ON_Font* ON_FontSubstitute::DefaultSubstitute  |  ( |   | )
static
Returns: The default substitute font set by SetDefaultSubstitute().
◆ Dump()
 void ON_FontSubstitute::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ DumpSubstitutions()
 static void ON_FontSubstitute::DumpSubstitutions  |  ( |  ON_TextLog &  |  text_log | )
static
Description: Print a list of all current substitutions.
◆ FindSubstitutionFromFamilyFace()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromFamilyFace  |  ( |  const ON_wString  |  missing_font_family_name,
|  ON_Font::Weight  |  weight,
|  ON_Font::Stretch  |  stretch,
|  ON_Font::Style  |  style,
|  bool  |  bReturnClosestFace
)
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromFamilyName()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromFamilyName  |  ( |  const ON_wString  |  missing_font_family_name | )
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromFont()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromFont  |  ( |  const ON_Font *  |  missing_font | )
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromHash()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromHash  |  ( |  const ON_SHA1_Hash  |  missing_font_characteristics_hash | )
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromPostScriptName()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromPostScriptName  |  ( |  const ON_wString  |  missing_font_postscript_name | )
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromQuartetFace() [1/2]
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromQuartetFace  |  ( |  const ON_wString  |  missing_font_quartet_name,
|  bool  |  bBoldMember,
|  bool  |  bItalicMember,
|  bool  |  bReturnClosestFace
)
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromQuartetFace() [2/2]
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromQuartetFace  |  ( |  const ON_wString  |  missing_font_quartet_name,
|  ON_FontFaceQuartet::Member  |  member,
|  bool  |  bReturnClosestFace
)
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FindSubstitutionFromQuartetName()
 static const ON_FontSubstitute* ON_FontSubstitute::FindSubstitutionFromQuartetName  |  ( |  const ON_wString  |  missing_font_quartet_name | )
static
Returns: The installed font to use in place of missing font or nullptr if no substitution has been is specified.
◆ FontSubstitutionsAreValid()
 static bool ON_FontSubstitute::FontSubstitutionsAreValid  |  ( |  ON_TextLog &  |  error_log | )
static
Description: Validate information used to map missing fonts to installed fonts.
◆ HasFamilyFace()
 bool ON_FontSubstitute::HasFamilyFace  |  ( |   | ) |   const
◆ HasFamilyName()
 bool ON_FontSubstitute::HasFamilyName  |  ( |   | ) |   const
◆ HasFontCharacteristicsHash()
 bool ON_FontSubstitute::HasFontCharacteristicsHash  |  ( |   | ) |   const
◆ HasPostScriptName()
 bool ON_FontSubstitute::HasPostScriptName  |  ( |   | ) |   const
◆ HasQuartetFace()
 bool ON_FontSubstitute::HasQuartetFace  |  ( |   | ) |   const
◆ HasQuartetName()
 bool ON_FontSubstitute::HasQuartetName  |  ( |   | ) |   const
◆ IsSet()
 bool ON_FontSubstitute::IsSet  |  ( |   | ) |   const
◆ IsUnset()
 bool ON_FontSubstitute::IsUnset  |  ( |   | ) |   const
◆ IsValid()
 bool ON_FontSubstitute::IsValid  |  ( |  bool  |  bTestLookup,
|  ON_TextLog &  |  error_log
) |   |  const
Parameters: bTestLookup - [in] If this->RuntimeSerialNumber() > 0 && bTestLookup is true, then lookups are tested.
◆ IterateSubstitutions()
 static void ON_FontSubstitute::IterateSubstitutions  |  ( |  ON__UINT_PTR  |  callback_context,
|  bool(*)(ON__UINT_PTR, const ON_FontSubstitute *)  |  callback
)
static
Parameters: callback - [in] Function to call with each available substitution in this application.
◆ MissingFamilyFaceStretch()
 ON_Font::Stretch ON_FontSubstitute::MissingFamilyFaceStretch  |  ( |   | ) |   const
Remarks: When MissingFontFamilyName() is empty, MissingFontFamilyFaceStretch() is meaningless.
◆ MissingFamilyFaceStyle()
 ON_Font::Style ON_FontSubstitute::MissingFamilyFaceStyle  |  ( |   | ) |   const
Remarks: When MissingFontFamilyName() is empty, MissingFontFamilyFaceStyle() is meaningless.
◆ MissingFamilyFaceWeight()
 ON_Font::Weight ON_FontSubstitute::MissingFamilyFaceWeight  |  ( |   | ) |   const
Remarks: When MissingFontFamilyName() is empty, MissingFontFamilyFaceWeight() is meaningless.
◆ MissingFamilyName()
 const ON_wString ON_FontSubstitute::MissingFamilyName  |  ( |   | ) |   const
◆ MissingFontCharacteristicsHash()
 const ON_SHA1_Hash ON_FontSubstitute::MissingFontCharacteristicsHash  |  ( |   | ) |   const
◆ MissingFontIdentificationFromUnsigned()
 static ON_FontSubstitute::Identification ON_FontSubstitute::MissingFontIdentificationFromUnsigned  |  ( |  unsigned  |  missing_font_identification_as_unsigned | )
static
Parameters: missing_font_identification_as_unsigned - [in] Returns: The MissingFontIdentification value with the same value as the parameter. MissingFontIdentification::None is returned when the parameter value is invalid.
◆ MissingPostScriptName()
 const ON_wString ON_FontSubstitute::MissingPostScriptName  |  ( |   | ) |   const
◆ MissingQuartetFaceIsBold()
 bool ON_FontSubstitute::MissingQuartetFaceIsBold  |  ( |   | ) |   const
Remarks: When MissingFontQuartetTextName() is empty, MissingFontQuartetFaceIsBold() is meaningless.
◆ MissingQuartetFaceIsItalic()
 bool ON_FontSubstitute::MissingQuartetFaceIsItalic  |  ( |   | ) |   const
Remarks: When MissingFontQuartetTextName() is empty, MissingFontQuartetFaceIsItalic() is meaningless.
◆ MissingQuartetFaceMember()
 ON_FontFaceQuartet::Member ON_FontSubstitute::MissingQuartetFaceMember  |  ( |   | ) |   const
Remarks: When MissingFontQuartetTextName() is empty, MissingFontQuartetFaceMember() is meaningless.
◆ MissingQuartetName()
 const ON_wString ON_FontSubstitute::MissingQuartetName  |  ( |   | ) |   const
◆ operator=()
 ON_FontSubstitute& ON_FontSubstitute::operator=  |  ( |  const ON_FontSubstitute &  |   | )
default
◆ RemoveAllSubstitutions()
 static unsigned ON_FontSubstitute::RemoveAllSubstitutions  |  ( |   | )
static
Description: Remove all font subsitutions from the application, including the default substitute.
◆ RemoveSubstitution()
 static bool ON_FontSubstitute::RemoveSubstitution  |  ( |  const ON_FontSubstitute *&  |  s | )
static
Description: Remove a font subsitution from the application. Parameter: s - [in] The substituion to remove. This must be a pointer value returned by AddSubstitution() or one of the statics below.
◆ RuntimeSerialNumber()
 const unsigned ON_FontSubstitute::RuntimeSerialNumber  |  ( |   | ) |   const
Returns: >0: This ON_FontSubstitute instance is part of the table used to manage missing font to installed font substitutions, the value is unique to this instance, and the class is managed by opennurbs. Do not delete it. 0: Otherwise. This class is manage by application code.
◆ SetDefaultSubstitute()
 static bool ON_FontSubstitute::SetDefaultSubstitute  |  ( |  const ON_Font *  |  installed_font | )
static
Parameters: installed_font - [in] This font must either be nullptr or it must be an installed font that is the regular member of its quartet. Returns: True if installed_font was valid input. False otherwise.
◆ SubstituteFont()
 const ON_Font* ON_FontSubstitute::SubstituteFont  |  ( |   | ) |   const
Description: The substitute font is always an installed font. It is never has underlined or strikethrough attributes set. Returns: The substitued font
◆ SubstitutionsCount()
 static unsigned int ON_FontSubstitute::SubstitutionsCount  |  ( |   | )
static
Returns: Total number of active substutitions.
Member Data Documentation
◆ Unset
 const ON_FontSubstitute ON_FontSubstitute::Unset
static