Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_SubDComponentId Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentId ()=default
ON_SubDComponentId (const class ON_SubDEdge *e)
ON_SubDComponentId (const class ON_SubDFace *f)
ON_SubDComponentId (const class ON_SubDVertex *v)
ON_SubDComponentId (const ON_SubDComponentId &)=default
ON_SubDComponentId (ON_SubDComponentPtr cptr)
ON_SubDComponentId (ON_SubDComponentPtr::Type component_type, unsigned int component_id)
~ON_SubDComponentId ()=default
unsigned int  | ComponentId () const
ON_SubDComponentPtr::Type  | ComponentType () const
bool  | IsSet () const
ON_SubDComponentId &  | operator= (const ON_SubDComponentId &)=default
 Static Public Member Functions
static int  | CompareTypeAndId (const ON_SubDComponentId &lhs, const ON_SubDComponentId &rhs)
static int  | CompareTypeAndIdFromPointer (const ON_SubDComponentId *lhs, const ON_SubDComponentId *rhs)
 Static Public Attributes
static const ON_SubDComponentId  | Unset
type = unset and id = 0; More...
Constructor & Destructor Documentation
◆ ON_SubDComponentId() [1/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |   | )
default
◆ ~ON_SubDComponentId()
 ON_SubDComponentId::~ON_SubDComponentId  |  ( |   | )
default
◆ ON_SubDComponentId() [2/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  const ON_SubDComponentId &  |   | )
default
◆ ON_SubDComponentId() [3/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  ON_SubDComponentPtr::Type  |  component_type,
|  unsigned int  |  component_id
)
◆ ON_SubDComponentId() [4/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  ON_SubDComponentPtr  |  cptr | )
◆ ON_SubDComponentId() [5/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  const class ON_SubDVertex *  |  v | )
◆ ON_SubDComponentId() [6/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  const class ON_SubDEdge *  |  e | )
◆ ON_SubDComponentId() [7/7]
 ON_SubDComponentId::ON_SubDComponentId  |  ( |  const class ON_SubDFace *  |  f | )
Member Function Documentation
◆ CompareTypeAndId()
 static int ON_SubDComponentId::CompareTypeAndId  |  ( |  const ON_SubDComponentId &  |  lhs,
|  const ON_SubDComponentId &  |  rhs
)
static
◆ CompareTypeAndIdFromPointer()
 static int ON_SubDComponentId::CompareTypeAndIdFromPointer  |  ( |  const ON_SubDComponentId *  |  lhs,
|  const ON_SubDComponentId *  |  rhs
)
static
◆ ComponentId()
 unsigned int ON_SubDComponentId::ComponentId  |  ( |   | ) |   const
◆ ComponentType()
 ON_SubDComponentPtr::Type ON_SubDComponentId::ComponentType  |  ( |   | ) |   const
◆ IsSet()
 bool ON_SubDComponentId::IsSet  |  ( |   | ) |   const
Returns: true if type is not unset and id > 0
◆ operator=()
 ON_SubDComponentId & ON_SubDComponentId::operator=  |  ( |  const ON_SubDComponentId &  |   | )
default
Member Data Documentation
◆ Unset
 const ON_SubDComponentId ON_SubDComponentId::Unset
static
type = unset and id = 0;