Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoUiPaintColorSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoUiPaintColorSettings ()
CRhinoUiPaintColorSettings (const CRhinoUiPaintColorSettings &)
~CRhinoUiPaintColorSettings ()
void  | Defaults ()
ON_Color  | EditBoxBackground () const
ON_Color  | EditBoxBackground (bool computeIfUnset) const
ON_Color  | GridLineColor (bool onEditBackground) const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
ON_Color  | ModifiedValueControlColor () const
bool  | operator!= (const CRhinoUiPaintColorSettings &) const
CRhinoUiPaintColorSettings &  | operator= (const CRhinoUiPaintColorSettings &)
bool  | operator== (const CRhinoUiPaintColorSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetEditBoxBackground (const ON_Color &color)
void  | SetTabBackground (const ON_Color &color)
void  | SetTabBackground (const ON_Color &color, bool activeTab)
ON_Color  | TabBackground () const
ON_Color  | TabBackground (bool activeTab, bool computeIfUnset) const
void  | Validate ()
clamp settings to valid values More...
 Static Public Member Functions
static const wchar_t *  | ProfileKey ()
 Public Attributes
ON_Color  | m_active_caption
ON_Color  | m_active_viewport_title
ON_Color  | m_hot_border
ON_Color  | m_hot_end
ON_Color  | m_hot_start
ON_Color  | m_inactive_caption
ON_Color  | m_inactive_viewport_title
ON_Color  | m_mouse_overcontrol_border
ON_Color  | m_mouse_overcontrol_end
ON_Color  | m_mouse_overcontrol_start
ON_Color  | m_normal_border
ON_Color  | m_normal_end
ON_Color  | m_normal_start
ON_Color  | m_pressed_border
ON_Color  | m_pressed_end
ON_Color  | m_pressed_start
ON_Color  | m_text_disabled
ON_Color  | m_text_enabled
 Static Public Attributes
static const CRhinoUiPaintColorSettings  | Default
Detailed Description
Colors for the general windows user interface elements
Constructor & Destructor Documentation
◆ CRhinoUiPaintColorSettings() [1/2]
 CRhinoUiPaintColorSettings::CRhinoUiPaintColorSettings  |  ( |   | )
◆ ~CRhinoUiPaintColorSettings()
 CRhinoUiPaintColorSettings::~CRhinoUiPaintColorSettings  |  ( |   | )
◆ CRhinoUiPaintColorSettings() [2/2]
 CRhinoUiPaintColorSettings::CRhinoUiPaintColorSettings  |  ( |  const CRhinoUiPaintColorSettings &  |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoUiPaintColorSettings::Defaults  |  ( |   | )
Description: Set members to defaults.
◆ EditBoxBackground() [1/2]
 ON_Color CRhinoUiPaintColorSettings::EditBoxBackground  |  ( |   | ) |   const
◆ EditBoxBackground() [2/2]
 ON_Color CRhinoUiPaintColorSettings::EditBoxBackground  |  ( |  bool  |  computeIfUnset | ) |   const
◆ GridLineColor()
 ON_Color CRhinoUiPaintColorSettings::GridLineColor  |  ( |  bool  |  onEditBackground | ) |   const
◆ LoadProfile()
 void CRhinoUiPaintColorSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ ModifiedValueControlColor()
 ON_Color CRhinoUiPaintColorSettings::ModifiedValueControlColor  |  ( |   | ) |   const
◆ operator!=()
 bool CRhinoUiPaintColorSettings::operator!=  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ operator=()
 CRhinoUiPaintColorSettings & CRhinoUiPaintColorSettings::operator=  |  ( |  const CRhinoUiPaintColorSettings &  |   | )
◆ operator==()
 bool CRhinoUiPaintColorSettings::operator==  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ ProfileKey()
 static const wchar_t * CRhinoUiPaintColorSettings::ProfileKey  |  ( |   | )
static
◆ SaveProfile()
 void CRhinoUiPaintColorSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetEditBoxBackground()
 void CRhinoUiPaintColorSettings::SetEditBoxBackground  |  ( |  const ON_Color &  |  color | )
◆ SetTabBackground() [1/2]
 void CRhinoUiPaintColorSettings::SetTabBackground  |  ( |  const ON_Color &  |  color | )
◆ SetTabBackground() [2/2]
 void CRhinoUiPaintColorSettings::SetTabBackground  |  ( |  const ON_Color &  |  color,
|  bool  |  activeTab
)
◆ TabBackground() [1/2]
 ON_Color CRhinoUiPaintColorSettings::TabBackground  |  ( |   | ) |   const
◆ TabBackground() [2/2]
 ON_Color CRhinoUiPaintColorSettings::TabBackground  |  ( |  bool  |  activeTab,
|  bool  |  computeIfUnset
) |   |  const
◆ Validate()
 void CRhinoUiPaintColorSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoUiPaintColorSettings CRhinoUiPaintColorSettings::Default
static
◆ m_active_caption
 ON_Color CRhinoUiPaintColorSettings::m_active_caption
◆ m_active_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_active_viewport_title
◆ m_hot_border
 ON_Color CRhinoUiPaintColorSettings::m_hot_border
◆ m_hot_end
 ON_Color CRhinoUiPaintColorSettings::m_hot_end
◆ m_hot_start
 ON_Color CRhinoUiPaintColorSettings::m_hot_start
◆ m_inactive_caption
 ON_Color CRhinoUiPaintColorSettings::m_inactive_caption
◆ m_inactive_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_inactive_viewport_title
◆ m_mouse_overcontrol_border
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_border
◆ m_mouse_overcontrol_end
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_end
◆ m_mouse_overcontrol_start
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_start
◆ m_normal_border
 ON_Color CRhinoUiPaintColorSettings::m_normal_border
◆ m_normal_end
 ON_Color CRhinoUiPaintColorSettings::m_normal_end
◆ m_normal_start
 ON_Color CRhinoUiPaintColorSettings::m_normal_start
◆ m_pressed_border
 ON_Color CRhinoUiPaintColorSettings::m_pressed_border
◆ m_pressed_end
 ON_Color CRhinoUiPaintColorSettings::m_pressed_end
◆ m_pressed_start
 ON_Color CRhinoUiPaintColorSettings::m_pressed_start
◆ m_text_disabled
 ON_Color CRhinoUiPaintColorSettings::m_text_disabled
◆ m_text_enabled
 ON_Color CRhinoUiPaintColorSettings::m_text_enabled