Public Member Functions | Public Attributes | List of all members
ON_MeshIntersectionCache Class Reference
OpenNURBS
Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change. More...
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshIntersectionCache ()=default
~ON_MeshIntersectionCache ()
 Public Attributes
ON_MeshIntersectionCacheImplementation *  | m_impl = nullptr
Detailed Description
Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change.
Constructor & Destructor Documentation
◆ ON_MeshIntersectionCache()
 ON_MeshIntersectionCache::ON_MeshIntersectionCache  |  ( |   | )
default
◆ ~ON_MeshIntersectionCache()
 ON_MeshIntersectionCache::~ON_MeshIntersectionCache  |  ( |   | )
Member Data Documentation
◆ m_impl
 ON_MeshIntersectionCacheImplementation* ON_MeshIntersectionCache::m_impl = nullptr