Public Member Functions | Static Public Member Functions | List of all members
ON_SquisherImpl Class Referenceabstract
OpenNURBS
#include <opennurbs_plus_squish.h>
 Public Member Functions
ON_SquisherImpl ()=default
virtual  | ~ON_SquisherImpl ()=default
void  | Dump (ON_TextLog &text_log) const
virtual const ON_Mesh *  | GetMesh2d () const =0
virtual int  | GetMesh2dEdges (ON_SimpleArray< ON_Line > *edges) const =0
virtual const ON_Mesh *  | GetMesh3d () const =0
virtual int  | GetMesh3dEdges (ON_SimpleArray< ON_Line > *edges) const =0
virtual ON_PolylineCurve *  | SquishCurve (const ON_Curve &curve3d) const =0
virtual ON_Mesh *  | SquishMesh (const ON_SquishParameters &squishParams, const ON_Mesh &mesh3d)=0
virtual ON_Mesh *  | SquishMesh (const ON_SquishParameters &squishParams, const ON_Mesh &mesh3d, const ON_SimpleArray< const ON_Geometry * > *marks, ON_SimpleArray< ON_Geometry * > *squished_marks)=0
virtual bool  | SquishPoint (ON_3dPoint point3d, ON_MESH_POINT &point2d) const =0
virtual ON_PointCloud *  | SquishPointCloud (const ON_PointCloud &pc3) const =0
virtual ON_Brep *  | SquishSurface (const ON_SquishParameters &squishParams, const ON_Surface &surface3d)=0
virtual ON_Brep *  | SquishSurface (const ON_SquishParameters &squishParams, const ON_Surface &surface3d, const ON_SimpleArray< const ON_Geometry * > *marks, ON_SimpleArray< ON_Geometry * > *squished_marks)=0
virtual ON_TextDot *  | SquishTextDot (const ON_TextDot &textDot) const =0
 Static Public Member Functions
static bool  | Is2dPatternSquished (const ON_Geometry *geometry)
static bool  | SquishBack2dMarks (const ON_Geometry *squished_geometry, const ON_SimpleArray< const ON_Geometry * > *marks, ON_SimpleArray< ON_Geometry * > *squished_marks)
Constructor & Destructor Documentation
◆ ON_SquisherImpl()
 ON_SquisherImpl::ON_SquisherImpl  |  ( |   | )
default
◆ ~ON_SquisherImpl()
 virtual ON_SquisherImpl::~ON_SquisherImpl  |  ( |   | )
virtualdefault
Member Function Documentation
◆ Dump()
 void ON_SquisherImpl::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ GetMesh2d()
 virtual const ON_Mesh * ON_SquisherImpl::GetMesh2d  |  ( |   | ) |   const
pure virtual
◆ GetMesh2dEdges()
 virtual int ON_SquisherImpl::GetMesh2dEdges  |  ( |  ON_SimpleArray< ON_Line > *  |  edges | ) |   const
pure virtual
◆ GetMesh3d()
 virtual const ON_Mesh * ON_SquisherImpl::GetMesh3d  |  ( |   | ) |   const
pure virtual
◆ GetMesh3dEdges()
 virtual int ON_SquisherImpl::GetMesh3dEdges  |  ( |  ON_SimpleArray< ON_Line > *  |  edges | ) |   const
pure virtual
◆ Is2dPatternSquished()
 static bool ON_SquisherImpl::Is2dPatternSquished  |  ( |  const ON_Geometry *  |  geometry | )
static
◆ SquishBack2dMarks()
 static bool ON_SquisherImpl::SquishBack2dMarks  |  ( |  const ON_Geometry *  |  squished_geometry,
|  const ON_SimpleArray< const ON_Geometry * > *  |  marks,
|  ON_SimpleArray< ON_Geometry * > *  |  squished_marks
)
static
◆ SquishCurve()
 virtual ON_PolylineCurve * ON_SquisherImpl::SquishCurve  |  ( |  const ON_Curve &  |  curve3d | ) |   const
pure virtual
◆ SquishMesh() [1/2]
 virtual ON_Mesh * ON_SquisherImpl::SquishMesh  |  ( |  const ON_SquishParameters &  |  squishParams,
|  const ON_Mesh &  |  mesh3d
)
pure virtual
◆ SquishMesh() [2/2]
 virtual ON_Mesh * ON_SquisherImpl::SquishMesh  |  ( |  const ON_SquishParameters &  |  squishParams,
|  const ON_Mesh &  |  mesh3d,
|  const ON_SimpleArray< const ON_Geometry * > *  |  marks,
|  ON_SimpleArray< ON_Geometry * > *  |  squished_marks
)
pure virtual
◆ SquishPoint()
 virtual bool ON_SquisherImpl::SquishPoint  |  ( |  ON_3dPoint  |  point3d,
|  ON_MESH_POINT &  |  point2d
) |   |  const
pure virtual
◆ SquishPointCloud()
 virtual ON_PointCloud * ON_SquisherImpl::SquishPointCloud  |  ( |  const ON_PointCloud &  |  pc3 | ) |   const
pure virtual
◆ SquishSurface() [1/2]
 virtual ON_Brep * ON_SquisherImpl::SquishSurface  |  ( |  const ON_SquishParameters &  |  squishParams,
|  const ON_Surface &  |  surface3d
)
pure virtual
◆ SquishSurface() [2/2]
 virtual ON_Brep * ON_SquisherImpl::SquishSurface  |  ( |  const ON_SquishParameters &  |  squishParams,
|  const ON_Surface &  |  surface3d,
|  const ON_SimpleArray< const ON_Geometry * > *  |  marks,
|  ON_SimpleArray< ON_Geometry * > *  |  squished_marks
)
pure virtual
◆ SquishTextDot()
 virtual ON_TextDot * ON_SquisherImpl::SquishTextDot  |  ( |  const ON_TextDot &  |  textDot | ) |   const
pure virtual