Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SurfaceCurvature Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
double  | GaussianCurvature () const
bool  | IsSet () const
bool  | IsUnset () const
bool  | IsZero () const
double  | MaximumRadius () const
double  | MeanCurvature () const
double  | MinimumRadius () const
 Static Public Member Functions
static const ON_SurfaceCurvature  | CreateFromPrincipalCurvatures (double k1, double k2)
 Public Attributes
double  | k1
double  | k2
principal curvatures More...
 Static Public Attributes
static const ON_SurfaceCurvature  | Nan
static const ON_SurfaceCurvature  | Zero
Detailed Description
ON_SurfaceCurvature
Member Function Documentation
◆ CreateFromPrincipalCurvatures()
 static const ON_SurfaceCurvature ON_SurfaceCurvature::CreateFromPrincipalCurvatures  |  ( |  double  |  k1,
|  double  |  k2
)
static
◆ GaussianCurvature()
 double ON_SurfaceCurvature::GaussianCurvature  |  ( |   | ) |   const
◆ IsSet()
 bool ON_SurfaceCurvature::IsSet  |  ( |   | ) |   const
◆ IsUnset()
 bool ON_SurfaceCurvature::IsUnset  |  ( |   | ) |   const
◆ IsZero()
 bool ON_SurfaceCurvature::IsZero  |  ( |   | ) |   const
◆ MaximumRadius()
 double ON_SurfaceCurvature::MaximumRadius  |  ( |   | ) |   const
◆ MeanCurvature()
 double ON_SurfaceCurvature::MeanCurvature  |  ( |   | ) |   const
◆ MinimumRadius()
 double ON_SurfaceCurvature::MinimumRadius  |  ( |   | ) |   const
Member Data Documentation
◆ k1
 double ON_SurfaceCurvature::k1
◆ k2
 double ON_SurfaceCurvature::k2
principal curvatures
◆ Nan
 const ON_SurfaceCurvature ON_SurfaceCurvature::Nan
static
◆ Zero
 const ON_SurfaceCurvature ON_SurfaceCurvature::Zero
static