Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_SubDRTreeVertexFinder Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDRTreeVertexFinder ()=default
ON_SubDRTreeVertexFinder (const ON_SubDRTreeVertexFinder &)=default
~ON_SubDRTreeVertexFinder ()=default
ON_SubDRTreeVertexFinder &  | operator= (const ON_SubDRTreeVertexFinder &)=default
 Static Public Member Functions
static bool  | Callback (void *a_context, ON__INT_PTR a_id)
static const ON_SubDRTreeVertexFinder  | Create (const ON_3dPoint P)
static const ON_SubDRTreeVertexFinder  | Create (const ON_3dPoint P, bool bMarkFilter)
 Public Attributes
bool  | m_bMarkFilter = false
bool  | m_bMarkFilterEnabled = false
double  | m_distance = ON_DBL_QNAN
ON_3dPoint  | m_P = ON_3dPoint::NanPoint
const ON_SubDVertex *  | m_v = nullptr
Constructor & Destructor Documentation
◆ ON_SubDRTreeVertexFinder() [1/2]
 ON_SubDRTreeVertexFinder::ON_SubDRTreeVertexFinder  |  ( |   | )
default
◆ ~ON_SubDRTreeVertexFinder()
 ON_SubDRTreeVertexFinder::~ON_SubDRTreeVertexFinder  |  ( |   | )
default
◆ ON_SubDRTreeVertexFinder() [2/2]
 ON_SubDRTreeVertexFinder::ON_SubDRTreeVertexFinder  |  ( |  const ON_SubDRTreeVertexFinder &  |   | )
default
Member Function Documentation
◆ Callback()
 static bool ON_SubDRTreeVertexFinder::Callback  |  ( |  void *  |  a_context,
|  ON__INT_PTR  |  a_id
)
static
◆ Create() [1/2]
 static const ON_SubDRTreeVertexFinder ON_SubDRTreeVertexFinder::Create  |  ( |  const ON_3dPoint  |  P | )
static
◆ Create() [2/2]
 static const ON_SubDRTreeVertexFinder ON_SubDRTreeVertexFinder::Create  |  ( |  const ON_3dPoint  |  P,
|  bool  |  bMarkFilter
)
static
◆ operator=()
 ON_SubDRTreeVertexFinder& ON_SubDRTreeVertexFinder::operator=  |  ( |  const ON_SubDRTreeVertexFinder &  |   | )
default
Member Data Documentation
◆ m_bMarkFilter
 bool ON_SubDRTreeVertexFinder::m_bMarkFilter = false
◆ m_bMarkFilterEnabled
 bool ON_SubDRTreeVertexFinder::m_bMarkFilterEnabled = false
◆ m_distance
 double ON_SubDRTreeVertexFinder::m_distance = ON_DBL_QNAN
◆ m_P
 ON_3dPoint ON_SubDRTreeVertexFinder::m_P = ON_3dPoint::NanPoint
◆ m_v
 const ON_SubDVertex* ON_SubDRTreeVertexFinder::m_v = nullptr