Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentAndDouble Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentAndDouble ()=default
ON_SubDComponentAndDouble (const ON_SubDComponentAndDouble &)=default
~ON_SubDComponentAndDouble ()=default
const ON_SubDComponentPtr  | Component () const
ON_SubDComponentAndDouble &  | operator= (const ON_SubDComponentAndDouble &)=default
void  | SetComponent (ON_SubDComponentPtr cptr)
void  | SetValue (double x)
double  | Value () const
 Static Public Member Functions
static int  | CompareComponent (const ON_SubDComponentAndDouble *a, const ON_SubDComponentAndDouble *b)
static int  | CompareComponentAndDouble (const ON_SubDComponentAndDouble *a, const ON_SubDComponentAndDouble *b)
static int  | CompareValue (const ON_SubDComponentAndDouble *a, const ON_SubDComponentAndDouble *b)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDEdge *e, double x)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDEdgePtr eptr, double x)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDFace *f, double x)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDFacePtr fptr, double x)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDVertex *v, double x)
static const ON_SubDComponentAndDouble  | Create (const ON_SubDVertexPtr vptr, double x)
static const ON_SubDComponentAndDouble  | Create (ON_SubDComponentPtr cptr, double x)
 Public Attributes
ON_SubDComponentPtr  | m_cptr = ON_SubDComponentPtr::Null
double  | m_x = ON_DBL_QNAN
 Static Public Attributes
static const ON_SubDComponentAndDouble  | NullAndNan
static const ON_SubDComponentAndDouble  | NullAndZero
Detailed Description
ON_SubDComponentPtrAndDouble
Constructor & Destructor Documentation
◆ ON_SubDComponentAndDouble() [1/2]
 ON_SubDComponentAndDouble::ON_SubDComponentAndDouble  |  ( |   | )
default
◆ ~ON_SubDComponentAndDouble()
 ON_SubDComponentAndDouble::~ON_SubDComponentAndDouble  |  ( |   | )
default
◆ ON_SubDComponentAndDouble() [2/2]
 ON_SubDComponentAndDouble::ON_SubDComponentAndDouble  |  ( |  const ON_SubDComponentAndDouble &  |   | )
default
Member Function Documentation
◆ CompareComponent()
 static int ON_SubDComponentAndDouble::CompareComponent  |  ( |  const ON_SubDComponentAndDouble *  |  a,
|  const ON_SubDComponentAndDouble *  |  b
)
static
Description: Compare Component() using ON_SubDComponentPtr::CompareComponent().
◆ CompareComponentAndDouble()
 static int ON_SubDComponentAndDouble::CompareComponentAndDouble  |  ( |  const ON_SubDComponentAndDouble *  |  a,
|  const ON_SubDComponentAndDouble *  |  b
)
static
Description: Dictionary compare Component() and Value() in that order.
◆ CompareValue()
 static int ON_SubDComponentAndDouble::CompareValue  |  ( |  const ON_SubDComponentAndDouble *  |  a,
|  const ON_SubDComponentAndDouble *  |  b
)
static
Description: Compare Value() nans are treated as equal and sort last.
◆ Component()
 const ON_SubDComponentPtr ON_SubDComponentAndDouble::Component  |  ( |   | ) |   const
◆ Create() [1/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDEdge *  |  e,
|  double  |  x
)
static
◆ Create() [2/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDEdgePtr  |  eptr,
|  double  |  x
)
static
◆ Create() [3/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDFace *  |  f,
|  double  |  x
)
static
◆ Create() [4/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDFacePtr  |  fptr,
|  double  |  x
)
static
◆ Create() [5/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDVertex *  |  v,
|  double  |  x
)
static
◆ Create() [6/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  const ON_SubDVertexPtr  |  vptr,
|  double  |  x
)
static
◆ Create() [7/7]
 static const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::Create  |  ( |  ON_SubDComponentPtr  |  cptr,
|  double  |  x
)
static
◆ operator=()
 ON_SubDComponentAndDouble& ON_SubDComponentAndDouble::operator=  |  ( |  const ON_SubDComponentAndDouble &  |   | )
default
◆ SetComponent()
 void ON_SubDComponentAndDouble::SetComponent  |  ( |  ON_SubDComponentPtr  |  cptr | )
◆ SetValue()
 void ON_SubDComponentAndDouble::SetValue  |  ( |  double  |  x | )
◆ Value()
 double ON_SubDComponentAndDouble::Value  |  ( |   | ) |   const
Member Data Documentation
◆ m_cptr
 ON_SubDComponentPtr ON_SubDComponentAndDouble::m_cptr = ON_SubDComponentPtr::Null
◆ m_x
 double ON_SubDComponentAndDouble::m_x = ON_DBL_QNAN
◆ NullAndNan
 const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::NullAndNan
static
◆ NullAndZero
 const ON_SubDComponentAndDouble ON_SubDComponentAndDouble::NullAndZero
static