Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_ComponentIndexAndDouble Class Reference
OpenNURBS
#include <opennurbs_defines.h>
 Public Member Functions
ON_ComponentIndexAndDouble ()=default
ON_ComponentIndexAndDouble (const ON_ComponentIndexAndDouble &)=default
~ON_ComponentIndexAndDouble ()=default
const ON_COMPONENT_INDEX  | Component () const
ON_ComponentIndexAndDouble &  | operator= (const ON_ComponentIndexAndDouble &)=default
void  | SetComponent (ON_COMPONENT_INDEX ci)
void  | SetValue (double x)
double  | Value () const
 Static Public Member Functions
static int  | CompareComponent (const ON_ComponentIndexAndDouble *a, const ON_ComponentIndexAndDouble *b)
static int  | CompareComponentAndValue (const ON_ComponentIndexAndDouble *a, const ON_ComponentIndexAndDouble *b)
static int  | CompareValue (const ON_ComponentIndexAndDouble *a, const ON_ComponentIndexAndDouble *b)
static const ON_ComponentIndexAndDouble  | Create (ON_COMPONENT_INDEX ci, double x)
 Public Attributes
ON_COMPONENT_INDEX  | m_ci = ON_COMPONENT_INDEX::UnsetComponentIndex
double  | m_x = ON_DBL_QNAN
 Static Public Attributes
static const ON_ComponentIndexAndDouble  | UnsetAndNan
static const ON_ComponentIndexAndDouble  | UnsetAndZero
Constructor & Destructor Documentation
◆ ON_ComponentIndexAndDouble() [1/2]
 ON_ComponentIndexAndDouble::ON_ComponentIndexAndDouble  |  ( |   | )
default
◆ ~ON_ComponentIndexAndDouble()
 ON_ComponentIndexAndDouble::~ON_ComponentIndexAndDouble  |  ( |   | )
default
◆ ON_ComponentIndexAndDouble() [2/2]
 ON_ComponentIndexAndDouble::ON_ComponentIndexAndDouble  |  ( |  const ON_ComponentIndexAndDouble &  |   | )
default
Member Function Documentation
◆ CompareComponent()
 static int ON_ComponentIndexAndDouble::CompareComponent  |  ( |  const ON_ComponentIndexAndDouble *  |  a,
|  const ON_ComponentIndexAndDouble *  |  b
)
static
Description: Compare Component() using ON_COMPONENT_INDEX::Compare().
◆ CompareComponentAndValue()
 static int ON_ComponentIndexAndDouble::CompareComponentAndValue  |  ( |  const ON_ComponentIndexAndDouble *  |  a,
|  const ON_ComponentIndexAndDouble *  |  b
)
static
Description: Dictionary compare Component() 1st and Value() 2nd.
◆ CompareValue()
 static int ON_ComponentIndexAndDouble::CompareValue  |  ( |  const ON_ComponentIndexAndDouble *  |  a,
|  const ON_ComponentIndexAndDouble *  |  b
)
static
Description: Compare Value() nans are treated as equal and sort last.
◆ Component()
 const ON_COMPONENT_INDEX ON_ComponentIndexAndDouble::Component  |  ( |   | ) |   const
◆ Create()
 static const ON_ComponentIndexAndDouble ON_ComponentIndexAndDouble::Create  |  ( |  ON_COMPONENT_INDEX  |  ci,
|  double  |  x
)
static
◆ operator=()
 ON_ComponentIndexAndDouble& ON_ComponentIndexAndDouble::operator=  |  ( |  const ON_ComponentIndexAndDouble &  |   | )
default
◆ SetComponent()
 void ON_ComponentIndexAndDouble::SetComponent  |  ( |  ON_COMPONENT_INDEX  |  ci | )
◆ SetValue()
 void ON_ComponentIndexAndDouble::SetValue  |  ( |  double  |  x | )
◆ Value()
 double ON_ComponentIndexAndDouble::Value  |  ( |   | ) |   const
Member Data Documentation
◆ m_ci
 ON_COMPONENT_INDEX ON_ComponentIndexAndDouble::m_ci = ON_COMPONENT_INDEX::UnsetComponentIndex
◆ m_x
 double ON_ComponentIndexAndDouble::m_x = ON_DBL_QNAN
◆ UnsetAndNan
 const ON_ComponentIndexAndDouble ON_ComponentIndexAndDouble::UnsetAndNan
static
◆ UnsetAndZero
 const ON_ComponentIndexAndDouble ON_ComponentIndexAndDouble::UnsetAndZero
static