Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoTextDot Class Reference
Rhino
#include <rhinoSdkAnnotationObject.h>
 Inheritance diagram for CRhinoTextDot:
 Public Member Functions
CRhinoTextDot ()
Constructors. More...
CRhinoTextDot (const CRhinoTextDot &src)
copies source object UUID More...
CRhinoTextDot (const ON_3dmObjectAttributes &src)
assigns a new object UUID More...
~CRhinoTextDot () override
bool  | AlwaysOnTop () const
bool  | Bold () const
ON_BoundingBox  | BoundingBox () const override
ON_BoundingBox  | BoundingBox (const CRhinoViewport *) const override
ON_BoundingBox  | BoundingBox (const ON_Viewport &vp) const
not virtual More...
void  | Create (const wchar_t *string, ON_3dPoint &point)
Create a CRhinoTextDot from a text string and a point. More...
void  | DeleteFromDocNotification () override
void  | DestroyRuntimeCache (bool bDelete=true) override
void  | Draw (CRhinoDisplayPipeline &dp) const override
Draws object based on pipeline display attributes... More...
const wchar_t *  | FontFace () const
bool  | GetScreenRectangleSize (ON_2dPoint &rect) const
bool  | IsVisibleInView (CRhinoView &view) const
bool  | Italic () const
ON::object_type  | ObjectType () const override
Returns ON::text_dot. More...
ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &context) const override
CRhinoTextDot &  | operator= (const CRhinoTextDot &src)
copies source object UUID More...
int  | Pick (const CRhinoPickContext &, CRhinoObjRefArray &objref) const override
ON_3dPoint  | Point () const
const wchar_t *  | SecondaryTextString () const
void  | SetAlwaysOnTop (bool bTop)
void  | SetBold (bool bBold)
void  | SetDot (ON_TextDot &dot)
copies dot and moves user data from argument to m_textdot More...
void  | SetFontFace (const wchar_t *string)
Set or Get the font name for the object. More...
void  | SetItalic (bool bItalic)
void  | SetPoint (const ON_3dPoint &point)
void  | SetSecondaryTextString (const wchar_t *string)
void  | SetTextHeight (int height)
Set or Get the height of the text in pixels. More...
void  | SetTextString (const wchar_t *string)
void  | SetTransparent (bool bTransparent)
const wchar_t *  | ShortDescription (bool bPlural) const override
Returns "text dot". More...
bool  | SnapTo (const CRhinoSnapContext &snap_context, CRhinoSnapEvent &snap_event) const override
int  | TextHeight () const
const wchar_t *  | TextString () const
bool  | Transparent () const
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
virtual void  | AddToDocNotification ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual void  | DrawHighlightedSubObjects (class CRhinoDisplayPipeline &) const
virtual void  | DrawSubObject (class CRhinoDisplayPipeline &, ON_COMPONENT_INDEX) const
Draws wireframe representation of a sub object. More...
virtual void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EnableGrips (bool bGripsOn)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
virtual bool  | GetFrame (ON_Plane &plane) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
virtual int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh * > &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=NULL) const
virtual bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox=false, const ON_Xform *xform=nullptr) const
virtual int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curve_list) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
virtual bool  | HighlightRequiresRedraw () const
virtual bool  | HighlightSubObject (ON_COMPONENT_INDEX component_index, bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
virtual bool  | IsSolid () const
virtual bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX component_index) const
true if specified component is highlighted More...
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
virtual bool  | IsSubObjectSelected (ON_COMPONENT_INDEX component_index) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
virtual int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
virtual int  | UnhighlightAllSubObjects ()
returns number of changed subobjects More...
virtual int  | UnselectAllSubObjects ()
returns number of unselected subobjects More...
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static void  | TextDotScreenSize (const ON_TextDot &dot, float &cornerRadius, ON_2fPoint &dotSize, ON_2fPoint &textSize)
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Protected Member Functions
class CRhCacheDataTextDot *  | TextDotDisplay () const
Cached information. More...
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual int  | SubObjectsAreHighlighted () const
returns number of highlighted subobjects More...
virtual int  | SubObjectsAreSelected () const
returns number of selected subobjects More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Protected Attributes
ON_TextDot  | m_textdot
m_geometry points to this object More...
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoTextDot() [1/3]
 CRhinoTextDot::CRhinoTextDot  |  ( |   | )
Constructors.
assigns a new object UUID
◆ CRhinoTextDot() [2/3]
 CRhinoTextDot::CRhinoTextDot  |  ( |  const ON_3dmObjectAttributes &  |  src | )
assigns a new object UUID
◆ CRhinoTextDot() [3/3]
 CRhinoTextDot::CRhinoTextDot  |  ( |  const CRhinoTextDot &  |  src | )
copies source object UUID
◆ ~CRhinoTextDot()
 CRhinoTextDot::~CRhinoTextDot  |  ( |   | )
override
Member Function Documentation
◆ AlwaysOnTop()
 bool CRhinoTextDot::AlwaysOnTop  |  ( |   | ) |   const
◆ Bold()
 bool CRhinoTextDot::Bold  |  ( |   | ) |   const
◆ BoundingBox() [1/3]
 ON_BoundingBox CRhinoTextDot::BoundingBox  |  ( |   | ) |   const
overridevirtual
Description: Gets 3d axis aligned bounding box that contains the object.
Returns: 3d bounding box
Remarks: The default implementation uses m_geometry->BoundingBox(), lazy evaluation, and caches the result in m_bbox.
 If you override this function, then you must set m_bbox.
Reimplemented from CRhinoObject.
◆ BoundingBox() [2/3]
 ON_BoundingBox CRhinoTextDot::BoundingBox  |  ( |  const CRhinoViewport *  |   | ) |   const
override
◆ BoundingBox() [3/3]
 ON_BoundingBox CRhinoTextDot::BoundingBox  |  ( |  const ON_Viewport &  |  vp | ) |   const
not virtual
◆ Create()
 void CRhinoTextDot::Create  |  ( |  const wchar_t *  |  string,
|  ON_3dPoint &  |  point
)
Create a CRhinoTextDot from a text string and a point.
◆ DeleteFromDocNotification()
 void CRhinoTextDot::DeleteFromDocNotification  |  ( |   | )
overridevirtual
Description: This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
Reimplemented from CRhinoObject.
◆ DestroyRuntimeCache()
 void CRhinoTextDot::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Expert interface Description: Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. Parameters: bDelete - [in] if true, any cached information is properly deleted. If false, any cached information is simply discarded. This is useful when the cached information may be in alternate memory pools that are managed in nonstandard ways.
Reimplemented from ON_Object.
◆ Draw()
 void CRhinoTextDot::Draw  |  ( |  CRhinoDisplayPipeline &  |   | ) |   const
overridevirtual
Draws object based on pipeline display attributes...
Reimplemented from CRhinoObject.
◆ FontFace()
 const wchar_t* CRhinoTextDot::FontFace  |  ( |   | ) |   const
◆ GetScreenRectangleSize()
 bool CRhinoTextDot::GetScreenRectangleSize  |  ( |  ON_2dPoint &  |  rect | ) |   const
Description: Get the size of the bounding rectangle of the text in pixels Parameters: [out] rect - the bounding rectangle Returns: TRUE - success FALSE - failure
◆ IsVisibleInView()
 bool CRhinoTextDot::IsVisibleInView  |  ( |  CRhinoView &  |  view | ) |   const
◆ Italic()
 bool CRhinoTextDot::Italic  |  ( |   | ) |   const
◆ ObjectType()
 ON::object_type CRhinoTextDot::ObjectType  |  ( |   | ) |   const
overridevirtual
Returns ON::text_dot.
Implements CRhinoObject.
◆ OnDoubleClick()
 ON_wString CRhinoTextDot::OnDoubleClick  |  ( |  const CRhinoDoubleClickContext &  |  double_click_context | ) |   const
overridevirtual
Description: Called when a user double clicks on this object. If the function returns a non-empty string, the string is interpreted as a command macro to execute.
Reimplemented from CRhinoObject.
◆ operator=()
 CRhinoTextDot& CRhinoTextDot::operator=  |  ( |  const CRhinoTextDot &  |  src | )
copies source object UUID
◆ Pick()
 int CRhinoTextDot::Pick  |  ( |  const CRhinoPickContext &  |  ,
|  CRhinoObjRefArray &  |  objref
) |   |  const
overridevirtual
Description: Test if the object was hit by the pick event described in the PickContext and add it to the picklist if it was Parameters: [in] CRhinoPickContext& - Information about the current pick event [out] CRhinoObjRefArray& - Array for collecting objects that are picked Returns: 1 Object was hit 2 Object was not hit
Reimplemented from CRhinoObject.
◆ Point()
 ON_3dPoint CRhinoTextDot::Point  |  ( |   | ) |   const
◆ SecondaryTextString()
 const wchar_t* CRhinoTextDot::SecondaryTextString  |  ( |   | ) |   const
◆ SetAlwaysOnTop()
 void CRhinoTextDot::SetAlwaysOnTop  |  ( |  bool  |  bTop | )
Description: Get or Set whether the dot is drawn "On Top" of other geometry Parameters: [in] bTop bool - It is or isn't on top Returns: true - on top false - not on top
◆ SetBold()
 void CRhinoTextDot::SetBold  |  ( |  bool  |  bBold | )
Description: Get or Set whether the dot is drawn with Bold text Parameters: [in] bBold bool - It is or isn't Bold Returns: true - Bold false - not Bold
◆ SetDot()
 void CRhinoTextDot::SetDot  |  ( |  ON_TextDot &  |  dot | )
copies dot and moves user data from argument to m_textdot
◆ SetFontFace()
 void CRhinoTextDot::SetFontFace  |  ( |  const wchar_t *  |  string | )
Set or Get the font name for the object.
◆ SetItalic()
 void CRhinoTextDot::SetItalic  |  ( |  bool  |  bItalic | )
Description: Get or Set whether the dot is drawn with Italic text Parameters: [in] bItalic bool - It is or isn't Italic Returns: true - Italic false - not Italic
◆ SetPoint()
 void CRhinoTextDot::SetPoint  |  ( |  const ON_3dPoint &  |  point | )
Description: Set or get a 3d definition point for the dot Parameters: [in] point the point to set
◆ SetSecondaryTextString()
 void CRhinoTextDot::SetSecondaryTextString  |  ( |  const wchar_t *  |  string | )
Description: Set or Get the secondary text string for the object which is typically used for additional info and only displayed when the dot is selected or under the mouse or something Parameters: [in] const wchar_t* - the secondary text to assign to the object Returns: const wchar_t* - the object's secondary text
◆ SetTextHeight()
 void CRhinoTextDot::SetTextHeight  |  ( |  int  |  height | )
Set or Get the height of the text in pixels.
◆ SetTextString()
 void CRhinoTextDot::SetTextString  |  ( |  const wchar_t *  |  string | )
Description: Set or Get the text string for the object Parameters: [in] const wchar_t* - the text to assign to the object Returns: const wchar_t* - the object's text
◆ SetTransparent()
 void CRhinoTextDot::SetTransparent  |  ( |  bool  |  bTransparent | )
Description: Get or Set whether the dot is drawn with a transparent background Parameters: [in] bTop bool - It is or isn't on transparent Returns: true - transparent false - not transparent
◆ ShortDescription()
 const wchar_t* CRhinoTextDot::ShortDescription  |  ( |  bool  |  bPlural | ) |   const
overridevirtual
Returns "text dot".
Implements CRhinoObject.
◆ SnapTo()
 bool CRhinoTextDot::SnapTo  |  ( |  const CRhinoSnapContext &  |  snap_context,
|  CRhinoSnapEvent &  |  snap_event
) |   |  const
overridevirtual
Description: virtual CRhinoObject::SnapTo override Remarks: This function should not be used in Rhino plug-ins.
Reimplemented from CRhinoObject.
◆ TextDotDisplay()
 class CRhCacheDataTextDot* CRhinoTextDot::TextDotDisplay  |  ( |   | ) |   const
protected
Cached information.
◆ TextDotScreenSize()
 static void CRhinoTextDot::TextDotScreenSize  |  ( |  const ON_TextDot &  |  dot,
|  float &  |  cornerRadius,
|  ON_2fPoint &  |  dotSize,
|  ON_2fPoint &  |  textSize
)
static
◆ TextHeight()
 int CRhinoTextDot::TextHeight  |  ( |   | ) |   const
◆ TextString()
 const wchar_t* CRhinoTextDot::TextString  |  ( |   | ) |   const
◆ Transparent()
 bool CRhinoTextDot::Transparent  |  ( |   | ) |   const
Member Data Documentation
◆ m_textdot
 ON_TextDot CRhinoTextDot::m_textdot
protected
m_geometry points to this object