Public Member Functions | Protected Member Functions | List of all members
CRhinoUiInPlaceButton Class Reference
RhinoUI
#include <RhinoSdkUiInPlaceCtrls.h>
 Inheritance diagram for CRhinoUiInPlaceButton:
 Public Member Functions
CRhinoUiInPlaceButton ()
virtual  | ~CRhinoUiInPlaceButton ()
void  | Hide ()
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | Show (CRect rcButton)
 Protected Member Functions
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
Detailed Description
CRhinoUiInPlaceButton
Constructor & Destructor Documentation
◆ CRhinoUiInPlaceButton()
 CRhinoUiInPlaceButton::CRhinoUiInPlaceButton  |  ( |   | )
◆ ~CRhinoUiInPlaceButton()
 virtual CRhinoUiInPlaceButton::~CRhinoUiInPlaceButton  |  ( |   | )
virtual
Member Function Documentation
◆ Hide()
 void CRhinoUiInPlaceButton::Hide  |  ( |   | )
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiInPlaceButton::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiInPlaceButton::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ Show()
 void CRhinoUiInPlaceButton::Show  |  ( |  CRect  |  rcButton | )