Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_OutlineFigurePoint Class Reference
OpenNURBS
#include <opennurbs_font.h>
 Public Types
enum  | Proximity : ON__UINT8 { Proximity::Unset = 0, Proximity::OnFigure = 1, Proximity::OffFigure = 2, Proximity::Error = 15 }
enum  | Type : ON__UINT8 {
 Type::Unset = 0, Type::BeginFigureUnknown = 1, Type::BeginFigureOpen = 2, Type::BeginFigureClosed = 3,
 Type::LineTo = 6, Type::QuadraticBezierPoint = 7, Type::CubicBezierPoint = 8, Type::EndFigureOpen = 11,
 Type::EndFigureClosed = 12, Type::Error = 15
 }
 Public Member Functions
ON_OutlineFigurePoint ()=default
ON_OutlineFigurePoint (const ON_OutlineFigurePoint &)=default
~ON_OutlineFigurePoint ()=default
ON__UINT16  | FigureIndex () const
bool  | IsBeginFigurePoint () const
bool  | IsEndFigurePoint () const
bool  | IsInteriorFigurePoint () const
bool  | IsOffFigure () const
bool  | IsOnFigure () const
ON_OutlineFigurePoint &  | operator= (const ON_OutlineFigurePoint &)=default
const ON_2fPoint  | Point () const
const ON_2dPoint  | Point2d () const
const ON_2iPoint  | Point2i () const
const ON_2iPoint  | Point2iCeil () const
const ON_2iPoint  | Point2iFloor () const
ON_OutlineFigurePoint::Proximity  | PointProximity () const
ON_OutlineFigurePoint::Type  | PointType () const
 Static Public Member Functions
static ON_OutlineFigurePoint::Type  | ContourPointTypeFromUnsigned (unsigned contour_point_type_as_unsigned)
static bool  | IsBeginFigurePointType (ON_OutlineFigurePoint::Type point_type)
static bool  | IsEndFigurePointType (ON_OutlineFigurePoint::Type point_type)
static bool  | IsInteriorFigurePointType (ON_OutlineFigurePoint::Type point_type)
 Public Attributes
ON__UINT16  | m_figure_index = 0
0 = unset. The first figure in an outline has m_figure_index = 1. More...
ON_2fPoint  | m_point = ON_2fPoint::NanPoint
point location More...
ON_OutlineFigurePoint::Proximity  | m_point_proximity = ON_OutlineFigurePoint::Proximity::Unset
ON_OutlineFigurePoint::Type  | m_point_type = ON_OutlineFigurePoint::Type::Unset
 Static Public Attributes
static const ON_OutlineFigurePoint  | Error
static const ON_OutlineFigurePoint  | Unset
Member Enumeration Documentation
◆ Proximity
 enum ON_OutlineFigurePoint::Proximity : ON__UINT8
strong
Enumerator
Unset
OnFigure
The point is the beginning or end of a line or bezier segment in the figure.
OffFigure
The point is a bezier control point that may be off the figure.
Error
◆ Type
 enum ON_OutlineFigurePoint::Type : ON__UINT8
strong
Enumerator
Unset
BeginFigureUnknown
Beginning of a figure
The open/closed state is unknown.
BeginFigureOpen
Marks the beginning of an open figure. (single stroke font, ...)
BeginFigureClosed
Marks the beginning of a closed figure.
LineTo
interior line segment point
Interior of a figure
QuadraticBezierPoint
interior quadratic bezier (degree=2, order=3) control point.
CubicBezierPoint
interior cubic bezier (degree=3, order=4) control point.
EndFigureOpen
End of an open figure (single stroke font, ...)
End of a figure
EndFigureClosed
End of a closed figure.
Error
Error of some sort.
Constructor & Destructor Documentation
◆ ON_OutlineFigurePoint() [1/2]
 ON_OutlineFigurePoint::ON_OutlineFigurePoint  |  ( |   | )
default
◆ ~ON_OutlineFigurePoint()
 ON_OutlineFigurePoint::~ON_OutlineFigurePoint  |  ( |   | )
default
◆ ON_OutlineFigurePoint() [2/2]
 ON_OutlineFigurePoint::ON_OutlineFigurePoint  |  ( |  const ON_OutlineFigurePoint &  |   | )
default
Member Function Documentation
◆ ContourPointTypeFromUnsigned()
 static ON_OutlineFigurePoint::Type ON_OutlineFigurePoint::ContourPointTypeFromUnsigned  |  ( |  unsigned  |  contour_point_type_as_unsigned | )
static
◆ FigureIndex()
 ON__UINT16 ON_OutlineFigurePoint::FigureIndex  |  ( |   | ) |   const
◆ IsBeginFigurePoint()
 bool ON_OutlineFigurePoint::IsBeginFigurePoint  |  ( |   | ) |   const
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::BeginFigureUnknown ON_OutlineFigurePoint::Type::BeginFigureFilled ON_OutlineFigurePoint::Type::BeginFigureHollow ON_OutlineFigurePoint::Type::BeginFigureOpen
◆ IsBeginFigurePointType()
 static bool ON_OutlineFigurePoint::IsBeginFigurePointType  |  ( |  ON_OutlineFigurePoint::Type  |  point_type | )
static
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::BeginFigureUnknown ON_OutlineFigurePoint::Type::BeginFigureFilled ON_OutlineFigurePoint::Type::BeginFigureHollow ON_OutlineFigurePoint::Type::BeginFigureOpen
◆ IsEndFigurePoint()
 bool ON_OutlineFigurePoint::IsEndFigurePoint  |  ( |   | ) |   const
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::LineToCloseContour ON_OutlineFigurePoint::Type::EndFigureUnknown ON_OutlineFigurePoint::Type::EndFigureClosed ON_OutlineFigurePoint::Type::EndFigureOpen
◆ IsEndFigurePointType()
 static bool ON_OutlineFigurePoint::IsEndFigurePointType  |  ( |  ON_OutlineFigurePoint::Type  |  point_type | )
static
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::LineToCloseContour ON_OutlineFigurePoint::Type::EndFigureUnknown ON_OutlineFigurePoint::Type::EndFigureClosed ON_OutlineFigurePoint::Type::EndFigureOpen
◆ IsInteriorFigurePoint()
 bool ON_OutlineFigurePoint::IsInteriorFigurePoint  |  ( |   | ) |   const
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::MoveTo ON_OutlineFigurePoint::Type::LineTo ON_OutlineFigurePoint::Type::QuadraticBezierPoint ON_OutlineFigurePoint::Type::CubicBezierPoint
◆ IsInteriorFigurePointType()
 static bool ON_OutlineFigurePoint::IsInteriorFigurePointType  |  ( |  ON_OutlineFigurePoint::Type  |  point_type | )
static
Returns: true if point_type is one of the following: ON_OutlineFigurePoint::Type::MoveTo ON_OutlineFigurePoint::Type::LineTo ON_OutlineFigurePoint::Type::QuadraticBezierPoint ON_OutlineFigurePoint::Type::CubicBezierPoint
◆ IsOffFigure()
 bool ON_OutlineFigurePoint::IsOffFigure  |  ( |   | ) |   const
Returns: True if the point is in interior control point in bezier segment. False otherwise (the point is on at the start or end of a line or bezier segment or unset).
◆ IsOnFigure()
 bool ON_OutlineFigurePoint::IsOnFigure  |  ( |   | ) |   const
Returns: True if the point is on at the start or end of a line or bezier segment. False otherwise (the point is in interior control point in bezier segment or unset).
◆ operator=()
 ON_OutlineFigurePoint& ON_OutlineFigurePoint::operator=  |  ( |  const ON_OutlineFigurePoint &  |   | )
default
◆ Point()
 const ON_2fPoint ON_OutlineFigurePoint::Point  |  ( |   | ) |   const
◆ Point2d()
 const ON_2dPoint ON_OutlineFigurePoint::Point2d  |  ( |   | ) |   const
◆ Point2i()
 const ON_2iPoint ON_OutlineFigurePoint::Point2i  |  ( |   | ) |   const
Returns: Point rounded to nearest integer coordinates.
◆ Point2iCeil()
 const ON_2iPoint ON_OutlineFigurePoint::Point2iCeil  |  ( |   | ) |   const
Returns: Point rounded up (ceil) to integer coordinates.
◆ Point2iFloor()
 const ON_2iPoint ON_OutlineFigurePoint::Point2iFloor  |  ( |   | ) |   const
Returns: Point rounded down (floor) to integer coordinates.
◆ PointProximity()
 ON_OutlineFigurePoint::Proximity ON_OutlineFigurePoint::PointProximity  |  ( |   | ) |   const
◆ PointType()
 ON_OutlineFigurePoint::Type ON_OutlineFigurePoint::PointType  |  ( |   | ) |   const
Member Data Documentation
◆ Error
 const ON_OutlineFigurePoint ON_OutlineFigurePoint::Error
static
◆ m_figure_index
 ON__UINT16 ON_OutlineFigurePoint::m_figure_index = 0
0 = unset. The first figure in an outline has m_figure_index = 1.
◆ m_point
 ON_2fPoint ON_OutlineFigurePoint::m_point = ON_2fPoint::NanPoint
point location
◆ m_point_proximity
 ON_OutlineFigurePoint::Proximity ON_OutlineFigurePoint::m_point_proximity = ON_OutlineFigurePoint::Proximity::Unset
◆ m_point_type
 ON_OutlineFigurePoint::Type ON_OutlineFigurePoint::m_point_type = ON_OutlineFigurePoint::Type::Unset
◆ Unset
 const ON_OutlineFigurePoint ON_OutlineFigurePoint::Unset
static