Classes | Public Member Functions | List of all members
CRhRdkRenderPlugInIterator Class Reference
RDK
#include <RhRdkRenderPlugInIterator.h>
 Inheritance diagram for CRhRdkRenderPlugInIterator:
 Classes
class  | Info
 Public Member Functions
CRhRdkRenderPlugInIterator ()
virtual  | ~CRhRdkRenderPlugInIterator ()
virtual bool  | Next (Info &infoOut)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class provides support for enumerating installed Rhino render plug-ins.
Constructor & Destructor Documentation
◆ CRhRdkRenderPlugInIterator()
 CRhRdkRenderPlugInIterator::CRhRdkRenderPlugInIterator  |  ( |   | )
◆ ~CRhRdkRenderPlugInIterator()
 virtual CRhRdkRenderPlugInIterator::~CRhRdkRenderPlugInIterator  |  ( |   | )
virtual
Member Function Documentation
◆ Next()
 virtual bool CRhRdkRenderPlugInIterator::Next  |  ( |  Info &  |  infoOut | )
virtual