Classes | Public Member Functions | List of all members
ON_EdgeSoftening Class Reference
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_EdgeSoftening:
 Classes
class  | Defaults
 Public Member Functions
ON_EdgeSoftening ()
ON_EdgeSoftening (const ON_EdgeSoftening &es)
ON_EdgeSoftening (const ON_XMLNode &node)
bool  | Chamfer (void) const
Specifies whether to chamfer the edges. More...
double  | EdgeAngleThreshold (void) const
bool  | Faceted (void) const
Specifies whether the edges are faceted. More...
bool  | ForceSoftening (void) const
Specifies whether to soften edges despite too large a radius. More...
bool  | On (void) const
Specifies whether the feature is enabled or not. More...
bool  | operator!= (const ON_EdgeSoftening &es) const
const ON_EdgeSoftening &  | operator= (const ON_EdgeSoftening &es)
bool  | operator== (const ON_EdgeSoftening &es) const
void  | SetChamfer (bool b)
void  | SetEdgeAngleThreshold (double d)
void  | SetFaceted (bool b)
void  | SetForceSoftening (bool b)
void  | SetOn (bool b)
void  | SetSoftening (double d)
double  | Softening (void) const
The softening radius. More...
virtual ON_UUID  | Uuid (void) const override
Return the unique identifier of this mesh modifier. More...
 Public Member Functions inherited from ON_MeshModifier
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const
< For internal use only. More...
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
 Additional Inherited Members
 Static Public Member Functions inherited from ON_MeshModifier
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes inherited from ON_MeshModifier
CImpl *  | m_impl
Constructor & Destructor Documentation
◆ ON_EdgeSoftening() [1/3]
 ON_EdgeSoftening::ON_EdgeSoftening  |  ( |   | )
◆ ON_EdgeSoftening() [2/3]
 ON_EdgeSoftening::ON_EdgeSoftening  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_EdgeSoftening() [3/3]
 ON_EdgeSoftening::ON_EdgeSoftening  |  ( |  const ON_EdgeSoftening &  |  es | )
Member Function Documentation
◆ Chamfer()
 bool ON_EdgeSoftening::Chamfer  |  ( |  void  |   | ) |   const
Specifies whether to chamfer the edges.
◆ EdgeAngleThreshold()
 double ON_EdgeSoftening::EdgeAngleThreshold  |  ( |  void  |   | ) |   const
Threshold angle (in degrees) which controls whether an edge is softened or not. The angle refers to the angles between the adjacent faces of an edge.
◆ Faceted()
 bool ON_EdgeSoftening::Faceted  |  ( |  void  |   | ) |   const
Specifies whether the edges are faceted.
◆ ForceSoftening()
 bool ON_EdgeSoftening::ForceSoftening  |  ( |  void  |   | ) |   const
Specifies whether to soften edges despite too large a radius.
◆ On()
 bool ON_EdgeSoftening::On  |  ( |  void  |   | ) |   const
Specifies whether the feature is enabled or not.
◆ operator!=()
 bool ON_EdgeSoftening::operator!=  |  ( |  const ON_EdgeSoftening &  |  es | ) |   const
◆ operator=()
 const ON_EdgeSoftening& ON_EdgeSoftening::operator=  |  ( |  const ON_EdgeSoftening &  |  es | )
◆ operator==()
 bool ON_EdgeSoftening::operator==  |  ( |  const ON_EdgeSoftening &  |  es | ) |   const
◆ SetChamfer()
 void ON_EdgeSoftening::SetChamfer  |  ( |  bool  |  b | )
◆ SetEdgeAngleThreshold()
 void ON_EdgeSoftening::SetEdgeAngleThreshold  |  ( |  double  |  d | )
◆ SetFaceted()
 void ON_EdgeSoftening::SetFaceted  |  ( |  bool  |  b | )
◆ SetForceSoftening()
 void ON_EdgeSoftening::SetForceSoftening  |  ( |  bool  |  b | )
◆ SetOn()
 void ON_EdgeSoftening::SetOn  |  ( |  bool  |  b | )
◆ SetSoftening()
 void ON_EdgeSoftening::SetSoftening  |  ( |  double  |  d | )
◆ Softening()
 double ON_EdgeSoftening::Softening  |  ( |  void  |   | ) |   const
The softening radius.
◆ Uuid()
 virtual ON_UUID ON_EdgeSoftening::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Return the unique identifier of this mesh modifier.
Implements ON_MeshModifier.