Public Member Functions | Protected Member Functions | List of all members
CRhinoOnWorksessionFile::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Member Functions
CParameters (class CRhinoOnWorksessionFilePrivate *privateParameters)
~CParameters ()
CRhinoOnWorksessionFile::change_type  | ChangeType () const
Whether the model was attached or detached. More...
CRhinoDoc *  | Document () const
Document the worksession belongs to. More...
const wchar_t *  | FilePath () const
Full path of the .3dm file being attached or detached. More...
unsigned int  | WorksessionModelRuntimeSerialNumber () const
 Protected Member Functions
CParameters (const CParameters &)=delete
CParameters &  | operator= (const CParameters &)=delete
Constructor & Destructor Documentation
◆ CParameters() [1/2]
 CRhinoOnWorksessionFile::CParameters::CParameters  |  ( |  class CRhinoOnWorksessionFilePrivate *  |  privateParameters | )
◆ ~CParameters()
 CRhinoOnWorksessionFile::CParameters::~CParameters  |  ( |   | )
◆ CParameters() [2/2]
 CRhinoOnWorksessionFile::CParameters::CParameters  |  ( |  const CParameters &  |   | )
protecteddelete
Member Function Documentation
◆ ChangeType()
 CRhinoOnWorksessionFile::change_type CRhinoOnWorksessionFile::CParameters::ChangeType  |  ( |   | ) |   const
Whether the model was attached or detached.
◆ Document()
 CRhinoDoc* CRhinoOnWorksessionFile::CParameters::Document  |  ( |   | ) |   const
Document the worksession belongs to.
◆ FilePath()
 const wchar_t* CRhinoOnWorksessionFile::CParameters::FilePath  |  ( |   | ) |   const
Full path of the .3dm file being attached or detached.
◆ operator=()
 CParameters& CRhinoOnWorksessionFile::CParameters::operator=  |  ( |  const CParameters &  |   | )
protecteddelete
◆ WorksessionModelRuntimeSerialNumber()
 unsigned int CRhinoOnWorksessionFile::CParameters::WorksessionModelRuntimeSerialNumber  |  ( |   | ) |   const
Runtime serial number of the worksession reference model being attached or detached. Not persistent across sessions.