Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_ParticleSystem::ON_ParticleState Class Reference
#include <opennurbs_plus_particle.h>
 Public Member Functions
bool  | IsSet () const
bool  | IsUnset () const
 Public Attributes
ON_3dVector  | m_acceleration
ON_3dVector  | m_force
force accumulator More...
double  | m_mass
state More...
ON_3dPoint  | m_position
double  | m_time
ON_3dVector  | m_velocity
 Static Public Attributes
static const ON_ParticleSystem::ON_ParticleState  | Unset
Unset.m_time = ON_UNSET_VALUE. More...
Member Function Documentation
◆ IsSet()
 bool ON_ParticleSystem::ON_ParticleState::IsSet  |  ( |   | ) |   const
◆ IsUnset()
 bool ON_ParticleSystem::ON_ParticleState::IsUnset  |  ( |   | ) |   const
Member Data Documentation
◆ m_acceleration
 ON_3dVector ON_ParticleSystem::ON_ParticleState::m_acceleration
◆ m_force
 ON_3dVector ON_ParticleSystem::ON_ParticleState::m_force
force accumulator
◆ m_mass
 double ON_ParticleSystem::ON_ParticleState::m_mass
state
◆ m_position
 ON_3dPoint ON_ParticleSystem::ON_ParticleState::m_position
◆ m_time
 double ON_ParticleSystem::ON_ParticleState::m_time
◆ m_velocity
 ON_3dVector ON_ParticleSystem::ON_ParticleState::m_velocity
◆ Unset
 const ON_ParticleSystem::ON_ParticleState ON_ParticleSystem::ON_ParticleState::Unset
static
Unset.m_time = ON_UNSET_VALUE.