List of all members
CRhRdkLightManagerSupport_BuiltIn Class Reference
RDK
#include <RhRdkLightManagerSupport.h>
 Inheritance diagram for CRhRdkLightManagerSupport_BuiltIn:
 Additional Inherited Members
 Public Types inherited from CRhinoEventWatcher
enum  | alias_event {
 alias_added, alias_deleted, alias_undeleted, alias_modified,
 alias_sorted, alias_current
 }
enum  | dimstyle_event {
 dimstyle_added, dimstyle_deleted, dimstyle_undeleted, dimstyle_modified,
 dimstyle_sorted, dimstyle_current
 }
enum  | event_id { event_id_none = 0, event_id_force_4byte_size = 0xFFFFFFFF }
enum  | font_event {
 font_added, font_deleted, font_undeleted, font_modified,
 font_sorted, font_current
 }
enum  | group_event {
 group_added, group_deleted, group_undeleted, group_modified,
 group_sorted
 }
enum  | hatchpattern_event {
 hatchpattern_added, hatchpattern_deleted, hatchpattern_undeleted, hatchpattern_modified,
 hatchpattern_sorted, hatchpattern_current
 }
enum  | idef_event {
 idef_added, idef_deleted, idef_undeleted, idef_modified,
 idef_sorted
 }
enum  | layer_event {
 layer_added, layer_deleted, layer_undeleted, layer_modified,
 layer_sorted, layer_current
 }
enum  | light_event {
 light_added, light_deleted, light_undeleted, light_modified,
 light_sorted
 }
enum  | linetype_event {
 linetype_added, linetype_deleted, linetype_undeleted, linetype_modified,
 linetype_sorted, linetype_current
 }
enum  | material_event {
 material_added, material_deleted, material_undeleted, material_modified,
 material_sorted, material_current
 }
enum  | text_style_event : unsigned int {
 text_style_added, text_style_deleted, text_style_undeleted, text_style_modified,
 text_style_sorted, text_style_current
 }
enum  | texture_mapping_event {
 texture_mapping_added, texture_mapping_deleted, texture_mapping_undeleted, texture_mapping_modified,
 texture_mapping_sorted, texture_mapping_current
 }
enum  | undo_event {
 no_undo_event = 0, begin_recording, end_recording, begin_undo,
 end_undo, begin_redo, end_redo, before_begin_recording,
 before_end_recording, purge_record = 86
 }
 Public Member Functions inherited from CRhRdkLightManagerSupport
CRhRdkLightManagerSupport ()
virtual  | ~CRhRdkLightManagerSupport ()
virtual bool  | DeleteLight (CRhinoDoc &doc, const ON_Light &light, bool bUndelete=false) const
virtual void *  | EVF (const wchar_t *, void *) override
virtual void  | GetLights (const CRhinoDoc &doc, ON_ObjectArray< ON_Light > &lights) const
virtual bool  | GetLightSolo (CRhinoDoc &doc, const ON_UUID &id) const
virtual void  | GroupLights (CRhinoDoc &doc, ON_ObjectArray< ON_Light > &lights) const
virtual UUID  | InterfaceId (void) const override
bool  | IsActive (void) const
virtual bool  | IsInSoloStorage (const CRhinoDoc &doc, const ON_UUID &lightId) const
virtual ON_wString  | LightDescription (const CRhinoDoc &doc, const ON_Light &light) const
virtual bool  | LightFromId (const CRhinoDoc &doc, const ON_UUID &uuid, ON_Light &light) const
virtual bool  | LightFromObject (const CRhinoObject &object, ON_Light &light) const
virtual int  | LightsInSoloStorage (const CRhinoDoc &doc) const
virtual void  | ModifyLight (CRhinoDoc &doc, const ON_Light &light) const
virtual unsigned int  | ObjectSerialNumberFromLight (const CRhinoDoc &doc, const ON_Light &light) const
virtual void  | OnCustomLightEvent (const CRhinoDoc &doc, CRhinoEventWatcher::light_event, const ON_Light &light) const
virtual bool  | OnEditLight (CRhinoDoc &doc, ON_ObjectArray< ON_Light > &light) const
virtual bool  | RestoreFromSolo (CRhinoDoc &doc, const ON_UUID &lightId) const
virtual bool  | SaveToSoloStorage (CRhinoDoc &doc, const ON_UUID &lightId) const
virtual bool  | SetLightSolo (CRhinoDoc &doc, const ON_UUID &id, bool bSolo) const
virtual void  | UnGroup (CRhinoDoc &doc, ON_ObjectArray< ON_Light > &lights) const
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from CRhinoEventWatcher
CRhinoEventWatcher ()
CRhinoEventWatcher (bool headlessDocAware, bool headlessAppAware)
virtual  | ~CRhinoEventWatcher ()
virtual void  | AliasTableEvent (CRhinoEventWatcher::alias_event event, const CRhinoAppAliasList &alias_table, int alias_index, const CRhinoCommandAlias *old_settings)
virtual int  | DeleteLayerCheck (CRhinoDoc &doc, ON_SimpleArray< int > &layer_index_list, bool bQuiet)
virtual void  | DimStyleTableEvent (CRhinoEventWatcher::dimstyle_event event, const CRhinoDimStyleTable &dimstyle_table, int dimstyle_index, const ON_DimStyle *old_settings)
void  | Enable (BOOL32 b=TRUE)
virtual void  | Event (event_id id, unsigned int iParam1, int iParam2, const void *ptrParam1, const void *ptrParam2)
OBSOLETE - NEVER USE THIS. More...
virtual void  | GroupTableEvent (CRhinoEventWatcher::group_event event, const CRhinoGroupTable &group_table, int group_index, const ON_Group *old_settings)
virtual void  | HatchPatternTableEvent (CRhinoEventWatcher::hatchpattern_event event, const CRhinoHatchPatternTable &hatchpattern_table, int hatchpattern_index, const ON_HatchPattern *old_settings)
virtual void  | InstanceDefinitionTableEvent (CRhinoEventWatcher::idef_event event, const CRhinoInstanceDefinitionTable &idef_table, int idef_index, const ON_InstanceDefinition *old_settings)
bool  | IsEnabled () const
bool  | IsHeadlessAppAware () const
bool  | IsHeadlessDocAware () const
virtual void  | LayerTableEvent (CRhinoEventWatcher::layer_event event, const CRhinoLayerTable &layer_table, int layer_index, const ON_Layer *old_settings)
virtual void  | LinetypeTableEvent (CRhinoEventWatcher::linetype_event event, const CRhinoLinetypeTable &linetype_table, int linetype_index, const ON_Linetype *old_settings)
virtual void  | MaterialTableEvent (CRhinoEventWatcher::material_event event, const CRhinoMaterialTable &material_table, int material_index, const ON_Material *old_settings)
virtual void  | OnActiveDocumentChanged (CRhinoDoc *doc)
virtual void  | OnAppSettingsChanged (const CRhinoAppSettings &new_app_settings)
virtual void  | OnBeginCommand (const CRhinoCommand &command, const CRhinoCommandContext &context)
virtual void  | OnBeginOpenDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bMerge, BOOL32 bReference)
virtual void  | OnBeginSaveDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bExportSelected)
virtual void  | OnCloseDocument (CRhinoDoc &doc)
virtual void  | OnCloseRhino (class CRhinoApp &app)
virtual void  | OnCreateView (CRhinoView *rhino_view)
virtual void  | OnDeselectAllObjects (CRhinoDoc &doc, int count)
virtual void  | OnDeselectObject (CRhinoDoc &doc, const CRhinoObject &object)
virtual void  | OnDeselectObjects (CRhinoDoc &doc, const ON_SimpleArray< const CRhinoObject * > &objects)
virtual void  | OnDestroyView (CRhinoView *rhino_view)
virtual void  | OnDocumentPropertiesChanged (CRhinoDoc &doc)
virtual void  | OnEnableEventWatcher (BOOL32 b)
virtual void  | OnEndCommand (const CRhinoCommand &command, const CRhinoCommandContext &context, CRhinoCommand::result rc)
virtual void  | OnEndOpenDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bMerge, BOOL32 bReference)
virtual void  | OnEndSaveDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bExportSelected)
virtual void  | OnInitRhino (class CRhinoApp &app)
virtual void  | OnNewDocument (CRhinoDoc &doc)
virtual void  | OnPurgeObject (CRhinoDoc &doc, CRhinoObject &object)
virtual void  | OnRenameView (CRhinoView *rhino_view)
virtual void  | OnSelectObject (CRhinoDoc &doc, const CRhinoObject &object)
virtual void  | OnSelectObjects (CRhinoDoc &doc, const ON_SimpleArray< const CRhinoObject * > &objects)
virtual void  | OnSetActiveView (CRhinoView *rhino_view)
virtual void  | OnUnitsChangedWithScaling (CRhinoDoc &doc, double scale)
virtual void  | OnUpdateObjectMesh (CRhinoDoc &doc, CRhinoObject &object, ON::mesh_type mesh_type)
void  | Register ()
unsigned int  | SerialNumber () const
virtual void  | TextureMappingTableEvent (CRhinoEventWatcher::texture_mapping_event event, const CRhinoTextureMappingTable &texture_mapping_table, int texture_mapping_index, const ON_TextureMapping *old_settings)
virtual void  | UndoEvent (CRhinoEventWatcher::undo_event event, unsigned int undo_record_serialnumber, const CRhinoCommand *cmd)
void  | UnRegister ()
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkLightManagerSupport
virtual void  | LightTableEvent (CRhinoEventWatcher::light_event event, const CRhinoLightTable &light_table, int light_index, const ON_Light *old_settings) override
virtual const CRhinoObject *  | ObjectFromLight (const CRhinoDoc &doc, const ON_Light &light) const
virtual void  | OnAddObject (CRhinoDoc &doc, CRhinoObject &object) override
virtual void  | OnDeleteObject (CRhinoDoc &doc, CRhinoObject &object) override
virtual void  | OnModifyObjectAttributes (CRhinoDoc &doc, CRhinoObject &object, const CRhinoObjectAttributes &old_attributes) override
virtual void  | OnObjectReplaced (unsigned int rhino_doc_serial_number, unsigned int deleted_object_sn, unsigned int added_object_sn) override
virtual void  | OnReplaceObject (CRhinoDoc &doc, CRhinoObject &old_object, CRhinoObject &new_object) override
virtual void  | OnUnDeleteObject (CRhinoDoc &doc, CRhinoObject &object) override