Classes | Public Types | Public Member Functions | List of all members
ON_CurvePiping Class Reference
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_CurvePiping:
 Classes
class  | Defaults
 Public Types
enum  | CapTypes : int { CapTypes::None = 0, CapTypes::Flat = 1, CapTypes::Box = 2, CapTypes::Dome = 3 }
 Public Member Functions
ON_CurvePiping ()
ON_CurvePiping (const ON_CurvePiping &cp)
ON_CurvePiping (const ON_XMLNode &node)
int  | Accuracy (void) const
Specifies the accuracy of the pipe in the range 0 to 100. More...
CapTypes  | CapType (void) const
The type of cap to be created at the ends of the pipe. More...
bool  | Faceted (void) const
Specifies whether the pipe is faceted or not. More...
bool  | On (void) const
Specifies whether the feature is enabled or not. More...
bool  | operator!= (const ON_CurvePiping &cp) const
const ON_CurvePiping &  | operator= (const ON_CurvePiping &cp)
bool  | operator== (const ON_CurvePiping &cp) const
double  | Radius (void) const
Specifies the radius of the pipe (minimum value 0.0001). More...
int  | Segments (void) const
Specifies the number of segments in the pipe (minimum value 2). More...
void  | SetAccuracy (int a)
void  | SetCapType (CapTypes ct)
void  | SetFaceted (bool b)
void  | SetOn (bool b)
void  | SetRadius (double d)
void  | SetSegments (int s)
virtual ON_UUID  | Uuid (void) const override
Return the unique identifier of this mesh modifier. More...
 Public Member Functions inherited from ON_MeshModifier
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const
< For internal use only. More...
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
 Additional Inherited Members
 Static Public Member Functions inherited from ON_MeshModifier
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes inherited from ON_MeshModifier
CImpl *  | m_impl
Member Enumeration Documentation
◆ CapTypes
 enum ON_CurvePiping::CapTypes : int
strong
Enumerator
None
No capping.
Flat
A flat surface will cap the pipe.
Box
A simple construction will cap the pipe.
Dome
A meridians-and-parallels hemisphere construction will cap the pipe.
Constructor & Destructor Documentation
◆ ON_CurvePiping() [1/3]
 ON_CurvePiping::ON_CurvePiping  |  ( |   | )
◆ ON_CurvePiping() [2/3]
 ON_CurvePiping::ON_CurvePiping  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_CurvePiping() [3/3]
 ON_CurvePiping::ON_CurvePiping  |  ( |  const ON_CurvePiping &  |  cp | )
Member Function Documentation
◆ Accuracy()
 int ON_CurvePiping::Accuracy  |  ( |  void  |   | ) |   const
Specifies the accuracy of the pipe in the range 0 to 100.
◆ CapType()
 CapTypes ON_CurvePiping::CapType  |  ( |  void  |   | ) |   const
The type of cap to be created at the ends of the pipe.
◆ Faceted()
 bool ON_CurvePiping::Faceted  |  ( |  void  |   | ) |   const
Specifies whether the pipe is faceted or not.
◆ On()
 bool ON_CurvePiping::On  |  ( |  void  |   | ) |   const
Specifies whether the feature is enabled or not.
◆ operator!=()
 bool ON_CurvePiping::operator!=  |  ( |  const ON_CurvePiping &  |  cp | ) |   const
◆ operator=()
 const ON_CurvePiping& ON_CurvePiping::operator=  |  ( |  const ON_CurvePiping &  |  cp | )
◆ operator==()
 bool ON_CurvePiping::operator==  |  ( |  const ON_CurvePiping &  |  cp | ) |   const
◆ Radius()
 double ON_CurvePiping::Radius  |  ( |  void  |   | ) |   const
Specifies the radius of the pipe (minimum value 0.0001).
◆ Segments()
 int ON_CurvePiping::Segments  |  ( |  void  |   | ) |   const
Specifies the number of segments in the pipe (minimum value 2).
◆ SetAccuracy()
 void ON_CurvePiping::SetAccuracy  |  ( |  int  |  a | )
◆ SetCapType()
 void ON_CurvePiping::SetCapType  |  ( |  CapTypes  |  ct | )
◆ SetFaceted()
 void ON_CurvePiping::SetFaceted  |  ( |  bool  |  b | )
◆ SetOn()
 void ON_CurvePiping::SetOn  |  ( |  bool  |  b | )
◆ SetRadius()
 void ON_CurvePiping::SetRadius  |  ( |  double  |  d | )
◆ SetSegments()
 void ON_CurvePiping::SetSegments  |  ( |  int  |  s | )
◆ Uuid()
 virtual ON_UUID ON_CurvePiping::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Return the unique identifier of this mesh modifier.
Implements ON_MeshModifier.