Classes | Public Types | Public Member Functions | List of all members
ON_IntersectCurveSDF Class Reference
OpenNURBS
#include <opennurbs_plus_implicitfn.h>
 Classes
class  | ON_CurveSDFEvent
 Public Types
enum  | ON_CurveSDFEventType : int { ON_CurveSDFEventType::Unknown = 0, ON_CurveSDFEventType::NoEvent = 1, ON_CurveSDFEventType::Point = 2, ON_CurveSDFEventType::Overlap = 3 }
 Public Member Functions
ON_IntersectCurveSDF (const ON_SignedDistanceFunction &sdf)
Constructor. More...
~ON_IntersectCurveSDF ()
bool  | Intersect (const ON_Curve &curve, ON_SimpleArray< ON_CurveSDFEvent > &result, double tolerance)
Intersect a curve with the SDF. More...
Detailed Description
Intersect a curve with a signed distance function.
Member Enumeration Documentation
◆ ON_CurveSDFEventType
 enum ON_IntersectCurveSDF::ON_CurveSDFEventType : int
strong
Curve - SDF intersection event type
Enumerator
Unknown
unknown event type
NoEvent
no point or overlap
Point
point intersection
Overlap
overlap intersection
Constructor & Destructor Documentation
◆ ON_IntersectCurveSDF()
 ON_IntersectCurveSDF::ON_IntersectCurveSDF  |  ( |  const ON_SignedDistanceFunction &  |  sdf | )
Constructor.
◆ ~ON_IntersectCurveSDF()
 ON_IntersectCurveSDF::~ON_IntersectCurveSDF  |  ( |   | )
Member Function Documentation
◆ Intersect()
 bool ON_IntersectCurveSDF::Intersect  |  ( |  const ON_Curve &  |  curve,
|  ON_SimpleArray< ON_CurveSDFEvent > &  |  result,
|  double  |  tolerance
)
Intersect a curve with the SDF.