Public Member Functions | Protected Member Functions | List of all members
CRhRdkMaterialFactory Class Referenceabstract
RDK
#include <RhRdkMaterialFactory.h>
 Inheritance diagram for CRhRdkMaterialFactory:
 Public Member Functions
CRhRdkMaterialFactory ()
virtual  | ~CRhRdkMaterialFactory ()
virtual CRhRdkContent::Kinds  | Kind (void) const
virtual CRhRdkContent *  | NewContent (void) const
 Public Member Functions inherited from CRhRdkContentFactory
CRhRdkContentFactory ()
virtual  | ~CRhRdkContentFactory ()
virtual ON_wString  | ContentInternalName (void) const
virtual UUID  | ContentTypeId (void) const
virtual IRhRdkContentUIAgent *  | ContentUIAgent (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual bool  | Initialize (void)
virtual UUID  | InterfaceId (void) const final override
virtual bool  | IsBuiltIn (void) const
virtual bool  | IsElevated (void) const
virtual bool  | IsKind (CRhRdkContent::Kinds kind) const
virtual_su CRhRdkContent *  | NewContent (bool bAutoGlobalRegister) const
virtual UUID  | PlugInId (void) const override
virtual void  | RebuildCache (void)
virtual UUID  | RenderEngineId (void) const
virtual void  | SetContentUIAgent (IRhRdkContentUIAgent *pAgent)
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual class CRhRdkMaterial *  | NewMaterial (void) const =0
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkMaterialFactory()
 CRhRdkMaterialFactory::CRhRdkMaterialFactory  |  ( |   | )
◆ ~CRhRdkMaterialFactory()
 virtual CRhRdkMaterialFactory::~CRhRdkMaterialFactory  |  ( |   | )
virtual
Member Function Documentation
◆ Kind()
 virtual CRhRdkContent::Kinds CRhRdkMaterialFactory::Kind  |  ( |  void  |   | ) |   const
virtual
Returns
The kind of content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewContent()
 virtual CRhRdkContent* CRhRdkMaterialFactory::NewContent  |  ( |  void  |   | ) |   const
virtual
Create a new content.
Note
This should be implemented simply as
return new CMyContent(...);
 No further initialization or operations should be performed on the new content.
Returns
A pointer to a new instance of the content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewMaterial()
 virtual class CRhRdkMaterial* CRhRdkMaterialFactory::NewMaterial  |  ( |  void  |   | ) |   const
protectedpure virtual