Public Member Functions | Friends | List of all members
CRhinoUiOptionsListCtrlFileNameEditBox Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlFileNameEditBox:
 Public Member Functions
CRhinoUiOptionsListCtrlFileNameEditBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlFileNameEditBox ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
bool  | ClearTextOnDeleteKey () const
bool  | DisplayFileDialogNow ()
CFileDialog *  | FileDialog ()
CRhinoGetFileDialog &  | FileDialogCtrl ()
CRhinoGetFileDialog::file_dialog_type  | FileDialogCtrlType () const
afx_msg void  | OnDestroy ()
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
afx_msg void  | OnEnKillfocus ()
bool  | SetClearTextOnDeleteKey (bool b)
void  | SetFileDialog (CFileDialog *pFD)
CRhinoGetFileDialog::file_dialog_type  | SetFileDialogCtrlType (CRhinoGetFileDialog::file_dialog_type type)
void  | SetText (LPCTSTR lps)
bool  | SetWarnOnDeleteKey (bool b)
bool  | WarnOnDeleteKey () const
 Public Member Functions inherited from CRhinoUiOptionsListCtrlEditBox
CRhinoUiOptionsListCtrlEditBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlEditBox ()
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
afx_msg void  | OnEnChange ()
virtual bool  | OnEndEdit (LPCTSTR lps) const
afx_msg void  | OnEnKillfocus ()
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
void  | SetNumber (double d)
void  | SetNumber (int i)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Public Member Functions inherited from CRhinoUiEdit
CRhinoUiEdit ()
virtual  | ~CRhinoUiEdit ()
void  | DDX_Text (CDataExchange *pDX, int nIDC, double &nValue)
void  | DDX_Text (CDataExchange *pDX, int nIDC, int &nValue)
void  | DDX_Text (CDataExchange *pDX, int nIDC, ON_wString &wValue)
int  | DisplayPrecision () const
void  | Format ()
const CString &  | FormatKeyword () const
int  | GetEditType () const
void  | GetNumericValue (double &d)
void  | GetNumericValue (int &n)
CSpinButtonCtrl *  | GetSpinButtonCtrl () const
void  | GetStringValue (ON_wString &w)
bool  | IncludeSpinner () const
void  | LinkToSliderCtrl (CRhinoUiSliderCtrl *)
afx_msg void  | OnChar (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
on_number_error  | OnNumberErrorMode () const
afx_msg void  | OnSetFocus (CWnd *pOldWnd)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
void  | SetAllowEmpty (bool bSet=true)
void  | SetDisplayPrecision (int precision)
int  | SetEditType (edit_type et)
void  | SetFormatKeyword (const char *lps)
void  | SetFormatKeyword (const wchar_t *lps)
bool  | SetIncludeSpinner (bool b)
void  | SetMax (bool bSet, double nMax=0.0)
void  | SetMax (bool bSet, int nMax=0)
void  | SetMin (bool bSet, double nMin=0.0)
void  | SetMin (bool bSet, int nMin=0)
void  | SetNonZero (bool bSet=TRUE)
void  | SetNumber (double d)
void  | SetNumber (int i)
void  | SetOnNumberErrorMode (on_number_error mode)
void  | SetStringValue (const char *s, bool bAppend=false)
void  | SetStringValue (const wchar_t *w, bool bAppend=false)
void  | SetValue (double nValue)
void  | SetValue (int nValue)
ON_wString  | StringValue ()
void  | SynchSlider ()
void  | VerifyValue (double &nValue)
void  | VerifyValue (int &nValue)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Friends
class  | CRhUiOptionsListCtrlFileNameEditBoxButton
 Additional Inherited Members
 Public Types inherited from CRhinoUiEdit
enum  | edit_type {
 et_text = 0, et_int, et_double, et_ip,
 et_invalid, force_32bit_edit_type = 0xFFFFFFFF
 }
enum  | on_number_error { one_use_last_good_number = 0, one_clamp_to_min_max_value, force_32bit_number_error = 0xFFFFFFFF }
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiEdit
bool  | CreateBuddy ()
void  | FormatInt ()
void  | FormatReal ()
void  | OnCharInt (UINT nChar, UINT nRepCnt, UINT nFlags)
void  | OnCharReal (UINT nChar, UINT nRepCnt, UINT nFlags)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
 Protected Attributes inherited from CRhinoUiOptionsListCtrlEditBox
bool  | m_bCancel
int  | m_edit_state = 0
 Protected Attributes inherited from CRhinoUiEdit
bool  | m_allowemtpy
int  | m_displayprecision
int  | m_edit_type
bool  | m_hasmax
bool  | m_hasmin
bool  | m_include_buddy
CString  | m_key_word
CString  | m_last_good_string
double  | m_lastgoodnumber
CRhinoUiSliderCtrl *  | m_linked_slider
double  | m_max
double  | m_min
bool  | m_nonzero
on_number_error  | m_on_number_error
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
Detailed Description
CRhinoUiOptionsListCtrlFileNameEditBox
Description: Display a read only edit box containing file name and a "..." button used to browse for file name.
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlFileNameEditBox()
 CRhinoUiOptionsListCtrlFileNameEditBox::CRhinoUiOptionsListCtrlFileNameEditBox  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsText = NULL,
|  int  |  iIndentLevel = 0
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
◆ ~CRhinoUiOptionsListCtrlFileNameEditBox()
 virtual CRhinoUiOptionsListCtrlFileNameEditBox::~CRhinoUiOptionsListCtrlFileNameEditBox  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description: CRhinoUiOptionsListCtrlItem virtual override
Create read only edit control and browse button.
Parameters: See CRhinoUiOptionsListCtrlItem::BeginEditItem()
Returns: Returns true if edit control and browse button are created; otherwise false.
See Also: CRhinoUiOptionsListCtrlEditBox::BeginEditItem()
Reimplemented from CRhinoUiOptionsListCtrlEditBox.
◆ ClearTextOnDeleteKey()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::ClearTextOnDeleteKey  |  ( |   | ) |   const
Description: Call this method to determine if file name should be cleared when the delete key is pressed. The default value is true.
Returns: Returns true if file name will be cleared when the delete key is pressed.
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::SetWarnOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::SetWarnOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::ClearTextOnDeleteKey() Defaults to true
◆ DisplayFileDialogNow()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::DisplayFileDialogNow  |  ( |   | )
Description: Call this method to display the file dialog in the same manner as when the "..." file button is clicked. This will only work if the file window has been created.
Returns: Returns true if the control windows exists and button click was simulated otherwise; returns false.
◆ FileDialog()
 CFileDialog* CRhinoUiOptionsListCtrlFileNameEditBox::FileDialog  |  ( |   | )
Description: Call this method to get the CFileDialog object which will be used by the file button if the FileDialogCtrlType() is equal to CRhinoGetFileDialog::custom
Returns: Returns the CFileDialog object which will be used by the file button if the FileDialogCtrlType() is equal to CRhinoGetFileDialog::custom
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrl() CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialog()
◆ FileDialogCtrl()
 CRhinoGetFileDialog& CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrl  |  ( |   | )
Description: Call this method to get the control object for the file button. When the file button is pressed it will use this object to display a standard Rhino file dialog. This will only get used if SetFileDialogCtrlType() is set to custom.
Returns: Rhino file dialog control object used by the file button associated with this item.
See Also: CRhinoGetFileDialog CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType()
◆ FileDialogCtrlType()
 CRhinoGetFileDialog::file_dialog_type CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType  |  ( |   | ) |   const
Description: Call this method to get Rhino file dialog mode which will be used when the file button is pressed. If this returns CRhinoGetFileDialog::custom FileDialog() will be used instead.
Returns: Rhino file dialog control type to be used by the FileDialogCtrl()
See Also: CRhinoGetFileDialog CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType()
◆ OnDestroy()
 afx_msg void CRhinoUiOptionsListCtrlFileNameEditBox::OnDestroy  |  ( |   | )
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlFileNameEditBox::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description: CRhinoUiOptionsListCtrlItem override
Reimplemented from CRhinoUiOptionsListCtrlEditBox.
◆ OnEnKillfocus()
 afx_msg void CRhinoUiOptionsListCtrlFileNameEditBox::OnEnKillfocus  |  ( |   | )
◆ SetClearTextOnDeleteKey()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::SetClearTextOnDeleteKey  |  ( |  bool  |  b | )
Description: Call this method to tell the control if the file name should be cleared when the delete key is pressed. The default value is true.
Parameters: b [in] New value for this mode.
Returns: Returns previous value
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::WarnOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::SetWarnOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::ClearTextOnDeleteKey() Defaults to true
◆ SetFileDialog()
 void CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialog  |  ( |  CFileDialog *  |  pFD | )
Description: Call this method to set the CFileDialog object which will be used by the file button if the FileDialogCtrlType() is equal to CRhinoGetFileDialog::custom
Parameters: pFD [in] Pointer to CFileDialog control object to be used by the file button.
Returns: Returns the CFileDialog object which will be used by the file button if the FileDialogCtrlType() is equal to CRhinoGetFileDialog::custom
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrl() CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialog()
◆ SetFileDialogCtrlType()
 CRhinoGetFileDialog::file_dialog_type CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType  |  ( |  CRhinoGetFileDialog::file_dialog_type  |  type | )
Description: Call this method to set the Rhino file dialog mode which will be used when the file button is pressed. If this returns CRhinoGetFileDialog::custom FileDialog() will be used instead.
Parameters: type [in] New Rhino file dialog mode.
Returns: Returns previous value.
See Also: CRhinoGetFileDialog CRhinoUiOptionsListCtrlFileNameEditBox::FileDialogCtrlType() CRhinoUiOptionsListCtrlFileNameEditBox::SetFileDialogCtrlType()
◆ SetText()
 void CRhinoUiOptionsListCtrlFileNameEditBox::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: CRhinoUiOptionsListCtrlItem override
Reimplemented from CRhinoUiOptionsListCtrlEditBox.
◆ SetWarnOnDeleteKey()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::SetWarnOnDeleteKey  |  ( |  bool  |  b | )
Description: Call this method to tell the control to display or suppress a warning message when the delete key is pressed which will clear the file name. The warning message will include Yes and No buttons to give the user the opportunity to change there mind.
Parameters: b [in] New value for this mode.
Returns: Returns previous value
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::WarnOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::ClearTextOnDeleteKey() CRhinoUiOptionsListCtrlFileNameEditBox::SetClearTextOnDeleteKey()
◆ WarnOnDeleteKey()
 bool CRhinoUiOptionsListCtrlFileNameEditBox::WarnOnDeleteKey  |  ( |   | ) |   const
Description: Call this method to determine if a warning message should be displayed when the delete key is pressed which will clear the file name. The warning message will include Yes and No buttons to give the user the opportunity to change there mind. The default value is false.
Returns: Returns true if a warning will be displayed otherwise false
See Also: CRhinoUiOptionsListCtrlFileNameEditBox::SetWarnOnDeleteKey() Defaults to false
Friends And Related Function Documentation
◆ CRhUiOptionsListCtrlFileNameEditBoxButton
 friend class CRhUiOptionsListCtrlFileNameEditBoxButton
friend