Public Member Functions | Protected Member Functions | List of all members
CRhinoUiFileEvent::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Member Functions
CParameters (class CRhUiFileEventPrivateParameters *privatePrarmeters)
~CParameters ()
ON_UUID  | EventId () const
ON_UUID  | FileId () const
ON_UUID  | ItemId () const
 Protected Member Functions
CParameters (const CParameters &)=delete
CParameters &  | operator= (const CParameters &)=delete
Constructor & Destructor Documentation
◆ CParameters() [1/2]
 CRhinoUiFileEvent::CParameters::CParameters  |  ( |  class CRhUiFileEventPrivateParameters *  |  privatePrarmeters | )
◆ ~CParameters()
 CRhinoUiFileEvent::CParameters::~CParameters  |  ( |   | )
◆ CParameters() [2/2]
 CRhinoUiFileEvent::CParameters::CParameters  |  ( |  const CParameters &  |   | )
protecteddelete
Member Function Documentation
◆ EventId()
 ON_UUID CRhinoUiFileEvent::CParameters::EventId  |  ( |   | ) |   const
◆ FileId()
 ON_UUID CRhinoUiFileEvent::CParameters::FileId  |  ( |   | ) |   const
◆ ItemId()
 ON_UUID CRhinoUiFileEvent::CParameters::ItemId  |  ( |   | ) |   const
◆ operator=()
 CParameters& CRhinoUiFileEvent::CParameters::operator=  |  ( |  const CParameters &  |   | )
protecteddelete