Public Member Functions | Public Attributes | List of all members
CRhinoCommandAlias Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoCommandAlias ()
CRhinoCommandAlias (const CRhinoCommandAlias &other)
CRhinoCommandAlias (const wchar_t *alias, const wchar_t *macro)
CRhinoCommandAlias (const wchar_t *alias, const wchar_t *macro, bool instant)
bool  | IsInstant () const
CRhinoCommandAlias &  | operator= (const CRhinoCommandAlias &other)
void  | SetInstant (bool instant)
 Public Attributes
ON_wString  | m_alias
ON_wString  | m_macro
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoCommandAlias() [1/4]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |   | )
◆ CRhinoCommandAlias() [2/4]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |  const wchar_t *  |  alias,
|  const wchar_t *  |  macro
)
◆ CRhinoCommandAlias() [3/4]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |  const wchar_t *  |  alias,
|  const wchar_t *  |  macro,
|  bool  |  instant
)
◆ CRhinoCommandAlias() [4/4]
 CRhinoCommandAlias::CRhinoCommandAlias  |  ( |  const CRhinoCommandAlias &  |  other | )
Member Function Documentation
◆ IsInstant()
 bool CRhinoCommandAlias::IsInstant  |  ( |   | ) |   const
◆ operator=()
 CRhinoCommandAlias& CRhinoCommandAlias::operator=  |  ( |  const CRhinoCommandAlias &  |  other | )
◆ SetInstant()
 void CRhinoCommandAlias::SetInstant  |  ( |  bool  |  instant | )
Member Data Documentation
◆ m_alias
 ON_wString CRhinoCommandAlias::m_alias
17 Jan 2006 S.Baer Default C++ copy constructor, operator=, and destructor work fine
◆ m_macro
 ON_wString CRhinoCommandAlias::m_macro