Public Member Functions | List of all members
CRhinoUserInterfaceLabel Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Inheritance diagram for CRhinoUserInterfaceLabel:
 Public Member Functions
CRhinoUserInterfaceLabel ()
CRhinoUserInterfaceLabel (const wchar_t *text)
virtual  | ~CRhinoUserInterfaceLabel ()
ON_4fRect  | ComputedRect (const CRhinoDisplayPipeline *pipeline, bool logicalPixels) const override
ON_2fSize  | ComputeSize () const override
void  | Draw (CRhinoDisplayPipeline &dp) override
 Public Member Functions inherited from CRhinoUserInterfaceControl
CRhinoUserInterfaceControl ()
virtual  | ~CRhinoUserInterfaceControl ()
void  | GetAlignment (ControlHorizontalAlignment &h, ControlVerticalAlignment &v) const
void  | GetTextAlignment (ControlHorizontalAlignment &h, ControlVerticalAlignment &v) const
const ON_wString &  | ImageSVG () const
ON_2fPoint  | Location () const
void  | SetAlignment (ControlHorizontalAlignment h, ControlVerticalAlignment v)
void  | SetImageSVG (const wchar_t *svg)
void  | SetLocation (float x, float y)
void  | SetLocation (ON_2fPoint location)
void  | SetLocation (ON_2fPoint location, ControlHorizontalAlignment hAlign, ControlVerticalAlignment vAlign)
void  | SetSize (const ON_2fSize &size)
void  | SetSize (float width, float height)
void  | SetText (const wchar_t *text)
void  | SetTextAlignment (ControlHorizontalAlignment h, ControlVerticalAlignment v)
void  | SetTextColor (const ON_Color &color)
void  | SetTextHeight (float height)
void  | SetTrackingPoint (const ON_3dPoint &pt)
ON_2fSize  | Size () const
const ON_wString &  | Text () const
ON_Color  | TextColor () const
float  | TextHeight () const
ON_3dPoint  | TrackingPoint () const
 Public Member Functions inherited from CRhinoUserInterfaceObject
CRhinoUserInterfaceObject ()
virtual  | ~CRhinoUserInterfaceObject ()
virtual bool  | AcceptsKeyboardFocus () const
void  | Animate (CRhinoAnimatingDouble &value, double target, double duration, AnimationStyle style, CRhinoDoc *doc)
void  | BindToActiveViewport (bool on)
void  | BindToViewport (unsigned int viewport_sn)
virtual double  | CameraDepth (const ON_Plane &cameraPlane) const
int  | DisplayOrder () const
ON_UUID  | DocumentGroupId () const
unsigned int  | DocumentRuntimeSerialNumber () const
bool  | GetData (const wchar_t *key, bool &value) const
bool  | GetData (const wchar_t *key, double &value) const
bool  | GetData (const wchar_t *key, int &value) const
bool  | GetData (const wchar_t *key, ON_UUID &value) const
bool  | GetData (const wchar_t *key, ON_wString &value) const
bool  | HasKeyboardFocus () const
bool  | HasMouseCapture () const
bool  | IsBoundToActiveViewport () const
unsigned int  | IsBoundToViewport () const
virtual bool  | IsMouseOver (const CRhinoMouseEventArgs &mouse)
bool  | MoveKeyboardFocusToSibling (bool forward, CRhinoDoc *doc)
virtual bool  | OnCharacter (unsigned int character, unsigned int flags)
virtual void  | OnKeyboardFocusChanged (bool hasFocus)
virtual bool  | OnKeyDown (unsigned int virtualKey, unsigned int flags)
virtual void  | OnMouseClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDoubleClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDown (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseEnter (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseLeave (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseMove (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseUp (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseWheel (const CRhinoMouseEventArgs &mouse, int delta)
virtual CRhinoCommand::result  | OnRunCommand (const CRhinoCommandContext &context, const CRhinoMouseEventArgs &mouse)
virtual void  | OnTrackpadScroll (const CRhinoMouseEventArgs &mouse, float horizontal, float vertical)
CRhinoUserInterfaceObject *  | Parent ()
const CRhinoUserInterfaceObject *  | Parent () const
bool  | ReceivesMouseWheelEvents () const
bool  | ReceivesTrackpadScrollEvents () const
bool  | RegisterForAllDocuments ()
void  | RunCommand (const CRhinoMouseEventArgs &mouse)
unsigned int  | RuntimeSerialNumber () const
void  | SetCursor (HCURSOR cursor)
void  | SetData (const wchar_t *key, bool value)
void  | SetData (const wchar_t *key, const wchar_t *value)
void  | SetData (const wchar_t *key, double value)
void  | SetData (const wchar_t *key, int value)
void  | SetData (const wchar_t *key, ON_UUID value)
void  | SetDisplayOrder (int order)
void  | SetReceivesMouseWheelEvents (bool enable)
void  | SetReceivesTrackpadScrollEvents (bool enable)
void  | SetTooltip (const wchar_t *tooltip)
void  | SetVisible (bool visible)
bool  | UnregisterFromAllDocuments ()
bool  | Visible () const
 Additional Inherited Members
 Public Types inherited from CRhinoUserInterfaceObject
enum  | FocusReason : int { FocusReason::Unknown = 0, FocusReason::Pointer = 1, FocusReason::Navigation = 2 }
 Static Public Member Functions inherited from CRhinoUserInterfaceObject
static void  | ClearKeyboardFocus (CRhinoDoc *doc)
static FocusReason  | KeyboardFocusReason ()
 Protected Member Functions inherited from CRhinoUserInterfaceObject
virtual void  | ContinueAnimate (CRhinoDoc *doc)
void  | ReleaseKeyboardFocus (CRhinoDoc *doc)
void  | SetKeyboardFocus (CRhinoDoc *doc, FocusReason reason=FocusReason::Unknown)
void  | SetMouseCapture (CRhinoDoc *doc)
 Protected Attributes inherited from CRhinoUserInterfaceControl
class CRhUserInterfaceControlPrivate *  | m_ui_control_private = nullptr
 Protected Attributes inherited from CRhinoUserInterfaceObject
class CRhUserInterfaceObjectPrivate *  | m_private = nullptr
Detailed Description
Description: A control that draws a single line of text. Labels do not respond to the mouse; they are the descriptive text that goes in the first column of a CRhinoUserInterfaceGrid, but they can be used anywhere a control can.
Constructor & Destructor Documentation
◆ CRhinoUserInterfaceLabel() [1/2]
 CRhinoUserInterfaceLabel::CRhinoUserInterfaceLabel  |  ( |   | )
◆ CRhinoUserInterfaceLabel() [2/2]
 CRhinoUserInterfaceLabel::CRhinoUserInterfaceLabel  |  ( |  const wchar_t *  |  text | )
◆ ~CRhinoUserInterfaceLabel()
 virtual CRhinoUserInterfaceLabel::~CRhinoUserInterfaceLabel  |  ( |   | )
virtual
Member Function Documentation
◆ ComputedRect()
 ON_4fRect CRhinoUserInterfaceLabel::ComputedRect  |  ( |  const CRhinoDisplayPipeline *  |  pipeline,
|  bool  |  logicalPixels
) |   |  const
overridevirtual
Description: Compute the location and size of this control in the coordinates of the thing that is drawing it. Parameters: pipeline - the display pipeline to compute location and size inside of. The same control can end up in different places in different pipelines, because of how it is aligned or because it is tracking a 3d point. Take the pipeline rather than the view it belongs to: a detail on a layout is drawn by its own nested pipeline whose view is the page view, so a view cannot say which of the two is being drawn. logicalPixels - should the rectangle be return in device or logical pixels
Reimplemented from CRhinoUserInterfaceControl.
◆ ComputeSize()
 ON_2fSize CRhinoUserInterfaceLabel::ComputeSize  |  ( |   | ) |   const
overridevirtual
Description: Compute the size of this control in logical pixels.
Reimplemented from CRhinoUserInterfaceControl.
◆ Draw()
 void CRhinoUserInterfaceLabel::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | )
overridevirtual
Description: All user interface objects must implement a Draw function. This is where drawing using the input display pipeline is performed. The base class Draw function does nothing.
Reimplemented from CRhinoUserInterfaceObject.