Public Member Functions | Public Attributes | List of all members
CRhinoApp::CRhMruCommandRecord Class Reference
#include <rhinoSdkApp.h>
 Public Member Functions
CRhMruCommandRecord (const wchar_t *, const wchar_t *, const wchar_t *, const UINT)
CRhMruCommandRecord (const wchar_t *=nullptr, const wchar_t *=nullptr)
const wchar_t *  | DisplayString () const
void  | EmptyRecord ()
void  | GetDisplayStringWithoutShortcut (ON_wString &) const
UINT  | GetModifierFlags () const
void  | GetShortcut (ON_wString &) const
 Public Attributes
ON_wString  | m_display_string
ON_wString  | m_macro
Detailed Description
Description: MRU command list contains list of recently run macros/commands Returns: Reference to MRU command list.
Constructor & Destructor Documentation
◆ CRhMruCommandRecord() [1/2]
 CRhinoApp::CRhMruCommandRecord::CRhMruCommandRecord  |  ( |  const wchar_t *  |   = nullptr,
|  const wchar_t *  |   = nullptr
)
◆ CRhMruCommandRecord() [2/2]
 CRhinoApp::CRhMruCommandRecord::CRhMruCommandRecord  |  ( |  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  const  |  UINT
)
Member Function Documentation
◆ DisplayString()
 const wchar_t* CRhinoApp::CRhMruCommandRecord::DisplayString  |  ( |   | ) |   const
◆ EmptyRecord()
 void CRhinoApp::CRhMruCommandRecord::EmptyRecord  |  ( |   | )
◆ GetDisplayStringWithoutShortcut()
 void CRhinoApp::CRhMruCommandRecord::GetDisplayStringWithoutShortcut  |  ( |  ON_wString &  |   | ) |   const
◆ GetModifierFlags()
 UINT CRhinoApp::CRhMruCommandRecord::GetModifierFlags  |  ( |   | ) |   const
◆ GetShortcut()
 void CRhinoApp::CRhMruCommandRecord::GetShortcut  |  ( |  ON_wString &  |   | ) |   const
Member Data Documentation
◆ m_display_string
 ON_wString CRhinoApp::CRhMruCommandRecord::m_display_string
◆ m_macro
 ON_wString CRhinoApp::CRhMruCommandRecord::m_macro