Public Member Functions | Public Attributes | Friends | List of all members
CRhinoCacheHandle Class Reference
Rhino
#include <rhinoSdkObject.h>
 Public Member Functions
CRhinoCacheHandle ()=default
const CRhinoObject *  | ParentObject () const
void  | Reset ()
 Public Attributes
std::shared_ptr< class CRhCacheData >  | m_cache_data
std::shared_ptr< class CRhVboCurveSetData >  | m_vbo_curve_data
std::shared_ptr< class CRhVboData >  | m_vbo_data
 Friends
class  | CRhinoObject
Constructor & Destructor Documentation
◆ CRhinoCacheHandle()
 CRhinoCacheHandle::CRhinoCacheHandle  |  ( |   | )
default
Member Function Documentation
◆ ParentObject()
 const CRhinoObject* CRhinoCacheHandle::ParentObject  |  ( |   | ) |   const
◆ Reset()
 void CRhinoCacheHandle::Reset  |  ( |   | )
Friends And Related Function Documentation
◆ CRhinoObject
 friend class CRhinoObject
friend
Member Data Documentation
◆ m_cache_data
 std::shared_ptr<class CRhCacheData> CRhinoCacheHandle::m_cache_data
◆ m_vbo_curve_data
 std::shared_ptr<class CRhVboCurveSetData> CRhinoCacheHandle::m_vbo_curve_data
◆ m_vbo_data
 std::shared_ptr<class CRhVboData> CRhinoCacheHandle::m_vbo_data