Public Member Functions | Friends | List of all members
CRhinoParameterDictionary Class Reference
Rhino
#include <rhinoSdkInterop.h>
 Public Member Functions
CRhinoParameterDictionary ()
virtual  | ~CRhinoParameterDictionary ()
bool  | GetArc (const wchar_t *name, ON_Arc &arc) const
bool  | GetBool (const wchar_t *name, bool &value) const
bool  | GetColor (const wchar_t *name, ON_Color &point) const
bool  | GetDouble (const wchar_t *name, double &value) const
bool  | GetInt (const wchar_t *name, int &value) const
bool  | GetLine (const wchar_t *name, ON_Line &line) const
bool  | GetMeshParameters (const wchar_t *name, ON_MeshParameters &value) const
bool  | GetPlane (const wchar_t *name, ON_Plane &plane) const
bool  | GetPoint (const wchar_t *name, ON_2iPoint &point) const
bool  | GetPoint (const wchar_t *name, ON_3dPoint &point) const
bool  | GetPoints (const wchar_t *name, ON_SimpleArray< ON_3dPoint > &pts) const
bool  | GetString (const wchar_t *name, ON_wString &value) const
bool  | GetUnsignedInt (const wchar_t *name, unsigned int &value) const
bool  | GetUnsignedIntList (const wchar_t *name, ON_SimpleArray< unsigned int > &list)
bool  | GetUuid (const wchar_t *name, ON_UUID &value) const
bool  | GetUuidList (const wchar_t *name, ON_SimpleArray< ON_UUID > &value) const
bool  | GetVector (const wchar_t *name, ON_3dVector &vector) const
bool  | GetViewport (const wchar_t *name, ON_Viewport &viewport) const
void  | SetArc (const wchar_t *name, const ON_Arc &arc)
void  | SetBool (const wchar_t *name, bool value)
void  | SetColor (const wchar_t *name, const ON_Color &point)
void  | SetDouble (const wchar_t *name, double value)
void  | SetInt (const wchar_t *name, int value)
void  | SetLine (const wchar_t *name, const ON_Line &line)
void  | SetMeshParameters (const wchar_t *name, const ON_MeshParameters &value)
void  | SetPlane (const wchar_t *name, const ON_Plane &plane)
void  | SetPoint (const wchar_t *name, const ON_2iPoint &point)
void  | SetPoint (const wchar_t *name, const ON_3dPoint &point)
void  | SetPoints (const wchar_t *name, const ON_SimpleArray< ON_3dPoint > &pts)
void  | SetString (const wchar_t *name, const wchar_t *value)
void  | SetUnsignedInt (const wchar_t *name, unsigned int value)
void  | SetUnsignedIntList (const wchar_t *name, const ON_SimpleArray< unsigned int > &list)
void  | SetUuid (const wchar_t *name, const ON_UUID &value)
void  | SetUuidList (const wchar_t *name, const ON_SimpleArray< ON_UUID > &value)
void  | SetVector (const wchar_t *name, const ON_3dVector &vector)
void  | SetViewport (const wchar_t *name, const ON_Viewport &viewport)
 Friends
class  | CRhParameterDictionary
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Dictionary used for named callbacks to pass data back and forth between C++ and .NET
Constructor & Destructor Documentation
◆ CRhinoParameterDictionary()
 CRhinoParameterDictionary::CRhinoParameterDictionary  |  ( |   | )
◆ ~CRhinoParameterDictionary()
 virtual CRhinoParameterDictionary::~CRhinoParameterDictionary  |  ( |   | )
virtual
Member Function Documentation
◆ GetArc()
 bool CRhinoParameterDictionary::GetArc  |  ( |  const wchar_t *  |  name,
|  ON_Arc &  |  arc
) |   |  const
◆ GetBool()
 bool CRhinoParameterDictionary::GetBool  |  ( |  const wchar_t *  |  name,
|  bool &  |  value
) |   |  const
◆ GetColor()
 bool CRhinoParameterDictionary::GetColor  |  ( |  const wchar_t *  |  name,
|  ON_Color &  |  point
) |   |  const
◆ GetDouble()
 bool CRhinoParameterDictionary::GetDouble  |  ( |  const wchar_t *  |  name,
|  double &  |  value
) |   |  const
◆ GetInt()
 bool CRhinoParameterDictionary::GetInt  |  ( |  const wchar_t *  |  name,
|  int &  |  value
) |   |  const
◆ GetLine()
 bool CRhinoParameterDictionary::GetLine  |  ( |  const wchar_t *  |  name,
|  ON_Line &  |  line
) |   |  const
◆ GetMeshParameters()
 bool CRhinoParameterDictionary::GetMeshParameters  |  ( |  const wchar_t *  |  name,
|  ON_MeshParameters &  |  value
) |   |  const
◆ GetPlane()
 bool CRhinoParameterDictionary::GetPlane  |  ( |  const wchar_t *  |  name,
|  ON_Plane &  |  plane
) |   |  const
◆ GetPoint() [1/2]
 bool CRhinoParameterDictionary::GetPoint  |  ( |  const wchar_t *  |  name,
|  ON_2iPoint &  |  point
) |   |  const
◆ GetPoint() [2/2]
 bool CRhinoParameterDictionary::GetPoint  |  ( |  const wchar_t *  |  name,
|  ON_3dPoint &  |  point
) |   |  const
◆ GetPoints()
 bool CRhinoParameterDictionary::GetPoints  |  ( |  const wchar_t *  |  name,
|  ON_SimpleArray< ON_3dPoint > &  |  pts
) |   |  const
◆ GetString()
 bool CRhinoParameterDictionary::GetString  |  ( |  const wchar_t *  |  name,
|  ON_wString &  |  value
) |   |  const
◆ GetUnsignedInt()
 bool CRhinoParameterDictionary::GetUnsignedInt  |  ( |  const wchar_t *  |  name,
|  unsigned int &  |  value
) |   |  const
◆ GetUnsignedIntList()
 bool CRhinoParameterDictionary::GetUnsignedIntList  |  ( |  const wchar_t *  |  name,
|  ON_SimpleArray< unsigned int > &  |  list
)
◆ GetUuid()
 bool CRhinoParameterDictionary::GetUuid  |  ( |  const wchar_t *  |  name,
|  ON_UUID &  |  value
) |   |  const
◆ GetUuidList()
 bool CRhinoParameterDictionary::GetUuidList  |  ( |  const wchar_t *  |  name,
|  ON_SimpleArray< ON_UUID > &  |  value
) |   |  const
◆ GetVector()
 bool CRhinoParameterDictionary::GetVector  |  ( |  const wchar_t *  |  name,
|  ON_3dVector &  |  vector
) |   |  const
◆ GetViewport()
 bool CRhinoParameterDictionary::GetViewport  |  ( |  const wchar_t *  |  name,
|  ON_Viewport &  |  viewport
) |   |  const
◆ SetArc()
 void CRhinoParameterDictionary::SetArc  |  ( |  const wchar_t *  |  name,
|  const ON_Arc &  |  arc
)
◆ SetBool()
 void CRhinoParameterDictionary::SetBool  |  ( |  const wchar_t *  |  name,
|  bool  |  value
)
◆ SetColor()
 void CRhinoParameterDictionary::SetColor  |  ( |  const wchar_t *  |  name,
|  const ON_Color &  |  point
)
◆ SetDouble()
 void CRhinoParameterDictionary::SetDouble  |  ( |  const wchar_t *  |  name,
|  double  |  value
)
◆ SetInt()
 void CRhinoParameterDictionary::SetInt  |  ( |  const wchar_t *  |  name,
|  int  |  value
)
◆ SetLine()
 void CRhinoParameterDictionary::SetLine  |  ( |  const wchar_t *  |  name,
|  const ON_Line &  |  line
)
◆ SetMeshParameters()
 void CRhinoParameterDictionary::SetMeshParameters  |  ( |  const wchar_t *  |  name,
|  const ON_MeshParameters &  |  value
)
◆ SetPlane()
 void CRhinoParameterDictionary::SetPlane  |  ( |  const wchar_t *  |  name,
|  const ON_Plane &  |  plane
)
◆ SetPoint() [1/2]
 void CRhinoParameterDictionary::SetPoint  |  ( |  const wchar_t *  |  name,
|  const ON_2iPoint &  |  point
)
◆ SetPoint() [2/2]
 void CRhinoParameterDictionary::SetPoint  |  ( |  const wchar_t *  |  name,
|  const ON_3dPoint &  |  point
)
◆ SetPoints()
 void CRhinoParameterDictionary::SetPoints  |  ( |  const wchar_t *  |  name,
|  const ON_SimpleArray< ON_3dPoint > &  |  pts
)
◆ SetString()
 void CRhinoParameterDictionary::SetString  |  ( |  const wchar_t *  |  name,
|  const wchar_t *  |  value
)
◆ SetUnsignedInt()
 void CRhinoParameterDictionary::SetUnsignedInt  |  ( |  const wchar_t *  |  name,
|  unsigned int  |  value
)
◆ SetUnsignedIntList()
 void CRhinoParameterDictionary::SetUnsignedIntList  |  ( |  const wchar_t *  |  name,
|  const ON_SimpleArray< unsigned int > &  |  list
)
◆ SetUuid()
 void CRhinoParameterDictionary::SetUuid  |  ( |  const wchar_t *  |  name,
|  const ON_UUID &  |  value
)
◆ SetUuidList()
 void CRhinoParameterDictionary::SetUuidList  |  ( |  const wchar_t *  |  name,
|  const ON_SimpleArray< ON_UUID > &  |  value
)
◆ SetVector()
 void CRhinoParameterDictionary::SetVector  |  ( |  const wchar_t *  |  name,
|  const ON_3dVector &  |  vector
)
◆ SetViewport()
 void CRhinoParameterDictionary::SetViewport  |  ( |  const wchar_t *  |  name,
|  const ON_Viewport &  |  viewport
)
Friends And Related Function Documentation
◆ CRhParameterDictionary
 friend class CRhParameterDictionary
friend