Public Member Functions | Friends | List of all members
ON_SubDEdgeIdIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDEdgeIdIterator:
 Public Member Functions
ON_SubDEdgeIdIterator ()=default
ON_SubDEdgeIdIterator (const ON_SubD &subd)
ON_SubDEdgeIdIterator (const ON_SubDEdgeIdIterator &)=default
ON_SubDEdgeIdIterator (const ON_SubDRef &subd_ref)
~ON_SubDEdgeIdIterator ()=default
const ON_SubDEdge *  | CurrentEdge () const
const ON_SubDEdge *  | FirstEdge ()
const ON_SubDEdge *  | FirstEdgeOnLevel (unsigned int level_index)
const ON_SubDEdge *  | NextEdge ()
const ON_SubDEdge *  | NextEdgeOnLevel (unsigned int level_index)
ON_SubDEdgeIdIterator &  | operator= (const ON_SubDEdgeIdIterator &)=default
 Friends
class  | ON_SubDHeap
Detailed Description
ON_SubDEdgeIdIterator
Constructor & Destructor Documentation
◆ ON_SubDEdgeIdIterator() [1/4]
 ON_SubDEdgeIdIterator::ON_SubDEdgeIdIterator  |  ( |   | )
default
◆ ~ON_SubDEdgeIdIterator()
 ON_SubDEdgeIdIterator::~ON_SubDEdgeIdIterator  |  ( |   | )
default
◆ ON_SubDEdgeIdIterator() [2/4]
 ON_SubDEdgeIdIterator::ON_SubDEdgeIdIterator  |  ( |  const ON_SubDEdgeIdIterator &  |   | )
default
◆ ON_SubDEdgeIdIterator() [3/4]
 ON_SubDEdgeIdIterator::ON_SubDEdgeIdIterator  |  ( |  const ON_SubDRef &  |  subd_ref | )
◆ ON_SubDEdgeIdIterator() [4/4]
 ON_SubDEdgeIdIterator::ON_SubDEdgeIdIterator  |  ( |  const ON_SubD &  |  subd | )
Member Function Documentation
◆ CurrentEdge()
 const ON_SubDEdge* ON_SubDEdgeIdIterator::CurrentEdge  |  ( |   | ) |   const
Returns: The most recently returned edge from a call to FirstEdge() or NextEdge().
◆ FirstEdge()
 const ON_SubDEdge* ON_SubDEdgeIdIterator::FirstEdge  |  ( |   | )
Description: In general, you want to use a ON_SubDEdgeIterator to loop through SubD edges. This is a special tool for unusual sitiations when it is necessary to iteratate through every edge on every level of a SubD in order of increasing m_id value. Returns: The edge with the smallest id.
◆ FirstEdgeOnLevel()
 const ON_SubDEdge* ON_SubDEdgeIdIterator::FirstEdgeOnLevel  |  ( |  unsigned int  |  level_index | )
◆ NextEdge()
 const ON_SubDEdge* ON_SubDEdgeIdIterator::NextEdge  |  ( |   | )
Description: In general, you want to use a ON_SubDEdgeIterator to loop through SubD edges. This is a special tool for unusual sitiations when it is necessary to iteratate through every edge on every level of a SubD in order of increasing m_id value. Returns: The edge in order of increasing id.
◆ NextEdgeOnLevel()
 const ON_SubDEdge* ON_SubDEdgeIdIterator::NextEdgeOnLevel  |  ( |  unsigned int  |  level_index | )
◆ operator=()
 ON_SubDEdgeIdIterator& ON_SubDEdgeIdIterator::operator=  |  ( |  const ON_SubDEdgeIdIterator &  |   | )
default
Friends And Related Function Documentation
◆ ON_SubDHeap
 friend class ON_SubDHeap
friend