Classes | Public Member Functions | List of all members
CRhRdkTextureCache Class Reference
RDK
#include <RhRdkTextureCache.h>
 Inheritance diagram for CRhRdkTextureCache:
 Classes
class  | Location
 Public Member Functions
ON_DEPRECATED  | CRhRdkTextureCache (const ON_2iSize &size, DWORD dwCRC)
CRhRdkTextureCache (const ON_2iSize &size, DWORD dwCRC, const wchar_t *wszTag)
virtual  | ~CRhRdkTextureCache ()
virtual ON_DEPRECATED void  | AddTexture (const CRhinoDib &dib)
virtual_su ON_wString  | AddTexture (const CRhinoDib &dib, Location locationsToAddTo)
virtual_su ON_wString  | Filename (Location locationFileIsExpected) const
virtual ON_DEPRECATED ON_wString  | Filename (void) const
virtual_su bool  | HasCachedTexture (Location locationsToCheck) const
virtual ON_DEPRECATED bool  | HasCachedTexture (void) const
void  | Lock () const
void  | Unlock () const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This object gives access to RDK's texture cache. Textures are cached on disk using file names that are derived from a combination of the texture size and a CRC of the parameters that were used to render the texture.
Constructor & Destructor Documentation
◆ CRhRdkTextureCache() [1/2]
 ON_DEPRECATED CRhRdkTextureCache::CRhRdkTextureCache  |  ( |  const ON_2iSize &  |  size,
|  DWORD  |  dwCRC
)
Instantiate this object on the stack.
Parameters
size | is the size of the texture in pixels.
dwCRC | is a CRC of all parameters that were used to create the texture imagery.
◆ CRhRdkTextureCache() [2/2]
 CRhRdkTextureCache::CRhRdkTextureCache  |  ( |  const ON_2iSize &  |  size,
|  DWORD  |  dwCRC,
|  const wchar_t *  |  wszTag
)
◆ ~CRhRdkTextureCache()
 virtual CRhRdkTextureCache::~CRhRdkTextureCache  |  ( |   | )
virtual
Member Function Documentation
◆ AddTexture() [1/2]
 virtual ON_DEPRECATED void CRhRdkTextureCache::AddTexture  |  ( |  const CRhinoDib &  |  dib | )
virtual
Add a texture to the cache for this texture size and CRC. If the texture file already exists it will be overwritten.
◆ AddTexture() [2/2]
 virtual_su ON_wString CRhRdkTextureCache::AddTexture  |  ( |  const CRhinoDib &  |  dib,
|  Location  |  locationsToAddTo
)
◆ Filename() [1/2]
 virtual_su ON_wString CRhRdkTextureCache::Filename  |  ( |  Location  |  locationFileIsExpected | ) |   const
◆ Filename() [2/2]
 virtual ON_DEPRECATED ON_wString CRhRdkTextureCache::Filename  |  ( |  void  |   | ) |   const
virtual
Get the full path to the texture file on disk.
◆ HasCachedTexture() [1/2]
 virtual_su bool CRhRdkTextureCache::HasCachedTexture  |  ( |  Location  |  locationsToCheck | ) |   const
◆ HasCachedTexture() [2/2]
 virtual ON_DEPRECATED bool CRhRdkTextureCache::HasCachedTexture  |  ( |  void  |   | ) |   const
virtual
Returns
true if there is a cached texture on disk for this texture size and CRC.
◆ Lock()
 void CRhRdkTextureCache::Lock  |  ( |   | ) |   const
◆ Unlock()
 void CRhRdkTextureCache::Unlock  |  ( |   | ) |   const