Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCreatorNew Class Reference
RDK
#include <RhRdkContentCreator.h>
 Inheritance diagram for CRhRdkContentCreatorNew:
 Public Member Functions
CRhRdkContentCreatorNew (const CRhRdkDocument &rdkDoc, const ON_SimpleArray< UUID > &aUuidNewType, bool bHarvest)
CRhRdkContentCreatorNew (const CRhRdkDocument &rdkDoc, const UUID &uuidNewType, bool bHarvest)
virtual  | ~CRhRdkContentCreatorNew ()
 Public Member Functions inherited from CRhRdkContentCreator
CRhRdkContentCreator (const CRhRdkDocument &rdkDoc)
virtual  | ~CRhRdkContentCreator ()
const CRhRdkContent *  | AddContent (const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
bool  | AddContent (OUT CRhRdkContentArray &aContent, const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
virtual_su bool  | AutoEditChild (void) const
const CRhRdkContent *  | ChangeContentType (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
const CRhRdkContent *  | ChangeContentTypeEx (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild, unsigned int ic_flags) const
const wchar_t *  | ErrorString (void) const
const CRhRdkContent *  | FindChildAddOrChange (const CRhRdkContent &parentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
void  | AppendCreator (const class CCreator &c)
void  | AppendType (const UUID uuidType)
virtual bool  | CreateNewContent (CRhRdkContentArrayNC &aContentOut, const CRhRdkContent *pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName) const override
bool  | Harvest (void) const
virtual bool  | IsCopy (void) const override
virtual const CRhRdkContentArray *  | OriginalContent (void) const override
virtual bool  | SetUpDefaults (CRhRdkContent *pContent, const CRhRdkContent *pOldContent) const
 Protected Member Functions inherited from CRhRdkContentCreator
virtual void *  | EVF (const wchar_t *, void *) override
const CRhRdkDocument *  | RdkDocument (void) const
void  | SetErrorString (const wchar_t *wsz) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkContentCreatorNew() [1/2]
 CRhRdkContentCreatorNew::CRhRdkContentCreatorNew  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  const ON_SimpleArray< UUID > &  |  aUuidNewType,
|  bool  |  bHarvest
)
◆ CRhRdkContentCreatorNew() [2/2]
 CRhRdkContentCreatorNew::CRhRdkContentCreatorNew  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  const UUID &  |  uuidNewType,
|  bool  |  bHarvest
)
◆ ~CRhRdkContentCreatorNew()
 virtual CRhRdkContentCreatorNew::~CRhRdkContentCreatorNew  |  ( |   | )
virtual
Member Function Documentation
◆ AppendCreator()
 void CRhRdkContentCreatorNew::AppendCreator  |  ( |  const class CCreator &  |  c | )
protected
◆ AppendType()
 void CRhRdkContentCreatorNew::AppendType  |  ( |  const UUID  |  uuidType | )
protected
◆ CreateNewContent()
 virtual bool CRhRdkContentCreatorNew::CreateNewContent  |  ( |  CRhRdkContentArrayNC &  |  aContentOut,
|  const CRhRdkContent *  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName
) |   |  const
overrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ Harvest()
 bool CRhRdkContentCreatorNew::Harvest  |  ( |  void  |   | ) |   const
protected
◆ IsCopy()
 virtual bool CRhRdkContentCreatorNew::IsCopy  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ OriginalContent()
 virtual const CRhRdkContentArray* CRhRdkContentCreatorNew::OriginalContent  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ SetUpDefaults()
 virtual bool CRhRdkContentCreatorNew::SetUpDefaults  |  ( |  CRhRdkContent *  |  pContent,
|  const CRhRdkContent *  |  pOldContent
) |   |  const
protectedvirtual
Reimplemented in CRhRdkContentCreatorNewFileTexture.