Public Member Functions | Public Attributes | List of all members
ON_CurveProxyHistory Class Reference
OpenNURBS
#include <opennurbs_object_history.h>
 Public Member Functions
ON_CurveProxyHistory ()
ON_CurveProxyHistory (const ON_CurveProxyHistory &)=default
~ON_CurveProxyHistory ()
void  | Destroy ()
void  | Dump (ON_TextLog &) const
ON_CurveProxyHistory &  | operator= (const ON_CurveProxyHistory &)=default
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bReversed
from ON_CurveProxy.m_bReversed More...
ON_ObjRef  | m_curve_ref
from ON_CurveProxy.m_real_curve More...
ON_Interval  | m_full_real_curve_domain
from ON_CurveProxy.m_real_curve.Domain() More...
ON_Interval  | m_proxy_curve_domain
from ON_CurveProxy.m_this_domain More...
ON_Interval  | m_segment_edge_domain
If these are empty intervals, they are from old files. Ignore them. More...
ON_Interval  | m_segment_trim_domain
ON_Interval  | m_sub_real_curve_domain
from ON_CurveProxy.m_real_curve_domain More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_CurveProxyHistory() [1/2]
 ON_CurveProxyHistory::ON_CurveProxyHistory  |  ( |   | )
Used to save information needed to create an ON_CurveProxy reference in history records.
◆ ~ON_CurveProxyHistory()
 ON_CurveProxyHistory::~ON_CurveProxyHistory  |  ( |   | )
◆ ON_CurveProxyHistory() [2/2]
 ON_CurveProxyHistory::ON_CurveProxyHistory  |  ( |  const ON_CurveProxyHistory &  |   | )
default
Member Function Documentation
◆ Destroy()
 void ON_CurveProxyHistory::Destroy  |  ( |   | )
◆ Dump()
 void ON_CurveProxyHistory::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ operator=()
 ON_CurveProxyHistory& ON_CurveProxyHistory::operator=  |  ( |  const ON_CurveProxyHistory &  |   | )
default
◆ Read()
 bool ON_CurveProxyHistory::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_CurveProxyHistory::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bReversed
 bool ON_CurveProxyHistory::m_bReversed
from ON_CurveProxy.m_bReversed
◆ m_curve_ref
 ON_ObjRef ON_CurveProxyHistory::m_curve_ref
from ON_CurveProxy.m_real_curve
◆ m_full_real_curve_domain
 ON_Interval ON_CurveProxyHistory::m_full_real_curve_domain
from ON_CurveProxy.m_real_curve.Domain()
◆ m_proxy_curve_domain
 ON_Interval ON_CurveProxyHistory::m_proxy_curve_domain
from ON_CurveProxy.m_this_domain
◆ m_segment_edge_domain
 ON_Interval ON_CurveProxyHistory::m_segment_edge_domain
If these are empty intervals, they are from old files. Ignore them.
◆ m_segment_trim_domain
 ON_Interval ON_CurveProxyHistory::m_segment_trim_domain
◆ m_sub_real_curve_domain
 ON_Interval ON_CurveProxyHistory::m_sub_real_curve_domain
from ON_CurveProxy.m_real_curve_domain