Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppCursorToolTipSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppCursorToolTipSettings ()
void  | Defaults ()
bool  | EnableGumballToolTips () const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppCursorToolTipSettings &) const
bool  | operator== (const CRhinoAppCursorToolTipSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetEnableGumballToolTips (bool bEnable)
 Public Attributes
ON_Color  | m_background_color
bool  | m_bAutoSuppress
bool  | m_bCommandPromptPane
bool  | m_bDistancePane
bool  | m_bEnableCursorToolTips
Cursor ToolTip settings. More...
bool  | m_bOsnapPane
bool  | m_bPointPane
bool  | m_bRelativePointPane
ON_Color  | m_text_color
int  | m_xoffset
int  | m_yoffset
 Static Public Attributes
static const CRhinoAppCursorToolTipSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppCursorToolTipSettings()
 CRhinoAppCursorToolTipSettings::CRhinoAppCursorToolTipSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppCursorToolTipSettings::Defaults  |  ( |   | )
◆ EnableGumballToolTips()
 bool CRhinoAppCursorToolTipSettings::EnableGumballToolTips  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoAppCursorToolTipSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppCursorToolTipSettings::operator!=  |  ( |  const CRhinoAppCursorToolTipSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppCursorToolTipSettings::operator==  |  ( |  const CRhinoAppCursorToolTipSettings &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppCursorToolTipSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetEnableGumballToolTips()
 void CRhinoAppCursorToolTipSettings::SetEnableGumballToolTips  |  ( |  bool  |  bEnable | )
Member Data Documentation
◆ Default
 const CRhinoAppCursorToolTipSettings CRhinoAppCursorToolTipSettings::Default
static
◆ m_background_color
 ON_Color CRhinoAppCursorToolTipSettings::m_background_color
◆ m_bAutoSuppress
 bool CRhinoAppCursorToolTipSettings::m_bAutoSuppress
◆ m_bCommandPromptPane
 bool CRhinoAppCursorToolTipSettings::m_bCommandPromptPane
◆ m_bDistancePane
 bool CRhinoAppCursorToolTipSettings::m_bDistancePane
◆ m_bEnableCursorToolTips
 bool CRhinoAppCursorToolTipSettings::m_bEnableCursorToolTips
Cursor ToolTip settings.
◆ m_bOsnapPane
 bool CRhinoAppCursorToolTipSettings::m_bOsnapPane
◆ m_bPointPane
 bool CRhinoAppCursorToolTipSettings::m_bPointPane
◆ m_bRelativePointPane
 bool CRhinoAppCursorToolTipSettings::m_bRelativePointPane
◆ m_text_color
 ON_Color CRhinoAppCursorToolTipSettings::m_text_color
◆ m_xoffset
 int CRhinoAppCursorToolTipSettings::m_xoffset
◆ m_yoffset
 int CRhinoAppCursorToolTipSettings::m_yoffset