Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDVertexEdgeProperties Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDVertexEdgeProperties ()=default
ON_SubDVertexEdgeProperties (const ON_SubDVertexEdgeProperties &)=default
~ON_SubDVertexEdgeProperties ()=default
bool  | HasBoundaryVertexTopology () const
bool  | HasInteriorVertexTopology () const
bool  | HasManifoldVertexTopology () const
bool  | HasNonmanifoldVertexTopology () const
ON_SubDVertexEdgeProperties &  | operator= (const ON_SubDVertexEdgeProperties &)=default
 Public Attributes
unsigned short  | m_boundary_edge_count = 0
Number of boundary edges (1 attached face) More...
unsigned short  | m_crease_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Crease. More...
unsigned short  | m_edge_count = 0
vertex->m_edge_count More...
unsigned short  | m_face_count = 0
vertex->m_face_count More...
unsigned short  | m_interior_edge_count = 0
Number of interior edges (2 attached faces) More...
unsigned short  | m_max_edge_face_count = 0
Maximum value of attached edges's m_face_count. More...
unsigned short  | m_min_edge_face_count = 0
Minimum value of attached edges's m_face_count. More...
unsigned short  | m_nonmanifold_edge_count = 0
Number of nonmanifold edges (3 or more attached faces) More...
unsigned short  | m_null_edge_count = 0
Number of null edges. More...
unsigned short  | m_smooth_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX. More...
unsigned short  | m_unset_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Unset. More...
unsigned short  | m_wire_edge_count = 0
Number of wire edges (0 attached faces) More...
 Static Public Attributes
static const ON_SubDVertexEdgeProperties  | Zero
all member values are zero. More...
Detailed Description
ON_SubDVertexEdgeProperties
Constructor & Destructor Documentation
◆ ON_SubDVertexEdgeProperties() [1/2]
 ON_SubDVertexEdgeProperties::ON_SubDVertexEdgeProperties  |  ( |   | )
default
◆ ~ON_SubDVertexEdgeProperties()
 ON_SubDVertexEdgeProperties::~ON_SubDVertexEdgeProperties  |  ( |   | )
default
◆ ON_SubDVertexEdgeProperties() [2/2]
 ON_SubDVertexEdgeProperties::ON_SubDVertexEdgeProperties  |  ( |  const ON_SubDVertexEdgeProperties &  |   | )
default
Member Function Documentation
◆ HasBoundaryVertexTopology()
 bool ON_SubDVertexEdgeProperties::HasBoundaryVertexTopology  |  ( |   | ) |   const
Returns: True if there are no null edges, exactly two boundary edges, and any other edges have two faces. Remarks: Tags are ignored.
◆ HasInteriorVertexTopology()
 bool ON_SubDVertexEdgeProperties::HasInteriorVertexTopology  |  ( |   | ) |   const
Returns: True if there are no null edges and there are two edges with a single face and all remaining edges have two faces. Remarks: Tags are ignored.
◆ HasManifoldVertexTopology()
 bool ON_SubDVertexEdgeProperties::HasManifoldVertexTopology  |  ( |   | ) |   const
Returns: HasInteriorVertexTopology() || HasBoundaryVertexTopology().
◆ HasNonmanifoldVertexTopology()
 bool ON_SubDVertexEdgeProperties::HasNonmanifoldVertexTopology  |  ( |   | ) |   const
Returns: True if there are no null edges and there is an edge with zero faces or an edge with three or more faces. Remarks: Tags are ignored.
◆ operator=()
 ON_SubDVertexEdgeProperties& ON_SubDVertexEdgeProperties::operator=  |  ( |  const ON_SubDVertexEdgeProperties &  |   | )
default
Member Data Documentation
◆ m_boundary_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_boundary_edge_count = 0
Number of boundary edges (1 attached face)
◆ m_crease_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_crease_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Crease.
◆ m_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_edge_count = 0
vertex->m_edge_count
Vertex attached component counts
◆ m_face_count
 unsigned short ON_SubDVertexEdgeProperties::m_face_count = 0
vertex->m_face_count
◆ m_interior_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_interior_edge_count = 0
Number of interior edges (2 attached faces)
◆ m_max_edge_face_count
 unsigned short ON_SubDVertexEdgeProperties::m_max_edge_face_count = 0
Maximum value of attached edges's m_face_count.
◆ m_min_edge_face_count
 unsigned short ON_SubDVertexEdgeProperties::m_min_edge_face_count = 0
Minimum value of attached edges's m_face_count.
Edge face counts
◆ m_nonmanifold_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_nonmanifold_edge_count = 0
Number of nonmanifold edges (3 or more attached faces)
◆ m_null_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_null_edge_count = 0
Number of null edges.
◆ m_smooth_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_smooth_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX.
◆ m_unset_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_unset_edge_count = 0
Number of edges tags ON_SubDEdgeTag::Unset.
Edge tag counts
◆ m_wire_edge_count
 unsigned short ON_SubDVertexEdgeProperties::m_wire_edge_count = 0
Number of wire edges (0 attached faces)
Edge topology counts
◆ Zero
 const ON_SubDVertexEdgeProperties ON_SubDVertexEdgeProperties::Zero
static
all member values are zero.