Public Member Functions | List of all members
CRhinoVarSrfConstraintNormal Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Member Functions
CRhinoVarSrfConstraintNormal (const ON_Line &normal)
const ON_Line  | Normal () const
Constructor & Destructor Documentation
◆ CRhinoVarSrfConstraintNormal()
 CRhinoVarSrfConstraintNormal::CRhinoVarSrfConstraintNormal  |  ( |  const ON_Line &  |  normal | )
Member Function Documentation
◆ Normal()
 const ON_Line CRhinoVarSrfConstraintNormal::Normal  |  ( |   | ) |   const
inline