Public Member Functions | Static Public Attributes | Friends | List of all members
CRhinoUndoRecord Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Public Member Functions
CRhinoUndoRecord ()
CRhinoUndoRecord (const CRhinoUndoRecord &)
~CRhinoUndoRecord ()
const wchar_t *  | Description () const
bool  | IsSet () const
CRhinoUndoRecord &  | operator= (const CRhinoUndoRecord &)
unsigned int  | SerialNumber () const
 Static Public Attributes
static const CRhinoUndoRecord  | Unset
 Friends
class  | CRhinoDoc
Detailed Description
Description: CRhinoUndoRecord is a snapshot of a single entry in a document's undo or redo history. Remarks: A document deletes its internal records as undo and redo are performed. CRhinoUndoRecord copies the values it reports, so an instance stays valid after the document's history changes. Once the history has changed, the value returned by SerialNumber() may no longer identify a record in that history. See Also: CRhinoDoc::GetUndoRecords CRhinoDoc::GetRedoRecords
Constructor & Destructor Documentation
◆ CRhinoUndoRecord() [1/2]
 CRhinoUndoRecord::CRhinoUndoRecord  |  ( |   | )
◆ ~CRhinoUndoRecord()
 CRhinoUndoRecord::~CRhinoUndoRecord  |  ( |   | )
◆ CRhinoUndoRecord() [2/2]
 CRhinoUndoRecord::CRhinoUndoRecord  |  ( |  const CRhinoUndoRecord &  |   | )
Member Function Documentation
◆ Description()
 const wchar_t* CRhinoUndoRecord::Description  |  ( |   | ) |   const
Returns: The name of the command that created the undoable events, or a description of what created them when they did not happen in a command. Never nullptr.
◆ IsSet()
 bool CRhinoUndoRecord::IsSet  |  ( |   | ) |   const
Returns: True if this record has a nonzero serial number.
◆ operator=()
 CRhinoUndoRecord& CRhinoUndoRecord::operator=  |  ( |  const CRhinoUndoRecord &  |   | )
◆ SerialNumber()
 unsigned int CRhinoUndoRecord::SerialNumber  |  ( |   | ) |   const
Returns: The runtime serial number Rhino assigned to this undo event, or zero when this record is not set. Remarks: Pass this value to CRhinoDoc::UndoTo() or CRhinoDoc::RedoTo() to unwind a document's history through this record.
Friends And Related Function Documentation
◆ CRhinoDoc
 friend class CRhinoDoc
friend
Member Data Documentation
◆ Unset
 const CRhinoUndoRecord CRhinoUndoRecord::Unset
static
A record with a zero serial number and an empty description.