Public Member Functions | Protected Member Functions | List of all members
IRhinoOptionsPage Class Referenceabstract
Rhino
#include <RhinoSdkPages.h>
 Inheritance diagram for IRhinoOptionsPage:
 Public Member Functions
virtual bool  | Apply (CRhinoOptionsPageEventArgs &e)
virtual void  | AttachedToUi (CRhinoOptionsPageEventArgs &e)
virtual RhinoOptionPageButtons  | ButtonsToDisplay () const
virtual void  | Cancel (CRhinoOptionsPageEventArgs &e)
virtual void  | HostAttached (IRhinoOptionsPageHost *host)
virtual bool  | IsButtonEnabled (RhinoOptionPageButtons control) const
virtual void  | OnRestoreDefaultsClick (CRhinoOptionsPageEventArgs &e)
virtual CRhinoCommand::result  | RunScript (CRhinoOptionsPageEventArgs &e)=0
virtual void  | UpdatePage (CRhinoOptionsPageEventArgs &e)=0
 Public Member Functions inherited from IRhinoPage
virtual  | ~IRhinoPage ()=default
virtual bool  | Activated (const class IRhinoPageHost *host, bool activated) const
virtual ON_2iSize  | DefaultSize () const
virtual const wchar_t *  | EnglishTitle () const =0
virtual void  | HostWindowCreated (const class IRhinoPageHost *host) const
virtual RHINO_WINDOW_IMAGE_HANDLE  | Image (ON_2iSize size)=0
virtual const wchar_t *  | LocalTitle () const
virtual ON_2iSize  | MinimumSize () const
virtual LPARAM  | PageProc (unsigned int message, WPARAM wParam, LPARAM lParam)
virtual void  | Release ()=0
virtual bool  | ShowHelp (const class IRhinoPageHost *host) const
virtual IRhinoWindow *  | Window ()=0
 Protected Member Functions
IRhinoOptionsPage ()=default
IRhinoOptionsPage (const IRhinoOptionsPage &)=delete
IRhinoOptionsPage &  | operator= (const IRhinoOptionsPage &)=delete
 Protected Member Functions inherited from IRhinoPage
IRhinoPage ()=default
IRhinoPage (const IRhinoPage &)=delete
IRhinoPage &  | operator= (const IRhinoPage &)=delete
Detailed Description
class IRhinoOptionsPage
Description: Interface used to extend the Rhino options or document properties dialogs.
Constructor & Destructor Documentation
◆ IRhinoOptionsPage() [1/2]
 IRhinoOptionsPage::IRhinoOptionsPage  |  ( |   | )
protecteddefault
 Description: Default constructor.
◆ IRhinoOptionsPage() [2/2]
 IRhinoOptionsPage::IRhinoOptionsPage  |  ( |  const IRhinoOptionsPage &  |   | )
protecteddelete
 Description: Delete the default copy constructor
Member Function Documentation
◆ Apply()
 virtual bool IRhinoOptionsPage::Apply  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
virtual
 Description: Called by the host when it is time to apply changes to the application or document. Parameters: e[in] - Event arguments. Returns: Returns true if it is safe to close the page and or host or false if there was an error on the page.
◆ AttachedToUi()
 virtual void IRhinoOptionsPage::AttachedToUi  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
virtual
 Description: Called when the page has been added to the appropriate Rhino user interface. This is a good time to set attributes like bold or title text color.
◆ ButtonsToDisplay()
 virtual RhinoOptionPageButtons IRhinoOptionsPage::ButtonsToDisplay  |  ( |   | ) |   const
virtual
 Description: Called by the host when deciding which standard buttons to display. Returns: The standard controls to display, returns RhinoOptionPageButtons::None by default.
◆ Cancel()
 virtual void IRhinoOptionsPage::Cancel  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
virtual
 Description: Called by the host when the page modifications have been canceled.
◆ HostAttached()
 virtual void IRhinoOptionsPage::HostAttached  |  ( |  IRhinoOptionsPageHost *  |  host | )
virtual
 Description: This method gets called after the plug-in returns the pages to add to Rhino and the associated host objects are created. Save this pointer and use it to communicate with the host or just ignore the call if you don't care.
◆ IsButtonEnabled()
 virtual bool IRhinoOptionsPage::IsButtonEnabled  |  ( |  RhinoOptionPageButtons  |  control | ) |   const
virtual
 Description: Called by the host when deciding if a visible standard control should be enabled or not. Parameters: control[in] = The control to enable. Returns: Return true to enable the control or false to disable it, returns false by default.
◆ OnRestoreDefaultsClick()
 virtual void IRhinoOptionsPage::OnRestoreDefaultsClick  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
virtual
 Description: Called by the host when the "Restore Defaults" button is clicked, will be followed by a UpdatePage call to update the page contents.
◆ operator=()
 IRhinoOptionsPage& IRhinoOptionsPage::operator=  |  ( |  const IRhinoOptionsPage &  |   | )
protecteddelete
 Description: Delete the default operator=
◆ RunScript()
 virtual CRhinoCommand::result IRhinoOptionsPage::RunScript  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
pure virtual
 Description: Called by the script-able version of the host command when this page is selected. You should use CRhinoGet... methods to interact with users when overriding this method. Returns: The return value notifies the calling command to continue or cancel.
◆ UpdatePage()
 virtual void IRhinoOptionsPage::UpdatePage  |  ( |  CRhinoOptionsPageEventArgs &  |  e | )
pure virtual
 Description: Called by the host when it is time to update the page contents reflecting the current options states. Parameters: e[in] - Event arguments.