Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
CRhinoEdgeContinuitySettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | EdgeContinuityMode : int { EdgeContinuityMode::Distance = 0, EdgeContinuityMode::Tangency = 1, EdgeContinuityMode::Curvature = 2 }
Continuity mode to report More...
 Public Member Functions
CRhinoEdgeContinuitySettings ()
ON_Color  | BadHairColor () const
EdgeContinuityMode  | Continuity () const
double  | CurvatureScale () const
double  | CurvatureTolerancePercent () const
void  | Defaults ()
int  | Density () const
double  | DistanceScale () const
double  | DistanceTolerance () const
ON_Color  | GoodHairColor () const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
ON_Color  | MaxColor () const
bool  | operator!= (const CRhinoEdgeContinuitySettings &other) const
bool  | operator== (const CRhinoEdgeContinuitySettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetBadHairColor (ON_Color color)
void  | SetContinuity (EdgeContinuityMode continuity)
void  | SetCurvatureScale (double scale)
void  | SetCurvatureTolerancePercent (double percent)
void  | SetDensity (int density)
void  | SetDistanceScale (double scale)
void  | SetDistanceTolerance (double distance)
void  | SetGoodHairColor (ON_Color color)
void  | SetMaxColor (ON_Color color)
void  | SetShowCurvature (bool show)
void  | SetShowDistance (bool show)
void  | SetShowTangency (bool show)
void  | SetTangencyScale (double scale)
void  | SetTangentToleranceDegrees (double degrees)
void  | SetTangentToleranceRadians (double radians)
void  | SetTextColor (ON_Color color)
bool  | ShowCurvature () const
bool  | ShowDistance () const
bool  | ShowTangency () const
double  | TangencyScale () const
double  | TangentToleranceDegrees () const
double  | TangentToleranceRadians () const
ON_Color  | TextColor () const
void  | Validate ()
 Static Public Member Functions
static EdgeContinuityMode  | EdgeContinuityModeFromUnsigned (unsigned int edge_mode_as_unsigned)
 Static Public Attributes
static const CRhinoEdgeContinuitySettings  | Default
Detailed Description
Member Enumeration Documentation
◆ EdgeContinuityMode
 enum CRhinoEdgeContinuitySettings::EdgeContinuityMode : int
strong
Continuity mode to report
Enumerator
Distance
G0 Continuity
Tangency
G1 Continuity
Curvature
G2 Continuity
Constructor & Destructor Documentation
◆ CRhinoEdgeContinuitySettings()
 CRhinoEdgeContinuitySettings::CRhinoEdgeContinuitySettings  |  ( |   | )
Member Function Documentation
◆ BadHairColor()
 ON_Color CRhinoEdgeContinuitySettings::BadHairColor  |  ( |   | ) |   const
◆ Continuity()
 EdgeContinuityMode CRhinoEdgeContinuitySettings::Continuity  |  ( |   | ) |   const
◆ CurvatureScale()
 double CRhinoEdgeContinuitySettings::CurvatureScale  |  ( |   | ) |   const
◆ CurvatureTolerancePercent()
 double CRhinoEdgeContinuitySettings::CurvatureTolerancePercent  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoEdgeContinuitySettings::Defaults  |  ( |   | )
◆ Density()
 int CRhinoEdgeContinuitySettings::Density  |  ( |   | ) |   const
◆ DistanceScale()
 double CRhinoEdgeContinuitySettings::DistanceScale  |  ( |   | ) |   const
◆ DistanceTolerance()
 double CRhinoEdgeContinuitySettings::DistanceTolerance  |  ( |   | ) |   const
◆ EdgeContinuityModeFromUnsigned()
 static EdgeContinuityMode CRhinoEdgeContinuitySettings::EdgeContinuityModeFromUnsigned  |  ( |  unsigned int  |  edge_mode_as_unsigned | )
static
◆ GoodHairColor()
 ON_Color CRhinoEdgeContinuitySettings::GoodHairColor  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoEdgeContinuitySettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ MaxColor()
 ON_Color CRhinoEdgeContinuitySettings::MaxColor  |  ( |   | ) |   const
◆ operator!=()
 bool CRhinoEdgeContinuitySettings::operator!=  |  ( |  const CRhinoEdgeContinuitySettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoEdgeContinuitySettings::operator==  |  ( |  const CRhinoEdgeContinuitySettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoEdgeContinuitySettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoEdgeContinuitySettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetBadHairColor()
 void CRhinoEdgeContinuitySettings::SetBadHairColor  |  ( |  ON_Color  |  color | )
◆ SetContinuity()
 void CRhinoEdgeContinuitySettings::SetContinuity  |  ( |  EdgeContinuityMode  |  continuity | )
◆ SetCurvatureScale()
 void CRhinoEdgeContinuitySettings::SetCurvatureScale  |  ( |  double  |  scale | )
◆ SetCurvatureTolerancePercent()
 void CRhinoEdgeContinuitySettings::SetCurvatureTolerancePercent  |  ( |  double  |  percent | )
◆ SetDensity()
 void CRhinoEdgeContinuitySettings::SetDensity  |  ( |  int  |  density | )
◆ SetDistanceScale()
 void CRhinoEdgeContinuitySettings::SetDistanceScale  |  ( |  double  |  scale | )
◆ SetDistanceTolerance()
 void CRhinoEdgeContinuitySettings::SetDistanceTolerance  |  ( |  double  |  distance | )
◆ SetGoodHairColor()
 void CRhinoEdgeContinuitySettings::SetGoodHairColor  |  ( |  ON_Color  |  color | )
◆ SetMaxColor()
 void CRhinoEdgeContinuitySettings::SetMaxColor  |  ( |  ON_Color  |  color | )
◆ SetShowCurvature()
 void CRhinoEdgeContinuitySettings::SetShowCurvature  |  ( |  bool  |  show | )
◆ SetShowDistance()
 void CRhinoEdgeContinuitySettings::SetShowDistance  |  ( |  bool  |  show | )
◆ SetShowTangency()
 void CRhinoEdgeContinuitySettings::SetShowTangency  |  ( |  bool  |  show | )
◆ SetTangencyScale()
 void CRhinoEdgeContinuitySettings::SetTangencyScale  |  ( |  double  |  scale | )
◆ SetTangentToleranceDegrees()
 void CRhinoEdgeContinuitySettings::SetTangentToleranceDegrees  |  ( |  double  |  degrees | )
◆ SetTangentToleranceRadians()
 void CRhinoEdgeContinuitySettings::SetTangentToleranceRadians  |  ( |  double  |  radians | )
◆ SetTextColor()
 void CRhinoEdgeContinuitySettings::SetTextColor  |  ( |  ON_Color  |  color | )
◆ ShowCurvature()
 bool CRhinoEdgeContinuitySettings::ShowCurvature  |  ( |   | ) |   const
◆ ShowDistance()
 bool CRhinoEdgeContinuitySettings::ShowDistance  |  ( |   | ) |   const
◆ ShowTangency()
 bool CRhinoEdgeContinuitySettings::ShowTangency  |  ( |   | ) |   const
◆ TangencyScale()
 double CRhinoEdgeContinuitySettings::TangencyScale  |  ( |   | ) |   const
◆ TangentToleranceDegrees()
 double CRhinoEdgeContinuitySettings::TangentToleranceDegrees  |  ( |   | ) |   const
◆ TangentToleranceRadians()
 double CRhinoEdgeContinuitySettings::TangentToleranceRadians  |  ( |   | ) |   const
◆ TextColor()
 ON_Color CRhinoEdgeContinuitySettings::TextColor  |  ( |   | ) |   const
◆ Validate()
 void CRhinoEdgeContinuitySettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoEdgeContinuitySettings CRhinoEdgeContinuitySettings::Default
static