Static Public Member Functions | List of all members
CRhRdkMaterial::PhysicallyBased::ParameterNames Class Reference
#include <RhRdkMaterial.h>
 Static Public Member Functions
static ON_wString  | Alpha (void)
static ON_wString  | Anisotropic (void)
static ON_wString  | AnisotropicRotation (void)
static ON_wString  | BaseColor (void)
static ON_wString  | BRDF (void)
static ON_wString  | Clearcoat (void)
static ON_wString  | ClearcoatRoughness (void)
static ON_wString  | Emission (void)
static ON_wString  | Metallic (void)
static ON_wString  | Opacity (void)
static ON_wString  | OpacityIor (void)
static ON_wString  | OpacityRoughness (void)
static ON_wString  | Roughness (void)
static ON_wString  | Sheen (void)
static ON_wString  | SheenTint (void)
static ON_wString  | Specular (void)
static ON_wString  | SpecularTint (void)
static ON_wString  | Subsurface (void)
static ON_wString  | SubsurfaceScatteringColor (void)
static ON_wString  | SubsurfaceScatteringRadius (void)
Member Function Documentation
◆ Alpha()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Alpha  |  ( |  void  |   | )
static
◆ Anisotropic()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Anisotropic  |  ( |  void  |   | )
static
◆ AnisotropicRotation()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::AnisotropicRotation  |  ( |  void  |   | )
static
◆ BaseColor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::BaseColor  |  ( |  void  |   | )
static
◆ BRDF()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::BRDF  |  ( |  void  |   | )
static
◆ Clearcoat()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Clearcoat  |  ( |  void  |   | )
static
◆ ClearcoatRoughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::ClearcoatRoughness  |  ( |  void  |   | )
static
◆ Emission()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Emission  |  ( |  void  |   | )
static
◆ Metallic()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Metallic  |  ( |  void  |   | )
static
◆ Opacity()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Opacity  |  ( |  void  |   | )
static
◆ OpacityIor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::OpacityIor  |  ( |  void  |   | )
static
◆ OpacityRoughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::OpacityRoughness  |  ( |  void  |   | )
static
◆ Roughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Roughness  |  ( |  void  |   | )
static
◆ Sheen()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Sheen  |  ( |  void  |   | )
static
◆ SheenTint()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::SheenTint  |  ( |  void  |   | )
static
◆ Specular()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Specular  |  ( |  void  |   | )
static
◆ SpecularTint()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::SpecularTint  |  ( |  void  |   | )
static
◆ Subsurface()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::Subsurface  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringColor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::SubsurfaceScatteringColor  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringRadius()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ParameterNames::SubsurfaceScatteringRadius  |  ( |  void  |   | )
static