Public Member Functions | List of all members
CRhinoVarSrfEdgeCurve Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Inheritance diagram for CRhinoVarSrfEdgeCurve:
 Public Member Functions
CRhinoVarSrfEdgeCurve (const ON_Curve *curve, ON::continuity continuity)
virtual  | ~CRhinoVarSrfEdgeCurve ()
std::shared_ptr< CRhinoVarSrfConstraintCurve >  | Duplicate (const ON_Xform *xform=nullptr) override
duplicate with transform More...
 Public Member Functions inherited from CRhinoVarSrfConstraintCurve
CRhinoVarSrfConstraintCurve (const ON_Curve *curve, ON::continuity continuity)
virtual  | ~CRhinoVarSrfConstraintCurve ()
const ON_Curve *  | Curve () const
void  | Reverse ()
bool  | Reversed () const
 Additional Inherited Members
 Public Attributes inherited from CRhinoVarSrfConstraintCurve
ON::continuity  | m_continuity
commmand can change these continuities More...
ON::continuity  | m_endContinuity
ON::continuity  | m_startContinuity
 Protected Attributes inherited from CRhinoVarSrfConstraintCurve
const ON_Curve *  | m_curve
ON_SimpleArray< const ON_Geometry * >  | m_geos
bool  | m_reversed
Constructor & Destructor Documentation
◆ CRhinoVarSrfEdgeCurve()
 CRhinoVarSrfEdgeCurve::CRhinoVarSrfEdgeCurve  |  ( |  const ON_Curve *  |  curve,
|  ON::continuity  |  continuity
)
◆ ~CRhinoVarSrfEdgeCurve()
 virtual CRhinoVarSrfEdgeCurve::~CRhinoVarSrfEdgeCurve  |  ( |   | )
virtual
Member Function Documentation
◆ Duplicate()
 std::shared_ptr<CRhinoVarSrfConstraintCurve> CRhinoVarSrfEdgeCurve::Duplicate  |  ( |  const ON_Xform *  |  xform = nullptr | )
overridevirtual
duplicate with transform
Reimplemented from CRhinoVarSrfConstraintCurve.