Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhRdkSdkRealNumberEdit Class Reference
RDK
#include <RhRdkSdkNumberEdit.h>
 Inheritance diagram for CRhRdkSdkRealNumberEdit:
 Public Member Functions
CRhRdkSdkRealNumberEdit ()
virtual  | ~CRhRdkSdkRealNumberEdit ()
virtual bool  | AlwaysClampToZero (void) const
virtual bool  | AutoPercentileScaling (void) const
virtual int  | DecimalPlaces (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetValue (void) const
virtual void  | Initialize (double dLowerBound=0.0, double dUpperBound=Unbounded(), double dDelta=1.0, int iPlaces=1, const TCHAR *tszSuffix=_T(""), bool bPercentile=false)
virtual bool  | IsPercentile (void) const
virtual void  | SetAlwaysClampToZero (bool bClamp=true)
virtual void  | SetAsPercentile (bool bPercentile=true)
virtual void  | SetAutoPercentileScaling (bool bAuto=true)
virtual void  | SetDecimalPlaces (int iPlaces)
virtual void  | SetStripTrailingZeros (bool bStrip=true)
virtual void  | SetSuperSmartRolling (bool bSuperSmart=true)
virtual bool  | SetValue (double dValue, bool bForceBlankOff=false)
virtual bool  | StripTrailingZeros (void) const
virtual bool  | SuperSmartRolling (void) const
 Public Member Functions inherited from CRhRdkSdkNumberEdit
virtual int  | AutoRepeatDelay (void) const
virtual double  | ChangeThreshold (void) const
virtual int  | CharFromPos (const CPoint &pt) const
virtual bool  | CreateCtrl (DWORD dwStyle, const ON_4iRect &rect, CWnd *pParentWnd, UINT iID)
virtual bool  | EditByTyping (void) const
virtual bool  | EnableSpinnerWhenBlank (void) const
virtual bool  | Format (const double dValue, CString &sText) const
virtual bool  | IsBlank (void) const
virtual bool  | IsFixedSpinnerDelta (void) const
virtual bool  | IsFocused (void) const
virtual bool  | IsLocked (void) const
virtual double  | LinearRollingDelta (void) const
virtual bool  | LockFrom (const CRhRdkSdkNumberEdit &srce)
virtual void  | OnBeginRollSpinner (void)
virtual void  | OnEndRollSpinner (void)
virtual void  | OnUserChangedValue (void)
virtual void  | OnValueChanged (void)
virtual bool  | Parse (const TCHAR *tsz, double &dValueOut) const
virtual void  | RemoveBounds (void)
virtual void  | RemoveFixedSpinnerDelta (void)
virtual bool  | SendChangeWhenDragging (void) const
virtual void  | SetAllowSetDuringChange (bool bAllow=true)
virtual void  | SetAutoRepeatDelay (int iDelay)
virtual void  | SetBlank (bool bBlank=true)
virtual void  | SetBounds (double dLowerBound, double dUpperBound)
virtual void  | SetCanHideCursor (bool bCanHide=true)
virtual void  | SetChangeThreshold (double dThresh)
virtual void  | SetControlKeyScaling (double d)
virtual void  | SetEditByTyping (bool bCanType)
virtual void  | SetEnableSpinnerWhenBlank (bool bEnable=true)
virtual void  | SetFixedSpinnerDelta (double dDelta)
virtual void  | SetForcedStyles (DWORD dwStyles)
virtual void  | SetKeyScaling (double dArrow=1.0, double dPage=10.0)
virtual void  | SetLimitText (int iMax)
virtual void  | SetLinearRollingDelta (double dDelta)
virtual bool  | SetLock (bool bLocked)
virtual void  | SetLowerBound (double dLowerBound)
virtual void  | SetSel (int iStartChar, int iEndChar, bool bNoScroll=false)
virtual void  | SetSendChangeWhenDragging (bool bSend=true)
virtual void  | SetShiftKeyScaling (double d)
virtual void  | SetSimpleArithmeticOn (bool bOn=true)
virtual void  | SetSpinnerVisibility (bool bVisible)
virtual void  | SetSpinnerWidth (int iWidth)
virtual void  | SetSuffixString (const TCHAR *szSuffix)
virtual void  | SetUpperBound (double dUpperBound)
virtual void  | SetUseHandCursor (bool bUseHand=true)
virtual bool  | SimpleArithmeticOn (void) const
virtual HCURSOR  | SpinDragCursor (void) const
virtual int  | SpinnerWidth (void) const
virtual bool  | UseHandCursor (void) const
virtual bool  | WantThemedSpinner (void) const
 Static Public Member Functions
static double  | Unbounded (void)
 Static Public Member Functions inherited from CRhRdkSdkNumberEdit
static UINT  | ChangedMessageNumber (void)
 Protected Member Functions
virtual CImpl &  | Impl (void)
virtual const CImpl &  | Impl (void) const
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL32 b)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
 Protected Member Functions inherited from CRhRdkSdkNumberEdit
afx_msg void  | OnKillfocusEdit ()
virtual void  | PreSubclassWindow ()
 Protected Attributes
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkSdkRealNumberEdit()
 CRhRdkSdkRealNumberEdit::CRhRdkSdkRealNumberEdit  |  ( |   | )
◆ ~CRhRdkSdkRealNumberEdit()
 virtual CRhRdkSdkRealNumberEdit::~CRhRdkSdkRealNumberEdit  |  ( |   | )
virtual
Member Function Documentation
◆ AlwaysClampToZero()
 virtual bool CRhRdkSdkRealNumberEdit::AlwaysClampToZero  |  ( |  void  |   | ) |   const
virtual
Returns
Whether or not Format() will clamp near-zero values to zero.
◆ AutoPercentileScaling()
 virtual bool CRhRdkSdkRealNumberEdit::AutoPercentileScaling  |  ( |  void  |   | ) |   const
virtual
Returns
true if automatic percentile scaling is enabled.
◆ DecimalPlaces()
 virtual int CRhRdkSdkRealNumberEdit::DecimalPlaces  |  ( |  void  |   | ) |   const
virtual
Returns
Number of decimal places being displayed (or -1 if not used).
◆ EVF()
 virtual void* CRhRdkSdkRealNumberEdit::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkSdkNumberEdit.
◆ GetValue()
 virtual double CRhRdkSdkRealNumberEdit::GetValue  |  ( |  void  |   | ) |   const
virtual
Get the value.
◆ Impl() [1/2]
 virtual CImpl& CRhRdkSdkRealNumberEdit::Impl  |  ( |  void  |   | )
protectedvirtual
Implements CRhRdkSdkNumberEdit.
◆ Impl() [2/2]
 virtual const CImpl& CRhRdkSdkRealNumberEdit::Impl  |  ( |  void  |   | ) |   const
protectedvirtual
Implements CRhRdkSdkNumberEdit.
◆ Initialize()
 virtual void CRhRdkSdkRealNumberEdit::Initialize  |  ( |  double  |  dLowerBound = 0.0,
|  double  |  dUpperBound = Unbounded(),
|  double  |  dDelta = 1.0,
|  int  |  iPlaces = 1,
|  const TCHAR *  |  tszSuffix = _T(""),
|  bool  |  bPercentile = false
)
virtual
Initialize various properties.
◆ IsPercentile()
 virtual bool CRhRdkSdkRealNumberEdit::IsPercentile  |  ( |  void  |   | ) |   const
virtual
Returns
true if control is set as percentile.
◆ OnDestroy()
 afx_msg void CRhRdkSdkRealNumberEdit::OnDestroy  |  ( |   | )
protected
◆ OnEnable()
 afx_msg void CRhRdkSdkRealNumberEdit::OnEnable  |  ( |  BOOL32  |  b | )
protected
◆ OnSize()
 afx_msg void CRhRdkSdkRealNumberEdit::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ SetAlwaysClampToZero()
 virtual void CRhRdkSdkRealNumberEdit::SetAlwaysClampToZero  |  ( |  bool  |  bClamp = true | )
virtual
Set whether or not Format() will clamp near-zero values to zero.
◆ SetAsPercentile()
 virtual void CRhRdkSdkRealNumberEdit::SetAsPercentile  |  ( |  bool  |  bPercentile = true | )
virtual
Set value as percentile. Value will be displayed times 100 with % suffix. e.g., a value of 0.5 will be displayed as 50%
◆ SetAutoPercentileScaling()
 virtual void CRhRdkSdkRealNumberEdit::SetAutoPercentileScaling  |  ( |  bool  |  bAuto = true | )
virtual
Enable or disable automatic percentile scaling. If enabled, GetValue() returns an integer value from 0 to 100 and SetValue() accepts such a value. If disabled the functions use values between 0.0 to 1.0 when the control is set as percentile.
◆ SetDecimalPlaces()
 virtual void CRhRdkSdkRealNumberEdit::SetDecimalPlaces  |  ( |  int  |  iPlaces | )
virtual
Set number of decimal places to display. -1 means not used (i.e., uses g formatting).
◆ SetStripTrailingZeros()
 virtual void CRhRdkSdkRealNumberEdit::SetStripTrailingZeros  |  ( |  bool  |  bStrip = true | )
virtual
Set whether or not trailing zeroes will be stripped after the decimal point.
◆ SetSuperSmartRolling()
 virtual void CRhRdkSdkRealNumberEdit::SetSuperSmartRolling  |  ( |  bool  |  bSuperSmart = true | )
virtual
Set whether or not super-smart rolling is active. This feature maintains a narrow field regardless of the decimal places setting. It also does smart acceleration with 'mouse-jerk' engaging 'fast-mode' when the number edit is unbounded.
Note
Calling SetLinearRollingDelta() overrides super-smart rolling and does linear rolling regardless of the setting of super-smart rolling.
◆ SetValue()
 virtual bool CRhRdkSdkRealNumberEdit::SetValue  |  ( |  double  |  dValue,
|  bool  |  bForceBlankOff = false
)
virtual
Set the value.
◆ StripTrailingZeros()
 virtual bool CRhRdkSdkRealNumberEdit::StripTrailingZeros  |  ( |  void  |   | ) |   const
virtual
Returns
Whether or not trailing zeroes will be stripped after the decimal point.
◆ SuperSmartRolling()
 virtual bool CRhRdkSdkRealNumberEdit::SuperSmartRolling  |  ( |  void  |   | ) |   const
virtual
Returns
Whether or not super-smart rolling is active.
◆ Unbounded()
 static double CRhRdkSdkRealNumberEdit::Unbounded  |  ( |  void  |   | )
static
This value can be passed to Set*Bound(s) to make the control boundless.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkSdkRealNumberEdit::m_pImpl
mutableprotected