Public Member Functions | Public Attributes | List of all members
ON_PackTextureRectanglesParameters Class Reference
OpenNURBS
#include <opennurbs_plus_rectpack.h>
 Public Member Functions
ON_PackTextureRectanglesParameters ()
The default constructor sets all fields to zero. More...
bool  | IsValid (class ON_TextLog *text_log) const
The default operator= and copy constructor work fine. More...
 Public Attributes
double  | m_bm_height
double  | m_bm_width
bool  | m_bPreserveRectangleAspect
unsigned int  | m_method
Constructor & Destructor Documentation
◆ ON_PackTextureRectanglesParameters()
 ON_PackTextureRectanglesParameters::ON_PackTextureRectanglesParameters  |  ( |   | )
The default constructor sets all fields to zero.
Member Function Documentation
◆ IsValid()
 bool ON_PackTextureRectanglesParameters::IsValid  |  ( |  class ON_TextLog *  |  text_log | ) |   const
The default operator= and copy constructor work fine.
Member Data Documentation
◆ m_bm_height
 double ON_PackTextureRectanglesParameters::m_bm_height
◆ m_bm_width
 double ON_PackTextureRectanglesParameters::m_bm_width
If m_bm_width > 0 and m_bm_height > 0, then they specify the size of the bitmap in pixels that the packed texture will use.
◆ m_bPreserveRectangleAspect
 bool ON_PackTextureRectanglesParameters::m_bPreserveRectangleAspect
If m_bPreserveRectangleAspect is true, the aspect of rectangle assigned to the rect will be the same as the aspect of the original rectangle.
◆ m_method
 unsigned int ON_PackTextureRectanglesParameters::m_method
The m_method parameter specifies how the rectangles are packed. Generally, 0 is the best choice. The other options are available so legacy packings can be recalculated.
0 = latest 1 = V4, V5 SR0, V5 SR1 2 = V5 SR2