Public Attributes | Static Public Attributes | List of all members
ON_DepthImagePixel Class Reference
OpenNURBS
#include <opennurbs_plus_idimage.h>
 Public Attributes
ON_DepthImage_DEPTH_TYPE *  | m_depth
pointer to the depth value in the image More...
unsigned int  | m_i
pixel coordinates More...
ON__UINT_PTR *  | m_id
pointer to the id value in the image More...
const class ON_DepthImage *  | m_image
unsigned int  | m_j
0 <= m_j < m_id_image->m_height More...
 Static Public Attributes
static const ON_DepthImagePixel  | Unset
Detailed Description
Description: ON_DepthImagePixel is used to pass id image pixel information to ON_DepthImage shaders.
Member Data Documentation
◆ m_depth
 ON_DepthImage_DEPTH_TYPE* ON_DepthImagePixel::m_depth
pointer to the depth value in the image
= &m_id_image->m_depth[m_j][m_i]
◆ m_i
 unsigned int ON_DepthImagePixel::m_i
pixel coordinates
0 <= m_i < m_id_image->m_width
◆ m_id
 ON__UINT_PTR* ON_DepthImagePixel::m_id
pointer to the id value in the image
= &m_id_image->m_id[m_j][m_i]
◆ m_image
 const class ON_DepthImage* ON_DepthImagePixel::m_image
◆ m_j
 unsigned int ON_DepthImagePixel::m_j
0 <= m_j < m_id_image->m_height
◆ Unset
 const ON_DepthImagePixel ON_DepthImagePixel::Unset
static