Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
ON_StackedText Class Reference
OpenNURBS
#include <opennurbs_textrun.h>
 Public Types
enum  | StackStyle : unsigned char { StackStyle::kUnset = 0, StackStyle::kHorizontalToScreen = 1, StackStyle::kSlanted = 2 }
 Public Member Functions
ON_StackedText ()=default
ON_StackedText (const ON_StackedText &src)
~ON_StackedText ()
ON_StackedText &  | operator= (const ON_StackedText &src)
 Static Public Member Functions
static ON_StackedText::StackStyle  | StackStyleFromUnsigned (unsigned int stack_style_as_unsigned)
 Public Attributes
class ON_TextRun *  | m_bottom_run = nullptr
const ON_TextRun *  | m_parent_run = nullptr
wchar_t  | m_separator = (wchar_t)ON_UnicodeCodePoint::ON_Slash
class ON_TextRun *  | m_top_run = nullptr
 Static Public Attributes
static const ON_StackedText  | Empty
 Friends
class  | ON_TextRun
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Enumeration Documentation
◆ StackStyle
 enum ON_StackedText::StackStyle : unsigned char
strong
Enumerator
kUnset
kHorizontalToScreen
kSlanted
Constructor & Destructor Documentation
◆ ON_StackedText() [1/2]
 ON_StackedText::ON_StackedText  |  ( |   | )
default
◆ ~ON_StackedText()
 ON_StackedText::~ON_StackedText  |  ( |   | )
◆ ON_StackedText() [2/2]
 ON_StackedText::ON_StackedText  |  ( |  const ON_StackedText &  |  src | )
Member Function Documentation
◆ operator=()
 ON_StackedText& ON_StackedText::operator=  |  ( |  const ON_StackedText &  |  src | )
Sets m_parent_run = nullptr. You must set m_parent_run after calling operator=().
◆ StackStyleFromUnsigned()
 static ON_StackedText::StackStyle ON_StackedText::StackStyleFromUnsigned  |  ( |  unsigned int  |  stack_style_as_unsigned | )
static
Friends And Related Function Documentation
◆ ON_TextRun
 friend class ON_TextRun
friend
Member Data Documentation
◆ Empty
 const ON_StackedText ON_StackedText::Empty
static
◆ m_bottom_run
 class ON_TextRun* ON_StackedText::m_bottom_run = nullptr
◆ m_parent_run
 const ON_TextRun* ON_StackedText::m_parent_run = nullptr
◆ m_separator
 wchar_t ON_StackedText::m_separator = (wchar_t)ON_UnicodeCodePoint::ON_Slash
◆ m_top_run
 class ON_TextRun* ON_StackedText::m_top_run = nullptr