Public Member Functions | Public Attributes | List of all members
ON_PolyEdgeHistory Class Reference
OpenNURBS
#include <opennurbs_object_history.h>
 Public Member Functions
ON_PolyEdgeHistory ()
~ON_PolyEdgeHistory ()
void  | Destroy ()
void  | Dump (ON_TextLog &) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
int  | m_evaluation_mode
ON_ClassArray< ON_CurveProxyHistory >  | m_segment
ON_SimpleArray< double >  | m_t
Constructor & Destructor Documentation
◆ ON_PolyEdgeHistory()
 ON_PolyEdgeHistory::ON_PolyEdgeHistory  |  ( |   | )
Used to save information needed to create an CRhinoPolyEdge reference in history records.
◆ ~ON_PolyEdgeHistory()
 ON_PolyEdgeHistory::~ON_PolyEdgeHistory  |  ( |   | )
Member Function Documentation
◆ Destroy()
 void ON_PolyEdgeHistory::Destroy  |  ( |   | )
◆ Dump()
 void ON_PolyEdgeHistory::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ Read()
 bool ON_PolyEdgeHistory::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_PolyEdgeHistory::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_evaluation_mode
 int ON_PolyEdgeHistory::m_evaluation_mode
◆ m_segment
 ON_ClassArray< ON_CurveProxyHistory > ON_PolyEdgeHistory::m_segment
◆ m_t
 ON_SimpleArray<double> ON_PolyEdgeHistory::m_t