Public Member Functions | Protected Member Functions | List of all members
CRhinoTextDump Class Reference
Rhino
#include <RhinoSdkTextOut.h>
 Inheritance diagram for CRhinoTextDump:
 Public Member Functions
CRhinoTextDump ()
operator ON_TextLog & ()
ON_TextLog &  | TextLog ()
 Public Member Functions inherited from CRhinoTextOut
CRhinoTextOut ()
virtual  | ~CRhinoTextOut ()
LPVOID  | Data () const
class CRhRichTextDialog *  | Dialog () const
virtual CRhinoCommand::result  | DisplayText (bool is_interactive, const wchar_t *lpsWindowTitle, LPVOID pData=nullptr, HWND hWndParent=nullptr)
bool  | ScrollTextDialogToBottom () const
void  | ScrollTextDialogToBottom (bool b)
void  | SetTextOutputMode (output_mode mode)
bool  | SetUseFileDialog (bool b)
output_mode  | TextOutputMode () const
bool  | UseFileDialog () const
const wchar_t *  | WindowTitle () const
 Protected Member Functions
void  | PrintText (ON_TextLog &text_log, LPVOID pData) override
 Protected Member Functions inherited from CRhinoTextOut
bool  | PrintBuffer (CRhinoTextOutTextLog &text_log)
CRhinoCommand::result  | PrintToClipboard ()
CRhinoCommand::result  | PrintToDialog ()
CRhinoCommand::result  | PrintToFile ()
CRhinoCommand::result  | PrintToHistory ()
 Additional Inherited Members
 Public Types inherited from CRhinoTextOut
enum  | output_mode { text_dialog = 0, history_window, text_file, clipboard }
 Public Attributes inherited from CRhinoTextOut
class CRhTextOutWStringTextLog *  | m_wbuffer
 Protected Attributes inherited from CRhinoTextOut
class CRhRichTextDialog *  | m_dialog
HWND  | m_hWnd
output_mode  | m_output_mode
LPVOID  | m_pData
bool  | m_scroll_dialog_to_bottom
bool  | m_use_file_dialog
ON_wString  | m_window_title
Constructor & Destructor Documentation
◆ CRhinoTextDump()
 CRhinoTextDump::CRhinoTextDump  |  ( |   | )
Member Function Documentation
◆ operator ON_TextLog &()
 CRhinoTextDump::operator ON_TextLog &  |  ( |   | )
◆ PrintText()
 void CRhinoTextDump::PrintText  |  ( |  ON_TextLog &  |  text_log,
|  LPVOID  |  pData
)
overrideprotectedvirtual
Description: You must override this function to actually display your text. Parameters: text_log [in] - Log attached to text file, history window or text dialog. pData [in] - Data passed to CRhinoTextOut::DisplayText method.
Implements CRhinoTextOut.
◆ TextLog()
 ON_TextLog& CRhinoTextDump::TextLog  |  ( |   | )