Public Member Functions | Protected Attributes | List of all members
CRhinoAppUiManager Class Reference
RhinoUI
#include <RhinoSdkUiLibManagers.h>
 Inheritance diagram for CRhinoAppUiManager:
 Public Member Functions
CRhinoAppUiManager ()=default
virtual  | ~CRhinoAppUiManager ()
bool  | ColorDialog (CWnd *pWndParent, ON_Color &color, bool include_button_colors=false, const wchar_t *dialog_title=NULL) override
void  | DisplayDockLocationContextDialog (CDockBar &dock_bar, CPoint pt) override
CRhinoUiDockBarManager &  | DockBarManager () override
bool  | IsPlugInLoaded (const UUID &plug_in_id) const override
bool  | LoadPlugIn (const UUID &plug_in_id, bool fail_quietly=false, bool ignore_load_failed=false) override
CRhinoUiPaintManager &  | PaintManager () override
CRhinoUiResourceManager &  | ResourceManager () override
CRuntimeClass *  | RuntimeClassFromName (const UUID &plug_in_id, const wchar_t *lpsClassName) override
 Public Member Functions inherited from CRhinoUiManager
CRhinoUiManager ()
virtual  | ~CRhinoUiManager ()
virtual CRhinoUiModlessDockingDialogManager &  | ModlessDockingDialogManager ()
virtual CRhinoUiPageDockBarManager &  | PageDockBarManager ()
 Protected Attributes
CRhinoAppUiResourceManager  | m_test_resource_manager
 Protected Attributes inherited from CRhinoUiManager
CRhinoUiDockBarManager *  | m_dock_bar_manager = nullptr
CRhinoUiModlessDockingDialogManager *  | m_modless_docking_dialog_manager = nullptr
CRhinoUiPageDockBarManager *  | m_page_dock_bar_manager = nullptr
CRhinoUiPaintManager *  | m_paint_manager = nullptr
 Additional Inherited Members
 Protected Member Functions inherited from CRhinoUiManager
void  | OnDestroyMainFrame ()
Constructor & Destructor Documentation
◆ CRhinoAppUiManager()
 CRhinoAppUiManager::CRhinoAppUiManager  |  ( |   | )
default
◆ ~CRhinoAppUiManager()
 virtual CRhinoAppUiManager::~CRhinoAppUiManager  |  ( |   | )
virtual
Member Function Documentation
◆ ColorDialog()
 bool CRhinoAppUiManager::ColorDialog  |  ( |  CWnd *  |  pWndParent,
|  ON_Color &  |  color,
|  bool  |  include_button_colors = false,
|  const wchar_t *  |  dialog_title = NULL
)
overridevirtual
Reimplemented from CRhinoUiManager.
◆ DisplayDockLocationContextDialog()
 void CRhinoAppUiManager::DisplayDockLocationContextDialog  |  ( |  CDockBar &  |  dock_bar,
|  CPoint  |  pt
)
overridevirtual
Implements CRhinoUiManager.
◆ DockBarManager()
 CRhinoUiDockBarManager& CRhinoAppUiManager::DockBarManager  |  ( |   | )
overridevirtual
Reimplemented from CRhinoUiManager.
◆ IsPlugInLoaded()
 bool CRhinoAppUiManager::IsPlugInLoaded  |  ( |  const UUID &  |  plug_in_id | ) |   const
overridevirtual
Implements CRhinoUiManager.
◆ LoadPlugIn()
 bool CRhinoAppUiManager::LoadPlugIn  |  ( |  const UUID &  |  plug_in_id,
|  bool  |  fail_quietly = false,
|  bool  |  ignore_load_failed = false
)
overridevirtual
Implements CRhinoUiManager.
◆ PaintManager()
 CRhinoUiPaintManager& CRhinoAppUiManager::PaintManager  |  ( |   | )
overridevirtual
Reimplemented from CRhinoUiManager.
◆ ResourceManager()
 CRhinoUiResourceManager& CRhinoAppUiManager::ResourceManager  |  ( |   | )
overridevirtual
Implements CRhinoUiManager.
◆ RuntimeClassFromName()
 CRuntimeClass* CRhinoAppUiManager::RuntimeClassFromName  |  ( |  const UUID &  |  plug_in_id,
|  const wchar_t *  |  lpsClassName
)
overridevirtual
Implements CRhinoUiManager.
Member Data Documentation
◆ m_test_resource_manager
 CRhinoAppUiResourceManager CRhinoAppUiManager::m_test_resource_manager
protected