Public Member Functions | Public Attributes | List of all members
CRhinoLoftCurve Class Reference
Rhino
#include <rhinoSdkLoft.h>
 Public Member Functions
CRhinoLoftCurve ()
~CRhinoLoftCurve ()
int  | CloserEnd ()
 Public Attributes
bool  | m_bClosed
bool  | m_bPlanar
bool  | m_bRev
ON_Curve *  | m_curve
ON_3dPoint  | m_pick_point
double  | m_pick_t
ON_Plane  | m_plane
const ON_BrepTrim *  | m_trim
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoLoftCurve()
 CRhinoLoftCurve::CRhinoLoftCurve  |  ( |   | )
◆ ~CRhinoLoftCurve()
 CRhinoLoftCurve::~CRhinoLoftCurve  |  ( |   | )
Member Function Documentation
◆ CloserEnd()
 int CRhinoLoftCurve::CloserEnd  |  ( |   | )
Member Data Documentation
◆ m_bClosed
 bool CRhinoLoftCurve::m_bClosed
◆ m_bPlanar
 bool CRhinoLoftCurve::m_bPlanar
◆ m_bRev
 bool CRhinoLoftCurve::m_bRev
◆ m_curve
 ON_Curve* CRhinoLoftCurve::m_curve
◆ m_pick_point
 ON_3dPoint CRhinoLoftCurve::m_pick_point
◆ m_pick_t
 double CRhinoLoftCurve::m_pick_t
◆ m_plane
 ON_Plane CRhinoLoftCurve::m_plane
◆ m_trim
 const ON_BrepTrim* CRhinoLoftCurve::m_trim