Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiPanelFactory Class Referenceabstract
RhinoUI
#include <RhinoSdkUiDockbarTab.h>
 Public Member Functions
virtual ON_wString  | Caption (void) const =0
void  | Delete ()
bool  | Enabled (void) const
virtual bool  | HasDocumentContext (void) const
virtual HICON  | Icon (const ON_2iSize &sizeInPixels) const =0
CRhinoUiPanel *  | NewDockbarTab (const CRhinoDoc &) const
CRhinoUiPanel *  | NewNonDocDockbarTab (void) const
const ON_UUID &  | PlugInId (void) const
void  | SetEnabled (bool b)
virtual UUID  | TabId (void) const =0
 Protected Member Functions
CRhinoUiPanelFactory (const ON_UUID &uuidPlugInId)
virtual  | ~CRhinoUiPanelFactory ()
virtual void  | DeleteThis (void)=0
virtual CRhinoUiPanel *  | NewTab (unsigned int document_sn) const =0
 Friends
class  | Impl
Constructor & Destructor Documentation
◆ CRhinoUiPanelFactory()
 CRhinoUiPanelFactory::CRhinoUiPanelFactory  |  ( |  const ON_UUID &  |  uuidPlugInId | )
protected
◆ ~CRhinoUiPanelFactory()
 virtual CRhinoUiPanelFactory::~CRhinoUiPanelFactory  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Caption()
 virtual ON_wString CRhinoUiPanelFactory::Caption  |  ( |  void  |   | ) |   const
pure virtual
◆ Delete()
 void CRhinoUiPanelFactory::Delete  |  ( |   | )
◆ DeleteThis()
 virtual void CRhinoUiPanelFactory::DeleteThis  |  ( |  void  |   | )
protectedpure virtual
◆ Enabled()
 bool CRhinoUiPanelFactory::Enabled  |  ( |  void  |   | ) |   const
◆ HasDocumentContext()
 virtual bool CRhinoUiPanelFactory::HasDocumentContext  |  ( |  void  |   | ) |   const
virtual
Return true if you expect a new instance of the panel to be created when documents change. This function returns false by default for C++ panels to retain compatibility with Rhino 5.
◆ Icon()
 virtual HICON CRhinoUiPanelFactory::Icon  |  ( |  const ON_2iSize &  |  sizeInPixels | ) |   const
pure virtual
◆ NewDockbarTab()
 CRhinoUiPanel* CRhinoUiPanelFactory::NewDockbarTab  |  ( |  const CRhinoDoc &  |   | ) |   const
◆ NewNonDocDockbarTab()
 CRhinoUiPanel* CRhinoUiPanelFactory::NewNonDocDockbarTab  |  ( |  void  |   | ) |   const
◆ NewTab()
 virtual CRhinoUiPanel* CRhinoUiPanelFactory::NewTab  |  ( |  unsigned int  |  document_sn | ) |   const
protectedpure virtual
◆ PlugInId()
 const ON_UUID& CRhinoUiPanelFactory::PlugInId  |  ( |  void  |   | ) |   const
◆ SetEnabled()
 void CRhinoUiPanelFactory::SetEnabled  |  ( |  bool  |  b | )
◆ TabId()
 virtual UUID CRhinoUiPanelFactory::TabId  |  ( |  void  |   | ) |   const
pure virtual
Friends And Related Function Documentation
◆ Impl
 friend class Impl
friend