Public Member Functions | List of all members
ON_SubDVertexArray Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDVertexArray ()=default
ON_SubDVertexArray (const ON_SubD &subd)
ON_SubDVertexArray (const ON_SubDVertexArray &)=default
ON_SubDVertexArray &  | operator= (const ON_SubDVertexArray &)=default
const class ON_SubDVertex *  | operator[] (unsigned int i) const
const ON_SubD &  | SubD () const
unsigned int  | VertexCount () const
Detailed Description
ON_SubDVertexArray Description: Avoid using ON_SubDVertexArray. ON_SubDVertexIterator is more efficient and a better choice.
Constructor & Destructor Documentation
◆ ON_SubDVertexArray() [1/3]
 ON_SubDVertexArray::ON_SubDVertexArray  |  ( |  const ON_SubD &  |  subd | )
◆ ON_SubDVertexArray() [2/3]
 ON_SubDVertexArray::ON_SubDVertexArray  |  ( |   | )
default
◆ ON_SubDVertexArray() [3/3]
 ON_SubDVertexArray::ON_SubDVertexArray  |  ( |  const ON_SubDVertexArray &  |   | )
default
Member Function Documentation
◆ operator=()
 ON_SubDVertexArray& ON_SubDVertexArray::operator=  |  ( |  const ON_SubDVertexArray &  |   | )
default
◆ operator[]()
 const class ON_SubDVertex* ON_SubDVertexArray::operator[]  |  ( |  unsigned int  |  i | ) |   const
inline
◆ SubD()
 const ON_SubD& ON_SubDVertexArray::SubD  |  ( |   | ) |   const
inline
◆ VertexCount()
 unsigned int ON_SubDVertexArray::VertexCount  |  ( |   | ) |   const
inline