Public Member Functions | List of all members
CRhinoOptionsPageCollectionItem Class Reference
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
CRhinoOptionsPageCollectionItem (IRhinoOptionsPage *page)
~CRhinoOptionsPageCollectionItem ()
CRhinoOptionsPageCollectionItem *  | AddPage (IRhinoOptionsPage *pageToAdd)
int  | Count () const
CRhinoOptionsPageCollectionItem *  | operator[] (int index) const
IRhinoOptionsPage *  | Page () const
Detailed Description
class CRhinoOptionsPageCollectionItem
Description: A CRhinoOptionsPageCollectionItem representing a item added to a CRhinoOptionsPageCollection.
Constructor & Destructor Documentation
◆ CRhinoOptionsPageCollectionItem()
 CRhinoOptionsPageCollectionItem::CRhinoOptionsPageCollectionItem  |  ( |  IRhinoOptionsPage *  |  page | )
 Description: Constructor Parameters: page[in] Page to manage
◆ ~CRhinoOptionsPageCollectionItem()
 CRhinoOptionsPageCollectionItem::~CRhinoOptionsPageCollectionItem  |  ( |   | )
 Description: Destructor
Member Function Documentation
◆ AddPage()
 CRhinoOptionsPageCollectionItem* CRhinoOptionsPageCollectionItem::AddPage  |  ( |  IRhinoOptionsPage *  |  pageToAdd | )
 Description: Add child page to the managed page Parameters: pageToAdd[in] The child page to add Returns: The new collection item for the child page, use it to nest child pages.
◆ Count()
 int CRhinoOptionsPageCollectionItem::Count  |  ( |   | ) |   const
 Description: Number of child pages directly owned by this page Returns: Returns the number of child pages directly owned by this page
◆ operator[]()
 CRhinoOptionsPageCollectionItem* CRhinoOptionsPageCollectionItem::operator[]  |  ( |  int  |  index | ) |   const
 Description: Child page from index Parameters: index[in] = Zero based index of item to get Returns: Returns the child item if the index is valid otherwise; returns null.
◆ Page()
 IRhinoOptionsPage* CRhinoOptionsPageCollectionItem::Page  |  ( |   | ) |   const
 Description: Page to manage