Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoGetSpiral Class Reference
RhinoGet
#include <rhinoSdkGetSpiral.h>
 Public Member Functions
CArgsRhinoGetSpiral ()
CArgsRhinoGetSpiral (const CArgsRhinoGetSpiral &)
~CArgsRhinoGetSpiral ()
const BOOL32  | AroundCurve () const
const ON_wString &  | CenterPrompt () const
const BOOL32  | DiameterMode () const
const ON_wString &  | DiameterPrompt () const
const ON_3dVector &  | EndDir () const
const ON_3dPoint &  | EndPoint () const
const ON_wString &  | EndPrompt () const
const ON_wString &  | FirstDiameterPrompt () const
const double  | FirstRadius () const
const ON_wString &  | FirstRadiusPrompt () const
const BOOL32  | Flat () const
const BOOL32  | HelixMode () const
const double  | Length () const
CArgsRhinoGetSpiral &  | operator= (const CArgsRhinoGetSpiral &)
const double  | Pitch () const
const BOOL32  | PitchMode () const
const double  | PointsPerTurn () const
const ON_3dPoint &  | RadiusPoint () const
const ON_wString &  | RadiusPrompt () const
ON_Curve *  | Rail () const
const BOOL32  | ReverseTwist () const
const ON_wString &  | SecondDiameterPrompt () const
const double  | SecondRadius () const
const ON_wString &  | SecondRadiusPrompt () const
void  | SetAroundCurve (BOOL32)
void  | SetCenterPrompt (const wchar_t *)
void  | SetDiameterMode (BOOL32)
void  | SetDiameterPrompt (const wchar_t *)
void  | SetEndDir (const ON_3dVector &)
void  | SetEndPoint (const ON_3dPoint &)
void  | SetEndPrompt (const wchar_t *)
void  | SetFirstDiameterPrompt (const wchar_t *)
void  | SetFirstRadius (double)
void  | SetFirstRadiusPrompt (const wchar_t *)
void  | SetFlat (BOOL32)
void  | SetHelixMode (BOOL32)
void  | SetLength (double)
void  | SetPitch (double)
void  | SetPitchMode (BOOL32)
void  | SetPointsPerTurn (double)
void  | SetRadiusPoint (const ON_3dPoint &)
void  | SetRadiusPrompt (const wchar_t *)
void  | SetRail (const ON_Curve *)
void  | SetReverseTwist (BOOL32)
void  | SetSecondDiameterPrompt (const wchar_t *)
void  | SetSecondRadius (double)
void  | SetSecondRadiusPrompt (const wchar_t *)
void  | SetStartDir (const ON_3dVector &)
void  | SetStartPoint (const ON_3dPoint &)
void  | SetStartPrompt (const wchar_t *)
sets More...
void  | SetToleranceWarning (BOOL32)
void  | SetTurns (double)
void  | SetVertical (BOOL32)
const ON_3dVector &  | StartDir () const
const ON_3dPoint &  | StartPoint () const
const ON_wString &  | StartPrompt () const
gets More...
const BOOL32  | ToleranceWarning () const
const double  | Turns () const
const BOOL32  | Vertical () const
 Public Attributes
double  | m_Pitch
BOOL32  | m_PitchMode
double  | m_PointsPerTurn
BOOL32  | m_ReverseTwist
double  | m_Turns
 Protected Attributes
BOOL32  | m_AroundCurve
ON_wString  | m_CenterPrompt
BOOL32  | m_DiameterMode
ON_wString  | m_DiameterPrompt
ON_3dVector  | m_EndDir
ON_3dPoint  | m_EndPoint
ON_wString  | m_EndPrompt
ON_wString  | m_FirstDiameterPrompt
double  | m_FirstRadius
ON_wString  | m_FirstRadiusPrompt
BOOL32  | m_Flat
BOOL32  | m_HelixMode
double  | m_Length
ON_Curve *  | m_pRail
ON_3dPoint  | m_RadiusPoint
ON_wString  | m_RadiusPrompt
ON_wString  | m_SecondDiameterPrompt
double  | m_SecondRadius
ON_wString  | m_SecondRadiusPrompt
ON_3dVector  | m_StartDir
ON_3dPoint  | m_StartPoint
ON_wString  | m_StartPrompt
BOOL32  | m_ToleranceWarning
BOOL32  | m_Vertical
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
 CLASS CArgsRhinoGetSpiral
OVERVIEW TEXT Arguments for RhinoGetHelix and RhinoGetSpiral
KEYWORDS
Helix Spiral RhinoGetHelix RhinoGetSpiral
Constructor & Destructor Documentation
◆ CArgsRhinoGetSpiral() [1/2]
 CArgsRhinoGetSpiral::CArgsRhinoGetSpiral  |  ( |   | )
◆ ~CArgsRhinoGetSpiral()
 CArgsRhinoGetSpiral::~CArgsRhinoGetSpiral  |  ( |   | )
◆ CArgsRhinoGetSpiral() [2/2]
 CArgsRhinoGetSpiral::CArgsRhinoGetSpiral  |  ( |  const CArgsRhinoGetSpiral &  |   | )
Member Function Documentation
◆ AroundCurve()
 const BOOL32 CArgsRhinoGetSpiral::AroundCurve  |  ( |   | ) |   const
◆ CenterPrompt()
 const ON_wString& CArgsRhinoGetSpiral::CenterPrompt  |  ( |   | ) |   const
◆ DiameterMode()
 const BOOL32 CArgsRhinoGetSpiral::DiameterMode  |  ( |   | ) |   const
◆ DiameterPrompt()
 const ON_wString& CArgsRhinoGetSpiral::DiameterPrompt  |  ( |   | ) |   const
◆ EndDir()
 const ON_3dVector& CArgsRhinoGetSpiral::EndDir  |  ( |   | ) |   const
◆ EndPoint()
 const ON_3dPoint& CArgsRhinoGetSpiral::EndPoint  |  ( |   | ) |   const
◆ EndPrompt()
 const ON_wString& CArgsRhinoGetSpiral::EndPrompt  |  ( |   | ) |   const
◆ FirstDiameterPrompt()
 const ON_wString& CArgsRhinoGetSpiral::FirstDiameterPrompt  |  ( |   | ) |   const
◆ FirstRadius()
 const double CArgsRhinoGetSpiral::FirstRadius  |  ( |   | ) |   const
◆ FirstRadiusPrompt()
 const ON_wString& CArgsRhinoGetSpiral::FirstRadiusPrompt  |  ( |   | ) |   const
◆ Flat()
 const BOOL32 CArgsRhinoGetSpiral::Flat  |  ( |   | ) |   const
◆ HelixMode()
 const BOOL32 CArgsRhinoGetSpiral::HelixMode  |  ( |   | ) |   const
◆ Length()
 const double CArgsRhinoGetSpiral::Length  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetSpiral& CArgsRhinoGetSpiral::operator=  |  ( |  const CArgsRhinoGetSpiral &  |   | )
◆ Pitch()
 const double CArgsRhinoGetSpiral::Pitch  |  ( |   | ) |   const
◆ PitchMode()
 const BOOL32 CArgsRhinoGetSpiral::PitchMode  |  ( |   | ) |   const
◆ PointsPerTurn()
 const double CArgsRhinoGetSpiral::PointsPerTurn  |  ( |   | ) |   const
◆ RadiusPoint()
 const ON_3dPoint& CArgsRhinoGetSpiral::RadiusPoint  |  ( |   | ) |   const
◆ RadiusPrompt()
 const ON_wString& CArgsRhinoGetSpiral::RadiusPrompt  |  ( |   | ) |   const
◆ Rail()
 ON_Curve* CArgsRhinoGetSpiral::Rail  |  ( |   | ) |   const
◆ ReverseTwist()
 const BOOL32 CArgsRhinoGetSpiral::ReverseTwist  |  ( |   | ) |   const
◆ SecondDiameterPrompt()
 const ON_wString& CArgsRhinoGetSpiral::SecondDiameterPrompt  |  ( |   | ) |   const
◆ SecondRadius()
 const double CArgsRhinoGetSpiral::SecondRadius  |  ( |   | ) |   const
◆ SecondRadiusPrompt()
 const ON_wString& CArgsRhinoGetSpiral::SecondRadiusPrompt  |  ( |   | ) |   const
◆ SetAroundCurve()
 void CArgsRhinoGetSpiral::SetAroundCurve  |  ( |  BOOL32  |   | )
◆ SetCenterPrompt()
 void CArgsRhinoGetSpiral::SetCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetDiameterMode()
 void CArgsRhinoGetSpiral::SetDiameterMode  |  ( |  BOOL32  |   | )
◆ SetDiameterPrompt()
 void CArgsRhinoGetSpiral::SetDiameterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetEndDir()
 void CArgsRhinoGetSpiral::SetEndDir  |  ( |  const ON_3dVector &  |   | )
◆ SetEndPoint()
 void CArgsRhinoGetSpiral::SetEndPoint  |  ( |  const ON_3dPoint &  |   | )
◆ SetEndPrompt()
 void CArgsRhinoGetSpiral::SetEndPrompt  |  ( |  const wchar_t *  |   | )
◆ SetFirstDiameterPrompt()
 void CArgsRhinoGetSpiral::SetFirstDiameterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetFirstRadius()
 void CArgsRhinoGetSpiral::SetFirstRadius  |  ( |  double  |   | )
◆ SetFirstRadiusPrompt()
 void CArgsRhinoGetSpiral::SetFirstRadiusPrompt  |  ( |  const wchar_t *  |   | )
◆ SetFlat()
 void CArgsRhinoGetSpiral::SetFlat  |  ( |  BOOL32  |   | )
◆ SetHelixMode()
 void CArgsRhinoGetSpiral::SetHelixMode  |  ( |  BOOL32  |   | )
◆ SetLength()
 void CArgsRhinoGetSpiral::SetLength  |  ( |  double  |   | )
◆ SetPitch()
 void CArgsRhinoGetSpiral::SetPitch  |  ( |  double  |   | )
◆ SetPitchMode()
 void CArgsRhinoGetSpiral::SetPitchMode  |  ( |  BOOL32  |   | )
◆ SetPointsPerTurn()
 void CArgsRhinoGetSpiral::SetPointsPerTurn  |  ( |  double  |   | )
◆ SetRadiusPoint()
 void CArgsRhinoGetSpiral::SetRadiusPoint  |  ( |  const ON_3dPoint &  |   | )
◆ SetRadiusPrompt()
 void CArgsRhinoGetSpiral::SetRadiusPrompt  |  ( |  const wchar_t *  |   | )
◆ SetRail()
 void CArgsRhinoGetSpiral::SetRail  |  ( |  const ON_Curve *  |   | )
◆ SetReverseTwist()
 void CArgsRhinoGetSpiral::SetReverseTwist  |  ( |  BOOL32  |   | )
◆ SetSecondDiameterPrompt()
 void CArgsRhinoGetSpiral::SetSecondDiameterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetSecondRadius()
 void CArgsRhinoGetSpiral::SetSecondRadius  |  ( |  double  |   | )
◆ SetSecondRadiusPrompt()
 void CArgsRhinoGetSpiral::SetSecondRadiusPrompt  |  ( |  const wchar_t *  |   | )
◆ SetStartDir()
 void CArgsRhinoGetSpiral::SetStartDir  |  ( |  const ON_3dVector &  |   | )
◆ SetStartPoint()
 void CArgsRhinoGetSpiral::SetStartPoint  |  ( |  const ON_3dPoint &  |   | )
◆ SetStartPrompt()
 void CArgsRhinoGetSpiral::SetStartPrompt  |  ( |  const wchar_t *  |   | )
sets
◆ SetToleranceWarning()
 void CArgsRhinoGetSpiral::SetToleranceWarning  |  ( |  BOOL32  |   | )
◆ SetTurns()
 void CArgsRhinoGetSpiral::SetTurns  |  ( |  double  |   | )
◆ SetVertical()
 void CArgsRhinoGetSpiral::SetVertical  |  ( |  BOOL32  |   | )
◆ StartDir()
 const ON_3dVector& CArgsRhinoGetSpiral::StartDir  |  ( |   | ) |   const
◆ StartPoint()
 const ON_3dPoint& CArgsRhinoGetSpiral::StartPoint  |  ( |   | ) |   const
◆ StartPrompt()
 const ON_wString& CArgsRhinoGetSpiral::StartPrompt  |  ( |   | ) |   const
gets
◆ ToleranceWarning()
 const BOOL32 CArgsRhinoGetSpiral::ToleranceWarning  |  ( |   | ) |   const
◆ Turns()
 const double CArgsRhinoGetSpiral::Turns  |  ( |   | ) |   const
◆ Vertical()
 const BOOL32 CArgsRhinoGetSpiral::Vertical  |  ( |   | ) |   const
Member Data Documentation
◆ m_AroundCurve
 BOOL32 CArgsRhinoGetSpiral::m_AroundCurve
protected
◆ m_CenterPrompt
 ON_wString CArgsRhinoGetSpiral::m_CenterPrompt
protected
◆ m_DiameterMode
 BOOL32 CArgsRhinoGetSpiral::m_DiameterMode
protected
◆ m_DiameterPrompt
 ON_wString CArgsRhinoGetSpiral::m_DiameterPrompt
protected
◆ m_EndDir
 ON_3dVector CArgsRhinoGetSpiral::m_EndDir
protected
◆ m_EndPoint
 ON_3dPoint CArgsRhinoGetSpiral::m_EndPoint
protected
◆ m_EndPrompt
 ON_wString CArgsRhinoGetSpiral::m_EndPrompt
protected
◆ m_FirstDiameterPrompt
 ON_wString CArgsRhinoGetSpiral::m_FirstDiameterPrompt
protected
◆ m_FirstRadius
 double CArgsRhinoGetSpiral::m_FirstRadius
protected
◆ m_FirstRadiusPrompt
 ON_wString CArgsRhinoGetSpiral::m_FirstRadiusPrompt
protected
◆ m_Flat
 BOOL32 CArgsRhinoGetSpiral::m_Flat
protected
◆ m_HelixMode
 BOOL32 CArgsRhinoGetSpiral::m_HelixMode
protected
◆ m_Length
 double CArgsRhinoGetSpiral::m_Length
protected
◆ m_Pitch
 double CArgsRhinoGetSpiral::m_Pitch
◆ m_PitchMode
 BOOL32 CArgsRhinoGetSpiral::m_PitchMode
◆ m_PointsPerTurn
 double CArgsRhinoGetSpiral::m_PointsPerTurn
◆ m_pRail
 ON_Curve* CArgsRhinoGetSpiral::m_pRail
protected
◆ m_RadiusPoint
 ON_3dPoint CArgsRhinoGetSpiral::m_RadiusPoint
protected
◆ m_RadiusPrompt
 ON_wString CArgsRhinoGetSpiral::m_RadiusPrompt
protected
◆ m_ReverseTwist
 BOOL32 CArgsRhinoGetSpiral::m_ReverseTwist
◆ m_SecondDiameterPrompt
 ON_wString CArgsRhinoGetSpiral::m_SecondDiameterPrompt
protected
◆ m_SecondRadius
 double CArgsRhinoGetSpiral::m_SecondRadius
protected
◆ m_SecondRadiusPrompt
 ON_wString CArgsRhinoGetSpiral::m_SecondRadiusPrompt
protected
◆ m_StartDir
 ON_3dVector CArgsRhinoGetSpiral::m_StartDir
protected
◆ m_StartPoint
 ON_3dPoint CArgsRhinoGetSpiral::m_StartPoint
protected
◆ m_StartPrompt
 ON_wString CArgsRhinoGetSpiral::m_StartPrompt
protected
◆ m_ToleranceWarning
 BOOL32 CArgsRhinoGetSpiral::m_ToleranceWarning
protected
◆ m_Turns
 double CArgsRhinoGetSpiral::m_Turns
◆ m_Vertical
 BOOL32 CArgsRhinoGetSpiral::m_Vertical
protected