Static Public Member Functions | List of all members
CRhinoGetDimRadial Class Reference
Rhino
Class to interactively get user input for radial dimensions. More...
#include <rhinoSdkDimRadius.h>
 Static Public Member Functions
static CRhinoCommand::result  | GetDimRadial (unsigned int doc_sn, ON_DimRadial *&dim_out, CRhinoObjRef &point_ref, bool bInteractive, bool GetDiameter)
Detailed Description
Class to interactively get user input for radial dimensions.
Member Function Documentation
◆ GetDimRadial()
 static CRhinoCommand::result CRhinoGetDimRadial::GetDimRadial  |  ( |  unsigned int  |  doc_sn,
|  ON_DimRadial *&  |  dim_out,
|  CRhinoObjRef &  |  point_ref,
|  bool  |  bInteractive,
|  bool  |  GetDiameter
)
static
Description: Gets a radial dimension from user input Will allocate dim_out memory which caller must delete Parameters: doc_sn, [in] Serial no of the document for annotation styles output_dimension [out] Resulting dimension point_ref, [out] ObjRef of object selected to dimension bInteractive, [in] true: run in interactive mode false - run in script mode bGetDiameter [in] true - Get a diameter dimension false - Get a radius dimension Returns: Failure: No dimension gotten Success: Got a dimension