Public Member Functions | Public Attributes | List of all members
CRhinoUiLayerListCtrlItem Class Reference
RhinoUI
CRhinoUiLayerListCtrlItem. More...
#include <rhinoSdkUiLayerListCtrl.h>
 Public Member Functions
CRhinoUiLayerListCtrlItem ()
CRhinoUiLayerListCtrlItem (const CRhinoUiLayerListCtrlItem &src)
virtual  | ~CRhinoUiLayerListCtrlItem ()
virtual CRhinoUiLayerListCtrlItem &  | operator= (const CRhinoUiLayerListCtrlItem &src)
 Public Attributes
bool  | m_bChildren
bool  | m_bExpanded
int  | m_indent
int  | m_layer_index
ON_wString  | m_layer_name
Detailed Description
CRhinoUiLayerListCtrlItem.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiLayerListCtrlItem() [1/2]
 CRhinoUiLayerListCtrlItem::CRhinoUiLayerListCtrlItem  |  ( |   | )
◆ CRhinoUiLayerListCtrlItem() [2/2]
 CRhinoUiLayerListCtrlItem::CRhinoUiLayerListCtrlItem  |  ( |  const CRhinoUiLayerListCtrlItem &  |  src | )
◆ ~CRhinoUiLayerListCtrlItem()
 virtual CRhinoUiLayerListCtrlItem::~CRhinoUiLayerListCtrlItem  |  ( |   | )
virtual
Member Function Documentation
◆ operator=()
 virtual CRhinoUiLayerListCtrlItem& CRhinoUiLayerListCtrlItem::operator=  |  ( |  const CRhinoUiLayerListCtrlItem &  |  src | )
virtual
Member Data Documentation
◆ m_bChildren
 bool CRhinoUiLayerListCtrlItem::m_bChildren
◆ m_bExpanded
 bool CRhinoUiLayerListCtrlItem::m_bExpanded
◆ m_indent
 int CRhinoUiLayerListCtrlItem::m_indent
◆ m_layer_index
 int CRhinoUiLayerListCtrlItem::m_layer_index
◆ m_layer_name
 ON_wString CRhinoUiLayerListCtrlItem::m_layer_name