Public Member Functions | Public Attributes | List of all members
CRhRdkRenderPlugInIterator::Info Class Referencefinal
#include <RhRdkRenderPlugInIterator.h>
 Public Member Functions
Info ()
 Public Attributes
CRhRdkRenderPlugIn *  | m_pRdkRenderPlugIn
void *  | m_pReserved
CRhinoRenderPlugIn *  | m_pRhinoRenderPlugIn
ON_wString  | m_sPlugInName
UUID  | m_uuidPlugIn
Constructor & Destructor Documentation
◆ Info()
 CRhRdkRenderPlugInIterator::Info::Info  |  ( |   | )
Member Data Documentation
◆ m_pRdkRenderPlugIn
 CRhRdkRenderPlugIn* CRhRdkRenderPlugInIterator::Info::m_pRdkRenderPlugIn
◆ m_pReserved
 void* CRhRdkRenderPlugInIterator::Info::m_pReserved
◆ m_pRhinoRenderPlugIn
 CRhinoRenderPlugIn* CRhRdkRenderPlugInIterator::Info::m_pRhinoRenderPlugIn
◆ m_sPlugInName
 ON_wString CRhRdkRenderPlugInIterator::Info::m_sPlugInName
◆ m_uuidPlugIn
 UUID CRhRdkRenderPlugInIterator::Info::m_uuidPlugIn