Public Member Functions | Friends | List of all members
CRhinoUiExpandableTabCtrlItem_New Class Reference
RhinoUI
#include <RhinoSdkUiExpandableTabCtrl.h>
 Public Member Functions
virtual  | ~CRhinoUiExpandableTabCtrlItem_New ()
CDialog *  | GetDialogPage (void) const
bool  | ItemState (CRhinoUiExpandableTabCtrlItem::item_states flag) const
 Friends
class  | CRhinoUiExpandableTabCtrl_New
Constructor & Destructor Documentation
◆ ~CRhinoUiExpandableTabCtrlItem_New()
 virtual CRhinoUiExpandableTabCtrlItem_New::~CRhinoUiExpandableTabCtrlItem_New  |  ( |   | )
virtual
Member Function Documentation
◆ GetDialogPage()
 CDialog* CRhinoUiExpandableTabCtrlItem_New::GetDialogPage  |  ( |  void  |   | ) |   const
◆ ItemState()
 bool CRhinoUiExpandableTabCtrlItem_New::ItemState  |  ( |  CRhinoUiExpandableTabCtrlItem::item_states  |  flag | ) |   const
Friends And Related Function Documentation
◆ CRhinoUiExpandableTabCtrl_New
 friend class CRhinoUiExpandableTabCtrl_New
friend