Public Attributes | List of all members
CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS Class Reference
#include <RhRdkPlugIn.h>
 Public Attributes
bool  | bAffectBackground = true
bool  | bAffectGroundPlane = true
bool  | bAffectLights = true
bool  | bAffectMaterials = true
bool  | bReserved0 = false
bool  | bReserved1 = false
bool  | bReserved2 = false
bool  | bReserved3 = false
Member Data Documentation
◆ bAffectBackground
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bAffectBackground = true
◆ bAffectGroundPlane
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bAffectGroundPlane = true
◆ bAffectLights
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bAffectLights = true
◆ bAffectMaterials
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bAffectMaterials = true
◆ bReserved0
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bReserved0 = false
◆ bReserved1
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bReserved1 = false
◆ bReserved2
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bReserved2 = false
◆ bReserved3
 bool CRhRdkRenderPlugIn::RENDER_ARCTIC_OPTIONS::bReserved3 = false