Public Types | Public Member Functions | List of all members
CRhRdkSSData Class Reference
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkSSData:
 Public Types
enum  | Usage : unsigned int { Usage::Synchronous, Usage::Asynchronous }
 Public Member Functions
CRhRdkSSData (const CRhRdkPreviewGeometry *pGeo, const CRhRdkPreviewBackground *pBack, const CRhRdkPreviewLighting *pLight, Usage u)
virtual  | ~CRhRdkSSData ()
const CRhRdkPreviewBackground *  | Background (void) const
const CRhRdkPreviewGeometry *  | Geometry (void) const
Usage  | GetUsage (void) const
const CRhRdkPreviewLighting *  | Lighting (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class contains data about the preview scene server.
Member Enumeration Documentation
◆ Usage
 enum CRhRdkSSData::Usage : unsigned int
strong
Enumerator
Synchronous
Asynchronous
Constructor & Destructor Documentation
◆ CRhRdkSSData()
 CRhRdkSSData::CRhRdkSSData  |  ( |  const CRhRdkPreviewGeometry *  |  pGeo,
|  const CRhRdkPreviewBackground *  |  pBack,
|  const CRhRdkPreviewLighting *  |  pLight,
|  Usage  |  u
)
◆ ~CRhRdkSSData()
 virtual CRhRdkSSData::~CRhRdkSSData  |  ( |   | )
virtual
Member Function Documentation
◆ Background()
 const CRhRdkPreviewBackground* CRhRdkSSData::Background  |  ( |  void  |   | ) |   const
◆ Geometry()
 const CRhRdkPreviewGeometry* CRhRdkSSData::Geometry  |  ( |  void  |   | ) |   const
◆ GetUsage()
 Usage CRhRdkSSData::GetUsage  |  ( |  void  |   | ) |   const
◆ Lighting()
 const CRhRdkPreviewLighting* CRhRdkSSData::Lighting  |  ( |  void  |   | ) |   const