Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmRevisionHistory Class Reference
OpenNURBS
#include <opennurbs_3dm_properties.h>
 Public Member Functions
ON_3dmRevisionHistory ()
ON_3dmRevisionHistory (const ON_3dmRevisionHistory &)=default
~ON_3dmRevisionHistory ()=default
bool  | CreateTimeIsSet () const
void  | Dump (ON_TextLog &) const
bool  | IsEmpty () const
bool  | IsValid () const
bool  | LastEditedTimeIsSet () const
int  | NewRevision ()
returns updated revision count More...
ON_3dmRevisionHistory &  | operator= (const ON_3dmRevisionHistory &)=default
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Static Public Member Functions
static ON_3dmRevisionHistory  | FirstRevision ()
 Public Attributes
struct tm  | m_create_time
UCT create time. More...
struct tm  | m_last_edit_time
UCT las edited time. More...
int  | m_revision_count = 0
ON_wString  | m_sCreatedBy
ON_wString  | m_sLastEditedBy
 Static Public Attributes
static const ON_3dmRevisionHistory  | Empty
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_3dmRevisionHistory() [1/2]
 ON_3dmRevisionHistory::ON_3dmRevisionHistory  |  ( |   | )
Default construction sets this = ON_3dmRevisionHistory::Empty
◆ ~ON_3dmRevisionHistory()
 ON_3dmRevisionHistory::~ON_3dmRevisionHistory  |  ( |   | )
default
◆ ON_3dmRevisionHistory() [2/2]
 ON_3dmRevisionHistory::ON_3dmRevisionHistory  |  ( |  const ON_3dmRevisionHistory &  |   | )
default
Member Function Documentation
◆ CreateTimeIsSet()
 bool ON_3dmRevisionHistory::CreateTimeIsSet  |  ( |   | ) |   const
Returns: true if m_create_time is >= January 1, 1970
◆ Dump()
 void ON_3dmRevisionHistory::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ FirstRevision()
 static ON_3dmRevisionHistory ON_3dmRevisionHistory::FirstRevision  |  ( |   | )
static
Returns: A revision history with m_revision_count = 1 m_create_time = now m_last_edit_time = now m_sCreatedBy = current user m_sLastEditedBy = current user
◆ IsEmpty()
 bool ON_3dmRevisionHistory::IsEmpty  |  ( |   | ) |   const
◆ IsValid()
 bool ON_3dmRevisionHistory::IsValid  |  ( |   | ) |   const
◆ LastEditedTimeIsSet()
 bool ON_3dmRevisionHistory::LastEditedTimeIsSet  |  ( |   | ) |   const
Returns: true if m_last_edit_time is >= January 1, 1970
◆ NewRevision()
 int ON_3dmRevisionHistory::NewRevision  |  ( |   | )
returns updated revision count
◆ operator=()
 ON_3dmRevisionHistory& ON_3dmRevisionHistory::operator=  |  ( |  const ON_3dmRevisionHistory &  |   | )
default
◆ Read()
 bool ON_3dmRevisionHistory::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmRevisionHistory::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_3dmRevisionHistory ON_3dmRevisionHistory::Empty
static
Description: The Empty revision has a revision number zero, all time values set to zero and all string values empty.
◆ m_create_time
 struct tm ON_3dmRevisionHistory::m_create_time
UCT create time.
◆ m_last_edit_time
 struct tm ON_3dmRevisionHistory::m_last_edit_time
UCT las edited time.
◆ m_revision_count
 int ON_3dmRevisionHistory::m_revision_count = 0
◆ m_sCreatedBy
 ON_wString ON_3dmRevisionHistory::m_sCreatedBy
◆ m_sLastEditedBy
 ON_wString ON_3dmRevisionHistory::m_sLastEditedBy