Classes | Public Member Functions | Public Attributes | List of all members
ON_RtfFirstChar Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Inheritance diagram for ON_RtfFirstChar:
 Classes
class  | TextRun
 Public Member Functions
ON_RtfFirstChar (const ON_DimStyle *dimstyle, double height, ON_Color color)
virtual  | ~ON_RtfFirstChar ()
bool  | AppendCodePoint (ON__UINT32 codept) override
void  | BeginColorTable () override
void  | BeginFontTable () override
void  | BeginHeader () override
void  | Bold (const wchar_t *value) override
void  | FontTag (const wchar_t *value) override
void  | GroupBegin () override
virtuals More...
void  | GroupEnd () override
bool  | InColorTable ()
void  | InitStringBuilder (const ON_DimStyle *default_style)
void  | Italic (const wchar_t *value) override
const ON_wString  | OutputString ()
TextRun  | PopRun ()
void  | PushRun (TextRun &run)
void  | RunBegin () override
void  | RunEnd () override
void  | SetInColorTable (bool b)
void  | Strikethrough (const wchar_t *value) override
void  | TextField (const wchar_t *name) override
void  | UnderlineOff () override
void  | UnderlineOn () override
 Public Member Functions inherited from ON_TextBuilder
ON_TextBuilder ()
virtual  | ~ON_TextBuilder ()
virtual void  | Bullet ()
virtual void  | CharSet (const wchar_t *value)
unsigned int  | CharSetFromMap (int nval)
virtual void  | CodePage (const wchar_t *value)
unsigned int  | CodePageFromMap (int nval)
virtual void  | ColorBackground (const wchar_t *value)
virtual void  | ColorBlue (const wchar_t *value)
virtual void  | ColorForeground (const wchar_t *value)
virtual void  | ColorGreen (const wchar_t *value)
virtual void  | ColorRed (const wchar_t *value)
virtual void  | DefaultFont (const wchar_t *value)
virtual void  | EmDash ()
virtual void  | EnDash ()
const ON_wString  | FaceNameFromMap (int nval)
virtual void  | FinishFontDef ()
virtual void  | FlushText (size_t count, ON__UINT32 *cp_array)
virtual void  | FontSize (const wchar_t *value)
virtual void  | FormatChange ()
virtual void  | InitBuilder (const ON_Font *default_font)
virtual void  | LDblQuote ()
virtual void  | LQuote ()
virtual void  | Newline ()
virtual void  | NoSuperSub ()
virtual void  | Paragraph ()
virtual void  | ParagraphDefaults ()
virtual void  | RDblQuote ()
virtual bool  | ReadingFontDefinition ()
virtual bool  | ReadingFontTable ()
virtual void  | RQuote ()
ON__UINT32 *  | RunCodePoints (const ON_TextRun &run)
virtual void  | Section ()
virtual void  | SetReadingFontDefinition (bool b)
virtual void  | SetStackScale (const wchar_t *value)
virtual void  | StackEnd ()
virtual void  | StackFraction (const wchar_t *value)
virtual void  | Subscript ()
virtual void  | Superscript ()
virtual void  | Tab ()
virtual void  | UniCpCount (const wchar_t *value)
virtual void  | UniDecimal (const wchar_t *value)
virtual void  | UniDest (const wchar_t *value)
virtual void  | UniEmbeddedDest (const wchar_t *value)
 Public Attributes
TextRun  | m_current_run
ON_ClassArray< TextRun >  | m_run_stack
 Public Attributes inherited from ON_TextBuilder
ON_SimpleArray< ON__UINT32 >  | m_current_codepoints
TextProps  | m_current_props
ON__UINT16  | m_current_UTF16_buffer [2]
ON__INT32  | m_current_UTF16_buffer_count = 0
ON__INT32  | m_default_font_index = 0
ON_ClassArray< ON_FaceNameKey >  | m_facename_map
ON__INT32  | m_font_index = 0
ON__INT32  | m_font_table_level = 10000
ON__INT32  | m_in_run
ON__INT32  | m_level = 0
ON_ClassArray< TextProps >  | m_prop_stack
 Additional Inherited Members
 Public Types inherited from ON_TextBuilder
enum  | : ON__UINT16 { m_UFT16_waiting_mark = 0xEEEE, m_UFT16_unused_mark = 0xFFFF }
Constructor & Destructor Documentation
◆ ON_RtfFirstChar()
 ON_RtfFirstChar::ON_RtfFirstChar  |  ( |  const ON_DimStyle *  |  dimstyle,
|  double  |  height,
|  ON_Color  |  color
)
◆ ~ON_RtfFirstChar()
 virtual ON_RtfFirstChar::~ON_RtfFirstChar  |  ( |   | )
virtual
Member Function Documentation
◆ AppendCodePoint()
 bool ON_RtfFirstChar::AppendCodePoint  |  ( |  ON__UINT32  |  codept | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginColorTable()
 void ON_RtfFirstChar::BeginColorTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginFontTable()
 void ON_RtfFirstChar::BeginFontTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginHeader()
 void ON_RtfFirstChar::BeginHeader  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Bold()
 void ON_RtfFirstChar::Bold  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FontTag()
 void ON_RtfFirstChar::FontTag  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ GroupBegin()
 void ON_RtfFirstChar::GroupBegin  |  ( |   | )
overridevirtual
virtuals
Reimplemented from ON_TextBuilder.
◆ GroupEnd()
 void ON_RtfFirstChar::GroupEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ InColorTable()
 bool ON_RtfFirstChar::InColorTable  |  ( |   | )
bool InFontTable(); void SetInFontTable(bool b);
◆ InitStringBuilder()
 void ON_RtfFirstChar::InitStringBuilder  |  ( |  const ON_DimStyle *  |  default_style | )
◆ Italic()
 void ON_RtfFirstChar::Italic  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ OutputString()
 const ON_wString ON_RtfFirstChar::OutputString  |  ( |   | )
◆ PopRun()
 TextRun ON_RtfFirstChar::PopRun  |  ( |   | )
◆ PushRun()
 void ON_RtfFirstChar::PushRun  |  ( |  TextRun &  |  run | )
◆ RunBegin()
 void ON_RtfFirstChar::RunBegin  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ RunEnd()
 void ON_RtfFirstChar::RunEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ SetInColorTable()
 void ON_RtfFirstChar::SetInColorTable  |  ( |  bool  |  b | )
◆ Strikethrough()
 void ON_RtfFirstChar::Strikethrough  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ TextField()
 void ON_RtfFirstChar::TextField  |  ( |  const wchar_t *  |  name | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOff()
 void ON_RtfFirstChar::UnderlineOff  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOn()
 void ON_RtfFirstChar::UnderlineOn  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
Member Data Documentation
◆ m_current_run
 TextRun ON_RtfFirstChar::m_current_run
◆ m_run_stack
 ON_ClassArray< TextRun > ON_RtfFirstChar::m_run_stack