Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiDialogSub Class Reference
RhinoUI
CRhinoUiDialogSub. More...
#include <RhinoSdkUiDirDialog.h>
 Inheritance diagram for CRhinoUiDialogSub:
 Public Member Functions
CRhinoUiDialogSub ()
virtual  | ~CRhinoUiDialogSub ()
 Protected Member Functions
afx_msg void  | OnChangeEditPath ()
afx_msg void  | OnOK ()
OK button clicked. More...
 Protected Attributes
class CRhinoUiDirDialog *  | m_pPathDialog
 Friends
class  | CRhinoUiDirDialog
Detailed Description
CRhinoUiDialogSub.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoUiDialogSub()
 CRhinoUiDialogSub::CRhinoUiDialogSub  |  ( |   | )
◆ ~CRhinoUiDialogSub()
 virtual CRhinoUiDialogSub::~CRhinoUiDialogSub  |  ( |   | )
virtual
Member Function Documentation
◆ OnChangeEditPath()
 afx_msg void CRhinoUiDialogSub::OnChangeEditPath  |  ( |   | )
protected
◆ OnOK()
 afx_msg void CRhinoUiDialogSub::OnOK  |  ( |   | )
protected
OK button clicked.
Friends And Related Function Documentation
◆ CRhinoUiDirDialog
 friend class CRhinoUiDirDialog
friend
Member Data Documentation
◆ m_pPathDialog
 class CRhinoUiDirDialog* CRhinoUiDialogSub::m_pPathDialog
protected