Public Member Functions | List of all members
CRhinoWaitCursor Class Reference
Rhino
#include <rhinoSdkMouse.h>
 Public Member Functions
CRhinoWaitCursor ()
~CRhinoWaitCursor ()
Detailed Description
Same as a CWaitCursor with the difference that no wait cursor is applied when Rhino is "headless"
Constructor & Destructor Documentation
◆ CRhinoWaitCursor()
 CRhinoWaitCursor::CRhinoWaitCursor  |  ( |   | )
◆ ~CRhinoWaitCursor()
 CRhinoWaitCursor::~CRhinoWaitCursor  |  ( |   | )