Public Member Functions | Protected Attributes | List of all members
ON_DimStyleContext Class Reference
OpenNURBS
#include <opennurbs_dimensionstyle.h>
 Inheritance diagram for ON_DimStyleContext:
 Public Member Functions
ON_DimStyleContext ()=default
ON_DimStyleContext (const ON_DimStyleContext &)=default
virtual  | ~ON_DimStyleContext ()
virtual bool  | AddDimStyle (const ON_DimStyle &dim_style, bool bResolveNameAndIdConflicts)
virtual const ON_DimStyle &  | CurrentDimStyle () const
virtual const ON_DimStyle *  | DimStyleFromContentHash (const ON_SHA1_Hash &content_hash, const ON_DimStyle *not_found_result=nullptr) const
virtual const ON_DimStyle *  | DimStyleFromFont (const ON_Font &font, double model_space_text_scale, double text_height, ON::LengthUnitSystem text_height_unit_system, bool bReturnClosestMatch=true, const ON_DimStyle *not_found_result=nullptr) const
virtual const ON_DimStyle *  | DimStyleFromId (ON_UUID id, const ON_DimStyle *not_found_result=nullptr) const
virtual const ON_DimStyle *  | DimStyleFromName (const ON_NameHash &name_hash, const ON_DimStyle *not_found_result=nullptr) const
virtual const ON_DimStyle *  | FirstDimStyle (bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const
virtual ON__UINT64  | ModelSerialNumber () const
virtual ON::LengthUnitSystem  | ModelUnitSystem () const
virtual bool  | ModifyDimStyle (ON_UUID model_dim_style_id, const ON_DimStyle &dim_style)
virtual const ON_DimStyle *  | NextDimStyle (ON_UUID id, bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const
ON_DimStyleContext &  | operator= (const ON_DimStyleContext &)=default
virtual const ON_DimStyle *  | PrevDimStyle (ON_UUID id, bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const
 Protected Attributes
ON__UINT64  | m_model_serial_number = 0
ON::LengthUnitSystem  | m_unit_system = ON::LengthUnitSystem::Millimeters
Detailed Description
Description: A general and portable interface to access a model's available dimension styles. Remarks: The Rhino C++ SDK function CRhinoDoc.DimStyleContext() will return an ON_DimStyleContext for the Rhino model. The ONX_Model function ONX_Model.DimStyleContext() will return an ON_DimStyleContext for ONX_Model model.
Constructor & Destructor Documentation
◆ ON_DimStyleContext() [1/2]
 ON_DimStyleContext::ON_DimStyleContext  |  ( |   | )
default
◆ ~ON_DimStyleContext()
 virtual ON_DimStyleContext::~ON_DimStyleContext  |  ( |   | )
virtual
◆ ON_DimStyleContext() [2/2]
 ON_DimStyleContext::ON_DimStyleContext  |  ( |  const ON_DimStyleContext &  |   | )
default
Member Function Documentation
◆ AddDimStyle()
 virtual bool ON_DimStyleContext::AddDimStyle  |  ( |  const ON_DimStyle &  |  dim_style,
|  bool  |  bResolveNameAndIdConflicts
)
virtual
◆ CurrentDimStyle()
 virtual const ON_DimStyle& ON_DimStyleContext::CurrentDimStyle  |  ( |   | ) |   const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ DimStyleFromContentHash()
 virtual const ON_DimStyle* ON_DimStyleContext::DimStyleFromContentHash  |  ( |  const ON_SHA1_Hash &  |  content_hash,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ DimStyleFromFont()
 virtual const ON_DimStyle* ON_DimStyleContext::DimStyleFromFont  |  ( |  const ON_Font &  |  font,
|  double  |  model_space_text_scale,
|  double  |  text_height,
|  ON::LengthUnitSystem  |  text_height_unit_system,
|  bool  |  bReturnClosestMatch = true,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ DimStyleFromId()
 virtual const ON_DimStyle* ON_DimStyleContext::DimStyleFromId  |  ( |  ON_UUID  |  id,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ DimStyleFromName()
 virtual const ON_DimStyle* ON_DimStyleContext::DimStyleFromName  |  ( |  const ON_NameHash &  |  name_hash,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ FirstDimStyle()
 virtual const ON_DimStyle* ON_DimStyleContext::FirstDimStyle  |  ( |  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ ModelSerialNumber()
 virtual ON__UINT64 ON_DimStyleContext::ModelSerialNumber  |  ( |   | ) |   const
virtual
◆ ModelUnitSystem()
 virtual ON::LengthUnitSystem ON_DimStyleContext::ModelUnitSystem  |  ( |   | ) |   const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ ModifyDimStyle()
 virtual bool ON_DimStyleContext::ModifyDimStyle  |  ( |  ON_UUID  |  model_dim_style_id,
|  const ON_DimStyle &  |  dim_style
)
virtual
◆ NextDimStyle()
 virtual const ON_DimStyle* ON_DimStyleContext::NextDimStyle  |  ( |  ON_UUID  |  id,
|  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
◆ operator=()
 ON_DimStyleContext& ON_DimStyleContext::operator=  |  ( |  const ON_DimStyleContext &  |   | )
default
◆ PrevDimStyle()
 virtual const ON_DimStyle* ON_DimStyleContext::PrevDimStyle  |  ( |  ON_UUID  |  id,
|  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
virtual
Reimplemented in CRhinoDimStyleContext.
Member Data Documentation
◆ m_model_serial_number
 ON__UINT64 ON_DimStyleContext::m_model_serial_number = 0
mutableprotected
◆ m_unit_system
 ON::LengthUnitSystem ON_DimStyleContext::m_unit_system = ON::LengthUnitSystem::Millimeters
mutableprotected