Public Attributes | List of all members
ON_FixedSizePoolElement Class Reference
OpenNURBS
#include <opennurbs_fsp.h>
 Public Attributes
ON_FixedSizePoolElement *  | m_next
next element - intentionally not initialized because instantiation is not permitted. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Data Documentation
◆ m_next
 ON_FixedSizePoolElement* ON_FixedSizePoolElement::m_next
next element - intentionally not initialized because instantiation is not permitted.