Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmSettings Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmSettings ()=default
ON_3dmSettings (const ON_3dmSettings &)=default
~ON_3dmSettings ()=default
ON_UUID  | CurrentDimensionStyleId () const
int  | CurrentDimensionStyleIndex () const
ON_UUID  | CurrentHatchPatternId () const
ON_UUID  | CurrentLayerId () const
int  | CurrentLayerIndex () const
ON_UUID  | CurrentLinePatternId () const
int  | CurrentLinePatternIndex () const
ON_UUID  | CurrentMaterialId () const
int  | CurrentMaterialIndex () const
ON_UUID  | CurrentTextStyleId () const
int  | CurrentTextStyleIndex () const
void  | Dump (ON_TextLog &) const
ON_3dmSettings &  | operator= (const ON_3dmSettings &)=default
bool  | Read (ON_BinaryArchive &)
ON_MeshParameters::MESH_STYLE  | RenderMeshStyle (ON_MeshParameters::MESH_STYLE no_match_found_result) const
void  | SetCurrentDimensionStyleId (ON_UUID dimension_style_id)
void  | SetCurrentHatchPatternId (ON_UUID hatch_pattern_id)
void  | SetCurrentLayerId (ON_UUID layer_id)
void  | SetCurrentLinePatternId (ON_UUID line_pattern_id)
void  | SetCurrentMaterialId (ON_UUID material_id)
void  | SetCurrentTextStyleId (ON_UUID text_style_id)
void  | SetV5CurrentLayerIndex (int V5_current_layer_index)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_UUID  | m_active_view_id = ON_nil_uuid
id of "active" viewport
 More...
ON_MeshParameters  | m_AnalysisMeshSettings = ON_MeshParameters::DefaultAnalysisMesh
settings used for automatically created analysis meshes More...
ON_3dmAnnotationSettings  | m_AnnotationSettings
settings used when annotation objects are created More...
ON_Color  | m_current_color = ON_Color::Black
ON::object_color_source  | m_current_color_source = ON::color_from_layer
ON::object_linetype_source  | m_current_linetype_source = ON::linetype_from_layer
ON::object_material_source  | m_current_material_source = ON::material_from_layer
ON_Color  | m_current_plot_color = ON_Color::UnsetColor
ON::plot_color_source  | m_current_plot_color_source = ON::plot_color_from_layer
int  | m_current_wire_density = 1
ON_MeshParameters  | m_CustomRenderMeshSettings = ON_MeshParameters::DefaultMesh
saved custom settings More...
ON_EarthAnchorPoint  | m_earth_anchor_point = ON_EarthAnchorPoint::Unset
ON_3dmConstructionPlaneGridDefaults  | m_GridDefaults = ON_3dmConstructionPlaneGridDefaults::Default
default settings for construction plane grids More...
ON_3dmIOSettings  | m_IO_settings = ON_3dmIOSettings::Default
double  | m_linetype_display_scale = 1.0
ON_3dPoint  | m_model_basepoint = ON_3dPoint::Origin
ON_wString  | m_model_URL = ON_wString::EmptyString
model URL (can be empty) More...
ON_3dmUnitsAndTolerances  | m_ModelUnitsAndTolerances = ON_3dmUnitsAndTolerances::Millimeters
Model space tolerances and unit system. More...
ON_ClassArray< ON_3dmConstructionPlane >  | m_named_cplanes
ON_ClassArray< ON_3dmView >  | m_named_views
ON_3dmUnitsAndTolerances  | m_PageUnitsAndTolerances = ON_3dmUnitsAndTolerances::Millimeters
Page space (printing/paper) tolerances and unit system. More...
ON_ClassArray< ON_PlugInRef >  | m_plugin_list
Plugins that were loaded when the file was saved. More...
ON_MeshParameters  | m_RenderMeshSettings = ON_MeshParameters::DefaultMesh
settings used for automatically created rendering meshes More...
ON_3dmRenderSettings  | m_RenderSettings = ON_3dmRenderSettings::Default
ON_ClassArray< ON_3dmView >  | m_views
current viewports More...
 Static Public Attributes
static const ON_3dmSettings  | Default
Detailed Description
ON_3dmSettings
Constructor & Destructor Documentation
◆ ON_3dmSettings() [1/2]
 ON_3dmSettings::ON_3dmSettings  |  ( |   | )
default
◆ ~ON_3dmSettings()
 ON_3dmSettings::~ON_3dmSettings  |  ( |   | )
default
◆ ON_3dmSettings() [2/2]
 ON_3dmSettings::ON_3dmSettings  |  ( |  const ON_3dmSettings &  |   | )
default
Member Function Documentation
◆ CurrentDimensionStyleId()
 ON_UUID ON_3dmSettings::CurrentDimensionStyleId  |  ( |   | ) |   const
◆ CurrentDimensionStyleIndex()
 int ON_3dmSettings::CurrentDimensionStyleIndex  |  ( |   | ) |   const
◆ CurrentHatchPatternId()
 ON_UUID ON_3dmSettings::CurrentHatchPatternId  |  ( |   | ) |   const
◆ CurrentLayerId()
 ON_UUID ON_3dmSettings::CurrentLayerId  |  ( |   | ) |   const
◆ CurrentLayerIndex()
 int ON_3dmSettings::CurrentLayerIndex  |  ( |   | ) |   const
◆ CurrentLinePatternId()
 ON_UUID ON_3dmSettings::CurrentLinePatternId  |  ( |   | ) |   const
◆ CurrentLinePatternIndex()
 int ON_3dmSettings::CurrentLinePatternIndex  |  ( |   | ) |   const
◆ CurrentMaterialId()
 ON_UUID ON_3dmSettings::CurrentMaterialId  |  ( |   | ) |   const
◆ CurrentMaterialIndex()
 int ON_3dmSettings::CurrentMaterialIndex  |  ( |   | ) |   const
◆ CurrentTextStyleId()
 ON_UUID ON_3dmSettings::CurrentTextStyleId  |  ( |   | ) |   const
◆ CurrentTextStyleIndex()
 int ON_3dmSettings::CurrentTextStyleIndex  |  ( |   | ) |   const
◆ Dump()
 void ON_3dmSettings::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ operator=()
 ON_3dmSettings& ON_3dmSettings::operator=  |  ( |  const ON_3dmSettings &  |   | )
default
◆ Read()
 bool ON_3dmSettings::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ RenderMeshStyle()
 ON_MeshParameters::MESH_STYLE ON_3dmSettings::RenderMeshStyle  |  ( |  ON_MeshParameters::MESH_STYLE  |  no_match_found_result | ) |   const
Returns: ON_MeshParameters::render_mesh_fast m_RenderMeshSettings and ON_MeshParameters::FastRenderMesh have the same mesh geometry parameter settings. ON_MeshParameters::render_mesh_quality m_RenderMeshSettings and ON_MeshParameters::QualityRenderMesh have the same mesh geometry parameter settings. ON_MeshParameters::render_mesh_custom m_RenderMeshSettings and m_CustomRenderMeshSettings have the same mesh geometry parameter settings. no_match_found_result otherwise
◆ SetCurrentDimensionStyleId()
 void ON_3dmSettings::SetCurrentDimensionStyleId  |  ( |  ON_UUID  |  dimension_style_id | )
◆ SetCurrentHatchPatternId()
 void ON_3dmSettings::SetCurrentHatchPatternId  |  ( |  ON_UUID  |  hatch_pattern_id | )
◆ SetCurrentLayerId()
 void ON_3dmSettings::SetCurrentLayerId  |  ( |  ON_UUID  |  layer_id | )
These fields determine what layer, material, color, line style, and wire density are used for new objects.
◆ SetCurrentLinePatternId()
 void ON_3dmSettings::SetCurrentLinePatternId  |  ( |  ON_UUID  |  line_pattern_id | )
◆ SetCurrentMaterialId()
 void ON_3dmSettings::SetCurrentMaterialId  |  ( |  ON_UUID  |  material_id | )
◆ SetCurrentTextStyleId()
 void ON_3dmSettings::SetCurrentTextStyleId  |  ( |  ON_UUID  |  text_style_id | )
◆ SetV5CurrentLayerIndex()
 void ON_3dmSettings::SetV5CurrentLayerIndex  |  ( |  int  |  V5_current_layer_index | )
◆ Write()
 bool ON_3dmSettings::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Default
 const ON_3dmSettings ON_3dmSettings::Default
static
◆ m_active_view_id
 ON_UUID ON_3dmSettings::m_active_view_id = ON_nil_uuid
id of "active" viewport
◆ m_AnalysisMeshSettings
 ON_MeshParameters ON_3dmSettings::m_AnalysisMeshSettings = ON_MeshParameters::DefaultAnalysisMesh
settings used for automatically created analysis meshes
◆ m_AnnotationSettings
 ON_3dmAnnotationSettings ON_3dmSettings::m_AnnotationSettings
settings used when annotation objects are created
◆ m_current_color
 ON_Color ON_3dmSettings::m_current_color = ON_Color::Black
◆ m_current_color_source
 ON::object_color_source ON_3dmSettings::m_current_color_source = ON::color_from_layer
◆ m_current_linetype_source
 ON::object_linetype_source ON_3dmSettings::m_current_linetype_source = ON::linetype_from_layer
◆ m_current_material_source
 ON::object_material_source ON_3dmSettings::m_current_material_source = ON::material_from_layer
◆ m_current_plot_color
 ON_Color ON_3dmSettings::m_current_plot_color = ON_Color::UnsetColor
◆ m_current_plot_color_source
 ON::plot_color_source ON_3dmSettings::m_current_plot_color_source = ON::plot_color_from_layer
◆ m_current_wire_density
 int ON_3dmSettings::m_current_wire_density = 1
Surface wireframe density
@untitled table 0 boundary + "knot" wires 1 boundary + "knot" wires + 1 interior wire if no interior "knots" N>=2 boundary + "knot" wires + (N-1) interior wires
◆ m_CustomRenderMeshSettings
 ON_MeshParameters ON_3dmSettings::m_CustomRenderMeshSettings = ON_MeshParameters::DefaultMesh
saved custom settings
◆ m_earth_anchor_point
 ON_EarthAnchorPoint ON_3dmSettings::m_earth_anchor_point = ON_EarthAnchorPoint::Unset
If set, this is the model's location on the earth. This information is used when the model is used with GIS information.
◆ m_GridDefaults
 ON_3dmConstructionPlaneGridDefaults ON_3dmSettings::m_GridDefaults = ON_3dmConstructionPlaneGridDefaults::Default
default settings for construction plane grids
◆ m_IO_settings
 ON_3dmIOSettings ON_3dmSettings::m_IO_settings = ON_3dmIOSettings::Default
◆ m_linetype_display_scale
 double ON_3dmSettings::m_linetype_display_scale = 1.0
World scale factor to apply to non-solid linetypes for model display. For plotting, the linetype settings are used without scaling.
◆ m_model_basepoint
 ON_3dPoint ON_3dmSettings::m_model_basepoint = ON_3dPoint::Origin
Model basepoint is used when the file is read as an instance definition and is the point that is mapped to the origin in the instance definition.
◆ m_model_URL
 ON_wString ON_3dmSettings::m_model_URL = ON_wString::EmptyString
model URL (can be empty)
◆ m_ModelUnitsAndTolerances
 ON_3dmUnitsAndTolerances ON_3dmSettings::m_ModelUnitsAndTolerances = ON_3dmUnitsAndTolerances::Millimeters
Model space tolerances and unit system.
◆ m_named_cplanes
 ON_ClassArray<ON_3dmConstructionPlane> ON_3dmSettings::m_named_cplanes
◆ m_named_views
 ON_ClassArray<ON_3dmView> ON_3dmSettings::m_named_views
◆ m_PageUnitsAndTolerances
 ON_3dmUnitsAndTolerances ON_3dmSettings::m_PageUnitsAndTolerances = ON_3dmUnitsAndTolerances::Millimeters
Page space (printing/paper) tolerances and unit system.
◆ m_plugin_list
 ON_ClassArray<ON_PlugInRef> ON_3dmSettings::m_plugin_list
Plugins that were loaded when the file was saved.
◆ m_RenderMeshSettings
 ON_MeshParameters ON_3dmSettings::m_RenderMeshSettings = ON_MeshParameters::DefaultMesh
settings used for automatically created rendering meshes
◆ m_RenderSettings
 ON_3dmRenderSettings ON_3dmSettings::m_RenderSettings = ON_3dmRenderSettings::Default
◆ m_views
 ON_ClassArray<ON_3dmView> ON_3dmSettings::m_views
current viewports