Static Public Member Functions | List of all members
CRhRdkMaterial::PhysicallyBased::ChildSlotNames Class Reference
#include <RhRdkMaterial.h>
 Static Public Member Functions
static ON_wString  | Alpha (void)
static ON_wString  | AmbientOcclusion (void)
static ON_wString  | Anisotropic (void)
static ON_wString  | AnisotropicRotation (void)
static ON_wString  | BaseColor (void)
static ON_wString  | Bump (void)
static ON_wString  | Clearcoat (void)
static ON_wString  | ClearcoatBump (void)
static ON_wString  | ClearcoatRoughness (void)
static ON_wString  | Displacement (void)
static ON_wString  | Emission (void)
static ON_wString  | FromUsage (ChildSlotUsage usage)
static ON_wString  | Metallic (void)
static ON_wString  | Opacity (void)
static ON_wString  | OpacityIor (void)
static ON_wString  | OpacityRoughness (void)
static ON_wString  | Roughness (void)
static ON_wString  | Sheen (void)
static ON_wString  | SheenTint (void)
static ON_wString  | Specular (void)
static ON_wString  | SpecularTint (void)
static ON_wString  | Subsurface (void)
static ON_wString  | SubsurfaceScatteringColor (void)
static ON_wString  | SubsurfaceScatteringRadius (void)
static ChildSlotUsage  | ToUsage (const wchar_t *wszChildSlotName)
Member Function Documentation
◆ Alpha()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Alpha  |  ( |  void  |   | )
static
◆ AmbientOcclusion()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::AmbientOcclusion  |  ( |  void  |   | )
static
◆ Anisotropic()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Anisotropic  |  ( |  void  |   | )
static
◆ AnisotropicRotation()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::AnisotropicRotation  |  ( |  void  |   | )
static
◆ BaseColor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::BaseColor  |  ( |  void  |   | )
static
◆ Bump()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Bump  |  ( |  void  |   | )
static
◆ Clearcoat()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Clearcoat  |  ( |  void  |   | )
static
◆ ClearcoatBump()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::ClearcoatBump  |  ( |  void  |   | )
static
◆ ClearcoatRoughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::ClearcoatRoughness  |  ( |  void  |   | )
static
◆ Displacement()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Displacement  |  ( |  void  |   | )
static
◆ Emission()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Emission  |  ( |  void  |   | )
static
◆ FromUsage()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::FromUsage  |  ( |  ChildSlotUsage  |  usage | )
static
◆ Metallic()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Metallic  |  ( |  void  |   | )
static
◆ Opacity()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Opacity  |  ( |  void  |   | )
static
◆ OpacityIor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::OpacityIor  |  ( |  void  |   | )
static
◆ OpacityRoughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::OpacityRoughness  |  ( |  void  |   | )
static
◆ Roughness()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Roughness  |  ( |  void  |   | )
static
◆ Sheen()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Sheen  |  ( |  void  |   | )
static
◆ SheenTint()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::SheenTint  |  ( |  void  |   | )
static
◆ Specular()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Specular  |  ( |  void  |   | )
static
◆ SpecularTint()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::SpecularTint  |  ( |  void  |   | )
static
◆ Subsurface()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::Subsurface  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringColor()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::SubsurfaceScatteringColor  |  ( |  void  |   | )
static
◆ SubsurfaceScatteringRadius()
 static ON_wString CRhRdkMaterial::PhysicallyBased::ChildSlotNames::SubsurfaceScatteringRadius  |  ( |  void  |   | )
static
◆ ToUsage()
 static ChildSlotUsage CRhRdkMaterial::PhysicallyBased::ChildSlotNames::ToUsage  |  ( |  const wchar_t *  |  wszChildSlotName | )
static