Public Member Functions | Protected Member Functions | List of all members
CRhRdkOneColorTextureBaseCSI Class Reference
RDK
#include <RhRdkTwoColorTextureBase.h>
 Inheritance diagram for CRhRdkOneColorTextureBaseCSI:
 Public Member Functions
CRhRdkOneColorTextureBaseCSI (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CRhRdkOneColorTextureBaseCSI ()
virtual bool  | NextChildSlot (ON_wString &sParamNameOut, ON_wString &sChildSlotNameOut, ON_wString &sDisplayNameOut)
 Public Member Functions inherited from CRhRdkContent::CChildSlotIterator
CChildSlotIterator (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CChildSlotIterator ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual void  | IncIndex (void)
virtual int  | Index (void) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Attributes inherited from CRhRdkContent::CChildSlotIterator
CRhRdkContent::CSIContext  | m_Context
const CRhRdkContent *  | m_pContent
ON__UINT_PTR  | m_reserved
Constructor & Destructor Documentation
◆ CRhRdkOneColorTextureBaseCSI()
 CRhRdkOneColorTextureBaseCSI::CRhRdkOneColorTextureBaseCSI  |  ( |  const CRhRdkContent *  |  pContent,
|  CRhRdkContent::CSIContext  |  context
)
◆ ~CRhRdkOneColorTextureBaseCSI()
 virtual CRhRdkOneColorTextureBaseCSI::~CRhRdkOneColorTextureBaseCSI  |  ( |   | )
virtual
Member Function Documentation
◆ IncIndex()
 virtual void CRhRdkOneColorTextureBaseCSI::IncIndex  |  ( |  void  |   | )
protectedvirtual
Increments the iterator index.
◆ Index()
 virtual int CRhRdkOneColorTextureBaseCSI::Index  |  ( |  void  |   | ) |   const
protectedvirtual
◆ NextChildSlot()
 virtual bool CRhRdkOneColorTextureBaseCSI::NextChildSlot  |  ( |  ON_wString &  |  sParamNameOut,
|  ON_wString &  |  sChildSlotNameOut,
|  ON_wString &  |  sDisplayNameOut
)
virtual
If you override this you must call the base class first and return true if the base class returns true. Otherwise call Index() and return your child slots based on the returned index value; remember to call IncIndex() before you return true. When you have no more child slots to return, return false.
Implements CRhRdkContent::CChildSlotIterator.
Reimplemented in CRhRdkTwoColorTextureBaseCSI.