Public Member Functions | List of all members
ON_SubDComponentPtrPairHashTable Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDComponentPtrPairHashTable:
 Public Member Functions
ON_SubDComponentPtrPairHashTable ()
ON_SubDComponentPtrPairHashTable (const class ON_SubD &subd)
This is a good choice of constructor when the hash table is used to find pairs of vertices and edges. More...
ON_SubDComponentPtrPairHashTable (size_t pair_count_estimate)
This is a good choice of constructor when you have a good estimate of the number of pairs that will be in the hash table. More...
~ON_SubDComponentPtrPairHashTable ()=default
bool  | AddComponentPair (ON_SubDComponentPtr first_component, ON_SubDComponentPtr second_component)
bool  | AddEdgePair (const class ON_SubDEdge *first_e, const class ON_SubDEdge *second_e)
bool  | AddEdgePair (const class ON_SubDEdge *first_e, const ON_SubDEdgePtr second_eptr)
bool  | AddFacePair (const class ON_SubDFace *first_f, const class ON_SubDFace *second_f)
bool  | AddVertexPair (const class ON_SubDVertex *first_v, const class ON_SubDVertex *second_v)
const ON_SubDComponentPtrPair  | PairFromSecondComponentPtr (ON_SubDComponentPtr second_component)
const ON_SubDComponentPtrPair  | PairFromSecondEdge (const class ON_SubDEdge *second_e)
const ON_SubDComponentPtrPair  | PairFromSecondFace (const class ON_SubDFace *second_f)
const ON_SubDComponentPtrPair  | PairFromSecondVertex (const class ON_SubDVertex *second_v)
Constructor & Destructor Documentation
◆ ON_SubDComponentPtrPairHashTable() [1/3]
 ON_SubDComponentPtrPairHashTable::ON_SubDComponentPtrPairHashTable  |  ( |   | )
◆ ON_SubDComponentPtrPairHashTable() [2/3]
 ON_SubDComponentPtrPairHashTable::ON_SubDComponentPtrPairHashTable  |  ( |  size_t  |  pair_count_estimate | )
This is a good choice of constructor when you have a good estimate of the number of pairs that will be in the hash table.
Parameters
pair_count_estimate | A good estimate of the number of pairs that will be in this hash table.
◆ ON_SubDComponentPtrPairHashTable() [3/3]
 ON_SubDComponentPtrPairHashTable::ON_SubDComponentPtrPairHashTable  |  ( |  const class ON_SubD &  |  subd | )
This is a good choice of constructor when the hash table is used to find pairs of vertices and edges.
Parameters
subd | subd.VertexCount() + subd.EdgeCount() is used as the pair count estimate.
◆ ~ON_SubDComponentPtrPairHashTable()
 ON_SubDComponentPtrPairHashTable::~ON_SubDComponentPtrPairHashTable  |  ( |   | )
default
Member Function Documentation
◆ AddComponentPair()
 bool ON_SubDComponentPtrPairHashTable::AddComponentPair  |  ( |  ON_SubDComponentPtr  |  first_component,
|  ON_SubDComponentPtr  |  second_component
)
◆ AddEdgePair() [1/2]
 bool ON_SubDComponentPtrPairHashTable::AddEdgePair  |  ( |  const class ON_SubDEdge *  |  first_e,
|  const class ON_SubDEdge *  |  second_e
)
◆ AddEdgePair() [2/2]
 bool ON_SubDComponentPtrPairHashTable::AddEdgePair  |  ( |  const class ON_SubDEdge *  |  first_e,
|  const ON_SubDEdgePtr  |  second_eptr
)
◆ AddFacePair()
 bool ON_SubDComponentPtrPairHashTable::AddFacePair  |  ( |  const class ON_SubDFace *  |  first_f,
|  const class ON_SubDFace *  |  second_f
)
◆ AddVertexPair()
 bool ON_SubDComponentPtrPairHashTable::AddVertexPair  |  ( |  const class ON_SubDVertex *  |  first_v,
|  const class ON_SubDVertex *  |  second_v
)
◆ PairFromSecondComponentPtr()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondComponentPtr  |  ( |  ON_SubDComponentPtr  |  second_component | )
◆ PairFromSecondEdge()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondEdge  |  ( |  const class ON_SubDEdge *  |  second_e | )
◆ PairFromSecondFace()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondFace  |  ( |  const class ON_SubDFace *  |  second_f | )
◆ PairFromSecondVertex()
 const ON_SubDComponentPtrPair ON_SubDComponentPtrPairHashTable::PairFromSecondVertex  |  ( |  const class ON_SubDVertex *  |  second_v | )