Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_SubDToBrepParameters Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Types
enum  | VertexProcess : unsigned char {
 VertexProcess::None = 0, VertexProcess::LocalG1 = 1, VertexProcess::LocalG2 = 2, VertexProcess::LocalG1x = 3,
 VertexProcess::LocalG1xx = 4
 }
ON_SubDToBrepParameters::Vertex identifies the options for post processing extraorindary vertices. More...
 Public Member Functions
ON_SubDToBrepParameters ()=default
ON_SubDToBrepParameters (const ON_SubDToBrepParameters &)=default
~ON_SubDToBrepParameters ()=default
ON_SubDToBrepParameters::VertexProcess  | ExtraordinaryVertexProcess () const
ON_SubDToBrepParameters &  | operator= (const ON_SubDToBrepParameters &)=default
bool  | PackFaces () const
bool  | Read (ON_BinaryArchive &archive)
void  | SetExtraordinaryVertexProcess (ON_SubDToBrepParameters::VertexProcess ev_process)
void  | SetPackFaces (bool bPackFaces)
const ON_wString  | ToString (bool bVerbose) const
bool  | Write (ON_BinaryArchive &archive) const
 Static Public Member Functions
static int  | Compare (const ON_SubDToBrepParameters &lhs, const ON_SubDToBrepParameters &rhs)
static int  | CompareFromPointers (const ON_SubDToBrepParameters *lhs, const ON_SubDToBrepParameters *rhs)
static ON_SubDToBrepParameters::VertexProcess  | VertexProcessFromUnsigned (unsigned int vertex_process_as_unsigned)
static const ON_wString  | VertexProcessToString (ON_SubDToBrepParameters::VertexProcess vertex_process)
 Static Public Attributes
static const ON_SubDToBrepParameters  | Default
static const ON_SubDToBrepParameters  | DefaultPacked
static const ON_SubDToBrepParameters  | DefaultUnpacked
Member Enumeration Documentation
◆ VertexProcess
 enum ON_SubDToBrepParameters::VertexProcess : unsigned char
strong
ON_SubDToBrepParameters::Vertex identifies the options for post processing extraorindary vertices.
Enumerator
None
summary> The NURBS patches are used as is. At extraordinary vertices, the brep vertex may not be G1. Typically the deviation bewtween the brep and SubD surface is smallest with this option. /summary> summary> At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than None and smaller than LocalG1x and LocalG2. /summary>
LocalG1
summary> At extraordinary vertices, the NURBS patches are modified so they are G2 at the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than LocalG1 and LocalG1x. /summary>
LocalG2
summary> At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex and tend to be closer to G1 along edges near the extraordinary vertex. Typically the deviation bewtween the brep and SubD surface is larger than LocalG1 and smaller than LocalG2. /summary>
LocalG1x
summary> At extraordinary vertices, the NURBS patches are modified so they are G1 at the extraordinary vertex and G1 along edges near the extraordinary vertex. The patches will have one double knot near the extraordinary vertex. /summary>
LocalG1xx
Constructor & Destructor Documentation
◆ ON_SubDToBrepParameters() [1/2]
 ON_SubDToBrepParameters::ON_SubDToBrepParameters  |  ( |   | )
default
◆ ~ON_SubDToBrepParameters()
 ON_SubDToBrepParameters::~ON_SubDToBrepParameters  |  ( |   | )
default
◆ ON_SubDToBrepParameters() [2/2]
 ON_SubDToBrepParameters::ON_SubDToBrepParameters  |  ( |  const ON_SubDToBrepParameters &  |   | )
default
Member Function Documentation
◆ Compare()
 static int ON_SubDToBrepParameters::Compare  |  ( |  const ON_SubDToBrepParameters &  |  lhs,
|  const ON_SubDToBrepParameters &  |  rhs
)
static
◆ CompareFromPointers()
 static int ON_SubDToBrepParameters::CompareFromPointers  |  ( |  const ON_SubDToBrepParameters *  |  lhs,
|  const ON_SubDToBrepParameters *  |  rhs
)
static
◆ ExtraordinaryVertexProcess()
 ON_SubDToBrepParameters::VertexProcess ON_SubDToBrepParameters::ExtraordinaryVertexProcess  |  ( |   | ) |   const
Returns: Option used for post processing extraorindary vertices.
◆ operator=()
 ON_SubDToBrepParameters& ON_SubDToBrepParameters::operator=  |  ( |  const ON_SubDToBrepParameters &  |   | )
default
◆ PackFaces()
 bool ON_SubDToBrepParameters::PackFaces  |  ( |   | ) |   const
Returns: If true, then quad packs of SubD faces are returned as a single brep face. Otherwise each SubD face generates a brep face. Remarks: SubD n-gons with n != 4 always generate n brep faces.
◆ Read()
 bool ON_SubDToBrepParameters::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ SetExtraordinaryVertexProcess()
 void ON_SubDToBrepParameters::SetExtraordinaryVertexProcess  |  ( |  ON_SubDToBrepParameters::VertexProcess  |  ev_process | )
Description: Set the ExtraordinaryVertexProcess() property. Parameters: ev_process - [in]
◆ SetPackFaces()
 void ON_SubDToBrepParameters::SetPackFaces  |  ( |  bool  |  bPackFaces | )
Description: Set the PackFaces() property. Parameters: bPackFaces - [in]
◆ ToString()
 const ON_wString ON_SubDToBrepParameters::ToString  |  ( |  bool  |  bVerbose | ) |   const
◆ VertexProcessFromUnsigned()
 static ON_SubDToBrepParameters::VertexProcess ON_SubDToBrepParameters::VertexProcessFromUnsigned  |  ( |  unsigned int  |  vertex_process_as_unsigned | )
static
◆ VertexProcessToString()
 static const ON_wString ON_SubDToBrepParameters::VertexProcessToString  |  ( |  ON_SubDToBrepParameters::VertexProcess  |  vertex_process | )
static
◆ Write()
 bool ON_SubDToBrepParameters::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ Default
 const ON_SubDToBrepParameters ON_SubDToBrepParameters::Default
static
Description: Default ON_SubDToBrepParameters settings.
◆ DefaultPacked
 const ON_SubDToBrepParameters ON_SubDToBrepParameters::DefaultPacked
static
Description: Default ON_SubDToBrepParameters settings for creating an packed brep.
◆ DefaultUnpacked
 const ON_SubDToBrepParameters ON_SubDToBrepParameters::DefaultUnpacked
static
Description: Default ON_SubDToBrepParameters settings for creating an unpacked brep. Remarks: These are the settings used by ON_SubD::BrepForm(), which NEEDS to be unpacked. When picking proxy Brep components from a SubD, we need a close to 1-1 correspondence between proxy Brep components and SubD components. The only way to do that is to an unpacked proxy Brep.