Public Member Functions | List of all members
CRhRdkRenderMesh Class Reference
RDK
#include <RhRdkSdkRender.h>
 Inheritance diagram for CRhRdkRenderMesh:
 Public Member Functions
CRhRdkRenderMesh ()
virtual  | ~CRhRdkRenderMesh ()
virtual const CRhRdkObjectAncestry *  | Ancestry (void) const
virtual ON_BoundingBox  | BoundingBox (void) const
virtual bool  | Box (ON_PlaneSurface &plane, ON_Interval &z_interval) const
virtual void  | Clear (void)
virtual bool  | Cone (ON_Cone &cone, ON_Plane &truncation) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | IsONMaterial (void) const
virtual bool  | IsRdkMaterial (void) const
virtual const ON_Mesh *  | Mesh (void) const
virtual_su std::shared_ptr< const ON_Mesh >  | MeshEx (void) const
virtual const CRhinoObject *  | Object (void) const
virtual const ON_Material *  | ONMaterial (void) const
virtual bool  | Plane (ON_PlaneSurface &plane) const
enum RhRdkRenderMeshPrimitiveTypes  | PrimitiveType (void) const
virtual const CRhRdkMaterial *  | RdkMaterial (void) const
virtual_su std::shared_ptr< const CRhRdkMaterial >  | RdkMaterialEx (void) const
virtual void  | SetAncestry (const CRhRdkObjectAncestry &rma)
virtual void  | SetBox (const ON_PlaneSurface &plane, const ON_Interval &z_interval)
virtual void  | SetCone (const ON_Cone &cone, const ON_Plane &plane)
virtual void  | SetGeometry (const CRhRdkCustomRenderMeshes &crm, int iIndex)
virtual_su void  | SetGeometryEx (const IRhRdkCustomRenderMeshes &crm, int iIndex)
virtual_su void  | SetGeometryEx (const RhRdk::CustomRenderMeshes::IRenderMeshes::IInstance &instance)
virtual void  | SetMesh (const ON_Mesh *pMesh)
void  | SetMesh (std::shared_ptr< const ON_Mesh > pMesh)
virtual void  | SetObject (const CRhinoObject *pObject)
virtual void  | SetONMaterial (const ON_Material *pONMaterial)
virtual void  | SetPlane (const ON_PlaneSurface &plane)
virtual void  | SetRdkMaterial (const CRhRdkMaterial *pRdkMaterial)
virtual_su void  | SetRdkMaterial (std::shared_ptr< const CRhRdkMaterial > pRdkMaterial)
virtual void  | SetSphere (const ON_Sphere &sphere)
virtual void  | SetXformInstance (const ON_Xform &xform)
virtual const ON_Sphere *  | Sphere (void) const
virtual ON_Xform  | XformInstance (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkRenderMesh()
 CRhRdkRenderMesh::CRhRdkRenderMesh  |  ( |   | )
◆ ~CRhRdkRenderMesh()
 virtual CRhRdkRenderMesh::~CRhRdkRenderMesh  |  ( |   | )
virtual
Member Function Documentation
◆ Ancestry()
 virtual const CRhRdkObjectAncestry* CRhRdkRenderMesh::Ancestry  |  ( |  void  |   | ) |   const
virtual
◆ BoundingBox()
 virtual ON_BoundingBox CRhRdkRenderMesh::BoundingBox  |  ( |  void  |   | ) |   const
virtual
◆ Box()
 virtual bool CRhRdkRenderMesh::Box  |  ( |  ON_PlaneSurface &  |  plane,
|  ON_Interval &  |  z_interval
) |   |  const
virtual
◆ Clear()
 virtual void CRhRdkRenderMesh::Clear  |  ( |  void  |   | )
virtual
◆ Cone()
 virtual bool CRhRdkRenderMesh::Cone  |  ( |  ON_Cone &  |  cone,
|  ON_Plane &  |  truncation
) |   |  const
virtual
◆ EVF()
 virtual void* CRhRdkRenderMesh::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
◆ IsONMaterial()
 virtual bool CRhRdkRenderMesh::IsONMaterial  |  ( |  void  |   | ) |   const
virtual
◆ IsRdkMaterial()
 virtual bool CRhRdkRenderMesh::IsRdkMaterial  |  ( |  void  |   | ) |   const
virtual
◆ Mesh()
 virtual const ON_Mesh* CRhRdkRenderMesh::Mesh  |  ( |  void  |   | ) |   const
virtual
◆ MeshEx()
 virtual_su std::shared_ptr<const ON_Mesh> CRhRdkRenderMesh::MeshEx  |  ( |  void  |   | ) |   const
◆ Object()
 virtual const CRhinoObject* CRhRdkRenderMesh::Object  |  ( |  void  |   | ) |   const
virtual
◆ ONMaterial()
 virtual const ON_Material* CRhRdkRenderMesh::ONMaterial  |  ( |  void  |   | ) |   const
virtual
◆ Plane()
 virtual bool CRhRdkRenderMesh::Plane  |  ( |  ON_PlaneSurface &  |  plane | ) |   const
virtual
◆ PrimitiveType()
 enum RhRdkRenderMeshPrimitiveTypes CRhRdkRenderMesh::PrimitiveType  |  ( |  void  |   | ) |   const
strong
◆ RdkMaterial()
 virtual const CRhRdkMaterial* CRhRdkRenderMesh::RdkMaterial  |  ( |  void  |   | ) |   const
virtual
◆ RdkMaterialEx()
 virtual_su std::shared_ptr<const CRhRdkMaterial> CRhRdkRenderMesh::RdkMaterialEx  |  ( |  void  |   | ) |   const
◆ SetAncestry()
 virtual void CRhRdkRenderMesh::SetAncestry  |  ( |  const CRhRdkObjectAncestry &  |  rma | )
virtual
◆ SetBox()
 virtual void CRhRdkRenderMesh::SetBox  |  ( |  const ON_PlaneSurface &  |  plane,
|  const ON_Interval &  |  z_interval
)
virtual
◆ SetCone()
 virtual void CRhRdkRenderMesh::SetCone  |  ( |  const ON_Cone &  |  cone,
|  const ON_Plane &  |  plane
)
virtual
◆ SetGeometry()
 virtual void CRhRdkRenderMesh::SetGeometry  |  ( |  const CRhRdkCustomRenderMeshes &  |  crm,
|  int  |  iIndex
)
virtual
◆ SetGeometryEx() [1/2]
 virtual_su void CRhRdkRenderMesh::SetGeometryEx  |  ( |  const IRhRdkCustomRenderMeshes &  |  crm,
|  int  |  iIndex
)
◆ SetGeometryEx() [2/2]
 virtual_su void CRhRdkRenderMesh::SetGeometryEx  |  ( |  const RhRdk::CustomRenderMeshes::IRenderMeshes::IInstance &  |  instance | )
◆ SetMesh() [1/2]
 virtual void CRhRdkRenderMesh::SetMesh  |  ( |  const ON_Mesh *  |  pMesh | )
virtual
◆ SetMesh() [2/2]
 void CRhRdkRenderMesh::SetMesh  |  ( |  std::shared_ptr< const ON_Mesh >  |  pMesh | )
◆ SetObject()
 virtual void CRhRdkRenderMesh::SetObject  |  ( |  const CRhinoObject *  |  pObject | )
virtual
◆ SetONMaterial()
 virtual void CRhRdkRenderMesh::SetONMaterial  |  ( |  const ON_Material *  |  pONMaterial | )
virtual
◆ SetPlane()
 virtual void CRhRdkRenderMesh::SetPlane  |  ( |  const ON_PlaneSurface &  |  plane | )
virtual
◆ SetRdkMaterial() [1/2]
 virtual void CRhRdkRenderMesh::SetRdkMaterial  |  ( |  const CRhRdkMaterial *  |  pRdkMaterial | )
virtual
◆ SetRdkMaterial() [2/2]
 virtual_su void CRhRdkRenderMesh::SetRdkMaterial  |  ( |  std::shared_ptr< const CRhRdkMaterial >  |  pRdkMaterial | )
◆ SetSphere()
 virtual void CRhRdkRenderMesh::SetSphere  |  ( |  const ON_Sphere &  |  sphere | )
virtual
◆ SetXformInstance()
 virtual void CRhRdkRenderMesh::SetXformInstance  |  ( |  const ON_Xform &  |  xform | )
virtual
◆ Sphere()
 virtual const ON_Sphere* CRhRdkRenderMesh::Sphere  |  ( |  void  |   | ) |   const
virtual
◆ XformInstance()
 virtual ON_Xform CRhRdkRenderMesh::XformInstance  |  ( |  void  |   | ) |   const
virtual