Public Member Functions | List of all members
CRhinoUiEditReal Class Reference
RhinoUI
CRhinoUiEditReal. More...
#include <RhinoSdkUiEditReal.h>
 Inheritance diagram for CRhinoUiEditReal:
 Public Member Functions
CRhinoUiEditReal ()
virtual  | ~CRhinoUiEditReal ()
 Public Member Functions inherited from CRhinoUiEdit
CRhinoUiEdit ()
virtual  | ~CRhinoUiEdit ()
void  | DDX_Text (CDataExchange *pDX, int nIDC, double &nValue)
void  | DDX_Text (CDataExchange *pDX, int nIDC, int &nValue)
void  | DDX_Text (CDataExchange *pDX, int nIDC, ON_wString &wValue)
int  | DisplayPrecision () const
void  | Format ()
const CString &  | FormatKeyword () const
int  | GetEditType () const
void  | GetNumericValue (double &d)
void  | GetNumericValue (int &n)
CSpinButtonCtrl *  | GetSpinButtonCtrl () const
void  | GetStringValue (ON_wString &w)
bool  | IncludeSpinner () const
void  | LinkToSliderCtrl (CRhinoUiSliderCtrl *)
afx_msg void  | OnChar (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
on_number_error  | OnNumberErrorMode () const
afx_msg void  | OnSetFocus (CWnd *pOldWnd)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
void  | SetAllowEmpty (bool bSet=true)
void  | SetDisplayPrecision (int precision)
int  | SetEditType (edit_type et)
void  | SetFormatKeyword (const char *lps)
void  | SetFormatKeyword (const wchar_t *lps)
bool  | SetIncludeSpinner (bool b)
void  | SetMax (bool bSet, double nMax=0.0)
void  | SetMax (bool bSet, int nMax=0)
void  | SetMin (bool bSet, double nMin=0.0)
void  | SetMin (bool bSet, int nMin=0)
void  | SetNonZero (bool bSet=TRUE)
void  | SetNumber (double d)
void  | SetNumber (int i)
void  | SetOnNumberErrorMode (on_number_error mode)
void  | SetStringValue (const char *s, bool bAppend=false)
void  | SetStringValue (const wchar_t *w, bool bAppend=false)
void  | SetValue (double nValue)
void  | SetValue (int nValue)
ON_wString  | StringValue ()
void  | SynchSlider ()
void  | VerifyValue (double &nValue)
void  | VerifyValue (int &nValue)
 Additional Inherited Members
 Public Types inherited from CRhinoUiEdit
enum  | edit_type {
 et_text = 0, et_int, et_double, et_ip,
 et_invalid, force_32bit_edit_type = 0xFFFFFFFF
 }
enum  | on_number_error { one_use_last_good_number = 0, one_clamp_to_min_max_value, force_32bit_number_error = 0xFFFFFFFF }
 Protected Member Functions inherited from CRhinoUiEdit
bool  | CreateBuddy ()
void  | FormatInt ()
void  | FormatReal ()
void  | OnCharInt (UINT nChar, UINT nRepCnt, UINT nFlags)
void  | OnCharReal (UINT nChar, UINT nRepCnt, UINT nFlags)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
 Protected Attributes inherited from CRhinoUiEdit
bool  | m_allowemtpy
int  | m_displayprecision
int  | m_edit_type
bool  | m_hasmax
bool  | m_hasmin
bool  | m_include_buddy
CString  | m_key_word
CString  | m_last_good_string
double  | m_lastgoodnumber
CRhinoUiSliderCtrl *  | m_linked_slider
double  | m_max
double  | m_min
bool  | m_nonzero
on_number_error  | m_on_number_error
Detailed Description
CRhinoUiEditReal.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// THIS IS PROVIDED FOR BACKWARDS COMPATIBILITY ONLY!! This class has been replaced by CRhinoUiEdit and will be removed in the next version of Rhino
Constructor & Destructor Documentation
◆ CRhinoUiEditReal()
 CRhinoUiEditReal::CRhinoUiEditReal  |  ( |   | )
◆ ~CRhinoUiEditReal()
 virtual CRhinoUiEditReal::~CRhinoUiEditReal  |  ( |   | )
virtual