Public Member Functions | List of all members
CRhRdkRequestTask Class Reference
RDK
#include <RhRdkTask.h>
 Inheritance diagram for CRhRdkRequestTask:
 Public Member Functions
virtual Result  | Execute (const IRhRdkTaskOrigin &origin) const final override
virtual void  | Update (IRhRdkTaskUpdate &tu) const override
 Public Member Functions inherited from CRhRdkTask
CRhRdkTask ()
virtual  | ~CRhRdkTask ()
Result  | Error (const wchar_t *wszMessage) const
virtual bool  | IconIn (CRhRdkContent::Kinds kind, int width, int height, CRhinoDib &dibOut) const
virtual bool  | IconOut (CRhRdkContent::Kinds kind, int width, int height, CRhinoDib &dibOut) const
virtual UUID  | Id (void) const =0
virtual UUID  | InterfaceId (void) const final override
virtual bool  | IsForTopLevelContent (void) const
virtual int  | MenuOrder (const IRhRdkTaskOrigin &origin) const =0
virtual Separator  | MenuSeparators (void) const
virtual const wchar_t *  | MenuString (const IRhRdkTaskOrigin &origin, CRhRdkContent::Kinds kind) const =0
virtual bool  | Query (const IRhRdkTaskOrigin &origin, bool bOnItem) const
virtual UUID  | RenderEngineId (void) const
virtual void  | SetError (const wchar_t *wszMessage, RhRdkMbSeverity severity) const
virtual SubMenus  | SubMenu (void) const
virtual bool  | SupportsSandbox (void) const
virtual Result  | UserExecute (const IRhRdkTaskOrigin &origin) const
virtual void  | UserUpdate (IRhRdkTaskUpdate &tu) const
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Public Types inherited from CRhRdkTask
enum  | Result : unsigned int { Result::Success, Result::Failure, Result::Cancel }
enum  | Separator : unsigned int { Separator::None, Separator::Before, Separator::After, Separator::Both }
enum  | SubMenus { SubMenus::None, SubMenus::CreateNew, SubMenus::Thumbnails, SubMenus::PlugIn }
 Static Public Member Functions inherited from CRhRdkTask
static void  | RequiredDataSources (OUT ON_SimpleArray< ON_UUID > &aId)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkSimpleTask
virtual bool  | IsEnabled (const IRhRdkTaskOrigin &origin) const final override
 Protected Member Functions inherited from CRhRdkTask
void  | FullUndoString (const IRhRdkTaskOrigin &origin, ON_wString &sOut) const
virtual bool  | GetSureMessage (const IRhRdkTaskOrigin &origin, ON_wString &sMessageOut, ON_wString &sYesVerbOut, ON_wString &sNoVerbOut, ON_wString &sDontShowAgainIdOut) const
virtual void  | GetUndoString (const IRhRdkTaskOrigin &origin, ON_wString &sOut) const
virtual void  | SetSelection (const IRhRdkTaskOrigin &origin, const CRhRdkContentArray &aContent) const
Detailed Description
A request task is a task that is implemented in the UI plug-in. These tasks operate directly on a UI element and therefore only the UI plug-in knows how to execute them.
Member Function Documentation
◆ Execute()
 virtual Result CRhRdkRequestTask::Execute  |  ( |  const IRhRdkTaskOrigin &  |  origin | ) |   const
finaloverridevirtual
Implement this method to execute the task.
Implements CRhRdkTask.
◆ Update()
 virtual void CRhRdkRequestTask::Update  |  ( |  IRhRdkTaskUpdate &  |  tu | ) |   const
overridevirtual
Implement this method to update the UI element associated with the task (e.g., a menu). If you do not implement this, the task's UI elements will always appear in an active and unchecked state.
Reimplemented from CRhRdkTask.