Public Member Functions | List of all members
ON_DebugWriteArchive Class Reference
OpenNURBS
#include <opennurbs_archive.h>
 Public Member Functions
ON_DebugWriteArchive ()
~ON_DebugWriteArchive ()
ON_BinaryArchive *  | Archive () const
const ON_wString &  | FilePath () const
unsigned int  | Number () const
the number of the archive or 0 More...
Detailed Description
Opens a debug archive file Uses directory set by ON_SetDebugWriteObjectDirectory(const wchar_t* ). creates a file named "debug_file_nnnn.3dm" Example: ON_DebugWriteArchive debug; if(debug.m_Archive) ON_WriteArchive( *debug.m_Archive, geometry );
Constructor & Destructor Documentation
◆ ON_DebugWriteArchive()
 ON_DebugWriteArchive::ON_DebugWriteArchive  |  ( |   | )
Creates a file in N_DebugWriteObjectDirectory() and allocates archive to write to that file.
◆ ~ON_DebugWriteArchive()
 ON_DebugWriteArchive::~ON_DebugWriteArchive  |  ( |   | )
Member Function Documentation
◆ Archive()
 ON_BinaryArchive* ON_DebugWriteArchive::Archive  |  ( |   | ) |   const
check for nullptr before using Destructor closes archive and deletes it.
◆ FilePath()
 const ON_wString& ON_DebugWriteArchive::FilePath  |  ( |   | ) |   const
Name of the archive file. = .../debug_file_NNNNN.3dm where N = Number().
◆ Number()
 unsigned int ON_DebugWriteArchive::Number  |  ( |   | ) |   const
the number of the archive or 0