Public Member Functions | Static Public Attributes | List of all members
ON_AggregateComponentStatusEx Class Reference
OpenNURBS
#include <opennurbs_compstat.h>
 Inheritance diagram for ON_AggregateComponentStatusEx:
 Public Member Functions
ON_AggregateComponentStatusEx ()=default
ON_AggregateComponentStatusEx (const ON_AggregateComponentStatus &)
ON_AggregateComponentStatusEx (const ON_AggregateComponentStatusEx &)=default
~ON_AggregateComponentStatusEx ()=default
bool  | Add (const ON_AggregateComponentStatus &aggregate_status)
bool  | Add (ON_ComponentStatus component_status)
ON_ComponentStatus  | AggregateStatus () const
bool  | ClearAggregateStatus (ON_ComponentStatus states_to_clear)
bool  | ClearAllStates ()
unsigned int  | ComponentCount () const
ON__UINT64  | ComponentStatusSerialNumber () const
unsigned int  | DamagedCount () const
unsigned int  | HiddenCount () const
unsigned int  | HighlightedCount () const
bool  | IsCurrent () const
bool  | IsEmpty () const
unsigned int  | LockedCount () const
void  | MarkAsNotCurrent ()
ON_AggregateComponentStatusEx &  | operator= (const ON_AggregateComponentStatus &)
ON_AggregateComponentStatusEx &  | operator= (const ON_AggregateComponentStatusEx &)=default
unsigned int  | SelectedCount () const
unsigned int  | SelectedPersistentCount () const
 Static Public Attributes
static const ON_AggregateComponentStatusEx  | Empty
static const ON_AggregateComponentStatusEx  | NotCurrent
Constructor & Destructor Documentation
◆ ON_AggregateComponentStatusEx() [1/3]
 ON_AggregateComponentStatusEx::ON_AggregateComponentStatusEx  |  ( |   | )
default
◆ ~ON_AggregateComponentStatusEx()
 ON_AggregateComponentStatusEx::~ON_AggregateComponentStatusEx  |  ( |   | )
default
◆ ON_AggregateComponentStatusEx() [2/3]
 ON_AggregateComponentStatusEx::ON_AggregateComponentStatusEx  |  ( |  const ON_AggregateComponentStatusEx &  |   | )
default
◆ ON_AggregateComponentStatusEx() [3/3]
 ON_AggregateComponentStatusEx::ON_AggregateComponentStatusEx  |  ( |  const ON_AggregateComponentStatus &  |   | )
Member Function Documentation
◆ Add() [1/2]
 bool ON_AggregateComponentStatusEx::Add  |  ( |  const ON_AggregateComponentStatus &  |  aggregate_status | )
Description: Add the status information in aggregate_status to this aggregate status. Parameters: aggregate_status - [in] Returns: true if successful. false if information is not current and Add failed.
◆ Add() [2/2]
 bool ON_AggregateComponentStatusEx::Add  |  ( |  ON_ComponentStatus  |  component_status | )
Description: Add the status information in component_status to this aggregate status. Parameters: component_status - [in] Returns: true if successful. false if information is not current and Add failed.
◆ AggregateStatus()
 ON_ComponentStatus ON_AggregateComponentStatusEx::AggregateStatus  |  ( |   | ) |   const
◆ ClearAggregateStatus()
 bool ON_AggregateComponentStatusEx::ClearAggregateStatus  |  ( |  ON_ComponentStatus  |  states_to_clear | )
Description: Sets all states specified by states_to_clear to clear. Does not change current mark. Does not change component count. Returns true if successful. false if information is not current and ClearAggregateStatus() failed.
◆ ClearAllStates()
 bool ON_AggregateComponentStatusEx::ClearAllStates  |  ( |   | )
Description: Sets all states to clear. Marks status as current. Does not change component count Returns true if successful. false if information is not current and ClearAllStates() failed.
◆ ComponentCount()
 unsigned int ON_AggregateComponentStatusEx::ComponentCount  |  ( |   | ) |   const
◆ ComponentStatusSerialNumber()
 ON__UINT64 ON_AggregateComponentStatusEx::ComponentStatusSerialNumber  |  ( |   | ) |   const
Returns: A runtime serial number that is incremented every time a component status setting changes, even when the actual counts may be unknown. If the returned value is 0, status information is unknown.
◆ DamagedCount()
 unsigned int ON_AggregateComponentStatusEx::DamagedCount  |  ( |   | ) |   const
◆ HiddenCount()
 unsigned int ON_AggregateComponentStatusEx::HiddenCount  |  ( |   | ) |   const
◆ HighlightedCount()
 unsigned int ON_AggregateComponentStatusEx::HighlightedCount  |  ( |   | ) |   const
◆ IsCurrent()
 bool ON_AggregateComponentStatusEx::IsCurrent  |  ( |   | ) |   const
Returns: true if the information is current (valid, up to date, ...). false if the information is not current. Remarks: If the information is not current, all counts are zero and states are clear.
◆ IsEmpty()
 bool ON_AggregateComponentStatusEx::IsEmpty  |  ( |   | ) |   const
Returns: true if this is empty false if not empty.
◆ LockedCount()
 unsigned int ON_AggregateComponentStatusEx::LockedCount  |  ( |   | ) |   const
◆ MarkAsNotCurrent()
 void ON_AggregateComponentStatusEx::MarkAsNotCurrent  |  ( |   | )
Description: Mark the information as not current. Erases all information.
◆ operator=() [1/2]
 ON_AggregateComponentStatusEx& ON_AggregateComponentStatusEx::operator=  |  ( |  const ON_AggregateComponentStatus &  |   | )
◆ operator=() [2/2]
 ON_AggregateComponentStatusEx& ON_AggregateComponentStatusEx::operator=  |  ( |  const ON_AggregateComponentStatusEx &  |   | )
default
◆ SelectedCount()
 unsigned int ON_AggregateComponentStatusEx::SelectedCount  |  ( |   | ) |   const
Returns: Number of components that are selected or persistently selected.
◆ SelectedPersistentCount()
 unsigned int ON_AggregateComponentStatusEx::SelectedPersistentCount  |  ( |   | ) |   const
Returns: Number of components that are persistently selected.
Member Data Documentation
◆ Empty
 const ON_AggregateComponentStatusEx ON_AggregateComponentStatusEx::Empty
static
◆ NotCurrent
 const ON_AggregateComponentStatusEx ON_AggregateComponentStatusEx::NotCurrent
static