Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppGridSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppGridSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppGridSettings &src) const
bool  | operator== (const CRhinoAppGridSettings &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Public Attributes
int  | m_axis_line_width
1 or 2 More...
unsigned int  | m_line_stipple_pattern
bool  | m_show_zaxis
ON_Color  | m_thick_line_color
int  | m_thick_line_width
construction plane grid line properties More...
ON_Color  | m_thin_line_color
grid colors More...
ON_Color  | m_xaxis_color
ON_Color  | m_yaxis_color
ON_Color  | m_zaxis_color
 Static Public Attributes
static const CRhinoAppGridSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppGridSettings()
 CRhinoAppGridSettings::CRhinoAppGridSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppGridSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppGridSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppGridSettings::operator!=  |  ( |  const CRhinoAppGridSettings &  |  src | ) |   const
◆ operator==()
 bool CRhinoAppGridSettings::operator==  |  ( |  const CRhinoAppGridSettings &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppGridSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppGridSettings CRhinoAppGridSettings::Default
static
◆ m_axis_line_width
 int CRhinoAppGridSettings::m_axis_line_width
1 or 2
◆ m_line_stipple_pattern
 unsigned int CRhinoAppGridSettings::m_line_stipple_pattern
◆ m_show_zaxis
 bool CRhinoAppGridSettings::m_show_zaxis
◆ m_thick_line_color
 ON_Color CRhinoAppGridSettings::m_thick_line_color
◆ m_thick_line_width
 int CRhinoAppGridSettings::m_thick_line_width
construction plane grid line properties
1 or 2
◆ m_thin_line_color
 ON_Color CRhinoAppGridSettings::m_thin_line_color
grid colors
◆ m_xaxis_color
 ON_Color CRhinoAppGridSettings::m_xaxis_color
◆ m_yaxis_color
 ON_Color CRhinoAppGridSettings::m_yaxis_color
◆ m_zaxis_color
 ON_Color CRhinoAppGridSettings::m_zaxis_color