Public Member Functions | Protected Attributes | List of all members
CArgsRhinoText Class Reference
RhinoGet
#include <rhinoSdkGetText.h>
 Public Member Functions
CArgsRhinoText ()
CArgsRhinoText (const CArgsRhinoText &)=default
CArgsRhinoText (unsigned int rhino_doc_sn, const ON_3dPoint *start_point, const wchar_t *string)
~CArgsRhinoText ()=default
int  | DimStyleIndex () const
Current text style is used if its not forced here. More...
int  | DimStyleIndex (const CRhinoDoc &doc) const
bool  | HaveStartPoint () const
bool  | HaveString () const
double  | Height () const
bool  | IsInteractive ()
Set or get whether the command is being run interaceively. More...
CArgsRhinoText &  | operator= (const CArgsRhinoText &)=default
void  | SetDefaultPrompts ()
void  | SetDimStyleIndex (const CRhinoDoc &doc, int test_style_index)
void  | SetHeight (double height)
void  | SetInteractive (bool interactive)
void  | SetStartPoint (const ON_3dPoint &start_point)
void  | SetStartPointPrompt (const wchar_t *prompt)
void  | SetString (const wchar_t *string)
void  | SetStringPrompt (const wchar_t *prompt)
const ON_3dPoint *  | StartPoint () const
Text start point. More...
const wchar_t *  | StartPointPrompt () const
prompt when getting start point More...
const wchar_t *  | String () const
const wchar_t *  | StringPrompt () const
prompt when getting the text string More...
 Protected Attributes
int  | m_dim_style_index = -1
[in] font index in the Rhino text style table More...
bool  | m_havepoint = false
bool  | m_havestring = false
double  | m_height = 1.0
bool  | m_interactive = true
ON_wString  | m_promptstartpoint
[in] prompt when getting start point More...
ON_wString  | m_promptstring
[in] prompt when getting the text string More...
ON_3dPoint  | m_startpoint = ON_3dPoint::Origin
ON_wString  | m_string = ON_wString::EmptyString
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: CArgsRhinoText is used to pass input to RhinoGetText().
Constructor & Destructor Documentation
◆ CArgsRhinoText() [1/3]
 CArgsRhinoText::CArgsRhinoText  |  ( |   | )
◆ ~CArgsRhinoText()
 CArgsRhinoText::~CArgsRhinoText  |  ( |   | )
default
◆ CArgsRhinoText() [2/3]
 CArgsRhinoText::CArgsRhinoText  |  ( |  const CArgsRhinoText &  |   | )
default
◆ CArgsRhinoText() [3/3]
 CArgsRhinoText::CArgsRhinoText  |  ( |  unsigned int  |  rhino_doc_sn,
|  const ON_3dPoint *  |  start_point,
|  const wchar_t *  |  string
)
Member Function Documentation
◆ DimStyleIndex() [1/2]
 int CArgsRhinoText::DimStyleIndex  |  ( |   | ) |   const
Current text style is used if its not forced here.
Returns: -1: Use document default
◆ DimStyleIndex() [2/2]
 int CArgsRhinoText::DimStyleIndex  |  ( |  const CRhinoDoc &  |  doc | ) |   const
◆ HaveStartPoint()
 bool CArgsRhinoText::HaveStartPoint  |  ( |   | ) |   const
◆ HaveString()
 bool CArgsRhinoText::HaveString  |  ( |   | ) |   const
◆ Height()
 double CArgsRhinoText::Height  |  ( |   | ) |   const
◆ IsInteractive()
 bool CArgsRhinoText::IsInteractive  |  ( |   | )
Set or get whether the command is being run interaceively.
◆ operator=()
 CArgsRhinoText& CArgsRhinoText::operator=  |  ( |  const CArgsRhinoText &  |   | )
default
◆ SetDefaultPrompts()
 void CArgsRhinoText::SetDefaultPrompts  |  ( |   | )
◆ SetDimStyleIndex()
 void CArgsRhinoText::SetDimStyleIndex  |  ( |  const CRhinoDoc &  |  doc,
|  int  |  test_style_index
)
◆ SetHeight()
 void CArgsRhinoText::SetHeight  |  ( |  double  |  height | )
◆ SetInteractive()
 void CArgsRhinoText::SetInteractive  |  ( |  bool  |  interactive | )
◆ SetStartPoint()
 void CArgsRhinoText::SetStartPoint  |  ( |  const ON_3dPoint &  |  start_point | )
◆ SetStartPointPrompt()
 void CArgsRhinoText::SetStartPointPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetString()
 void CArgsRhinoText::SetString  |  ( |  const wchar_t *  |  string | )
◆ SetStringPrompt()
 void CArgsRhinoText::SetStringPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ StartPoint()
 const ON_3dPoint* CArgsRhinoText::StartPoint  |  ( |   | ) |   const
Text start point.
◆ StartPointPrompt()
 const wchar_t* CArgsRhinoText::StartPointPrompt  |  ( |   | ) |   const
prompt when getting start point
◆ String()
 const wchar_t* CArgsRhinoText::String  |  ( |   | ) |   const
◆ StringPrompt()
 const wchar_t* CArgsRhinoText::StringPrompt  |  ( |   | ) |   const
prompt when getting the text string
Member Data Documentation
◆ m_dim_style_index
 int CArgsRhinoText::m_dim_style_index = -1
protected
[in] font index in the Rhino text style table
-1 means use doc default
◆ m_havepoint
 bool CArgsRhinoText::m_havepoint = false
protected
◆ m_havestring
 bool CArgsRhinoText::m_havestring = false
protected
◆ m_height
 double CArgsRhinoText::m_height = 1.0
protected
◆ m_interactive
 bool CArgsRhinoText::m_interactive = true
protected
◆ m_promptstartpoint
 ON_wString CArgsRhinoText::m_promptstartpoint
protected
[in] prompt when getting start point
◆ m_promptstring
 ON_wString CArgsRhinoText::m_promptstring
protected
[in] prompt when getting the text string
◆ m_startpoint
 ON_3dPoint CArgsRhinoText::m_startpoint = ON_3dPoint::Origin
protected
◆ m_string
 ON_wString CArgsRhinoText::m_string = ON_wString::EmptyString
protected