Public Member Functions | Public Attributes | Friends | List of all members
CRhinoBitmap Class Reference
Rhino
#include <rhinoSdkBitmap.h>
 Public Member Functions
const ON_Bitmap *  | Bitmap () const
class CRhinoDib *  | Dib (class CRhinoDib *dib=nullptr) const
const ON_EmbeddedBitmap *  | EmbeddedBitmap () const
bool  | ExportToFile (const wchar_t *fullpath) const
const ON_FileReference &  | FileReference () const
ON_UUID  | Id () const
int  | Index () const
bool  | IsDeleted () const
bool  | IsReference () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
const ON_WindowsBitmapEx *  | WindowsBitmap () const
unsigned int  | WorksessionReferenceModelSerialNumber () const
 Public Attributes
int  | m_remap_index = -1
Runtime index used when remapping bitmaps for import/export. More...
int  | m_sort_index = -1
Runtime index used to sort bitmaps in bitmap dialog. More...
 Friends
class  | CRhinoBitmapTable
Member Function Documentation
◆ Bitmap()
 const ON_Bitmap* CRhinoBitmap::Bitmap  |  ( |   | ) |   const
◆ Dib()
 class CRhinoDib* CRhinoBitmap::Dib  |  ( |  class CRhinoDib *  |  dib = nullptr | ) |   const
Description: Gets a CRhinoDib of the bitmap Parameters: dib - [in] if not NULL, the dib is put into this bitmap. Returns: If successful, a pointer to a CRhinoDib. The caller is responsible for deleting this CRhinoDib.
◆ EmbeddedBitmap()
 const ON_EmbeddedBitmap* CRhinoBitmap::EmbeddedBitmap  |  ( |   | ) |   const
◆ ExportToFile()
 bool CRhinoBitmap::ExportToFile  |  ( |  const wchar_t *  |  fullpath | ) |   const
Description: Write the bitmap to a file. Parameters: fullpath - [in] full path, including file name and extension, name of the file to write. Returns: True if successful. See Also: CRhinoBitmapTable::ExportToFiles
◆ FileReference()
 const ON_FileReference& CRhinoBitmap::FileReference  |  ( |   | ) |   const
Returns: Bitmap name.
 When the bitmap is an embedded image file, the full path to the image file is returned.
◆ Id()
 ON_UUID CRhinoBitmap::Id  |  ( |   | ) |   const
◆ Index()
 int CRhinoBitmap::Index  |  ( |   | ) |   const
Description: Get array index of the bitmap in the bitmap table. Returns: -1: The bitmap is not in the bitmap table >=0: Index of the bitmap in the bitmap table.
◆ IsDeleted()
 bool CRhinoBitmap::IsDeleted  |  ( |   | ) |   const
◆ IsReference()
 bool CRhinoBitmap::IsReference  |  ( |   | ) |   const
Description: Rhino allows files to be used as the definitions for linked block instances definitions and to be used as reference models in worksessions. If an entry in the bitmap table is from a linked instance definition or worksession reference model, then IsReference() returns true. If IsReference() returns true, then the bitmap is not saved in a file. Returns: true if the bitmap is part of a linked instance definition or a worksession reference model. Remarks: If you need to know what type of reference the bitmap is used for, use the WorksessionReferenceModelSerialNumber(), and LinkedInstanceDefinitionSerialNumber() functions.
◆ LinkedInstanceDefinitionSerialNumber()
 unsigned int CRhinoBitmap::LinkedInstanceDefinitionSerialNumber  |  ( |   | ) |   const
Returns: 0: The bitmap is not part of a linked instance definition 1-1000: These numbers are reserved for future use. >1000: CRhinoDoc::m_instance_defintion_table.FindBySerialNumber() can be used to find the instance definition. Remarks: The linked instance definition serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
◆ WindowsBitmap()
 const ON_WindowsBitmapEx* CRhinoBitmap::WindowsBitmap  |  ( |   | ) |   const
◆ WorksessionReferenceModelSerialNumber()
 unsigned int CRhinoBitmap::WorksessionReferenceModelSerialNumber  |  ( |   | ) |   const
Returns: Worksession reference model id. 0: bitmap is not in a reference model. 1: bitmap is in an unidentified worksession reference model. 2-1000: reserved for future use >1000: Serial number of the worksession reference model.
 Remarks: The reference model serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
Friends And Related Function Documentation
◆ CRhinoBitmapTable
 friend class CRhinoBitmapTable
friend
Member Data Documentation
◆ m_remap_index
 int CRhinoBitmap::m_remap_index = -1
Runtime index used when remapping bitmaps for import/export.
◆ m_sort_index
 int CRhinoBitmap::m_sort_index = -1
Runtime index used to sort bitmaps in bitmap dialog.