Public Member Functions | List of all members
ON_Displacement::SubItemIterator Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Public Member Functions
SubItemIterator (const ON_Displacement &dsp)
~SubItemIterator ()
SubItem *  | Next (void)
Constructor & Destructor Documentation
◆ SubItemIterator()
 ON_Displacement::SubItemIterator::SubItemIterator  |  ( |  const ON_Displacement &  |  dsp | )
◆ ~SubItemIterator()
 ON_Displacement::SubItemIterator::~SubItemIterator  |  ( |   | )
Member Function Documentation
◆ Next()
 SubItem* ON_Displacement::SubItemIterator::Next  |  ( |  void  |   | )