Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmAnnotationSettings Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmAnnotationSettings ()=default
ON_3dmAnnotationSettings (const ON_3dmAnnotationSettings &)
~ON_3dmAnnotationSettings ()
ON_UUID  | DimensionLayerId () const
void  | Dump (ON_TextLog &text_log) const
void  | Enable_V5_AnnotationScaling (bool bEnable)
void  | EnableHatchScaling (bool bEnable)
void  | EnableLayoutSpaceAnnotationScaling (bool bEnable)
void  | EnableModelSpaceAnnotationScaling (bool bEnable)
void  | EnableUseDimensionLayer (bool bEnable)
bool  | Is_V5_AnnotationScalingEnabled () const
bool  | IsHatchScalingEnabled () const
bool  | IsLayoutSpaceAnnotationScalingEnabled () const
bool  | IsModelSpaceAnnotationScalingEnabled () const
ON_3dmAnnotationSettings &  | operator= (const ON_3dmAnnotationSettings &)
bool  | Read (ON_BinaryArchive &)
void  | SetDimensionLayerId (const ON_UUID &dimension_layer_id)
void  | SetWorldViewHatchScale (double world_view_hatch_scale)
void  | SetWorldViewTextScale (double world_view_text_scale)
bool  | UseDimensionLayer () const
double  | WorldViewHatchScale () const
double  | WorldViewTextScale () const
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
int  | m_angleformat = 0
0: decimal degrees, ... ( ON_DimStyle::angle_format enum as int ) More...
int  | m_angularunits = 0
0: degrees, 1: radians More...
double  | m_arrowlength = 1.0
int  | m_arrowtype = 0
0: filled narrow triangular arrow (= ((ON_Arrowhead::arrow_type enum value as int ) - 2)) More...
double  | m_arrowwidth = 1.0
double  | m_centermark = 1.0
double  | m_dimexe = 1.0
double  | m_dimexo = 1.0
double  | m_dimscale = 1.0
model size / plotted size More...
ON::LengthUnitSystem  | m_dimunits = ON::LengthUnitSystem::None
units used to measure the dimension More...
ON_wString  | m_facename
for decimal, digits past the decimal point More...
int  | m_lengthformat = 0
2 = ON_DimStyle::LengthDisplay::FeetAndInches, treat everything else as ON_DimStyle::LengthDisplay::ModelUnits More...
int  | m_resolution = 0
double  | m_textheight = 1.0
 Static Public Attributes
static const ON_3dmAnnotationSettings  | Default
Detailed Description
Model settings render mesh defaults viewports construction planes
Constructor & Destructor Documentation
◆ ON_3dmAnnotationSettings() [1/2]
 ON_3dmAnnotationSettings::ON_3dmAnnotationSettings  |  ( |   | )
default
◆ ~ON_3dmAnnotationSettings()
 ON_3dmAnnotationSettings::~ON_3dmAnnotationSettings  |  ( |   | )
◆ ON_3dmAnnotationSettings() [2/2]
 ON_3dmAnnotationSettings::ON_3dmAnnotationSettings  |  ( |  const ON_3dmAnnotationSettings &  |   | )
Member Function Documentation
◆ DimensionLayerId()
 ON_UUID ON_3dmAnnotationSettings::DimensionLayerId  |  ( |   | ) |   const
Description: Gets the id of the dimension layer. Note, if id is ON_nil_uuid or if a layer with the id does not exist, the current layer will be used.
◆ Dump()
 void ON_3dmAnnotationSettings::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Enable_V5_AnnotationScaling()
 void ON_3dmAnnotationSettings::Enable_V5_AnnotationScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Sets value of m_b_V5_EnableAnnotationScaling.
◆ EnableHatchScaling()
 void ON_3dmAnnotationSettings::EnableHatchScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Sets value of m_bEnableHatchScaling.
◆ EnableLayoutSpaceAnnotationScaling()
 void ON_3dmAnnotationSettings::EnableLayoutSpaceAnnotationScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Sets value of m_bEnableLayoutSpaceAnnotationScaling.
◆ EnableModelSpaceAnnotationScaling()
 void ON_3dmAnnotationSettings::EnableModelSpaceAnnotationScaling  |  ( |  bool  |  bEnable | )
Parameters: bEnable - [in] Sets value of m_bEnableModelSpaceAnnotationScaling.
◆ EnableUseDimensionLayer()
 void ON_3dmAnnotationSettings::EnableUseDimensionLayer  |  ( |  bool  |  bEnable | )
Description: Enables or disables the use of a dimension layer.
◆ Is_V5_AnnotationScalingEnabled()
 bool ON_3dmAnnotationSettings::Is_V5_AnnotationScalingEnabled  |  ( |   | ) |   const
Returns: Value of m_b_V5_EnableAnnotationScaling;
◆ IsHatchScalingEnabled()
 bool ON_3dmAnnotationSettings::IsHatchScalingEnabled  |  ( |   | ) |   const
Returns: Value of m_bEnableHatchScaling;
◆ IsLayoutSpaceAnnotationScalingEnabled()
 bool ON_3dmAnnotationSettings::IsLayoutSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
Returns: Value of m_bEnableLayoutSpaceAnnotationScaling;
◆ IsModelSpaceAnnotationScalingEnabled()
 bool ON_3dmAnnotationSettings::IsModelSpaceAnnotationScalingEnabled  |  ( |   | ) |   const
Returns: Value of m_bEnableModelSpaceAnnotationScaling;
◆ operator=()
 ON_3dmAnnotationSettings& ON_3dmAnnotationSettings::operator=  |  ( |  const ON_3dmAnnotationSettings &  |   | )
◆ Read()
 bool ON_3dmAnnotationSettings::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SetDimensionLayerId()
 void ON_3dmAnnotationSettings::SetDimensionLayerId  |  ( |  const ON_UUID &  |  dimension_layer_id | )
Description: Sets the dimension layer id. To, clear, use ON_nil_uuid.
◆ SetWorldViewHatchScale()
 void ON_3dmAnnotationSettings::SetWorldViewHatchScale  |  ( |  double  |  world_view_hatch_scale | )
Description: Sets the world view hatch scale.
◆ SetWorldViewTextScale()
 void ON_3dmAnnotationSettings::SetWorldViewTextScale  |  ( |  double  |  world_view_text_scale | )
Description: Sets the world view text scale.
◆ UseDimensionLayer()
 bool ON_3dmAnnotationSettings::UseDimensionLayer  |  ( |   | ) |   const
Returns: If true, then new annotations are added to the layer with the id returned by DimensionLayerId(). If false, then new annotations are added to the document's current layer.
◆ WorldViewHatchScale()
 double ON_3dmAnnotationSettings::WorldViewHatchScale  |  ( |   | ) |   const
Returns: Gets the world view hatch scale.
◆ WorldViewTextScale()
 double ON_3dmAnnotationSettings::WorldViewTextScale  |  ( |   | ) |   const
Returns: Gets the world view text scale.
◆ Write()
 bool ON_3dmAnnotationSettings::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Default
 const ON_3dmAnnotationSettings ON_3dmAnnotationSettings::Default
static
◆ m_angleformat
 int ON_3dmAnnotationSettings::m_angleformat = 0
0: decimal degrees, ... ( ON_DimStyle::angle_format enum as int )
◆ m_angularunits
 int ON_3dmAnnotationSettings::m_angularunits = 0
0: degrees, 1: radians
◆ m_arrowlength
 double ON_3dmAnnotationSettings::m_arrowlength = 1.0
◆ m_arrowtype
 int ON_3dmAnnotationSettings::m_arrowtype = 0
0: filled narrow triangular arrow (= ((ON_Arrowhead::arrow_type enum value as int ) - 2))
◆ m_arrowwidth
 double ON_3dmAnnotationSettings::m_arrowwidth = 1.0
◆ m_centermark
 double ON_3dmAnnotationSettings::m_centermark = 1.0
◆ m_dimexe
 double ON_3dmAnnotationSettings::m_dimexe = 1.0
◆ m_dimexo
 double ON_3dmAnnotationSettings::m_dimexo = 1.0
◆ m_dimscale
 double ON_3dmAnnotationSettings::m_dimscale = 1.0
model size / plotted size
these are the running defaults for making dimensions they are also the things written to the 3dm file as dimension settings
◆ m_dimunits
 ON::LengthUnitSystem ON_3dmAnnotationSettings::m_dimunits = ON::LengthUnitSystem::None
units used to measure the dimension
◆ m_facename
 ON_wString ON_3dmAnnotationSettings::m_facename
for decimal, digits past the decimal point
[LF_FACESIZE] ///< windows font name
◆ m_lengthformat
 int ON_3dmAnnotationSettings::m_lengthformat = 0
2 = ON_DimStyle::LengthDisplay::FeetAndInches, treat everything else as ON_DimStyle::LengthDisplay::ModelUnits
◆ m_resolution
 int ON_3dmAnnotationSettings::m_resolution = 0
ON_INTERNAL_OBSOLETE::V5_TextDisplayMode m_settings_textalign; ///< In V2 files - 0: above line, 1: in line, 2: horizontal ///< After V2 files - 0: normal (converts to above_line), 1: horizontal, 2: above_line, 3: in_line
 depends on m_lengthformat
◆ m_textheight
 double ON_3dmAnnotationSettings::m_textheight = 1.0