Public Member Functions | Protected Member Functions | List of all members
IRhinoAddPropertiesPages Class Referenceabstract
Rhino
#include <RhinoSdkPropertiesPages.h>
 Public Member Functions
virtual  | ~IRhinoAddPropertiesPages ()
virtual void  | GetPropertiesPages (CRhinoPropertiesPanelPageCollection &collection)=0
virtual ON_UUID  | PropertiesPlugInId () const =0
 Protected Member Functions
IRhinoAddPropertiesPages ()
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. class IRhinoAddPropertiesPages
Description: Used to add custom object properties pages to the properties panel.
Constructor & Destructor Documentation
◆ IRhinoAddPropertiesPages()
 IRhinoAddPropertiesPages::IRhinoAddPropertiesPages  |  ( |   | )
protected
 Description: Default constructor.
◆ ~IRhinoAddPropertiesPages()
 virtual IRhinoAddPropertiesPages::~IRhinoAddPropertiesPages  |  ( |   | )
virtual
 Description: Destructor.
Member Function Documentation
◆ GetPropertiesPages()
 virtual void IRhinoAddPropertiesPages::GetPropertiesPages  |  ( |  CRhinoPropertiesPanelPageCollection &  |  collection | )
pure virtual
 Description: The properties panel is a per document panel and a new instance gets generated for each new document. This gets called each time the document instance of the panel is created. Parameters: collection [out] - Add IRhinoOptionsPage objects to this collection, these IRhinoOptionsPage objects will get released when the document closes. Remarks: Make sure you include the following macro prior to calling new: AFX_MANAGE_STATE(AfxGetStaticModuleState()); Please see MFC Technical Notes 33 and 58 for additional details.
This method is called each time a new document is created. The IRhinoPropertiesPanelPage objects are notified when CRhinoObjects are added to a properties panel. Pages added to the collection will get deleted when the document is closed.
◆ PropertiesPlugInId()
 virtual ON_UUID IRhinoAddPropertiesPages::PropertiesPlugInId  |  ( |   | ) |   const
pure virtual
 Description: Must override and return the plug-in Id associated with the custom pages. Returns: Return the plug-in Id associated with the custom pages.