Public Member Functions | Protected Attributes | List of all members
CRhinoUiCheckBox Class Reference
RhinoUI
CRhinoUiCheckBox. More...
#include <RhinoSdkUiCheckBox.h>
 Inheritance diagram for CRhinoUiCheckBox:
 Public Member Functions
CRhinoUiCheckBox ()
virtual  | ~CRhinoUiCheckBox ()
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnRButtonDown (UINT nFlags, CPoint point)
afx_msg void OnLButtonDown(UINT nFlags, CPoint point); More...
afx_msg void  | OnRButtonUp (UINT nFlags, CPoint point)
bool  | SetToggleStateOnRightClick (bool b)
bool  | ToggleStateOnRightClick () const
Defaults to on. More...
 Protected Attributes
bool  | m_bAllowRightButtonClick
bool  | m_bRButtonDown
Detailed Description
CRhinoUiCheckBox.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiCheckBox()
 CRhinoUiCheckBox::CRhinoUiCheckBox  |  ( |   | )
◆ ~CRhinoUiCheckBox()
 virtual CRhinoUiCheckBox::~CRhinoUiCheckBox  |  ( |   | )
virtual
Member Function Documentation
◆ OnMouseMove()
 afx_msg void CRhinoUiCheckBox::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnRButtonDown()
 afx_msg void CRhinoUiCheckBox::OnRButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
afx_msg void OnLButtonDown(UINT nFlags, CPoint point);
◆ OnRButtonUp()
 afx_msg void CRhinoUiCheckBox::OnRButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ SetToggleStateOnRightClick()
 bool CRhinoUiCheckBox::SetToggleStateOnRightClick  |  ( |  bool  |  b | )
◆ ToggleStateOnRightClick()
 bool CRhinoUiCheckBox::ToggleStateOnRightClick  |  ( |   | ) |   const
Defaults to on.
Member Data Documentation
◆ m_bAllowRightButtonClick
 bool CRhinoUiCheckBox::m_bAllowRightButtonClick
protected
◆ m_bRButtonDown
 bool CRhinoUiCheckBox::m_bRButtonDown
protected