Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiModelessDockingDialog Class Reference
RhinoUI
#include <RhinoSdkUiPageDockBarManager.h>
 Inheritance diagram for CRhinoUiModelessDockingDialog:
 Public Member Functions
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
virtual void  | OnExpandTab (int iTabIndex, bool bExpand)
virtual void  | OnHideTab (int iTabIndex, bool bHide)
virtual BOOL32  | OnInitDialog ()
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Public Member Functions inherited from CRhinoUiDockBarClientExpandableTabPage
CRhinoUiDockBarClientExpandableTabPage (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDockBarClientExpandableTabPage (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDockBarClientExpandableTabPage ()
 Public Member Functions inherited from CRhinoUiExpandableTabPage
CRhinoUiExpandableTabPage (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiExpandableTabPage (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiExpandableTabPage ()
const CRhinoUiExpandableTabCtrlItem *  | GetExpandableTabCtrlItem () const
CRhinoUiExpandableTabCtrl *  | GetTabCtrl () const
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSysColorChange ()
LPCTSTR  | PageName () const
bool  | SetUseSpecialColors (bool b)
bool  | UseSpecialColors () const
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
CRhinoUiModelessDockingDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiModelessDockingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiModelessDockingDialog ()
void  | Construct ()
 Protected Member Functions inherited from CRhinoUiExpandableTabPage
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Protected Attributes
UUID  | m_uuid
ON_wString  | m_wName
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
 Friends
class  | CRhinoUiModlessDockingDialogManager
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
Detailed Description
class CRhinoUiModelessDockingDialog
Constructor & Destructor Documentation
◆ CRhinoUiModelessDockingDialog() [1/2]
 CRhinoUiModelessDockingDialog::CRhinoUiModelessDockingDialog  |  ( |  LPCTSTR  |  lpszTemplateName = NULL,
|  CWnd *  |  pParentWnd = NULL
)
protected
◆ CRhinoUiModelessDockingDialog() [2/2]
 CRhinoUiModelessDockingDialog::CRhinoUiModelessDockingDialog  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
protected
◆ ~CRhinoUiModelessDockingDialog()
 virtual CRhinoUiModelessDockingDialog::~CRhinoUiModelessDockingDialog  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Construct()
 void CRhinoUiModelessDockingDialog::Construct  |  ( |   | )
protected
◆ ForwardLMouseDblClickMessagesToParent()
 virtual bool CRhinoUiModelessDockingDialog::ForwardLMouseDblClickMessagesToParent  |  ( |  CPoint  |  point | )
virtual
Description: This method is overridden to allow users to toggle dock bar docked state by double clicking on the client area of the dialog.
See CRhinoUiDialog::ForwardLMouseDblClickMessagesToParent() for additional details. See Also: CRhinoUiDialog::ForwardLMouseDblClickMessagesToParent()
Reimplemented from CRhinoUiDockBarClientExpandableTabPage.
◆ ForwardLMouseDownMessagesToParent()
 virtual bool CRhinoUiModelessDockingDialog::ForwardLMouseDownMessagesToParent  |  ( |  CPoint  |  point | )
virtual
Description: This method is overridden to allow users to drag dock bar by clicking on client area of the dialog.
See CRhinoUiDialog::ForwardLMouseDownMessagesToParent() for additional details. See Also: CRhinoUiDialog::ForwardLMouseDownMessagesToParent()
Reimplemented from CRhinoUiDockBarClientExpandableTabPage.
◆ OnExpandTab()
 virtual void CRhinoUiModelessDockingDialog::OnExpandTab  |  ( |  int  |  iTabIndex,
|  bool  |  bExpand
)
virtual
Description: Event notification which is called when a tabs has been expanded or contracted.
Parameters: iTabIndex [in] Tab control index for this item bExpand [in] If true then tab has been expanded otherwise tab has been contracted.
See Also: CRhinoUiExpandableTabCtrl::ExpandItem()
Reimplemented from CRhinoUiExpandableTabPage.
◆ OnHideTab()
 virtual void CRhinoUiModelessDockingDialog::OnHideTab  |  ( |  int  |  iTabIndex,
|  bool  |  bHide
)
virtual
 Begin CRhinoUiExpandableTabPage overrides
Reimplemented from CRhinoUiExpandableTabPage.
◆ OnInitDialog()
 virtual BOOL32 CRhinoUiModelessDockingDialog::OnInitDialog  |  ( |   | )
virtual
Reimplemented from CRhinoUiExpandableTabPage.
◆ OnUnhandledEscapeAndEnter()
 virtual void CRhinoUiModelessDockingDialog::OnUnhandledEscapeAndEnter  |  ( |  UINT  |  nChar | )
virtual
End CRhinoUiExpandableTabPage overrides
Begin CRhinoUiDialog overrides
Reimplemented from CRhinoUiDialog.
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiModelessDockingDialog::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
virtual
Reimplemented from CRhinoUiExpandableTabPage.
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiModelessDockingDialog::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
Reimplemented from CRhinoUiDialog.
◆ WindowProc()
 virtual LRESULT CRhinoUiModelessDockingDialog::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
Reimplemented from CRhinoUiDialog.
Friends And Related Function Documentation
◆ CRhinoUiModlessDockingDialogManager
 friend class CRhinoUiModlessDockingDialogManager
friend
End CRhinoUiDialog overrides
Member Data Documentation
◆ m_uuid
 UUID CRhinoUiModelessDockingDialog::m_uuid
protected
◆ m_wName
 ON_wString CRhinoUiModelessDockingDialog::m_wName
protected