Public Member Functions | Friends | List of all members
CRhinoDimStyleContext Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Inheritance diagram for CRhinoDimStyleContext:
 Public Member Functions
CRhinoDimStyleContext (const CRhinoDimStyleContext &)=default
virtual  | ~CRhinoDimStyleContext ()
const ON_DimStyle &  | CurrentDimStyle () const override
const ON_DimStyle *  | DimStyleFromContentHash (const ON_SHA1_Hash &content_hash, const ON_DimStyle *not_found_result=nullptr) const override
const ON_DimStyle *  | DimStyleFromFont (const ON_Font &font, double model_space_text_scale, double text_height, ON::LengthUnitSystem text_height_unit_system, bool bReturnClosestMatch, const ON_DimStyle *not_found_result=nullptr) const override
const ON_DimStyle *  | DimStyleFromId (ON_UUID id, const ON_DimStyle *not_found_result=nullptr) const override
const ON_DimStyle *  | DimStyleFromName (const ON_NameHash &name_hash, const ON_DimStyle *not_found_result=nullptr) const override
const class CRhinoDoc *  | Document () const
const ON_DimStyle *  | FirstDimStyle (bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const override
virtual ON::LengthUnitSystem  | ModelUnitSystem () const override
const ON_DimStyle *  | NextDimStyle (ON_UUID id, bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const override
CRhinoDimStyleContext &  | operator= (const CRhinoDimStyleContext &)=default
const ON_DimStyle *  | PrevDimStyle (ON_UUID id, bool bIncludeSystemDimStyles=false, bool bIncludeDeletedDimStyles=false) const override
 Public Member Functions inherited from ON_DimStyleContext
ON_DimStyleContext ()=default
ON_DimStyleContext (const ON_DimStyleContext &)=default
virtual  | ~ON_DimStyleContext ()
virtual bool  | AddDimStyle (const ON_DimStyle &dim_style, bool bResolveNameAndIdConflicts)
virtual ON__UINT64  | ModelSerialNumber () const
virtual bool  | ModifyDimStyle (ON_UUID model_dim_style_id, const ON_DimStyle &dim_style)
ON_DimStyleContext &  | operator= (const ON_DimStyleContext &)=default
 Friends
class  | CRhinoDoc
 Additional Inherited Members
 Protected Attributes inherited from ON_DimStyleContext
ON__UINT64  | m_model_serial_number = 0
ON::LengthUnitSystem  | m_unit_system = ON::LengthUnitSystem::Millimeters
Constructor & Destructor Documentation
◆ ~CRhinoDimStyleContext()
 virtual CRhinoDimStyleContext::~CRhinoDimStyleContext  |  ( |   | )
virtual
◆ CRhinoDimStyleContext()
 CRhinoDimStyleContext::CRhinoDimStyleContext  |  ( |  const CRhinoDimStyleContext &  |   | )
default
Member Function Documentation
◆ CurrentDimStyle()
 const ON_DimStyle& CRhinoDimStyleContext::CurrentDimStyle  |  ( |   | ) |   const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ DimStyleFromContentHash()
 const ON_DimStyle* CRhinoDimStyleContext::DimStyleFromContentHash  |  ( |  const ON_SHA1_Hash &  |  content_hash,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ DimStyleFromFont()
 const ON_DimStyle* CRhinoDimStyleContext::DimStyleFromFont  |  ( |  const ON_Font &  |  font,
|  double  |  model_space_text_scale,
|  double  |  text_height,
|  ON::LengthUnitSystem  |  text_height_unit_system,
|  bool  |  bReturnClosestMatch,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ DimStyleFromId()
 const ON_DimStyle* CRhinoDimStyleContext::DimStyleFromId  |  ( |  ON_UUID  |  id,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ DimStyleFromName()
 const ON_DimStyle* CRhinoDimStyleContext::DimStyleFromName  |  ( |  const ON_NameHash &  |  name_hash,
|  const ON_DimStyle *  |  not_found_result = nullptr
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ Document()
 const class CRhinoDoc* CRhinoDimStyleContext::Document  |  ( |   | ) |   const
◆ FirstDimStyle()
 const ON_DimStyle* CRhinoDimStyleContext::FirstDimStyle  |  ( |  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ ModelUnitSystem()
 virtual ON::LengthUnitSystem CRhinoDimStyleContext::ModelUnitSystem  |  ( |   | ) |   const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ NextDimStyle()
 const ON_DimStyle* CRhinoDimStyleContext::NextDimStyle  |  ( |  ON_UUID  |  id,
|  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
◆ operator=()
 CRhinoDimStyleContext& CRhinoDimStyleContext::operator=  |  ( |  const CRhinoDimStyleContext &  |   | )
default
◆ PrevDimStyle()
 const ON_DimStyle* CRhinoDimStyleContext::PrevDimStyle  |  ( |  ON_UUID  |  id,
|  bool  |  bIncludeSystemDimStyles = false,
|  bool  |  bIncludeDeletedDimStyles = false
) |   |  const
overridevirtual
Reimplemented from ON_DimStyleContext.
Friends And Related Function Documentation
◆ CRhinoDoc
 friend class CRhinoDoc
friend