Public Member Functions | Public Attributes | List of all members
ON_CurvePair Class Reference
OpenNURBS
a parametric/space curve pair used in surface intersections More...
#include <opennurbs_plus_implicitfn.h>
 Public Member Functions
ON_CurvePair ()
ON_CurvePair (const ON_Curve *curve2d, const ON_Curve *curve3d)
 Public Attributes
const ON_Curve *  | Curve2d
const ON_Curve *  | Curve3d
Detailed Description
a parametric/space curve pair used in surface intersections
Constructor & Destructor Documentation
◆ ON_CurvePair() [1/2]
 ON_CurvePair::ON_CurvePair  |  ( |   | )
inline
◆ ON_CurvePair() [2/2]
 ON_CurvePair::ON_CurvePair  |  ( |  const ON_Curve *  |  curve2d,
|  const ON_Curve *  |  curve3d
)
inline
Member Data Documentation
◆ Curve2d
 const ON_Curve* ON_CurvePair::Curve2d
◆ Curve3d
 const ON_Curve* ON_CurvePair::Curve3d