Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoFileMenu Class Reference
Rhino
#include <rhinoSdkFileMenu.h>
 Public Member Functions
CRhinoFileMenu ()
virtual  | ~CRhinoFileMenu ()
 Protected Member Functions
void  | Defaults ()
unsigned int  | FileNew (bool bUseDialogs)
bool  | FileReference (ON_wString &wFileName, bool bUseDialogs, HWND hWndParent=NULL)
bool  | Finish (bool result)
bool  | ImportFile (unsigned int rhino_doc_sn, const wchar_t *file_name_to_read, bool bUseDialogs, bool bSelectNewObjects, ON_wString *file_name_read)
bool  | OnOpenRecentFile (UINT nID)
unsigned int  | OpenFile (const wchar_t *file_name_to_read, bool bUseDialogs, bool bCreateEmptyDocOnFailure, ON_wString *file_name_read)
void  | Start (bool bUseDialogs)
 Protected Attributes
CRhinoFileReadOptions  | m_SaveFileReadOptions
 Friends
class  | CMainFrame
class  | CRhinoApp
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoFileMenu()
 CRhinoFileMenu::CRhinoFileMenu  |  ( |   | )
◆ ~CRhinoFileMenu()
 virtual CRhinoFileMenu::~CRhinoFileMenu  |  ( |   | )
virtual
Member Function Documentation
◆ Defaults()
 void CRhinoFileMenu::Defaults  |  ( |   | )
protected
◆ FileNew()
 unsigned int CRhinoFileMenu::FileNew  |  ( |  bool  |  bUseDialogs | )
protected
◆ FileReference()
 bool CRhinoFileMenu::FileReference  |  ( |  ON_wString &  |  wFileName,
|  bool  |  bUseDialogs,
|  HWND  |  hWndParent = NULL
)
protected
◆ Finish()
 bool CRhinoFileMenu::Finish  |  ( |  bool  |  result | )
protected
◆ ImportFile()
 bool CRhinoFileMenu::ImportFile  |  ( |  unsigned int  |  rhino_doc_sn,
|  const wchar_t *  |  file_name_to_read,
|  bool  |  bUseDialogs,
|  bool  |  bSelectNewObjects,
|  ON_wString *  |  file_name_read
)
protected
Description: Import the contents of a file into the specified document. Parameters: rhino_doc_sn - [in] document to import into file_name_to_read - [in] name of file to read. If null, the user is asked to select a file. bUseDialogs - [in] true if user dialogs can be used. Otherwise a predictable scripting interface is used. file_name_read - [out] If not null, the name of the file that is actually read is returned here. Returns: True if the file was successfully read.
◆ OnOpenRecentFile()
 bool CRhinoFileMenu::OnOpenRecentFile  |  ( |  UINT  |  nID | )
protected
◆ OpenFile()
 unsigned int CRhinoFileMenu::OpenFile  |  ( |  const wchar_t *  |  file_name_to_read,
|  bool  |  bUseDialogs,
|  bool  |  bCreateEmptyDocOnFailure,
|  ON_wString *  |  file_name_read
)
protected
Description: Create a new document and read a file into that new document. Parameters: file_name_to_read - [in] name of file to read. If null, the user is asked to select a file. bUseDialogs - [in] true if user dialogs can be used. Otherwise a predictable scripting interface is used. bCreateEmptyDocOnFailure - [in] true if you want to create an empty document if the file readding fails. file_name_read - [out] If not null, the name of the file that is actually read is returned here. Returns: Runtime serial number of the new document or 0 if fails.
◆ Start()
 void CRhinoFileMenu::Start  |  ( |  bool  |  bUseDialogs | )
protected
Friends And Related Function Documentation
◆ CMainFrame
 friend class CMainFrame
friend
◆ CRhinoApp
 friend class CRhinoApp
friend
Member Data Documentation
◆ m_SaveFileReadOptions
 CRhinoFileReadOptions CRhinoFileMenu::m_SaveFileReadOptions
protected