Public Member Functions | Protected Member Functions | List of all members
IRhinoUiWindow Class Referenceabstract
RDK
#include <IRhRdkSectionHolder.h>
 Inheritance diagram for IRhinoUiWindow:
 Public Member Functions
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
virtual void  | Delete (void)=0
virtual void  | Enable (bool bEnable)=0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual HWND  | GetWindow (void)=0
virtual bool  | IsCreated (void) const =0
virtual bool  | IsEnabled (void) const =0
virtual bool  | IsShown (void) const =0
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false)=0
virtual HWND  | Parent (void) const =0
virtual void  | Refresh (bool bImmediate=false)=0
virtual void  | SetFocus (void)=0
virtual void  | SetParent (HWND parent)=0
virtual void  | Show (bool bShow)=0
 Protected Member Functions
virtual  | ~IRhinoUiWindow ()
Constructor & Destructor Documentation
◆ ~IRhinoUiWindow()
 virtual IRhinoUiWindow::~IRhinoUiWindow  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ Caption()
 virtual ON_wString IRhinoUiWindow::Caption  |  ( |  bool  |  bAlwaysEnglish = false | ) |   const
pure virtual
Implement this method to return the text caption that should be displayed in the window.
Parameters
bAlwaysEnglish | controls localization. If true the method must return the English caption. Otherwise, it must return the localized caption. If no caption is required, the method should return an empty string.
◆ Delete()
 virtual void IRhinoUiWindow::Delete  |  ( |  void  |   | )
pure virtual
Destroys the underlying window and deletes the object.
◆ Enable()
 virtual void IRhinoUiWindow::Enable  |  ( |  bool  |  bEnable | )
pure virtual
Enables or disables the window.
Parameters
bEnable | is true to enable the window or false to disable it.
◆ EVF()
 virtual void* IRhinoUiWindow::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
pure virtual
Emergency virtual function for future expansion.
◆ GetScreenCoords()
 virtual void IRhinoUiWindow::GetScreenCoords  |  ( |  ON_4iRect &  |  rectOut | ) |   const
pure virtual
Get the screen coordinates of the underlying window.
Parameters
rectOut | accepts the coordinates.
◆ GetWindow()
 virtual HWND IRhinoUiWindow::GetWindow  |  ( |  void  |   | )
pure virtual
Do not use
◆ IsCreated()
 virtual bool IRhinoUiWindow::IsCreated  |  ( |  void  |   | ) |   const
pure virtual
Returns
true if the underlying window has been created, else false.
◆ IsEnabled()
 virtual bool IRhinoUiWindow::IsEnabled  |  ( |  void  |   | ) |   const
pure virtual
Returns
true if the window is enabled, else false.
◆ IsShown()
 virtual bool IRhinoUiWindow::IsShown  |  ( |  void  |   | ) |   const
pure virtual
Returns
true if the window is being shown, else false.
◆ Move()
 virtual void IRhinoUiWindow::Move  |  ( |  const ON_4iRect &  |  rect,
|  bool  |  bRepaint = false,
|  bool  |  bRepaintBorder = false
)
pure virtual
Moves the underlying window.
Parameters
rect | is the rectangle to move to within the parent.
◆ Parent()
 virtual HWND IRhinoUiWindow::Parent  |  ( |  void  |   | ) |   const
pure virtual
Get the parent (host) window. This will return null unless a parent has been set in SetParent().
◆ Refresh()
 virtual void IRhinoUiWindow::Refresh  |  ( |  bool  |  bImmediate = false | )
pure virtual
Refreshes the window by repainting it.
Parameters
bImmediate | is true if the window should be repainted immediately, else false.
Note
On Microsoft Windows, Refresh(true) is equivalent to RedrawWindow() and Refresh(false) is equivalent to Invalidate().
◆ SetFocus()
 virtual void IRhinoUiWindow::SetFocus  |  ( |  void  |   | )
pure virtual
Sets the keyboard focus to the window.
◆ SetParent()
 virtual void IRhinoUiWindow::SetParent  |  ( |  HWND  |  parent | )
pure virtual
Set the parent (host) window.
Parameters
parent | is the parent to host the window on.
Note
When the object uses a controller, the controller must be set before calling SetParent() otherwise creation of the underlying control may fail.
◆ Show()
 virtual void IRhinoUiWindow::Show  |  ( |  bool  |  bShow | )
pure virtual
Shows or hides the window.
Parameters
bShow | is true to show the window or false to hide it.