Public Member Functions | Public Attributes | List of all members
CRhinoObjectDrawContext Class Reference
Rhino
#include <rhinoSdkDraw.h>
 Public Member Functions
CRhinoObjectDrawContext () RHINO_NOEXCEPT
 Public Attributes
const class CRhinoDrawAttributes *  | m_da
class CRhinoDisplayPipeline *  | m_dp
no friends /void ClearHelper() RHINO_NOEXCEPT; /void DestroyHelper() RHINO_NOEXCEPT; /void CopyHelper(const CRhinoObjectDrawContext&) RHINO_NOEXCEPT; /void CloneHelper(CRhinoObjectDrawContext&) RHINO_NOEXCEPT; More...
Constructor & Destructor Documentation
◆ CRhinoObjectDrawContext()
 CRhinoObjectDrawContext::CRhinoObjectDrawContext  |  ( |   | )
Member Data Documentation
◆ m_da
 const class CRhinoDrawAttributes* CRhinoObjectDrawContext::m_da
These attributes will depend on both the object and the context (type of view (page, workd), projection, ...) Ideally most of the information can be reused for many "frames" or quickly updated each frame. The CRhinoDrawAttributes class should be on the heap and efficiently managed by a view and object.
◆ m_dp
 class CRhinoDisplayPipeline* CRhinoObjectDrawContext::m_dp
no friends /void ClearHelper() RHINO_NOEXCEPT; /void DestroyHelper() RHINO_NOEXCEPT; /void CopyHelper(const CRhinoObjectDrawContext&) RHINO_NOEXCEPT; /void CloneHelper(CRhinoObjectDrawContext&) RHINO_NOEXCEPT;
The current implementation of CRhinoObjectDrawContext works perfectly with the C++ defaults for the following. That may change in the future. prototype example. Change early and often! perhaps a dp pointer is needed to get up and running ?