Public Member Functions | Static Public Attributes | List of all members
ON_ArchivableDictionary Class Reference
OpenNURBS
#include <opennurbs_archivable_dictionary.h>
 Public Member Functions
ON_ArchivableDictionary ()
ON_ArchivableDictionary (const ON_ArchivableDictionary &src)
virtual  | ~ON_ArchivableDictionary ()
void  | Clear ()
Sets count to 0. More...
bool  | ContainsKey (const wchar_t *key) const
bool  | CopyValue (const wchar_t *key, const ON_ArchivableDictionary &source, const wchar_t *source_key=nullptr)
void  | CopyValues (const ON_ArchivableDictionary &source)
int  | Count () const
Number of elements in dictionary. More...
bool  | GetBool (const wchar_t *key) const
ON_SimpleArray< bool >  | GetBoolArray (const wchar_t *key) const
double  | GetDouble (const wchar_t *key) const
ON_SimpleArray< double >  | GetDoubleArray (const wchar_t *key) const
float  | GetFloat (const wchar_t *key) const
ON_SimpleArray< float >  | GetFloatArray (const wchar_t *key) const
ON__INT16  | GetInt16 (const wchar_t *key) const
ON_SimpleArray< ON__INT16 >  | GetInt16Array (const wchar_t *key) const
ON__INT32  | GetInt32 (const wchar_t *key) const
ON_SimpleArray< ON__INT32 >  | GetInt32Array (const wchar_t *key) const
ON__INT64  | GetInt64 (const wchar_t *key) const
ON__INT8  | GetInt8 (const wchar_t *key) const
ON_SimpleArray< ON__INT8 >  | GetInt8Array (const wchar_t *key) const
ON_ClassArray< ON_wString >  | GetKeys () const
ON_MeshParameters  | GetMeshParameters (const wchar_t *key) const
ON_wString  | GetString (const wchar_t *key) const
ON_ClassArray< ON_wString >  | GetStringArray (const wchar_t *key) const
ON__UINT8  | GetUInt8 (const wchar_t *key) const
ON_SimpleArray< ON__UINT8 >  | GetUInt8Array (const wchar_t *key) const
ON_UUID  | GetUuid (const wchar_t *key) const
ON_SimpleArray< ON_UUID >  | GetUuidArray (const wchar_t *key) const
ON_ArchivableDictionary &  | operator= (const ON_ArchivableDictionary &src)
virtual bool  | Read (ON_BinaryArchive &binary_archive)
bool  | Remove (const wchar_t *key)
void  | SetBool (const wchar_t *key, bool value)
void  | SetBoolArray (const wchar_t *key, const ON_SimpleArray< bool > &value)
void  | SetDouble (const wchar_t *key, double value)
void  | SetDoubleArray (const wchar_t *key, const ON_SimpleArray< double > &value)
void  | SetFloat (const wchar_t *key, float value)
void  | SetFloatArray (const wchar_t *key, const ON_SimpleArray< float > &value)
void  | SetInt16 (const wchar_t *key, ON__INT16 value)
void  | SetInt16Array (const wchar_t *key, const ON_SimpleArray< ON__INT16 > &value)
void  | SetInt32 (const wchar_t *key, ON__INT32 value)
void  | SetInt32Array (const wchar_t *key, const ON_SimpleArray< ON__INT32 > &value)
void  | SetInt64 (const wchar_t *key, ON__INT64 value)
void  | SetInt8 (const wchar_t *key, ON__INT8 value)
void  | SetInt8Array (const wchar_t *key, const ON_SimpleArray< ON__INT8 > &value)
void  | SetMeshParameters (const wchar_t *key, const ON_MeshParameters &value)
void  | SetString (const wchar_t *key, const ON_wString &value)
void  | SetStringArray (const wchar_t *key, const ON_ClassArray< ON_wString > &value)
void  | SetUInt8 (const wchar_t *key, ON__UINT8 value)
void  | SetUInt8Array (const wchar_t *key, const ON_SimpleArray< ON__UINT8 > &value)
void  | SetUuid (const wchar_t *key, ON_UUID value)
void  | SetUuidArray (const wchar_t *key, const ON_SimpleArray< ON_UUID > &value)
bool  | TryGetBool (const wchar_t *key, bool &value) const
bool  | TryGetBoolArray (const wchar_t *key, ON_SimpleArray< bool > &value) const
bool  | TryGetDouble (const wchar_t *key, double &value) const
bool  | TryGetDoubleArray (const wchar_t *key, ON_SimpleArray< double > &value) const
bool  | TryGetFloat (const wchar_t *key, float &value) const
bool  | TryGetFloatArray (const wchar_t *key, ON_SimpleArray< float > &value) const
bool  | TryGetInt16 (const wchar_t *key, ON__INT16 &value) const
bool  | TryGetInt16Array (const wchar_t *key, ON_SimpleArray< ON__INT16 > &value) const
bool  | TryGetInt32 (const wchar_t *key, ON__INT32 &value) const
bool  | TryGetInt32Array (const wchar_t *key, ON_SimpleArray< ON__INT32 > &value) const
bool  | TryGetInt64 (const wchar_t *key, ON__INT64 &value) const
bool  | TryGetInt8 (const wchar_t *key, ON__INT8 &value) const
bool  | TryGetInt8Array (const wchar_t *key, ON_SimpleArray< ON__INT8 > &value) const
bool  | TryGetMeshParameters (const wchar_t *key, ON_MeshParameters &value) const
bool  | TryGetString (const wchar_t *key, ON_wString &value) const
bool  | TryGetStringArray (const wchar_t *key, ON_ClassArray< ON_wString > &value) const
bool  | TryGetUInt8 (const wchar_t *key, ON__UINT8 &value) const
bool  | TryGetUInt8Array (const wchar_t *key, ON_SimpleArray< ON__UINT8 > &value) const
bool  | TryGetUuid (const wchar_t *key, ON_UUID &value) const
bool  | TryGetUuidArray (const wchar_t *key, ON_SimpleArray< ON_UUID > &value) const
bool  | TrySetBool (const wchar_t *key, bool value)
bool  | TrySetBoolArray (const wchar_t *key, const ON_SimpleArray< bool > &value)
bool  | TrySetDouble (const wchar_t *key, double value)
bool  | TrySetDoubleArray (const wchar_t *key, const ON_SimpleArray< double > &value)
bool  | TrySetFloat (const wchar_t *key, float value)
bool  | TrySetFloatArray (const wchar_t *key, const ON_SimpleArray< float > &value)
bool  | TrySetInt16 (const wchar_t *key, ON__INT16 value)
bool  | TrySetInt16Array (const wchar_t *key, const ON_SimpleArray< ON__INT16 > &value)
bool  | TrySetInt32 (const wchar_t *key, ON__INT32 value)
bool  | TrySetInt32Array (const wchar_t *key, const ON_SimpleArray< ON__INT32 > &value)
bool  | TrySetInt64 (const wchar_t *key, ON__INT64 value)
bool  | TrySetInt8 (const wchar_t *key, ON__INT8 value)
bool  | TrySetInt8Array (const wchar_t *key, const ON_SimpleArray< ON__INT8 > &value)
bool  | TrySetMeshParameters (const wchar_t *key, const ON_MeshParameters &value)
bool  | TrySetString (const wchar_t *key, const ON_wString &value)
bool  | TrySetStringArray (const wchar_t *key, const ON_ClassArray< ON_wString > &value)
bool  | TrySetUInt8 (const wchar_t *key, ON__UINT8 value)
bool  | TrySetUInt8Array (const wchar_t *key, const ON_SimpleArray< ON__UINT8 > &value)
bool  | TrySetUuid (const wchar_t *key, ON_UUID value)
bool  | TrySetUuidArray (const wchar_t *key, const ON_SimpleArray< ON_UUID > &value)
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Attributes
static const ON_ArchivableDictionary  | Empty
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_ArchivableDictionary() [1/2]
 ON_ArchivableDictionary::ON_ArchivableDictionary  |  ( |   | )
◆ ~ON_ArchivableDictionary()
 virtual ON_ArchivableDictionary::~ON_ArchivableDictionary  |  ( |   | )
virtual
◆ ON_ArchivableDictionary() [2/2]
 ON_ArchivableDictionary::ON_ArchivableDictionary  |  ( |  const ON_ArchivableDictionary &  |  src | )
Member Function Documentation
◆ Clear()
 void ON_ArchivableDictionary::Clear  |  ( |   | )
Sets count to 0.
◆ ContainsKey()
 bool ON_ArchivableDictionary::ContainsKey  |  ( |  const wchar_t *  |  key | ) |   const
◆ CopyValue()
 bool ON_ArchivableDictionary::CopyValue  |  ( |  const wchar_t *  |  key,
|  const ON_ArchivableDictionary &  |  source,
|  const wchar_t *  |  source_key = nullptr
)
◆ CopyValues()
 void ON_ArchivableDictionary::CopyValues  |  ( |  const ON_ArchivableDictionary &  |  source | )
◆ Count()
 int ON_ArchivableDictionary::Count  |  ( |   | ) |   const
Number of elements in dictionary.
◆ GetBool()
 bool ON_ArchivableDictionary::GetBool  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetBoolArray()
 ON_SimpleArray<bool> ON_ArchivableDictionary::GetBoolArray  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetDouble()
 double ON_ArchivableDictionary::GetDouble  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetDoubleArray()
 ON_SimpleArray<double> ON_ArchivableDictionary::GetDoubleArray  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetFloat()
 float ON_ArchivableDictionary::GetFloat  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetFloatArray()
 ON_SimpleArray<float> ON_ArchivableDictionary::GetFloatArray  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt16()
 ON__INT16 ON_ArchivableDictionary::GetInt16  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt16Array()
 ON_SimpleArray<ON__INT16> ON_ArchivableDictionary::GetInt16Array  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt32()
 ON__INT32 ON_ArchivableDictionary::GetInt32  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt32Array()
 ON_SimpleArray<ON__INT32> ON_ArchivableDictionary::GetInt32Array  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt64()
 ON__INT64 ON_ArchivableDictionary::GetInt64  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt8()
 ON__INT8 ON_ArchivableDictionary::GetInt8  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetInt8Array()
 ON_SimpleArray<ON__INT8> ON_ArchivableDictionary::GetInt8Array  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetKeys()
 ON_ClassArray<ON_wString> ON_ArchivableDictionary::GetKeys  |  ( |   | ) |   const
◆ GetMeshParameters()
 ON_MeshParameters ON_ArchivableDictionary::GetMeshParameters  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetString()
 ON_wString ON_ArchivableDictionary::GetString  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetStringArray()
 ON_ClassArray<ON_wString> ON_ArchivableDictionary::GetStringArray  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetUInt8()
 ON__UINT8 ON_ArchivableDictionary::GetUInt8  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetUInt8Array()
 ON_SimpleArray<ON__UINT8> ON_ArchivableDictionary::GetUInt8Array  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetUuid()
 ON_UUID ON_ArchivableDictionary::GetUuid  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetUuidArray()
 ON_SimpleArray<ON_UUID> ON_ArchivableDictionary::GetUuidArray  |  ( |  const wchar_t *  |  key | ) |   const
◆ operator=()
 ON_ArchivableDictionary& ON_ArchivableDictionary::operator=  |  ( |  const ON_ArchivableDictionary &  |  src | )
◆ Read()
 virtual bool ON_ArchivableDictionary::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
virtual
◆ Remove()
 bool ON_ArchivableDictionary::Remove  |  ( |  const wchar_t *  |  key | )
◆ SetBool()
 void ON_ArchivableDictionary::SetBool  |  ( |  const wchar_t *  |  key,
|  bool  |  value
)
◆ SetBoolArray()
 void ON_ArchivableDictionary::SetBoolArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< bool > &  |  value
)
◆ SetDouble()
 void ON_ArchivableDictionary::SetDouble  |  ( |  const wchar_t *  |  key,
|  double  |  value
)
◆ SetDoubleArray()
 void ON_ArchivableDictionary::SetDoubleArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< double > &  |  value
)
◆ SetFloat()
 void ON_ArchivableDictionary::SetFloat  |  ( |  const wchar_t *  |  key,
|  float  |  value
)
◆ SetFloatArray()
 void ON_ArchivableDictionary::SetFloatArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< float > &  |  value
)
◆ SetInt16()
 void ON_ArchivableDictionary::SetInt16  |  ( |  const wchar_t *  |  key,
|  ON__INT16  |  value
)
◆ SetInt16Array()
 void ON_ArchivableDictionary::SetInt16Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT16 > &  |  value
)
◆ SetInt32()
 void ON_ArchivableDictionary::SetInt32  |  ( |  const wchar_t *  |  key,
|  ON__INT32  |  value
)
◆ SetInt32Array()
 void ON_ArchivableDictionary::SetInt32Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT32 > &  |  value
)
◆ SetInt64()
 void ON_ArchivableDictionary::SetInt64  |  ( |  const wchar_t *  |  key,
|  ON__INT64  |  value
)
◆ SetInt8()
 void ON_ArchivableDictionary::SetInt8  |  ( |  const wchar_t *  |  key,
|  ON__INT8  |  value
)
◆ SetInt8Array()
 void ON_ArchivableDictionary::SetInt8Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT8 > &  |  value
)
◆ SetMeshParameters()
 void ON_ArchivableDictionary::SetMeshParameters  |  ( |  const wchar_t *  |  key,
|  const ON_MeshParameters &  |  value
)
◆ SetString()
 void ON_ArchivableDictionary::SetString  |  ( |  const wchar_t *  |  key,
|  const ON_wString &  |  value
)
◆ SetStringArray()
 void ON_ArchivableDictionary::SetStringArray  |  ( |  const wchar_t *  |  key,
|  const ON_ClassArray< ON_wString > &  |  value
)
◆ SetUInt8()
 void ON_ArchivableDictionary::SetUInt8  |  ( |  const wchar_t *  |  key,
|  ON__UINT8  |  value
)
◆ SetUInt8Array()
 void ON_ArchivableDictionary::SetUInt8Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__UINT8 > &  |  value
)
◆ SetUuid()
 void ON_ArchivableDictionary::SetUuid  |  ( |  const wchar_t *  |  key,
|  ON_UUID  |  value
)
◆ SetUuidArray()
 void ON_ArchivableDictionary::SetUuidArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON_UUID > &  |  value
)
◆ TryGetBool()
 bool ON_ArchivableDictionary::TryGetBool  |  ( |  const wchar_t *  |  key,
|  bool &  |  value
) |   |  const
◆ TryGetBoolArray()
 bool ON_ArchivableDictionary::TryGetBoolArray  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< bool > &  |  value
) |   |  const
◆ TryGetDouble()
 bool ON_ArchivableDictionary::TryGetDouble  |  ( |  const wchar_t *  |  key,
|  double &  |  value
) |   |  const
◆ TryGetDoubleArray()
 bool ON_ArchivableDictionary::TryGetDoubleArray  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< double > &  |  value
) |   |  const
◆ TryGetFloat()
 bool ON_ArchivableDictionary::TryGetFloat  |  ( |  const wchar_t *  |  key,
|  float &  |  value
) |   |  const
◆ TryGetFloatArray()
 bool ON_ArchivableDictionary::TryGetFloatArray  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< float > &  |  value
) |   |  const
◆ TryGetInt16()
 bool ON_ArchivableDictionary::TryGetInt16  |  ( |  const wchar_t *  |  key,
|  ON__INT16 &  |  value
) |   |  const
◆ TryGetInt16Array()
 bool ON_ArchivableDictionary::TryGetInt16Array  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< ON__INT16 > &  |  value
) |   |  const
◆ TryGetInt32()
 bool ON_ArchivableDictionary::TryGetInt32  |  ( |  const wchar_t *  |  key,
|  ON__INT32 &  |  value
) |   |  const
◆ TryGetInt32Array()
 bool ON_ArchivableDictionary::TryGetInt32Array  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< ON__INT32 > &  |  value
) |   |  const
◆ TryGetInt64()
 bool ON_ArchivableDictionary::TryGetInt64  |  ( |  const wchar_t *  |  key,
|  ON__INT64 &  |  value
) |   |  const
◆ TryGetInt8()
 bool ON_ArchivableDictionary::TryGetInt8  |  ( |  const wchar_t *  |  key,
|  ON__INT8 &  |  value
) |   |  const
◆ TryGetInt8Array()
 bool ON_ArchivableDictionary::TryGetInt8Array  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< ON__INT8 > &  |  value
) |   |  const
◆ TryGetMeshParameters()
 bool ON_ArchivableDictionary::TryGetMeshParameters  |  ( |  const wchar_t *  |  key,
|  ON_MeshParameters &  |  value
) |   |  const
◆ TryGetString()
 bool ON_ArchivableDictionary::TryGetString  |  ( |  const wchar_t *  |  key,
|  ON_wString &  |  value
) |   |  const
◆ TryGetStringArray()
 bool ON_ArchivableDictionary::TryGetStringArray  |  ( |  const wchar_t *  |  key,
|  ON_ClassArray< ON_wString > &  |  value
) |   |  const
◆ TryGetUInt8()
 bool ON_ArchivableDictionary::TryGetUInt8  |  ( |  const wchar_t *  |  key,
|  ON__UINT8 &  |  value
) |   |  const
◆ TryGetUInt8Array()
 bool ON_ArchivableDictionary::TryGetUInt8Array  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< ON__UINT8 > &  |  value
) |   |  const
◆ TryGetUuid()
 bool ON_ArchivableDictionary::TryGetUuid  |  ( |  const wchar_t *  |  key,
|  ON_UUID &  |  value
) |   |  const
◆ TryGetUuidArray()
 bool ON_ArchivableDictionary::TryGetUuidArray  |  ( |  const wchar_t *  |  key,
|  ON_SimpleArray< ON_UUID > &  |  value
) |   |  const
◆ TrySetBool()
 bool ON_ArchivableDictionary::TrySetBool  |  ( |  const wchar_t *  |  key,
|  bool  |  value
)
◆ TrySetBoolArray()
 bool ON_ArchivableDictionary::TrySetBoolArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< bool > &  |  value
)
◆ TrySetDouble()
 bool ON_ArchivableDictionary::TrySetDouble  |  ( |  const wchar_t *  |  key,
|  double  |  value
)
◆ TrySetDoubleArray()
 bool ON_ArchivableDictionary::TrySetDoubleArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< double > &  |  value
)
◆ TrySetFloat()
 bool ON_ArchivableDictionary::TrySetFloat  |  ( |  const wchar_t *  |  key,
|  float  |  value
)
◆ TrySetFloatArray()
 bool ON_ArchivableDictionary::TrySetFloatArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< float > &  |  value
)
◆ TrySetInt16()
 bool ON_ArchivableDictionary::TrySetInt16  |  ( |  const wchar_t *  |  key,
|  ON__INT16  |  value
)
◆ TrySetInt16Array()
 bool ON_ArchivableDictionary::TrySetInt16Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT16 > &  |  value
)
◆ TrySetInt32()
 bool ON_ArchivableDictionary::TrySetInt32  |  ( |  const wchar_t *  |  key,
|  ON__INT32  |  value
)
◆ TrySetInt32Array()
 bool ON_ArchivableDictionary::TrySetInt32Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT32 > &  |  value
)
◆ TrySetInt64()
 bool ON_ArchivableDictionary::TrySetInt64  |  ( |  const wchar_t *  |  key,
|  ON__INT64  |  value
)
◆ TrySetInt8()
 bool ON_ArchivableDictionary::TrySetInt8  |  ( |  const wchar_t *  |  key,
|  ON__INT8  |  value
)
◆ TrySetInt8Array()
 bool ON_ArchivableDictionary::TrySetInt8Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__INT8 > &  |  value
)
◆ TrySetMeshParameters()
 bool ON_ArchivableDictionary::TrySetMeshParameters  |  ( |  const wchar_t *  |  key,
|  const ON_MeshParameters &  |  value
)
◆ TrySetString()
 bool ON_ArchivableDictionary::TrySetString  |  ( |  const wchar_t *  |  key,
|  const ON_wString &  |  value
)
◆ TrySetStringArray()
 bool ON_ArchivableDictionary::TrySetStringArray  |  ( |  const wchar_t *  |  key,
|  const ON_ClassArray< ON_wString > &  |  value
)
◆ TrySetUInt8()
 bool ON_ArchivableDictionary::TrySetUInt8  |  ( |  const wchar_t *  |  key,
|  ON__UINT8  |  value
)
◆ TrySetUInt8Array()
 bool ON_ArchivableDictionary::TrySetUInt8Array  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON__UINT8 > &  |  value
)
◆ TrySetUuid()
 bool ON_ArchivableDictionary::TrySetUuid  |  ( |  const wchar_t *  |  key,
|  ON_UUID  |  value
)
◆ TrySetUuidArray()
 bool ON_ArchivableDictionary::TrySetUuidArray  |  ( |  const wchar_t *  |  key,
|  const ON_SimpleArray< ON_UUID > &  |  value
)
◆ Write()
 virtual bool ON_ArchivableDictionary::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
virtual
Member Data Documentation
◆ Empty
 const ON_ArchivableDictionary ON_ArchivableDictionary::Empty
static