Public Member Functions | List of all members
CRhRdkContentAddedByUser Class Referencefinal
RDK
#include <RhRdkEventSink.h>
 Public Member Functions
CRhRdkContentAddedByUser (const CRhRdkContentArray &, int, bool bNameWasGenerated, void *)
const CRhRdkContentArray &  | Contents (void) const
RDK_DEPRECATED int  | EditingLevel (void) const
bool  | NameWasGenerated (void) const
Detailed Description
Deprecated:
OBSOLETE
See also
CRhRdkEventWatcher::OnContentAddedByUser()
Constructor & Destructor Documentation
◆ CRhRdkContentAddedByUser()
 CRhRdkContentAddedByUser::CRhRdkContentAddedByUser  |  ( |  const CRhRdkContentArray &  |  ,
|  int  |  ,
|  bool  |  bNameWasGenerated,
|  void *
)
Member Function Documentation
◆ Contents()
 const CRhRdkContentArray& CRhRdkContentAddedByUser::Contents  |  ( |  void  |   | ) |   const
inline
◆ EditingLevel()
 RDK_DEPRECATED int CRhRdkContentAddedByUser::EditingLevel  |  ( |  void  |   | ) |   const
inline
◆ NameWasGenerated()
 bool CRhRdkContentAddedByUser::NameWasGenerated  |  ( |  void  |   | ) |   const
inline