Public Member Functions | Public Attributes | Friends | List of all members
CRhinoDigitizerManager Class Reference
Rhino
#include <RhinoSdkDigitizerManager.h>
 Public Member Functions
~CRhinoDigitizerManager ()
bool  | CalibrateDigitizer ()
CRhinoCommand::result  | CheckDigitizer (const CRhinoCommandContext &context, bool bRecalibrate=false)
bool  | ConnectDigitizer (ON_UUID digitizer_plugin_uuid)
const CRhinoDigitizerPlugIn *  | CurrentDigitizerPlugIn () const
UUID  | CurrentPlugInID () const
Return the UUID for the current digitizer plug-in. More...
void  | Default ()
void  | DisconnectDigitizer ()
CRhinoGet::result  | GetDigClickPoint (const wchar_t *prompt, bool bAcceptEnter, ON_3dPoint &pt)
get a raw dig point during calibration More...
CRhinoCommand::result  | GetDigitizer (const CRhinoCommandContext &context, ON_UUID &digitizer_plugin_uuid)
void  | GetTransformedRay (const ON_3dRay &raw_ray, ON_3dRay &transformed_ray)
bool  | IsActive () const
true if GetPoint can accept digitizer input More...
bool  | IsCalibrated () const
true if a digitizer is connected and calibrated More...
bool  | IsConnected () const
true if a digitizer is connected More...
bool  | IsPaused () const
true if a digitizer is connected and paused More...
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | MimicDigClick ()
bool  | PauseDigitizer (bool bPause=true)
void  | SaveProfile (CRhinoProfileContext &pc) const
called in CRhinoApp::ExitInstance More...
double  | SetUserScale (double user_scale)
returns previous value More...
bool  | UpdateTransform (bool=false)
double  | UserScale () const
 Public Attributes
bool  | m_bDigCalibrated
bool  | m_bDigPaused
bool  | m_bGetDigClickPoint
true when we are getting 3 raw coord dig calibration pts More...
ON_3dPoint  | m_dig_origin
ON_Xform  | m_dig_point_xform
transforms point (has unit system scaling) More...
double  | m_dig_tol
in m_dig_us units More...
ON::LengthUnitSystem  | m_dig_us
This information is from m_current_plugin. More...
ON_Xform  | m_dig_vector_xform
transforms directions More...
ON_3dVector  | m_dig_xaxis
ON_3dVector  | m_dig_yaxis
LPARAM  | m_nFlags
value of nFlags on last point sent to PostDigitizerPointEvent More...
ON_3dPoint  | m_rhino_origin
ON::LengthUnitSystem  | m_rhino_us
ON_3dVector  | m_rhino_xaxis
ON_3dVector  | m_rhino_yaxis
ON_Plane  | m_RhinoOriginPlane
double  | m_scale
Digitizer to Rhino scale factor. More...
 Friends
void  | CleanupDigitizer ()
CRhinoDigitizerManager &  | CRhinoApp::DigitizerManager ()
only function that can create this class More...
void  | InitDigitizer ()
LRESULT CALLBACK  | SendPointWndProc (HWND, UINT, WPARAM, LPARAM)
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ ~CRhinoDigitizerManager()
 CRhinoDigitizerManager::~CRhinoDigitizerManager  |  ( |   | )
Member Function Documentation
◆ CalibrateDigitizer()
 bool CRhinoDigitizerManager::CalibrateDigitizer  |  ( |   | )
◆ CheckDigitizer()
 CRhinoCommand::result CRhinoDigitizerManager::CheckDigitizer  |  ( |  const CRhinoCommandContext &  |  context,
|  bool  |  bRecalibrate = false
)
Description: Commands that need a digitizer can call CheckDigitizer to make sure everything is ready. It takes care of starting a digitizer if one is not already running.
◆ ConnectDigitizer()
 bool CRhinoDigitizerManager::ConnectDigitizer  |  ( |  ON_UUID  |  digitizer_plugin_uuid | )
◆ CurrentDigitizerPlugIn()
 const CRhinoDigitizerPlugIn* CRhinoDigitizerManager::CurrentDigitizerPlugIn  |  ( |   | ) |   const
◆ CurrentPlugInID()
 UUID CRhinoDigitizerManager::CurrentPlugInID  |  ( |   | ) |   const
Return the UUID for the current digitizer plug-in.
◆ Default()
 void CRhinoDigitizerManager::Default  |  ( |   | )
◆ DisconnectDigitizer()
 void CRhinoDigitizerManager::DisconnectDigitizer  |  ( |   | )
◆ GetDigClickPoint()
 CRhinoGet::result CRhinoDigitizerManager::GetDigClickPoint  |  ( |  const wchar_t *  |  prompt,
|  bool  |  bAcceptEnter,
|  ON_3dPoint &  |  pt
)
get a raw dig point during calibration
◆ GetDigitizer()
 CRhinoCommand::result CRhinoDigitizerManager::GetDigitizer  |  ( |  const CRhinoCommandContext &  |  context,
|  ON_UUID &  |  digitizer_plugin_uuid
)
Returns: UUID of the digitizer plugin or ON_nil_uuid if none
◆ GetTransformedRay()
 void CRhinoDigitizerManager::GetTransformedRay  |  ( |  const ON_3dRay &  |  raw_ray,
|  ON_3dRay &  |  transformed_ray
)
◆ IsActive()
 bool CRhinoDigitizerManager::IsActive  |  ( |   | ) |   const
true if GetPoint can accept digitizer input
◆ IsCalibrated()
 bool CRhinoDigitizerManager::IsCalibrated  |  ( |   | ) |   const
true if a digitizer is connected and calibrated
◆ IsConnected()
 bool CRhinoDigitizerManager::IsConnected  |  ( |   | ) |   const
true if a digitizer is connected
◆ IsPaused()
 bool CRhinoDigitizerManager::IsPaused  |  ( |   | ) |   const
true if a digitizer is connected and paused
◆ LoadProfile()
 void CRhinoDigitizerManager::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ MimicDigClick()
 bool CRhinoDigitizerManager::MimicDigClick  |  ( |   | )
Description: Mimic a digitizer "foot pedal" click. Returns: True if successful.
◆ PauseDigitizer()
 bool CRhinoDigitizerManager::PauseDigitizer  |  ( |  bool  |  bPause = true | )
Description: When the digitizer is "paused", it cannot be used for getting points. Parameters: bPause - [in] Returns: Previous pause state
◆ SaveProfile()
 void CRhinoDigitizerManager::SaveProfile  |  ( |  CRhinoProfileContext &  |  pc | ) |   const
called in CRhinoApp::ExitInstance
◆ SetUserScale()
 double CRhinoDigitizerManager::SetUserScale  |  ( |  double  |  user_scale | )
returns previous value
◆ UpdateTransform()
 bool CRhinoDigitizerManager::UpdateTransform  |  ( |  bool  |   = false | )
◆ UserScale()
 double CRhinoDigitizerManager::UserScale  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CleanupDigitizer
 void CleanupDigitizer  |  ( |   | )
friend
◆ CRhinoApp::DigitizerManager
 CRhinoDigitizerManager& CRhinoApp::DigitizerManager  |  ( |   | )
friend
only function that can create this class
◆ InitDigitizer
 void InitDigitizer  |  ( |   | )
friend
◆ SendPointWndProc
 LRESULT CALLBACK SendPointWndProc  |  ( |  HWND  |  ,
|  UINT  |  ,
|  WPARAM  |  ,
|  LPARAM
)
friend
Member Data Documentation
◆ m_bDigCalibrated
 bool CRhinoDigitizerManager::m_bDigCalibrated
◆ m_bDigPaused
 bool CRhinoDigitizerManager::m_bDigPaused
◆ m_bGetDigClickPoint
 bool CRhinoDigitizerManager::m_bGetDigClickPoint
true when we are getting 3 raw coord dig calibration pts
◆ m_dig_origin
 ON_3dPoint CRhinoDigitizerManager::m_dig_origin
These points are in digitizer coordinates and are set by the "DigCalibrate" command
◆ m_dig_point_xform
 ON_Xform CRhinoDigitizerManager::m_dig_point_xform
transforms point (has unit system scaling)
The information above is used to compute this transformation. This transformation is used to convert the (x,y,z) values sent from the digitizer device into the (z,y,z) values pushed onto get point.
◆ m_dig_tol
 double CRhinoDigitizerManager::m_dig_tol
in m_dig_us units
◆ m_dig_us
 ON::LengthUnitSystem CRhinoDigitizerManager::m_dig_us
This information is from m_current_plugin.
◆ m_dig_vector_xform
 ON_Xform CRhinoDigitizerManager::m_dig_vector_xform
transforms directions
◆ m_dig_xaxis
 ON_3dVector CRhinoDigitizerManager::m_dig_xaxis
◆ m_dig_yaxis
 ON_3dVector CRhinoDigitizerManager::m_dig_yaxis
◆ m_nFlags
 LPARAM CRhinoDigitizerManager::m_nFlags
value of nFlags on last point sent to PostDigitizerPointEvent
◆ m_rhino_origin
 ON_3dPoint CRhinoDigitizerManager::m_rhino_origin
These points are in rhino world coordinates and are set by the "DigCalibrate" command
◆ m_rhino_us
 ON::LengthUnitSystem CRhinoDigitizerManager::m_rhino_us
This value is set by carefully placed calls to GetCurrentModel()->Settings().m_ModelUnitsAndTolerances.m_unit_system; bool m_bRhinoRunning; ///< true after CRhinoApp::InitInstance()
◆ m_rhino_xaxis
 ON_3dVector CRhinoDigitizerManager::m_rhino_xaxis
◆ m_rhino_yaxis
 ON_3dVector CRhinoDigitizerManager::m_rhino_yaxis
◆ m_RhinoOriginPlane
 ON_Plane CRhinoDigitizerManager::m_RhinoOriginPlane
◆ m_scale
 double CRhinoDigitizerManager::m_scale
Digitizer to Rhino scale factor.