Static Public Member Functions | List of all members
ON_CurvePiping::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static int  | Accuracy (void)
static CapTypes  | CapType (void)
static bool  | Faceted (void)
static double  | Radius (void)
static int  | Segments (void)
Member Function Documentation
◆ Accuracy()
 static int ON_CurvePiping::Defaults::Accuracy  |  ( |  void  |   | )
static
◆ CapType()
 static CapTypes ON_CurvePiping::Defaults::CapType  |  ( |  void  |   | )
static
◆ Faceted()
 static bool ON_CurvePiping::Defaults::Faceted  |  ( |  void  |   | )
static
◆ Radius()
 static double ON_CurvePiping::Defaults::Radius  |  ( |  void  |   | )
static
◆ Segments()
 static int ON_CurvePiping::Defaults::Segments  |  ( |  void  |   | )
static