Public Member Functions | Static Public Attributes | List of all members
CRhinoDocTableReference Class Reference
Rhino
#include <rhinoSdkBitmap.h>
 Public Member Functions
CRhinoDocTableReference ()=delete
CRhinoDocTableReference (const CRhinoDocTableReference &)
CRhinoDocTableReference (unsigned int doc_sn, ON_ModelComponent::Type component_type, const ON_SimpleArray< const class ON_ModelComponent * > *table, const wchar_t *default_component_root_name)
~CRhinoDocTableReference ()=default
unsigned int  | ComponentCount () const
ON_ModelComponent::Type  | ComponentType () const
const ON_wString &  | DefaultComponentRootName () const
const class CRhinoDoc *  | Document () const
unsigned int  | DocumentSerialNumber () const
const class ON_ModelComponent *  | FromId (ON_UUID id) const
const class ON_ModelComponent *  | FromName (const wchar_t *name, ON_UUID parent_id) const
const class ON_ModelComponent *  | FromNameHash (const ON_NameHash &name_hash) const
bool  | IndexedComponents () const
CRhinoDocTableReference &  | operator= (const CRhinoDocTableReference &)=delete
const class ON_ModelComponent *  | operator[] (size_t i) const
bool  | UniquelyNamedComponents () const
const ON_wString  | UnusedComponentName () const
const ON_wString  | UnusedComponentName (const wchar_t *root_name) const
 Static Public Attributes
static const CRhinoDocTableReference  | Unset
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoDocTableReference() [1/3]
 CRhinoDocTableReference::CRhinoDocTableReference  |  ( |   | )
delete
◆ ~CRhinoDocTableReference()
 CRhinoDocTableReference::~CRhinoDocTableReference  |  ( |   | )
default
◆ CRhinoDocTableReference() [2/3]
 CRhinoDocTableReference::CRhinoDocTableReference  |  ( |  const CRhinoDocTableReference &  |   | )
◆ CRhinoDocTableReference() [3/3]
 CRhinoDocTableReference::CRhinoDocTableReference  |  ( |  unsigned int  |  doc_sn,
|  ON_ModelComponent::Type  |  component_type,
|  const ON_SimpleArray< const class ON_ModelComponent * > *  |  table,
|  const wchar_t *  |  default_component_root_name
)
Member Function Documentation
◆ ComponentCount()
 unsigned int CRhinoDocTableReference::ComponentCount  |  ( |   | ) |   const
◆ ComponentType()
 ON_ModelComponent::Type CRhinoDocTableReference::ComponentType  |  ( |   | ) |   const
◆ DefaultComponentRootName()
 const ON_wString& CRhinoDocTableReference::DefaultComponentRootName  |  ( |   | ) |   const
◆ Document()
 const class CRhinoDoc* CRhinoDocTableReference::Document  |  ( |   | ) |   const
◆ DocumentSerialNumber()
 unsigned int CRhinoDocTableReference::DocumentSerialNumber  |  ( |   | ) |   const
◆ FromId()
 const class ON_ModelComponent* CRhinoDocTableReference::FromId  |  ( |  ON_UUID  |  id | ) |   const
Remarks: Every document component can be found by id.
◆ FromName()
 const class ON_ModelComponent* CRhinoDocTableReference::FromName  |  ( |  const wchar_t *  |  name,
|  ON_UUID  |  parent_id
) |   |  const
◆ FromNameHash()
 const class ON_ModelComponent* CRhinoDocTableReference::FromNameHash  |  ( |  const ON_NameHash &  |  name_hash | ) |   const
◆ IndexedComponents()
 bool CRhinoDocTableReference::IndexedComponents  |  ( |   | ) |   const
Returns: True if the components in this table can be found by index.
◆ operator=()
 CRhinoDocTableReference& CRhinoDocTableReference::operator=  |  ( |  const CRhinoDocTableReference &  |   | )
delete
◆ operator[]()
 const class ON_ModelComponent* CRhinoDocTableReference::operator[]  |  ( |  size_t  |  i | ) |   const
Remarks: If IndexedComponents() is true, then the table components can be found by index.
◆ UniquelyNamedComponents()
 bool CRhinoDocTableReference::UniquelyNamedComponents  |  ( |   | ) |   const
Returns: True if the components in this table have unique names and can be found by name or name hash. Remarks: All model components have names, but some, like model geometry and rendering materials, are not required to have unique names.
◆ UnusedComponentName() [1/2]
 const ON_wString CRhinoDocTableReference::UnusedComponentName  |  ( |   | ) |   const
◆ UnusedComponentName() [2/2]
 const ON_wString CRhinoDocTableReference::UnusedComponentName  |  ( |  const wchar_t *  |  root_name | ) |   const
Member Data Documentation
◆ Unset
 const CRhinoDocTableReference CRhinoDocTableReference::Unset
static