Public Member Functions | Public Attributes | List of all members
CRhinoDrawGripsSettings Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
CRhinoDrawGripsSettings (CRhinoDisplayPipeline &dp)
void  | DrawControlPolygonLine (const ON_Line &L, const class CRhinoGripStatus &gs0, const class CRhinoGripStatus &gs1, bool adjustDepthAndBiasModes=true)
void  | RestoreViewportSettings ()
 Public Attributes
bool  | m_bDrawDynamicStuff
bool  | m_bDrawStaticStuff
int  | m_cp_grip_style
int  | m_cp_line_style
CRhinoDisplayPipeline &  | m_dp
ON_Color  | m_grip_color
ON_SimpleArray< CRhinoGripStatus >  | m_grip_status
ON_Color  | m_locked_grip_color
const ON_Color  | m_saved_vp_color
vp settings when CRhinoDrawGripsSettings was created. More...
const EDepthMode  | m_saved_vp_wire_depth
const int  | m_saved_vp_wire_zbias
ON_Color  | m_selected_grip_color
ON_Color  | m_soft_transform_color
Constructor & Destructor Documentation
◆ CRhinoDrawGripsSettings()
 CRhinoDrawGripsSettings::CRhinoDrawGripsSettings  |  ( |  CRhinoDisplayPipeline &  |  dp | )
Member Function Documentation
◆ DrawControlPolygonLine()
 void CRhinoDrawGripsSettings::DrawControlPolygonLine  |  ( |  const ON_Line &  |  L,
|  const class CRhinoGripStatus &  |  gs0,
|  const class CRhinoGripStatus &  |  gs1,
|  bool  |  adjustDepthAndBiasModes = true
)
Description: A helper function for drawing lines in control polygons. Parameters: L - [in] Line between two grips gs0 - [in] Grip status at start of line. gs1 - [in] Grip status at start of line. adjustDepthAndBiasModes - [in] optional Highlighted lines adjust the depth and bias modes to "always in front" and "neutral" and then restore the mode after the line is drawn. This will cause a flush of the line buffer which in most cases is fine. Set to false only if you want to explicitly set these modes outside of this function.
◆ RestoreViewportSettings()
 void CRhinoDrawGripsSettings::RestoreViewportSettings  |  ( |   | )
Description: Restores viewport settings to the values in the m_saved_vp fields.
Member Data Documentation
◆ m_bDrawDynamicStuff
 bool CRhinoDrawGripsSettings::m_bDrawDynamicStuff
If true, then draw stuff that moves when grips are dragged, like the curve being bent by a dragged control point.
◆ m_bDrawStaticStuff
 bool CRhinoDrawGripsSettings::m_bDrawStaticStuff
If true, then draw stuff that does not move when grips are dragged, like the control polygon of the "original" curve.
◆ m_cp_grip_style
 int CRhinoDrawGripsSettings::m_cp_grip_style
m_cp_grip_style determines what kind of line is used to display things like control polygons. 0 = no control points 1 = default grip style
◆ m_cp_line_style
 int CRhinoDrawGripsSettings::m_cp_line_style
m_cp_line_style determines what kind of line is used to display things like control polygons. 0 = no control polygon 1 = solid control polygon 2 = dotted control polygon
◆ m_dp
 CRhinoDisplayPipeline& CRhinoDrawGripsSettings::m_dp
◆ m_grip_color
 ON_Color CRhinoDrawGripsSettings::m_grip_color
◆ m_grip_status
 ON_SimpleArray<CRhinoGripStatus> CRhinoDrawGripsSettings::m_grip_status
◆ m_locked_grip_color
 ON_Color CRhinoDrawGripsSettings::m_locked_grip_color
◆ m_saved_vp_color
 const ON_Color CRhinoDrawGripsSettings::m_saved_vp_color
vp settings when CRhinoDrawGripsSettings was created.
◆ m_saved_vp_wire_depth
 const EDepthMode CRhinoDrawGripsSettings::m_saved_vp_wire_depth
◆ m_saved_vp_wire_zbias
 const int CRhinoDrawGripsSettings::m_saved_vp_wire_zbias
◆ m_selected_grip_color
 ON_Color CRhinoDrawGripsSettings::m_selected_grip_color
◆ m_soft_transform_color
 ON_Color CRhinoDrawGripsSettings::m_soft_transform_color