Public Member Functions | List of all members
ON_TextBuilder::TextProps Class Reference
#include <opennurbs_textiterator.h>
 Public Member Functions
TextProps ()
unsigned int  | CharSet ()
unsigned int  | CodePage ()
ON_Color  | Color () const
bool  | FormatPending ()
double  | Height () const
double  | HeightScaleFactor () const
bool  | IsBold ()
bool  | IsItalic ()
bool  | IsKerningEnabled () const
bool  | IsStrikethrough ()
bool  | IsUnderlined ()
double  | LineSpaceScale () const
void  | SetBold (bool bold)
void  | SetCharSet (unsigned int charset, bool setcodepage)
void  | SetCodePage (unsigned int codepage)
void  | SetColor (ON_Color c)
void  | SetFormatPending (bool b)
void  | SetHeight (double h)
void  | SetHeightScaleFactor (double factor)
void  | SetItalic (bool italic)
void  | SetKerningEnabled (bool kerning)
void  | SetLineSpaceScale (double scale)
void  | SetStackFormat (ON_DimStyle::stack_format s)
void  | SetStackScale (double s)
void  | SetStrikethrough (bool strikethrough)
void  | SetUnderlined (bool underlined)
ON_DimStyle::stack_format  | StackFormat () const
double  | StackScale () const
Constructor & Destructor Documentation
◆ TextProps()
 ON_TextBuilder::TextProps::TextProps  |  ( |   | )
inline
Member Function Documentation
◆ CharSet()
 unsigned int ON_TextBuilder::TextProps::CharSet  |  ( |   | )
inline
◆ CodePage()
 unsigned int ON_TextBuilder::TextProps::CodePage  |  ( |   | )
inline
◆ Color()
 ON_Color ON_TextBuilder::TextProps::Color  |  ( |   | ) |   const
inline
◆ FormatPending()
 bool ON_TextBuilder::TextProps::FormatPending  |  ( |   | )
inline
◆ Height()
 double ON_TextBuilder::TextProps::Height  |  ( |   | ) |   const
inline
◆ HeightScaleFactor()
 double ON_TextBuilder::TextProps::HeightScaleFactor  |  ( |   | ) |   const
inline
◆ IsBold()
 bool ON_TextBuilder::TextProps::IsBold  |  ( |   | )
inline
◆ IsItalic()
 bool ON_TextBuilder::TextProps::IsItalic  |  ( |   | )
inline
◆ IsKerningEnabled()
 bool ON_TextBuilder::TextProps::IsKerningEnabled  |  ( |   | ) |   const
inline
◆ IsStrikethrough()
 bool ON_TextBuilder::TextProps::IsStrikethrough  |  ( |   | )
inline
◆ IsUnderlined()
 bool ON_TextBuilder::TextProps::IsUnderlined  |  ( |   | )
inline
◆ LineSpaceScale()
 double ON_TextBuilder::TextProps::LineSpaceScale  |  ( |   | ) |   const
inline
◆ SetBold()
 void ON_TextBuilder::TextProps::SetBold  |  ( |  bool  |  bold | )
inline
◆ SetCharSet()
 void ON_TextBuilder::TextProps::SetCharSet  |  ( |  unsigned int  |  charset,
|  bool  |  setcodepage
)
inline
◆ SetCodePage()
 void ON_TextBuilder::TextProps::SetCodePage  |  ( |  unsigned int  |  codepage | )
inline
◆ SetColor()
 void ON_TextBuilder::TextProps::SetColor  |  ( |  ON_Color  |  c | )
inline
◆ SetFormatPending()
 void ON_TextBuilder::TextProps::SetFormatPending  |  ( |  bool  |  b | )
inline
◆ SetHeight()
 void ON_TextBuilder::TextProps::SetHeight  |  ( |  double  |  h | )
inline
◆ SetHeightScaleFactor()
 void ON_TextBuilder::TextProps::SetHeightScaleFactor  |  ( |  double  |  factor | )
inline
◆ SetItalic()
 void ON_TextBuilder::TextProps::SetItalic  |  ( |  bool  |  italic | )
inline
◆ SetKerningEnabled()
 void ON_TextBuilder::TextProps::SetKerningEnabled  |  ( |  bool  |  kerning | )
inline
◆ SetLineSpaceScale()
 void ON_TextBuilder::TextProps::SetLineSpaceScale  |  ( |  double  |  scale | )
inline
◆ SetStackFormat()
 void ON_TextBuilder::TextProps::SetStackFormat  |  ( |  ON_DimStyle::stack_format  |  s | )
inline
◆ SetStackScale()
 void ON_TextBuilder::TextProps::SetStackScale  |  ( |  double  |  s | )
inline
◆ SetStrikethrough()
 void ON_TextBuilder::TextProps::SetStrikethrough  |  ( |  bool  |  strikethrough | )
inline
◆ SetUnderlined()
 void ON_TextBuilder::TextProps::SetUnderlined  |  ( |  bool  |  underlined | )
inline
◆ StackFormat()
 ON_DimStyle::stack_format ON_TextBuilder::TextProps::StackFormat  |  ( |   | ) |   const
inline
◆ StackScale()
 double ON_TextBuilder::TextProps::StackScale  |  ( |   | ) |   const
inline