Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoThicknessAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoThicknessAnalysisSettings ()
ON__UINT32  | ColorMappingCRC () const
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoThicknessAnalysisSettings &other) const
bool  | operator== (const CRhinoThicknessAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
bool  | m_bShowIsoparams
ON_Interval  | m_distance_range
unsigned short  | m_max_update_time_seconds
 Static Public Attributes
static const CRhinoThicknessAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoThicknessAnalysisSettings()
 CRhinoThicknessAnalysisSettings::CRhinoThicknessAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ ColorMappingCRC()
 ON__UINT32 CRhinoThicknessAnalysisSettings::ColorMappingCRC  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoThicknessAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoThicknessAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoThicknessAnalysisSettings::operator!=  |  ( |  const CRhinoThicknessAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoThicknessAnalysisSettings::operator==  |  ( |  const CRhinoThicknessAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoThicknessAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoThicknessAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoThicknessAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoThicknessAnalysisSettings CRhinoThicknessAnalysisSettings::Default
static
◆ m_bShowIsoparams
 bool CRhinoThicknessAnalysisSettings::m_bShowIsoparams
◆ m_distance_range
 ON_Interval CRhinoThicknessAnalysisSettings::m_distance_range
◆ m_max_update_time_seconds
 unsigned short CRhinoThicknessAnalysisSettings::m_max_update_time_seconds
maximum number of seconds a user is willing to wait to calculate the analysis results on a single object. An unsigned short allows for a maximum limit of 18.6 hours. If m_max_update_time_seconds is zero, then the calculation is allowed to run forever.