Public Member Functions | List of all members
CRhinoPickFilter Class Reference
Rhino
#include <rhinoSdkPick.h>
 Public Member Functions
CRhinoPickFilter ()=default
virtual  | ~CRhinoPickFilter ()
virtual bool  | IsAcceptableCandidate (const CRhinoPickContext &pickContext, const class CRhinoObject *object, bool bIgnoreSelectionState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility)
void  | Register ()
void  | UnRegister ()
Constructor & Destructor Documentation
◆ CRhinoPickFilter()
 CRhinoPickFilter::CRhinoPickFilter  |  ( |   | )
default
◆ ~CRhinoPickFilter()
 virtual CRhinoPickFilter::~CRhinoPickFilter  |  ( |   | )
virtual
Member Function Documentation
◆ IsAcceptableCandidate()
 virtual bool CRhinoPickFilter::IsAcceptableCandidate  |  ( |  const CRhinoPickContext &  |  pickContext,
|  const class CRhinoObject *  |  object,
|  bool  |  bIgnoreSelectionState,
|  bool  |  bIgnoreLayerLocking,
|  bool  |  bIgnoreLayerVisibility
)
virtual
◆ Register()
 void CRhinoPickFilter::Register  |  ( |   | )
◆ UnRegister()
 void CRhinoPickFilter::UnRegister  |  ( |   | )