Public Member Functions | Public Attributes | List of all members
CRhRdkRenderPlugIn::CRhRdkRenderOutputType Class Referencefinal
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkRenderOutputType ()
CRhRdkRenderOutputType (const ON_wString sExtension, const ON_wString &sDescription)
 Public Attributes
ON_wString  | m_sFileExtension
ON_wString  | m_sTypeDescription
Constructor & Destructor Documentation
◆ CRhRdkRenderOutputType() [1/2]
 CRhRdkRenderPlugIn::CRhRdkRenderOutputType::CRhRdkRenderOutputType  |  ( |   | )
◆ CRhRdkRenderOutputType() [2/2]
 CRhRdkRenderPlugIn::CRhRdkRenderOutputType::CRhRdkRenderOutputType  |  ( |  const ON_wString  |  sExtension,
|  const ON_wString &  |  sDescription
)
Member Data Documentation
◆ m_sFileExtension
 ON_wString CRhRdkRenderPlugIn::CRhRdkRenderOutputType::m_sFileExtension
The image format specified as a file extension without the period.
Note
for JPEG you must specify 'jpg', for TIFF you must specify 'tif'. RDK currently supports the following types: bmp, jpg, png, tif, tga, hdr, exr, rimage.
◆ m_sTypeDescription
 ON_wString CRhRdkRenderPlugIn::CRhRdkRenderOutputType::m_sTypeDescription
Description of the type. e.g., L"Windows Bitmap"