Public Member Functions | Static Public Attributes | List of all members
ON_ModelComponentTypeIterator Class Reference
OpenNURBS
#include <opennurbs_model_component.h>
 Public Member Functions
ON_ModelComponentTypeIterator () ON_NOEXCEPT
Default constructor creates ON_ModelComponentTypeIterator::Empty. More...
ON_ModelComponentTypeIterator (const ON_ModelComponentTypeIterator &)=default
ON_ModelComponentTypeIterator (size_t type_count, const ON_ModelComponent::Type *types) ON_NOEXCEPT
~ON_ModelComponentTypeIterator ()=default
ON_ModelComponent::Type  | CurrentType () const
ON_ModelComponent::Type  | FirstType ()
ON_ModelComponent::Type  | LastType ()
ON_ModelComponent::Type  | NextType ()
ON_ModelComponentTypeIterator &  | operator= (const ON_ModelComponentTypeIterator &)=default
ON_ModelComponent::Type  | PreviousType ()
unsigned int  | TypeCount () const
Number of types in the iterator. More...
 Static Public Attributes
static const ON_ModelComponentTypeIterator  | Empty
Contains no types. More...
static const ON_ModelComponentTypeIterator  | ExplicitComponentTypes
Contains all explicit component types (excludes Unset and Mixed). More...
static const ON_ModelComponentTypeIterator  | TableComponentTypes
Constructor & Destructor Documentation
◆ ON_ModelComponentTypeIterator() [1/3]
 ON_ModelComponentTypeIterator::ON_ModelComponentTypeIterator  |  ( |   | )
Default constructor creates ON_ModelComponentTypeIterator::Empty.
◆ ~ON_ModelComponentTypeIterator()
 ON_ModelComponentTypeIterator::~ON_ModelComponentTypeIterator  |  ( |   | )
default
◆ ON_ModelComponentTypeIterator() [2/3]
 ON_ModelComponentTypeIterator::ON_ModelComponentTypeIterator  |  ( |  const ON_ModelComponentTypeIterator &  |   | )
default
◆ ON_ModelComponentTypeIterator() [3/3]
 ON_ModelComponentTypeIterator::ON_ModelComponentTypeIterator  |  ( |  size_t  |  type_count,
|  const ON_ModelComponent::Type *  |  types
)
Parameters: type_count - [in] number of types types - [in] list of types to iterate over
Member Function Documentation
◆ CurrentType()
 ON_ModelComponent::Type ON_ModelComponentTypeIterator::CurrentType  |  ( |   | ) |   const
Description: Decrements the iterator and returns the new type. Returns: The current type.
◆ FirstType()
 ON_ModelComponent::Type ON_ModelComponentTypeIterator::FirstType  |  ( |   | )
Description: Sets the iterator to point to the first available type. Returns: The first available type.
◆ LastType()
 ON_ModelComponent::Type ON_ModelComponentTypeIterator::LastType  |  ( |   | )
Description: Sets the iterator to point to the last available type. Returns: The last available type.
◆ NextType()
 ON_ModelComponent::Type ON_ModelComponentTypeIterator::NextType  |  ( |   | )
Description: Increments the iterator and returns the new type. Returns: The new type. ON_ModelComponent::Type::Unset if the iterator is incremented the last type.
◆ operator=()
 ON_ModelComponentTypeIterator& ON_ModelComponentTypeIterator::operator=  |  ( |  const ON_ModelComponentTypeIterator &  |   | )
default
◆ PreviousType()
 ON_ModelComponent::Type ON_ModelComponentTypeIterator::PreviousType  |  ( |   | )
Description: Decrements the iterator and returns the new type. Returns: The new type ON_ModelComponent::Type::Unset if the iterator is decremented the first type.
◆ TypeCount()
 unsigned int ON_ModelComponentTypeIterator::TypeCount  |  ( |   | ) |   const
Number of types in the iterator.
Member Data Documentation
◆ Empty
 const ON_ModelComponentTypeIterator ON_ModelComponentTypeIterator::Empty
static
Contains no types.
◆ ExplicitComponentTypes
 const ON_ModelComponentTypeIterator ON_ModelComponentTypeIterator::ExplicitComponentTypes
static
Contains all explicit component types (excludes Unset and Mixed).
◆ TableComponentTypes
 const ON_ModelComponentTypeIterator ON_ModelComponentTypeIterator::TableComponentTypes
static
Every type in ON_ModelComponentTypeIterator::ExplicitComponents except Image, RenderLight, ModelGeometry, and HistoryRecord The types in ON_ModelComponentTypeIterator::Tables identify the most commonly used "table" component types.