Public Member Functions | List of all members
CRhinoUndoEventHandlerEx Class Referenceabstract
Rhino
#include <rhinoSdkDoc.h>
 Inheritance diagram for CRhinoUndoEventHandlerEx:
 Public Member Functions
virtual void  | Undo (CRhinoDoc &doc, const CRhinoCommand *cmd, const wchar_t *action_description, bool bCreatedByRedo, unsigned int undo_event_sn)=0
 Public Member Functions inherited from CRhinoUndoEventHandler
CRhinoUndoEventHandler ()
virtual  | ~CRhinoUndoEventHandler ()
 Additional Inherited Members
 Public Attributes inherited from CRhinoUndoEventHandler
ON_wString  | m_description
The AuditUndo command prints this description. More...
Member Function Documentation
◆ Undo()
 virtual void CRhinoUndoEventHandlerEx::Undo  |  ( |  CRhinoDoc &  |  doc,
|  const CRhinoCommand *  |  cmd,
|  const wchar_t *  |  action_description,
|  bool  |  bCreatedByRedo,
|  unsigned int  |  undo_event_sn
)
pure virtual
Description: The Rhino Undo command will call this virtual Undo function when the event needs to be undone. You should override this function to undo changes in your plug-in data,
NEVER change any setting in the Rhino document or application. Rhino handles ALL changes to the application and document and you will break the Undo/Redo commands if you make any changes to the application or document. Parameters: doc - [in] Document in which this undo is taking place. cmd - [in] Command being undone. Can be NULL. action_description - [in] Description of what is being undone. Can be NULL. bCreatedByRedo - [in] True if a "Redo" was responsible for creating this record. undo_event_sn - [in] Runtime serial number Rhino assigned to the event.