Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiTabPageCtrl Class Reference
RhinoUI
CRhinoUiTabPageCtrl. More...
#include <rhinoSdkUiTabPageCtrl.h>
 Inheritance diagram for CRhinoUiTabPageCtrl:
 Public Member Functions
CRhinoUiTabPageCtrl ()
virtual  | ~CRhinoUiTabPageCtrl ()
void  | AddPage (CRhinoUiTabCtrlPage &dlg, LPCTSTR lpsPageName)
void  | AddPage (CRhinoUiTabCtrlPage *pDlg, LPCTSTR lpsPageName)
int  | GetActiveIndex () const
CRhinoUiTabCtrlPage *  | GetActivePage () const
CRhinoUiTabCtrlPage *  | GetPage (int nPage) const
int  | GetPageCount () const
int  | GetPageIndex (CRhinoUiTabCtrlPage *pPage) const
bool  | OnApply ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
bool  | OnOK ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
afx_msg void  | OnTcnSelchange (NMHDR *pNMHDR, LRESULT *pResult)
void  | RemovePage (CRhinoUiTabCtrlPage *pPage)
void  | RemovePage (int iPage)
bool  | SetActivePage (CRhinoUiTabCtrlPage *pPage)
bool  | SetActivePage (int iPage)
 Public Member Functions inherited from CRhinoUiTabCtrl
CRhinoUiTabCtrl ()
virtual  | ~CRhinoUiTabCtrl ()
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnNcPaint ()
 Protected Member Functions
bool  | CallOnApply ()
bool  | CallOnOK ()
bool  | CreatePage (int iPageIndex)
virtual void  | PreSubclassWindow ()
void  | RemoveAll ()
 Protected Attributes
int  | m_active_page
ON_SimpleArray< CRhinoUiTabCtrlPage * >  | m_page_list
ON_SimpleArray< CRhinoUiTabCtrlPage * >  | m_remove_delete_list
Detailed Description
CRhinoUiTabPageCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiTabPageCtrl()
 CRhinoUiTabPageCtrl::CRhinoUiTabPageCtrl  |  ( |   | )
◆ ~CRhinoUiTabPageCtrl()
 virtual CRhinoUiTabPageCtrl::~CRhinoUiTabPageCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AddPage() [1/2]
 void CRhinoUiTabPageCtrl::AddPage  |  ( |  CRhinoUiTabCtrlPage &  |  dlg,
|  LPCTSTR  |  lpsPageName
)
Description: This method adds a CRhinoUiTabCtrlPage object to the tab control. Add pages to the tab control in the left-to-right order you want them to appear.
Parameters: dlg [in] Page to add to the tab control lpsPageName [in] Tab text, if this is NULL or an empty string the page will not be added.
See Also: CRhinoUiTabCtrlPage
◆ AddPage() [2/2]
 void CRhinoUiTabPageCtrl::AddPage  |  ( |  CRhinoUiTabCtrlPage *  |  pDlg,
|  LPCTSTR  |  lpsPageName
)
Description: This method adds a CRhinoUiTabCtrlPage object to the tab control. Add pages to the tab control in the left-to-right order you want them to appear.
Parameters: pDlg [in] Page to add to the tab control, this pointer will be deleted by the tab control. lpsPageName [in] Tab text, if this is NULL or an empty string the page will not be added.
See Also: CRhinoUiTabCtrlPage
◆ CallOnApply()
 bool CRhinoUiTabPageCtrl::CallOnApply  |  ( |   | )
protected
◆ CallOnOK()
 bool CRhinoUiTabPageCtrl::CallOnOK  |  ( |   | )
protected
◆ CreatePage()
 bool CRhinoUiTabPageCtrl::CreatePage  |  ( |  int  |  iPageIndex | )
protected
◆ GetActiveIndex()
 int CRhinoUiTabPageCtrl::GetActiveIndex  |  ( |   | ) |   const
Description: This method gets the index number of the active page from the tab control.
Returns: Returns the index number of the active page or -1 if no active page has been identified.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount()
◆ GetActivePage()
 CRhinoUiTabCtrlPage* CRhinoUiTabPageCtrl::GetActivePage  |  ( |   | ) |   const
Description: This method retrieves the active page from the tab control. Use this method to perform some action on the active page.
Returns: Returns the pointer to the active page or NULL if no active page has been identified.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetActiveIndex()
◆ GetPage()
 CRhinoUiTabCtrlPage* CRhinoUiTabPageCtrl::GetPage  |  ( |  int  |  nPage | ) |   const
Description: This method retrieves a pointer to the specified page in this tab control.
Parameters: nPage [in] Specifies the index of the desired page, starting at zero. Must be between zero and one less than the number of pages in the property sheet, inclusive.
Returns: The pointer to the page corresponding to the nPage parameter or NULL if nPage is invalid.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount()
◆ GetPageCount()
 int CRhinoUiTabPageCtrl::GetPageCount  |  ( |   | ) |   const
Description: This method determines the number of pages currently in the tab control.
Returns: Returns the number of pages in the tab control.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage()
◆ GetPageIndex()
 int CRhinoUiTabPageCtrl::GetPageIndex  |  ( |  CRhinoUiTabCtrlPage *  |  pPage | ) |   const
Description: This method retrieves the index number of the specified page in the tab control.
Parameters: pPage [in] Points to the page to be removed from the tab control. Cannot be NULL.
Returns: Returns the index number of a page or -1 if page is not found in the tab control.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage()
◆ OnApply()
 bool CRhinoUiTabPageCtrl::OnApply  |  ( |   | )
Description: Call this method from the CRhinoUiTabPageCtrl parent dialog when the Apply button is pressed.
Returns: Returns true if the all modified pages OnApply() methods returned true; otherwise, it is false.
See Also: CRhinoUiTabCtrlPage
◆ OnCreate()
 afx_msg int CRhinoUiTabPageCtrl::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiTabPageCtrl::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnDestroy()
 afx_msg void CRhinoUiTabPageCtrl::OnDestroy  |  ( |   | )
◆ OnOK()
 bool CRhinoUiTabPageCtrl::OnOK  |  ( |   | )
Description: Call this method from the CRhinoUiTabPageCtrl parent dialog when the OK button is pressed.
See Also: CRhinoUiTabCtrlPage
Returns: Returns true if the all modified pages OnApply() and all created pages OnOk() methods returned true; otherwise, it is false.
◆ OnSize()
 afx_msg void CRhinoUiTabPageCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ OnTcnSelchange()
 afx_msg void CRhinoUiTabPageCtrl::OnTcnSelchange  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ PreSubclassWindow()
 virtual void CRhinoUiTabPageCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
Reimplemented from CRhinoUiTabCtrl.
◆ RemoveAll()
 void CRhinoUiTabPageCtrl::RemoveAll  |  ( |   | )
protected
◆ RemovePage() [1/2]
 void CRhinoUiTabPageCtrl::RemovePage  |  ( |  CRhinoUiTabCtrlPage *  |  pPage | )
Description: This method removes a page from the tab control and destroys the associated window. The CRhinoUiTabCtrlPage pointer itself is not deleted until the owner of the CRhinoUiTabPageCtrl window is closed.
Parameters: pPage [in] Points to the page to be removed from the tab control. Cannot be NULL.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount()
◆ RemovePage() [2/2]
 void CRhinoUiTabPageCtrl::RemovePage  |  ( |  int  |  iPage | )
Description: This method removes a page from the tab control and destroys the associated window. The CRhinoUiTabCtrlPage pointer itself is not deleted until the owner of the CRhinoUiTabPageCtrl window is closed.
Parameters: iPage [in] Specifies the index of the page to be removed. Must be between zero and one less than the number of pages in the tab control, inclusive.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount()
◆ SetActivePage() [1/2]
 bool CRhinoUiTabPageCtrl::SetActivePage  |  ( |  CRhinoUiTabCtrlPage *  |  pPage | )
Description: This method changes the active page. For example, use SetActivePage if a user’s action on one page should cause another page to become the active page.
Parameters: pPage [in] Points to the page to set in the tab control. It cannot be NULL
Returns: Returns true if the page is activated successfully; otherwise, it is false.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount() CRhinoUiTabPageCtrl::SetActivePage( int iPage)
◆ SetActivePage() [2/2]
 bool CRhinoUiTabPageCtrl::SetActivePage  |  ( |  int  |  iPage | )
Description: This method changes the active page. For example, use SetActivePage if a user’s action on one page should cause another page to become the active page.
Parameters: iPage [in] Specifies the index of the page to set. It must be between zero and one less than the number of pages in the tab control, inclusive.
Returns: Returns true if the page is activated successfully; otherwise, it is false.
See Also: CRhinoUiTabCtrlPage CRhinoUiTabPageCtrl::AddPage() CRhinoUiTabPageCtrl::GetPageCount() CRhinoUiTabPageCtrl::SetActivePage( CRhinoUiTabCtrlPage* pPage)
Member Data Documentation
◆ m_active_page
 int CRhinoUiTabPageCtrl::m_active_page
protected
◆ m_page_list
 ON_SimpleArray<CRhinoUiTabCtrlPage*> CRhinoUiTabPageCtrl::m_page_list
protected
◆ m_remove_delete_list
 ON_SimpleArray<CRhinoUiTabCtrlPage*> CRhinoUiTabPageCtrl::m_remove_delete_list
protected