Public Member Functions | List of all members
CRhRdkFilenameContentField Class Reference
RDK
#include <RhRdkContentField.h>
 Inheritance diagram for CRhRdkFilenameContentField:
 Public Member Functions
CRhRdkFilenameContentField (const CRhRdkFilenameContentField &f)
CRhRdkFilenameContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszLocalName, const wchar_t *wszEnglishName, Filter setFilter=All, Filter getFilter=All, int sectionId=0, bool bDynamic=false, INT_PTR reserved=0)
virtual  | ~CRhRdkFilenameContentField ()
virtual void *  | EVF (const wchar_t *, void *) override
const CRhRdkFilenameContentField &  | operator= (const char *sz)
const CRhRdkFilenameContentField &  | operator= (const wchar_t *wsz)
virtual void  | SetValueToSection (IRhRdk_XMLSection &section) const override
virtual const CRhRdkVariant &  | Value (void) const override
 Public Member Functions inherited from CRhRdkContentField
CRhRdkContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszFriendlyName, eFilter setFilter=All, eFilter getFilter=All, INT_PTR reserved=0)
CRhRdkContentField (CRhRdkContent &c, const wchar_t *wszInternalName, const wchar_t *wszLocalName, const wchar_t *wszEnglishName, Filter setFilter=All, Filter getFilter=All, int sectionId=0, bool bDynamic=false, INT_PTR reserved=0)
virtual  | ~CRhRdkContentField ()
const void *  | AsBuffer (size_t &sizeOut) const
void *  | AsPointer (void) const
bool  | AutomaticRegisteredProperty (void) const
virtual CRhRdkContent &  | Content (void) const
virtual UINT  | Conversion (void) const
virtual CRhRdkVariant  | ConvertFromDisplay (const CRhRdkVariant &v) const
virtual CRhRdkVariant  | ConvertToDisplay (const CRhRdkVariant &v) const
virtual ON_wString  | EnglishName (void) const
virtual RDK_DEPRECATED ON_wString  | FriendlyName (void) const
virtual Filter  | GetFilter (void) const
virtual bool  | GetLimits (CRhRdkVariant &vMin, CRhRdkVariant &vMax) const
virtual void  | GetValueFromSection (const IRhRdk_XMLSection &section)
void  | Initialize (const CRhRdkVariant &v)
virtual ON_wString  | InternalName (void) const
bool  | IsDynamic (void) const
bool  | IsHiddenInAutoUI (void) const
virtual ON_wString  | LocalName (void) const
virtual CRhRdkContentField *  | MakeCopy (CRhRdkContent &) const
operator bool (void) const
operator const wchar_t * (void) const
operator CRhRdkColor (void) const
operator CRhRdkVariant (void) const
operator double (void) const
operator float (void) const
operator int (void) const
operator ON_2dVector (void) const
operator ON_3dVector (void) const
operator ON_4dPoint (void) const
operator ON_Color (void) const
operator ON_Xform (void) const
operator time_t (void) const
operator UUID (void) const
bool  | operator!= (const CRhRdkContentField &v) const
bool  | operator< (const CRhRdkContentField &v) const
const CRhRdkContentField &  | operator= (bool b)
const CRhRdkContentField &  | operator= (const char *sz)
const CRhRdkContentField &  | operator= (const CRhRdkContentField &f)
const CRhRdkContentField &  | operator= (const CRhRdkVariant &v)
const CRhRdkContentField &  | operator= (const ON_2dVector &v)
const CRhRdkContentField &  | operator= (const ON_3dVector &v)
const CRhRdkContentField &  | operator= (const ON_4dPoint &p)
const CRhRdkContentField &  | operator= (const ON_Color &c)
const CRhRdkContentField &  | operator= (const ON_Xform &xform)
const CRhRdkContentField &  | operator= (const time_t &time)
const CRhRdkContentField &  | operator= (const UUID &uuid)
const CRhRdkContentField &  | operator= (const wchar_t *wsz)
const CRhRdkContentField &  | operator= (double d)
const CRhRdkContentField &  | operator= (float f)
const CRhRdkContentField &  | operator= (int i)
const CRhRdkContentField &  | operator= (void *p)
bool  | operator== (const CRhRdkContentField &v) const
bool  | operator> (const CRhRdkContentField &v) const
virtual int  | SectionId (void) const
void  | SetAutomaticRegisteredProperty (bool)
virtual void  | SetConversion (UINT uFlags)
virtual Filter  | SetFilter (void) const
void  | SetIsHiddenInAutoUI (bool bHidden)
virtual bool  | SetLimits (const CRhRdkVariant &vMin, const CRhRdkVariant &vMax)
virtual bool  | SetValue (const CRhRdkVariant &vNewValue)
virtual RDK_DEPRECATED bool  | SetValue (const CRhRdkVariant &vNewValue, CRhRdkContent::eChangeContext cc)
virtual ON_wString  | UndoString (void) const
 Additional Inherited Members
 Public Types inherited from CRhRdkContentField
enum  | : unsigned int { conv_none = 0x0000, conv_percentile = 0x0001, conv_one_minus = 0x0002, conv_radians = 0x0004 }
typedef Filter  | eFilter
enum  | Filter : unsigned int {
 None = 0x00, Serialization = 0x01, Harvesting = 0x02, Rendering = 0x04,
 All = 0xFF
 }
 Protected Member Functions inherited from CRhRdkContentField
CImpl &  | Impl (void) const
CRhRdkContentField *  | NewField (CRhRdkContent &c) const
Detailed Description
'filename' field.
When contents need to store a filename, they should use this field subclass. It specializes certain operations for filenames.
Constructor & Destructor Documentation
◆ CRhRdkFilenameContentField() [1/2]
 CRhRdkFilenameContentField::CRhRdkFilenameContentField  |  ( |  CRhRdkContent &  |  c,
|  const wchar_t *  |  wszInternalName,
|  const wchar_t *  |  wszLocalName,
|  const wchar_t *  |  wszEnglishName,
|  Filter  |  setFilter = All,
|  Filter  |  getFilter = All,
|  int  |  sectionId = 0,
|  bool  |  bDynamic = false,
|  INT_PTR  |  reserved = 0
)
Filename fields are always constructed the same way. After construction they are an empty string.
Parameters
c | is the content that the field belongs to.
wszInternalName | is the internal name of the field. Not localized.
wszLocalName | is the localized user-friendly name of the field.
wszEnglishName | is the English user-friendly name of the field.
setFilter | is a filter for use during CRhRdkContentFields::SetValuesToSection(). The field is skipped if setFilter does not match at least one item in the call's filter.
getFilter | is a filter for use during CRhRdkContentFields::GetValuesFromSection(). The field is skipped if getFilter does not match at least one item in the call's filter.
sectionId | is the id of an automatic section. This is optional and should be zero if not required. It allows field UI controls to automatically be distributed among automatic UI sections.
bDynamic | indicates that this field is dynamic.
See also
IsDynamic()
Parameters
reserved | is reserved for future use. Must be zero.
◆ CRhRdkFilenameContentField() [2/2]
 CRhRdkFilenameContentField::CRhRdkFilenameContentField  |  ( |  const CRhRdkFilenameContentField &  |  f | )
◆ ~CRhRdkFilenameContentField()
 virtual CRhRdkFilenameContentField::~CRhRdkFilenameContentField  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkFilenameContentField::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridevirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkContentField.
◆ operator=() [1/2]
 const CRhRdkFilenameContentField& CRhRdkFilenameContentField::operator=  |  ( |  const char *  |  sz | )
Assign from a string.
◆ operator=() [2/2]
 const CRhRdkFilenameContentField& CRhRdkFilenameContentField::operator=  |  ( |  const wchar_t *  |  wsz | )
Assign from a wide string.
◆ SetValueToSection()
 virtual void CRhRdkFilenameContentField::SetValueToSection  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
overridevirtual
Set a value into a section using the field's internal name.
Reimplemented from CRhRdkContentField.
◆ Value()
 virtual const CRhRdkVariant& CRhRdkFilenameContentField::Value  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The value of the field.
Reimplemented from CRhRdkContentField.