Public Member Functions | Public Attributes | List of all members
ON_GeometryFingerprint Class Reference
OpenNURBS
#include <opennurbs_texture_mapping.h>
 Public Member Functions
ON_GeometryFingerprint ()
bool  | Matches (const ON_GeometryFingerprint &b, const ON_Xform &bt, double tol) const
bool  | Read (ON_BinaryArchive &binary_archive)
void  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &binary_archive) const
void  | Zero ()
 Public Attributes
ON_WeightedAverageHash  | m_edgeWAH
ON_WeightedAverageHash  | m_pointWAH
unsigned int  | m_topologyCRC
Constructor & Destructor Documentation
◆ ON_GeometryFingerprint()
 ON_GeometryFingerprint::ON_GeometryFingerprint  |  ( |   | )
Member Function Documentation
◆ Matches()
 bool ON_GeometryFingerprint::Matches  |  ( |  const ON_GeometryFingerprint &  |  b,
|  const ON_Xform &  |  bt,
|  double  |  tol
) |   |  const
◆ Read()
 bool ON_GeometryFingerprint::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
◆ Transform()
 void ON_GeometryFingerprint::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool ON_GeometryFingerprint::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
◆ Zero()
 void ON_GeometryFingerprint::Zero  |  ( |   | )
Member Data Documentation
◆ m_edgeWAH
 ON_WeightedAverageHash ON_GeometryFingerprint::m_edgeWAH
◆ m_pointWAH
 ON_WeightedAverageHash ON_GeometryFingerprint::m_pointWAH
◆ m_topologyCRC
 unsigned int ON_GeometryFingerprint::m_topologyCRC