Public Types | Public Member Functions | List of all members
CRhinoUiPaintManager Class Reference
RhinoUI
#include <RhinoSdkUiWindowsPaintManager.h>
 Public Types
enum  | {
 unset_color = 0xFF000000, error_color = 0xFE000000, bylayer_color = 0xFD000000, byparent_color = 0xFC000000,
 bydisplay_color = 0xFB000000
 }
enum  | DrawExpanderHeaderOptions : unsigned int {
 DrawExpanderHeaderOptions::None = 0x00000000, DrawExpanderHeaderOptions::DrawBoldText = 0x00000001, DrawExpanderHeaderOptions::UseLargeText = 0x00000002, DrawExpanderHeaderOptions::Collapsible = 0x00000004,
 DrawExpanderHeaderOptions::Opened = 0x00000008, DrawExpanderHeaderOptions::Disabled = 0x00000010, DrawExpanderHeaderOptions::DrawSeparatorLine = 0x00000020, DrawExpanderHeaderOptions::UsePathElipses = 0x00000040
 }
enum  | ExpanderHeaderDefaultColorPart : unsigned int {
 ExpanderHeaderDefaultColorPart::Background, ExpanderHeaderDefaultColorPart::Text, ExpanderHeaderDefaultColorPart::DisabledText, ExpanderHeaderDefaultColorPart::SeparatorLine,
 ExpanderHeaderDefaultColorPart::DisabledSeparatorLine
 }
enum  | FontSize : int { FontSize::Small, FontSize::Normal, FontSize::Large, FontSize::Title }
Size for UI font. More...
enum  | FontStyle : int {
 FontStyle::Regular = 0, FontStyle::Bold = 1, FontStyle::Italic = 2, FontStyle::Underline = 4,
 FontStyle::Strikeout = 8
 }
Style for UI font. More...
 Public Member Functions
CRhinoUiPaintManager ()
~CRhinoUiPaintManager ()
COLORREF  | ColorButtonBitmapMask () const
COLORREF  | ColorButtonEdge () const
COLORREF  | ColorButtonEdgeHighlight () const
COLORREF  | ColorButtonEdgeShadow () const
COLORREF  | ColorButtonFace (bool inactive_color=false) const
COLORREF  | ColorButtonHot () const
COLORREF  | ColorButtonPushed () const
COLORREF  | ColorButtonText (bool inactive_color=false) const
COLORREF  | ColorCaptonText (bool inactive_color=false) const
COLORREF  | ColorClientBackground () const
COLORREF  | ColorDockBarClientBackground () const
COLORREF  | ColorExpandableTab (bool inactive_color=false) const
COLORREF  | ColorExpandableTabText (bool inactive_color=false) const
COLORREF  | ColorGripperBars () const
COLORREF  | ColorItem (bool selected, bool inactive_color=false, bool separator=false) const
COLORREF  | ColorItemText (bool selected, bool inactive_color=false, bool separator=false) const
COLORREF  | ColorItemValue (bool selected, bool inactive_color=false) const
COLORREF  | ColorItemValueText (bool selected, bool inactive_color=false) const
COLORREF  | ColorNCBackground () const
COLORREF  | ColorTransparentNCDraw () const
DrawExpanderHeaderOptions  | DefaultDrawExpanderHeaderOptions () const
void  | DrawDividerLine (CDC &dc, const CRect &dividerRect, bool enabled, bool horizontal=true, COLORREF lineColor=ON_UNSET_COLOR, COLORREF disabledLineColor=ON_UNSET_COLOR)
void  | DrawDockBarGripper (CDC &dc, CRect rGripper, int dock_location)
bool  | DrawExpandableTabCtrlBkgnd (HWND hWnd, CDC *pDC, CRhinoUiThemeDraw *pThemeDraw)
bool  | DrawExpandableTabHeaderBkgnd (CDC &dc, const CRect &rect, CRhinoUiThemeDraw *pThemeDraw, bool bSpecial)
bool  | DrawExpandableTabHeaderForegnd (CDC &dc, const CRect &rect, CRhinoUiThemeDraw *pThemeDraw, bool bSpecial, bool bHot, bool bExpanded, const CString &text)
bool  | DrawExpandableTabPageBkgnd (HWND hWnd, CDC *pDC, CRhinoUiThemeDraw *pThemeDraw, bool bSpecial)
void  | DrawExpanderHeader (CDC &dc, const CRect &headerRect, int leftMargin, int rightMargin, const wchar_t *text, DrawExpanderHeaderOptions options, COLORREF bkgrndColor=ON_UNSET_COLOR, COLORREF textColor=ON_UNSET_COLOR, COLORREF disabledTextColor=ON_UNSET_COLOR, COLORREF separatorLineColor=ON_UNSET_COLOR, COLORREF disabledseparatorLineColor=ON_UNSET_COLOR)
COLORREF  | DrawExpanderHeaderDefaultColor (ExpanderHeaderDefaultColorPart part) const
int  | DrawExpandIcon (CDC &dc, int x, int y, bool expanded)
bool  | DrawGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption, bool bActiveWindow, bool bVerticalRect=false)
bool  | DrawNcWindowFrame (CWnd &wnd, CDC &dc, bool bSmallCaption, bool bActive, LPRECT lprWin=NULL, LPRECT lprClient=NULL, LPRECT lprCaption=NULL)
bool  | DrawTitleText (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption, bool bActiveWindow, bool bVerticalRect=false)
CBrush *  | GetExpandableTabPageBkgndBrush (CRhinoUiThemeDraw *pThemeDraw, bool bSpecial)
CFont *  | GetUiFont (FontSize size=FontSize::Normal, FontStyle style=FontStyle::Regular)
void  | Initialize ()
void  | PaintDockBarClientArea (CControlBar &cb, CDC &dc)
CSize  | SmallCaptionButtonSize () const
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
unset_color
error_color
bylayer_color
byparent_color
bydisplay_color
◆ DrawExpanderHeaderOptions
 enum CRhinoUiPaintManager::DrawExpanderHeaderOptions : unsigned int
strong
Enumerator
None
DrawBoldText
UseLargeText
Collapsible
Opened
Disabled
DrawSeparatorLine
UsePathElipses
◆ ExpanderHeaderDefaultColorPart
 enum CRhinoUiPaintManager::ExpanderHeaderDefaultColorPart : unsigned int
strong
Enumerator
Background
Text
DisabledText
SeparatorLine
DisabledSeparatorLine
◆ FontSize
 enum CRhinoUiPaintManager::FontSize : int
strong
Size for UI font.
Enumerator
Small
0.8 x Normal
Normal
1.0 x Normal
Large
1.2 x Normal
Title
2.0 x Normal
◆ FontStyle
 enum CRhinoUiPaintManager::FontStyle : int
strong
Style for UI font.
Enumerator
Regular
Normal
Bold
Bold
Italic
Italic
Underline
Underline
Strikeout
Strikeout
Constructor & Destructor Documentation
◆ CRhinoUiPaintManager()
 CRhinoUiPaintManager::CRhinoUiPaintManager  |  ( |   | )
◆ ~CRhinoUiPaintManager()
 CRhinoUiPaintManager::~CRhinoUiPaintManager  |  ( |   | )
Member Function Documentation
◆ ColorButtonBitmapMask()
 COLORREF CRhinoUiPaintManager::ColorButtonBitmapMask  |  ( |   | ) |   const
◆ ColorButtonEdge()
 COLORREF CRhinoUiPaintManager::ColorButtonEdge  |  ( |   | ) |   const
◆ ColorButtonEdgeHighlight()
 COLORREF CRhinoUiPaintManager::ColorButtonEdgeHighlight  |  ( |   | ) |   const
◆ ColorButtonEdgeShadow()
 COLORREF CRhinoUiPaintManager::ColorButtonEdgeShadow  |  ( |   | ) |   const
◆ ColorButtonFace()
 COLORREF CRhinoUiPaintManager::ColorButtonFace  |  ( |  bool  |  inactive_color = false | ) |   const
◆ ColorButtonHot()
 COLORREF CRhinoUiPaintManager::ColorButtonHot  |  ( |   | ) |   const
◆ ColorButtonPushed()
 COLORREF CRhinoUiPaintManager::ColorButtonPushed  |  ( |   | ) |   const
◆ ColorButtonText()
 COLORREF CRhinoUiPaintManager::ColorButtonText  |  ( |  bool  |  inactive_color = false | ) |   const
◆ ColorCaptonText()
 COLORREF CRhinoUiPaintManager::ColorCaptonText  |  ( |  bool  |  inactive_color = false | ) |   const
◆ ColorClientBackground()
 COLORREF CRhinoUiPaintManager::ColorClientBackground  |  ( |   | ) |   const
◆ ColorDockBarClientBackground()
 COLORREF CRhinoUiPaintManager::ColorDockBarClientBackground  |  ( |   | ) |   const
◆ ColorExpandableTab()
 COLORREF CRhinoUiPaintManager::ColorExpandableTab  |  ( |  bool  |  inactive_color = false | ) |   const
◆ ColorExpandableTabText()
 COLORREF CRhinoUiPaintManager::ColorExpandableTabText  |  ( |  bool  |  inactive_color = false | ) |   const
◆ ColorGripperBars()
 COLORREF CRhinoUiPaintManager::ColorGripperBars  |  ( |   | ) |   const
◆ ColorItem()
 COLORREF CRhinoUiPaintManager::ColorItem  |  ( |  bool  |  selected,
|  bool  |  inactive_color = false,
|  bool  |  separator = false
) |   |  const
◆ ColorItemText()
 COLORREF CRhinoUiPaintManager::ColorItemText  |  ( |  bool  |  selected,
|  bool  |  inactive_color = false,
|  bool  |  separator = false
) |   |  const
◆ ColorItemValue()
 COLORREF CRhinoUiPaintManager::ColorItemValue  |  ( |  bool  |  selected,
|  bool  |  inactive_color = false
) |   |  const
◆ ColorItemValueText()
 COLORREF CRhinoUiPaintManager::ColorItemValueText  |  ( |  bool  |  selected,
|  bool  |  inactive_color = false
) |   |  const
◆ ColorNCBackground()
 COLORREF CRhinoUiPaintManager::ColorNCBackground  |  ( |   | ) |   const
◆ ColorTransparentNCDraw()
 COLORREF CRhinoUiPaintManager::ColorTransparentNCDraw  |  ( |   | ) |   const
◆ DefaultDrawExpanderHeaderOptions()
 DrawExpanderHeaderOptions CRhinoUiPaintManager::DefaultDrawExpanderHeaderOptions  |  ( |   | ) |   const
◆ DrawDividerLine()
 void CRhinoUiPaintManager::DrawDividerLine  |  ( |  CDC &  |  dc,
|  const CRect &  |  dividerRect,
|  bool  |  enabled,
|  bool  |  horizontal = true,
|  COLORREF  |  lineColor = ON_UNSET_COLOR,
|  COLORREF  |  disabledLineColor = ON_UNSET_COLOR
)
◆ DrawDockBarGripper()
 void CRhinoUiPaintManager::DrawDockBarGripper  |  ( |  CDC &  |  dc,
|  CRect  |  rGripper,
|  int  |  dock_location
)
◆ DrawExpandableTabCtrlBkgnd()
 bool CRhinoUiPaintManager::DrawExpandableTabCtrlBkgnd  |  ( |  HWND  |  hWnd,
|  CDC *  |  pDC,
|  CRhinoUiThemeDraw *  |  pThemeDraw
)
◆ DrawExpandableTabHeaderBkgnd()
 bool CRhinoUiPaintManager::DrawExpandableTabHeaderBkgnd  |  ( |  CDC &  |  dc,
|  const CRect &  |  rect,
|  CRhinoUiThemeDraw *  |  pThemeDraw,
|  bool  |  bSpecial
)
◆ DrawExpandableTabHeaderForegnd()
 bool CRhinoUiPaintManager::DrawExpandableTabHeaderForegnd  |  ( |  CDC &  |  dc,
|  const CRect &  |  rect,
|  CRhinoUiThemeDraw *  |  pThemeDraw,
|  bool  |  bSpecial,
|  bool  |  bHot,
|  bool  |  bExpanded,
|  const CString &  |  text
)
◆ DrawExpandableTabPageBkgnd()
 bool CRhinoUiPaintManager::DrawExpandableTabPageBkgnd  |  ( |  HWND  |  hWnd,
|  CDC *  |  pDC,
|  CRhinoUiThemeDraw *  |  pThemeDraw,
|  bool  |  bSpecial
)
◆ DrawExpanderHeader()
 void CRhinoUiPaintManager::DrawExpanderHeader  |  ( |  CDC &  |  dc,
|  const CRect &  |  headerRect,
|  int  |  leftMargin,
|  int  |  rightMargin,
|  const wchar_t *  |  text,
|  DrawExpanderHeaderOptions  |  options,
|  COLORREF  |  bkgrndColor = ON_UNSET_COLOR,
|  COLORREF  |  textColor = ON_UNSET_COLOR,
|  COLORREF  |  disabledTextColor = ON_UNSET_COLOR,
|  COLORREF  |  separatorLineColor = ON_UNSET_COLOR,
|  COLORREF  |  disabledseparatorLineColor = ON_UNSET_COLOR
)
◆ DrawExpanderHeaderDefaultColor()
 COLORREF CRhinoUiPaintManager::DrawExpanderHeaderDefaultColor  |  ( |  ExpanderHeaderDefaultColorPart  |  part | ) |   const
◆ DrawExpandIcon()
 int CRhinoUiPaintManager::DrawExpandIcon  |  ( |  CDC &  |  dc,
|  int  |  x,
|  int  |  y,
|  bool  |  expanded
)
◆ DrawGradientTitleRect()
 bool CRhinoUiPaintManager::DrawGradientTitleRect  |  ( |  CDC *  |  pDC,
|  LPRECT  |  lpRect,
|  const wchar_t *  |  lpsCaption,
|  bool  |  bActiveWindow,
|  bool  |  bVerticalRect = false
)
◆ DrawNcWindowFrame()
 bool CRhinoUiPaintManager::DrawNcWindowFrame  |  ( |  CWnd &  |  wnd,
|  CDC &  |  dc,
|  bool  |  bSmallCaption,
|  bool  |  bActive,
|  LPRECT  |  lprWin = NULL,
|  LPRECT  |  lprClient = NULL,
|  LPRECT  |  lprCaption = NULL
)
◆ DrawTitleText()
 bool CRhinoUiPaintManager::DrawTitleText  |  ( |  CDC *  |  pDC,
|  LPRECT  |  lpRect,
|  const wchar_t *  |  lpsCaption,
|  bool  |  bActiveWindow,
|  bool  |  bVerticalRect = false
)
◆ GetExpandableTabPageBkgndBrush()
 CBrush* CRhinoUiPaintManager::GetExpandableTabPageBkgndBrush  |  ( |  CRhinoUiThemeDraw *  |  pThemeDraw,
|  bool  |  bSpecial
)
◆ GetUiFont()
 CFont* CRhinoUiPaintManager::GetUiFont  |  ( |  FontSize  |  size = FontSize::Normal,
|  FontStyle  |  style = FontStyle::Regular
)
◆ Initialize()
 void CRhinoUiPaintManager::Initialize  |  ( |   | )
◆ PaintDockBarClientArea()
 void CRhinoUiPaintManager::PaintDockBarClientArea  |  ( |  CControlBar &  |  cb,
|  CDC &  |  dc
)
◆ SmallCaptionButtonSize()
 CSize CRhinoUiPaintManager::SmallCaptionButtonSize  |  ( |   | ) |   const