Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoPlotColorComboBox Class Reference
Rhino
CRhinoPlotColorComboBox window. More...
#include <RhinoSdkPlotColorComboBox.h>
 Inheritance diagram for CRhinoPlotColorComboBox:
 Public Types
enum  | object_colors {
 by_display_color = 0, by_layer_color, by_parent_color, black_color,
 white_color, red_color, yellow_color, green_color,
 cyan_color, blue_color, magenta_color, custom_color,
 color_count
 }
Attributes. More...
 Public Member Functions
CRhinoPlotColorComboBox ()
Construction. More...
~CRhinoPlotColorComboBox ()
int  | GetCurrentColor (ON_Color &color, object_colors &obj_color)
BOOL32  | OnSelectionChanged ()
void  | SetCurrentColor (ON_Color color, object_colors obj_color=by_layer_color)
 Public Member Functions inherited from CRhinoUiColorComboBox
CRhinoUiColorComboBox ()
virtual  | ~CRhinoUiColorComboBox ()
bool  | AddColorItem (const char *lpsColorName, COLORREF color)
bool  | AddColorItem (const wchar_t *lpsColorName, COLORREF color)
CRhinoUiColorComboBoxItem *  | ItemFromIndex (int nIndex)
void  | SetColorPalette (HPALETTE pal)
 Protected Member Functions
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
void  | Initialize ()
void  | PreSubclassWindow ()
Overrides. More...
 Protected Member Functions inherited from CRhinoUiColorComboBox
bool  | _AddColorItem (LPCTSTR lpsColorName, COLORREF color)
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
 Additional Inherited Members
 Public Attributes inherited from CRhinoUiColorComboBox
CObArray  | m_items
 Protected Attributes inherited from CRhinoUiColorComboBox
HPALETTE  | m_hPalette
Detailed Description
CRhinoPlotColorComboBox window.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ object_colors
 enum CRhinoPlotColorComboBox::object_colors
Attributes.
Enumerator
by_display_color
by_layer_color
by_parent_color
black_color
white_color
red_color
yellow_color
green_color
cyan_color
blue_color
magenta_color
custom_color
color_count
Constructor & Destructor Documentation
◆ CRhinoPlotColorComboBox()
 CRhinoPlotColorComboBox::CRhinoPlotColorComboBox  |  ( |   | )
Construction.
◆ ~CRhinoPlotColorComboBox()
 CRhinoPlotColorComboBox::~CRhinoPlotColorComboBox  |  ( |   | )
Member Function Documentation
◆ DrawItem()
 virtual void CRhinoPlotColorComboBox::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
protectedvirtual
Reimplemented from CRhinoUiColorComboBox.
◆ GetCurrentColor()
 int CRhinoPlotColorComboBox::GetCurrentColor  |  ( |  ON_Color &  |  color,
|  object_colors &  |  obj_color
)
◆ Initialize()
 void CRhinoPlotColorComboBox::Initialize  |  ( |   | )
protected
◆ OnSelectionChanged()
 BOOL32 CRhinoPlotColorComboBox::OnSelectionChanged  |  ( |   | )
◆ PreSubclassWindow()
 void CRhinoPlotColorComboBox::PreSubclassWindow  |  ( |   | )
protectedvirtual
Overrides.
Reimplemented from CRhinoUiColorComboBox.
◆ SetCurrentColor()
 void CRhinoPlotColorComboBox::SetCurrentColor  |  ( |  ON_Color  |  color,
|  object_colors  |  obj_color = by_layer_color
)