Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_UserDataItemFilter Class Reference
OpenNURBS
#include <opennurbs_archive.h>
 Public Member Functions
ON_UserDataItemFilter ()
ON_UserDataItemFilter (ON_UUID application_id, bool bSerialize)
ON_UserDataItemFilter (ON_UUID application_id, ON_UUID item_id, bool bSerialize)
 Static Public Member Functions
static int  | Compare (const class ON_UserDataItemFilter *, const class ON_UserDataItemFilter *)
 Public Attributes
ON_UUID  | m_application_id
The application id can be the id for a plug-in, Rhino or opennurbs. More...
bool  | m_bSerialize
ON_UUID  | m_item_id
unsigned int  | m_precedence
Constructor & Destructor Documentation
◆ ON_UserDataItemFilter() [1/3]
 ON_UserDataItemFilter::ON_UserDataItemFilter  |  ( |   | )
◆ ON_UserDataItemFilter() [2/3]
 ON_UserDataItemFilter::ON_UserDataItemFilter  |  ( |  ON_UUID  |  application_id,
|  bool  |  bSerialize
)
◆ ON_UserDataItemFilter() [3/3]
 ON_UserDataItemFilter::ON_UserDataItemFilter  |  ( |  ON_UUID  |  application_id,
|  ON_UUID  |  item_id,
|  bool  |  bSerialize
)
Member Function Documentation
◆ Compare()
 static int ON_UserDataItemFilter::Compare  |  ( |  const class ON_UserDataItemFilter *  |  ,
|  const class ON_UserDataItemFilter *
)
static
Member Data Documentation
◆ m_application_id
 ON_UUID ON_UserDataItemFilter::m_application_id
The application id can be the id for a plug-in, Rhino or opennurbs.
◆ m_bSerialize
 bool ON_UserDataItemFilter::m_bSerialize
bSerializationEnabled is true if reading and writing are permitted. bSerializationEnabled is false if reading and writing are prevented.
◆ m_item_id
 ON_UUID ON_UserDataItemFilter::m_item_id
The item id for object user data is the value of ON_UserData.m_userdata_uuid. The item id for user table is the application id. A nil item id indicates the setting is applied to all object user data and user table information for the specified application.
◆ m_precedence
 unsigned int ON_UserDataItemFilter::m_precedence
If application id and item id match and m_bSerializeEnabled, does not match, then the ON_UserDataItemFilter with the largest value of m_precedence is used.