Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDQuadFacePack Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDQuadFacePack ()=default
ON_SubDQuadFacePack (const ON_SubDQuadFacePack &)=default
~ON_SubDQuadFacePack ()=default
unsigned  | FaceCount () const
ON_SubDQuadFacePack &  | operator= (const ON_SubDQuadFacePack &)=default
 Static Public Member Functions
static const ON_SubDQuadFacePack  | GetPack (unsigned int pack_seed_size, ON_SubDFace *face, unsigned int pack_id)
 Public Attributes
ON_SubDQuadFacePackSide  | m_corners [4] = { ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null }
ON_2udex  | m_size = ON_2udex::Zero
 Static Public Attributes
static const ON_SubDQuadFacePack  | Empty
Constructor & Destructor Documentation
◆ ON_SubDQuadFacePack() [1/2]
 ON_SubDQuadFacePack::ON_SubDQuadFacePack  |  ( |   | )
default
◆ ~ON_SubDQuadFacePack()
 ON_SubDQuadFacePack::~ON_SubDQuadFacePack  |  ( |   | )
default
◆ ON_SubDQuadFacePack() [2/2]
 ON_SubDQuadFacePack::ON_SubDQuadFacePack  |  ( |  const ON_SubDQuadFacePack &  |   | )
default
Member Function Documentation
◆ FaceCount()
 unsigned ON_SubDQuadFacePack::FaceCount  |  ( |   | ) |   const
◆ GetPack()
 static const ON_SubDQuadFacePack ON_SubDQuadFacePack::GetPack  |  ( |  unsigned int  |  pack_seed_size,
|  ON_SubDFace *  |  face,
|  unsigned int  |  pack_id
)
static
Parameters: pack_seed_size - [in] >= 0 The minimum size quad grid that will be returned is pack_seed_size X pack_seed_size. face - [in] The quad pack will be grown around this face. pack_id - [in] If a quad pack is found, this is the id that will be assigned to each ON_SubDFace.m_pack_id in the quad pack. Returns: If a pack is found, ON_SubDQuadFacePack has details. Otherwise, ON_SubDQuadFacePack::Empty is returned.
◆ operator=()
 ON_SubDQuadFacePack& ON_SubDQuadFacePack::operator=  |  ( |  const ON_SubDQuadFacePack &  |   | )
default
Member Data Documentation
◆ Empty
 const ON_SubDQuadFacePack ON_SubDQuadFacePack::Empty
static
◆ m_corners
 ON_SubDQuadFacePackSide ON_SubDQuadFacePack::m_corners[4] = { ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null, ON_SubDQuadFacePackSide::Null }
◆ m_size
 ON_2udex ON_SubDQuadFacePack::m_size = ON_2udex::Zero