Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCreatorExistingInstance Class Reference
RDK
#include <RhRdkContentCreator.h>
 Inheritance diagram for CRhRdkContentCreatorExistingInstance:
 Public Member Functions
CRhRdkContentCreatorExistingInstance (const CRhRdkDocument &rdkDoc, const CRhRdkContentArray &aContent)
 Public Member Functions inherited from CRhRdkContentCreatorExisting
CRhRdkContentCreatorExisting (const CRhRdkDocument &rdkDoc, const CRhRdkContentArray &aContent)
virtual  | ~CRhRdkContentCreatorExisting ()
 Public Member Functions inherited from CRhRdkContentCreator
CRhRdkContentCreator (const CRhRdkDocument &rdkDoc)
virtual  | ~CRhRdkContentCreator ()
const CRhRdkContent *  | AddContent (const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
bool  | AddContent (OUT CRhRdkContentArray &aContent, const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
virtual_su bool  | AutoEditChild (void) const
const CRhRdkContent *  | ChangeContentType (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
const CRhRdkContent *  | ChangeContentTypeEx (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild, unsigned int ic_flags) const
const wchar_t *  | ErrorString (void) const
const CRhRdkContent *  | FindChildAddOrChange (const CRhRdkContent &parentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual bool  | CreateNewContent (CRhRdkContentArrayNC &aContentOut, const CRhRdkContent *pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName) const override
 Protected Member Functions inherited from CRhRdkContentCreatorExisting
const CRhRdkContentArray &  | Content (void) const
virtual void *  | EVF (const wchar_t *, void *) override
virtual bool  | IsCopy (void) const override
virtual const CRhRdkContentArray *  | OriginalContent (void) const override
 Protected Member Functions inherited from CRhRdkContentCreator
const CRhRdkDocument *  | RdkDocument (void) const
void  | SetErrorString (const wchar_t *wsz) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkContentCreatorExistingInstance()
 CRhRdkContentCreatorExistingInstance::CRhRdkContentCreatorExistingInstance  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  const CRhRdkContentArray &  |  aContent
)
Member Function Documentation
◆ CreateNewContent()
 virtual bool CRhRdkContentCreatorExistingInstance::CreateNewContent  |  ( |  CRhRdkContentArrayNC &  |  aContentOut,
|  const CRhRdkContent *  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName
) |   |  const
overrideprotectedvirtual
Implements CRhRdkContentCreator.