Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoSubDDisplayAttributes Class Reference
Rhino
#include <RhinoSdkSubD.h>
 Public Member Functions
CRhinoSubDDisplayAttributes ()=default
CRhinoSubDDisplayAttributes (const CRhinoSubDDisplayAttributes &)
~CRhinoSubDDisplayAttributes ()
ON_SubDComponentPtr  | ComponentToDraw () const
CRhinoSubDDisplayAttributes &  | operator= (const CRhinoSubDDisplayAttributes &)
const class CRhSubDDisplayAttributesPrivate *  | PrivateData () const
void  | SetComponentToDraw (const ON_SubDComponentPtr &component)
void  | SetMaterialOverride (const class CDisplayPipelineMaterial *)
void  | SetReflectionPlane (const class ON_PlaneEquation *pe)
 Public Attributes
bool  | m_bDrawControlNet = false
bool  | m_bDrawEdges = true
Specify what to draw. More...
bool  | m_bDrawSurface = false
The surface is a shaded mesh based on subd appearance (smooth/flat) settings. More...
bool  | m_bDrawSurfaceNet = false
 Static Public Attributes
static const CRhinoSubDDisplayAttributes  | Default
Constructor & Destructor Documentation
◆ CRhinoSubDDisplayAttributes() [1/2]
 CRhinoSubDDisplayAttributes::CRhinoSubDDisplayAttributes  |  ( |   | )
default
◆ CRhinoSubDDisplayAttributes() [2/2]
 CRhinoSubDDisplayAttributes::CRhinoSubDDisplayAttributes  |  ( |  const CRhinoSubDDisplayAttributes &  |   | )
◆ ~CRhinoSubDDisplayAttributes()
 CRhinoSubDDisplayAttributes::~CRhinoSubDDisplayAttributes  |  ( |   | )
Member Function Documentation
◆ ComponentToDraw()
 ON_SubDComponentPtr CRhinoSubDDisplayAttributes::ComponentToDraw  |  ( |   | ) |   const
◆ operator=()
 CRhinoSubDDisplayAttributes& CRhinoSubDDisplayAttributes::operator=  |  ( |  const CRhinoSubDDisplayAttributes &  |   | )
◆ PrivateData()
 const class CRhSubDDisplayAttributesPrivate* CRhinoSubDDisplayAttributes::PrivateData  |  ( |   | ) |   const
◆ SetComponentToDraw()
 void CRhinoSubDDisplayAttributes::SetComponentToDraw  |  ( |  const ON_SubDComponentPtr &  |  component | )
◆ SetMaterialOverride()
 void CRhinoSubDDisplayAttributes::SetMaterialOverride  |  ( |  const class CDisplayPipelineMaterial *  |   | )
Override default behavior defined by the display pipeline attributes at drawing time.
◆ SetReflectionPlane()
 void CRhinoSubDDisplayAttributes::SetReflectionPlane  |  ( |  const class ON_PlaneEquation *  |  pe | )
Member Data Documentation
◆ Default
 const CRhinoSubDDisplayAttributes CRhinoSubDDisplayAttributes::Default
static
CRhinoSubDDisplayAttributes::Default draws the default presentation of subdivision objects in Rhino.
◆ m_bDrawControlNet
 bool CRhinoSubDDisplayAttributes::m_bDrawControlNet = false
The control net is made up of lines between edge control net points. This setting ignores subd appearance settings so that a control net can be used to contrast with a smooth surface appearance.
◆ m_bDrawEdges
 bool CRhinoSubDDisplayAttributes::m_bDrawEdges = true
Specify what to draw.
The edges are curves on the surface based on subd appearance (smooth/flat) settings
◆ m_bDrawSurface
 bool CRhinoSubDDisplayAttributes::m_bDrawSurface = false
The surface is a shaded mesh based on subd appearance (smooth/flat) settings.
◆ m_bDrawSurfaceNet
 bool CRhinoSubDDisplayAttributes::m_bDrawSurfaceNet = false
The surface net is made up of lines between edge surface points. This setting ignores subd appearance settings so that a surface net can be used to contrast with a flat surface appearance.