Public Member Functions | Protected Attributes | List of all members
CRhinoUiBitmapButton Class Reference
RhinoUI
CRhinoUiBitmapButton. More...
#include <RhinoSdkUiBitmapButton.h>
 Inheritance diagram for CRhinoUiBitmapButton:
 Public Member Functions
CRhinoUiBitmapButton ()
virtual  | ~CRhinoUiBitmapButton ()
bool  | AutoLoad (UINT nID, CWnd *pParent, UINT idBitmapResource)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
bool  | LoadBitmap (UINT idBitmapResource, AFX_MODULE_STATE *pModuleState=NULL)
afx_msg void  | OnSysColorChange ()
void  | SizeToContent ()
 Protected Attributes
UINT  | m_idResource
CImageList  | m_image
Detailed Description
CRhinoUiBitmapButton.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// Ported from CRhinoUiBitmapButton
Usage – a replacement for the MFC CBitmapButton
include an owner-draw button in your dialog
declare a CRhinoUiBitmapButton member in the CDialog code
hook in the CRhinoUiBitmapButton using a call to AutoLoad
the bitmap resource specified in AutoLoad must be divisible into 4 equally sized images that represent (left to right) the up, down, focused and disabled states of the button
Constructor & Destructor Documentation
◆ CRhinoUiBitmapButton()
 CRhinoUiBitmapButton::CRhinoUiBitmapButton  |  ( |   | )
◆ ~CRhinoUiBitmapButton()
 virtual CRhinoUiBitmapButton::~CRhinoUiBitmapButton  |  ( |   | )
virtual
Member Function Documentation
◆ AutoLoad()
 bool CRhinoUiBitmapButton::AutoLoad  |  ( |  UINT  |  nID,
|  CWnd *  |  pParent,
|  UINT  |  idBitmapResource
)
◆ DrawItem()
 virtual void CRhinoUiBitmapButton::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
virtual
◆ LoadBitmap()
 bool CRhinoUiBitmapButton::LoadBitmap  |  ( |  UINT  |  idBitmapResource,
|  AFX_MODULE_STATE *  |  pModuleState = NULL
)
◆ OnSysColorChange()
 afx_msg void CRhinoUiBitmapButton::OnSysColorChange  |  ( |   | )
◆ SizeToContent()
 void CRhinoUiBitmapButton::SizeToContent  |  ( |   | )
Member Data Documentation
◆ m_idResource
 UINT CRhinoUiBitmapButton::m_idResource
protected
◆ m_image
 CImageList CRhinoUiBitmapButton::m_image
protected