Public Member Functions | List of all members
CRhRdkContentInstanceBrowserTaskOrigin Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkContentInstanceBrowserTaskOrigin:
 Public Member Functions
CRhRdkContentInstanceBrowserTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const UUID &uuidInstance, const CRhRdkPreviewAppearance *pAppearance)
virtual IRhRdkTaskCollection::Control  | Control (void) const final override
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
 Public Member Functions inherited from CRhRdkSingleSelectionTaskOrigin
CRhRdkSingleSelectionTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const UUID &uuidInstance, const CRhRdkPreviewAppearance *pAppearance, const UUID &uuidEditor)
virtual  | ~CRhRdkSingleSelectionTaskOrigin ()
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const final override
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const final override
virtual const wchar_t *  | TopLevelKind (void) const final override
virtual UUID  | Uuid (void) const final override
 Public Member Functions inherited from CRhRdkContextTaskOrigin
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkContentInstanceBrowserTaskOrigin()
 CRhRdkContentInstanceBrowserTaskOrigin::CRhRdkContentInstanceBrowserTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con,
|  const UUID &  |  uuidInstance,
|  const CRhRdkPreviewAppearance *  |  pAppearance
)
Member Function Documentation
◆ Control()
 virtual IRhRdkTaskCollection::Control CRhRdkContentInstanceBrowserTaskOrigin::Control  |  ( |  void  |   | ) |   const
finaloverridevirtual
Implements CRhRdkTaskOrigin.
◆ SupportsTask()
 virtual bool CRhRdkContentInstanceBrowserTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  task | ) |   const
overridevirtual
Reimplemented from CRhRdkSingleSelectionTaskOrigin.