Public Member Functions | List of all members
ON_2dexMap Class Reference
OpenNURBS
#include <opennurbs_array.h>
 Public Member Functions
ON_2dexMap ()
ON_DEPRECATED  | ON_2dexMap (int capacity)
virtual  | ~ON_2dexMap ()
bool  | AddIndex (int i, int j)
const ON_DEPRECATED ON_2dex *  | Array () const
int  | Count () const
void  | Create (int count, int i0, int j)
const ON_2dex *  | Find2dex (int i) const
int  | FindIndex (int i, int not_found_rc) const
ON_2dex  | operator[] (int i) const
bool  | RemoveIndex (int i)
ON_DEPRECATED void  | Reserve (size_t capacity)
bool  | SetIndex (int i, int j)
void  | SetOrAddIndex (int i, int j)
int  | ToArray (ON_SimpleArray< ON_2dex > &aArrayOut) const
Constructor & Destructor Documentation
◆ ON_2dexMap() [1/2]
 ON_2dexMap::ON_2dexMap  |  ( |   | )
◆ ON_2dexMap() [2/2]
 ON_DEPRECATED ON_2dexMap::ON_2dexMap  |  ( |  int  |  capacity | )
◆ ~ON_2dexMap()
 virtual ON_2dexMap::~ON_2dexMap  |  ( |   | )
virtual
Member Function Documentation
◆ AddIndex()
 bool ON_2dexMap::AddIndex  |  ( |  int  |  i,
|  int  |  j
)
Description: Adds and element (i,j). If there is already an entry with value (i,*), then no element is added. Parameters: i - [in] i - [in] Returns: True if and element it added.
◆ Array()
 const ON_DEPRECATED ON_2dex* ON_2dexMap::Array  |  ( |   | ) |   const
◆ Count()
 int ON_2dexMap::Count  |  ( |   | ) |   const
◆ Create()
 void ON_2dexMap::Create  |  ( |  int  |  count,
|  int  |  i0,
|  int  |  j
)
Description: Creates an index map with the values (i0,j),...,(i0+count-1,j) Parameters: count - [in] number of elements i0 - [in] i value of first element j - [in] j value for all elements
◆ Find2dex()
 const ON_2dex* ON_2dexMap::Find2dex  |  ( |  int  |  i | ) |   const
◆ FindIndex()
 int ON_2dexMap::FindIndex  |  ( |  int  |  i,
|  int  |  not_found_rc
) |   |  const
Description: Searches for an element with a matching i and returns its j value. If no matching element is found, then not_found_rc is returned. Parameters: i - [in] value of i to search for not_found_rc - [in] value to return if there is not a match. Returns: j value
◆ operator[]()
 ON_2dex ON_2dexMap::operator[]  |  ( |  int  |  i | ) |   const
◆ RemoveIndex()
 bool ON_2dexMap::RemoveIndex  |  ( |  int  |  i | )
Description: If an element (i,*) exists, it is removed. If there is not an element with a matching i value, then false is returned. Parameters: i - [in] Returns: True if the element was removed
◆ Reserve()
 ON_DEPRECATED void ON_2dexMap::Reserve  |  ( |  size_t  |  capacity | )
◆ SetIndex()
 bool ON_2dexMap::SetIndex  |  ( |  int  |  i,
|  int  |  j
)
Description: Searches for an element (i,*) and sets its j value to j. If there is no element with a matching i, then false is returned. Parameters: i - [in] j - [in] Returns: True if and element exists and was set.
◆ SetOrAddIndex()
 void ON_2dexMap::SetOrAddIndex  |  ( |  int  |  i,
|  int  |  j
)
Description: If an element (i,*) exists, its j value is set. Otherwise a new element with value (i,j) is added. Parameters: i - [in] j - [in]
◆ ToArray()
 int ON_2dexMap::ToArray  |  ( |  ON_SimpleArray< ON_2dex > &  |  aArrayOut | ) |   const
Description: Flattens the map to an array Parameters: aArrayOut - [out] The array which the mapped values are appended to Returns: The number of items appended to the array