Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiLayerComboBox Class Reference
RhinoUI
CRhinoUiLayerComboBox. More...
#include <RhinoSdkUiLayerComboBox.h>
 Inheritance diagram for CRhinoUiLayerComboBox:
 Public Member Functions
CRhinoUiLayerComboBox ()
virtual  | ~CRhinoUiLayerComboBox ()
int  | AddLayerToList (const CRhinoLayer &layer)
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT lpCompareItemStruct)
CRhinoDoc *  | Document ()
virtual void  | DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct)
const CRhinoLayer *  | Layer (int list_index)
int  | LayerIndexFromListIndex (int list_index)
int  | ListIndexFromLayerIndex (int layer_index)
int  | LoadLayers (CRhinoDoc *doc, bool bShowReference=true, int set_current=-1)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
BOOL32  | RemoveLayerFromList (int layer_index)
int  | SelectedLayerIndex ()
 Protected Member Functions
void  | DestroyPopDownWnd ()
virtual void  | PreSubclassWindow ()
void  | ShowPopDownWnd (HWND hWnd, bool bShow)
 Protected Attributes
bool  | m_bShowReference
HPALETTE  | m_hPalette
CRhinoUiPopDownLayerWnd *  | m_pWndPopDown
Detailed Description
CRhinoUiLayerComboBox.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiLayerComboBox()
 CRhinoUiLayerComboBox::CRhinoUiLayerComboBox  |  ( |   | )
◆ ~CRhinoUiLayerComboBox()
 virtual CRhinoUiLayerComboBox::~CRhinoUiLayerComboBox  |  ( |   | )
virtual
Member Function Documentation
◆ AddLayerToList()
 int CRhinoUiLayerComboBox::AddLayerToList  |  ( |  const CRhinoLayer &  |  layer | )
◆ CompareItem()
 virtual int CRhinoUiLayerComboBox::CompareItem  |  ( |  LPCOMPAREITEMSTRUCT  |  lpCompareItemStruct | )
virtual
◆ DestroyPopDownWnd()
 void CRhinoUiLayerComboBox::DestroyPopDownWnd  |  ( |   | )
protected
◆ Document()
 CRhinoDoc* CRhinoUiLayerComboBox::Document  |  ( |   | )
◆ DrawItem()
 virtual void CRhinoUiLayerComboBox::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |  lpDrawItemStruct | )
virtual
◆ Layer()
 const CRhinoLayer* CRhinoUiLayerComboBox::Layer  |  ( |  int  |  list_index | )
◆ LayerIndexFromListIndex()
 int CRhinoUiLayerComboBox::LayerIndexFromListIndex  |  ( |  int  |  list_index | )
Description: Get layer index associated with a specific combo box item Parameters: list_index [in] - list item to check Returns: Layer index or -1 on error
◆ ListIndexFromLayerIndex()
 int CRhinoUiLayerComboBox::ListIndexFromLayerIndex  |  ( |  int  |  layer_index | )
Description: Get combo box index from layer index Parameters: layer_index [in] - layer index to scan for Returns: combo box index or -1 if not found in list
◆ LoadLayers()
 int CRhinoUiLayerComboBox::LoadLayers  |  ( |  CRhinoDoc *  |  doc,
|  bool  |  bShowReference = true,
|  int  |  set_current = -1
)
Description: Populate combo box with layer names and colors Parameters: doc [in] - document containing layer table bShowReference [in] - show reference layers set_current [in] - layer index of item to set as current Returns: Number of layers added to list
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiLayerComboBox::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiLayerComboBox::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ PreSubclassWindow()
 virtual void CRhinoUiLayerComboBox::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ RemoveLayerFromList()
 BOOL32 CRhinoUiLayerComboBox::RemoveLayerFromList  |  ( |  int  |  layer_index | )
◆ SelectedLayerIndex()
 int CRhinoUiLayerComboBox::SelectedLayerIndex  |  ( |   | )
Description: Get layer index associated with current combo box selection Returns: Layer index or -1 if nothing selected
◆ ShowPopDownWnd()
 void CRhinoUiLayerComboBox::ShowPopDownWnd  |  ( |  HWND  |  hWnd,
|  bool  |  bShow
)
protected
Member Data Documentation
◆ m_bShowReference
 bool CRhinoUiLayerComboBox::m_bShowReference
protected
◆ m_hPalette
 HPALETTE CRhinoUiLayerComboBox::m_hPalette
protected
◆ m_pWndPopDown
 CRhinoUiPopDownLayerWnd* CRhinoUiLayerComboBox::m_pWndPopDown
protected