Public Member Functions | Protected Member Functions | List of all members
CRhinoUiStaticEx Class Reference
RhinoUI
#include <RhinoSdkUiStatic.h>
 Inheritance diagram for CRhinoUiStaticEx:
 Public Member Functions
CRhinoUiStaticEx ()
virtual  | ~CRhinoUiStaticEx ()
COLORREF  | BackgroundColor () const
UINT  | GetAlignment () const
CString  | GetText () const
bool  | IsFilePath () const
void  | SetAlignment (UINT alignment)
void  | SetBackgroundColor (COLORREF color)
void  | SetColor (COLORREF color)
Another version of SetBackgroundColor. More...
void  | SetFilePath (const wchar_t *pszPath)
void  | SetText (const wchar_t *pszText)
void  | SetTextColor (COLORREF color)
COLORREF  | TextColor () const
 Protected Member Functions
virtual void  | DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct)
virtual void  | PreSubclassWindow ()
Detailed Description
Description: Owner drawn, drop-in replacement for CStatic that supports Rhino's color theme drawing. In most cases, you can simply replace CStatic with CRhinoUiStaticEx in your dialog box declaration.
Constructor & Destructor Documentation
◆ CRhinoUiStaticEx()
 CRhinoUiStaticEx::CRhinoUiStaticEx  |  ( |   | )
◆ ~CRhinoUiStaticEx()
 virtual CRhinoUiStaticEx::~CRhinoUiStaticEx  |  ( |   | )
virtual
Member Function Documentation
◆ BackgroundColor()
 COLORREF CRhinoUiStaticEx::BackgroundColor  |  ( |   | ) |   const
Gets and sets the static control's text background color. This overrides Rhino's color theme drawing. Setting will invalidate the control.
◆ DrawItem()
 virtual void CRhinoUiStaticEx::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |  lpDrawItemStruct | )
protectedvirtual
◆ GetAlignment()
 UINT CRhinoUiStaticEx::GetAlignment  |  ( |   | ) |   const
Gets or sets the static control's text alignment. Valid values are SS_LEFT, SS_CENTER, and SS_RIGHT. Setting will invalidate the control.
◆ GetText()
 CString CRhinoUiStaticEx::GetText  |  ( |   | ) |   const
Gets and sets the static control text. Setting will invalidate the control.
◆ IsFilePath()
 bool CRhinoUiStaticEx::IsFilePath  |  ( |   | ) |   const
Sets a file path as the static control text. File paths are drawn with DT_PATH_ELLIPSIS. Setting will invalidate the control.
◆ PreSubclassWindow()
 virtual void CRhinoUiStaticEx::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ SetAlignment()
 void CRhinoUiStaticEx::SetAlignment  |  ( |  UINT  |  alignment | )
◆ SetBackgroundColor()
 void CRhinoUiStaticEx::SetBackgroundColor  |  ( |  COLORREF  |  color | )
◆ SetColor()
 void CRhinoUiStaticEx::SetColor  |  ( |  COLORREF  |  color | )
Another version of SetBackgroundColor.
◆ SetFilePath()
 void CRhinoUiStaticEx::SetFilePath  |  ( |  const wchar_t *  |  pszPath | )
◆ SetText()
 void CRhinoUiStaticEx::SetText  |  ( |  const wchar_t *  |  pszText | )
◆ SetTextColor()
 void CRhinoUiStaticEx::SetTextColor  |  ( |  COLORREF  |  color | )
◆ TextColor()
 COLORREF CRhinoUiStaticEx::TextColor  |  ( |   | ) |   const
Gets and sets the static control's text color. This overrides Rhino's color theme drawing. Setting will invalidate the control.