CRhRdkNewContentCtrl Class Reference
RDK
#include <RhRdkNewContentCtrl.h>
Detailed Description
'NCC'.
Using this class as a dialog member is no longer supported.
STARTING WITH RHINO 8, THIS CONTROL IS DEPRECATED AND DOES NOT WORK. See [DEPCTL]