Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoRegProfileContextIterator Class Reference
RhinoUI
#include <RhinoSdkUiProfileContextIterator.h>
 Inheritance diagram for CRhinoRegProfileContextIterator:
 Public Member Functions
CRhinoRegProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoRegProfileContextIterator ()
const wchar_t *  | FirstSection ()
Must override. More...
const wchar_t *  | FirstValue ()
const wchar_t *  | NextSection ()
const wchar_t *  | NextValue ()
 Public Member Functions inherited from CRhinoProfileContextIterator
CRhinoProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoProfileContextIterator ()
int  | IterateAllSections (bool(*cull)(const wchar_t *)=NULL)
int  | IterateAllValues (bool(*cull)(ON_wString &value_name, ON_wString &value)=NULL)
const wchar_t *  | Section (int index) const
int  | SectionCount () const
const ON_ClassArray< ON_wString > &  | Sections () const
const wchar_t *  | Value () const
bool  | Value (bool &result) const
bool  | Value (double &result) const
bool  | Value (int &result) const
bool  | Value (int index, bool &result) const
bool  | Value (int index, double &result) const
bool  | Value (int index, int &result) const
bool  | Value (int index, ON_3dPoint &result) const
bool  | Value (int index, ON_3dVector &result) const
bool  | Value (int index, ON_Color &result) const
bool  | Value (int index, ON_wString &result) const
bool  | Value (int index, POINT &result) const
bool  | Value (int index, RECT &result) const
bool  | Value (ON_3dPoint &result) const
bool  | Value (ON_3dVector &result) const
bool  | Value (ON_Color &result) const
bool  | Value (ON_wString &result) const
bool  | Value (POINT &result) const
bool  | Value (RECT &result) const
int  | ValueCount () const
const wchar_t *  | ValueName (int index) const
const ON_ClassArray< ON_wString > &  | ValueNames () const
const ON_ClassArray< ON_wString > &  | Values () const
 Protected Member Functions
const wchar_t *  | Close ()
 Protected Attributes
HKEY  | m_hKey
 Protected Attributes inherited from CRhinoProfileContextIterator
int  | m_item
CRhinoProfileContext &  | m_pc
ON_wString  | m_section
ON_ClassArray< ON_wString >  | m_sections
ON_wString  | m_value
ON_wString  | m_value_name
ON_ClassArray< ON_wString >  | m_value_names
ON_ClassArray< ON_wString >  | m_values
ON_wString  | m_w
Detailed Description
class CRhinoRegProfileContextIterator
Constructor & Destructor Documentation
◆ CRhinoRegProfileContextIterator()
 CRhinoRegProfileContextIterator::CRhinoRegProfileContextIterator  |  ( |  const wchar_t *  |  section,
|  CRhinoProfileContext &  |  pc
)
◆ ~CRhinoRegProfileContextIterator()
 virtual CRhinoRegProfileContextIterator::~CRhinoRegProfileContextIterator  |  ( |   | )
virtual
Member Function Documentation
◆ Close()
 const wchar_t* CRhinoRegProfileContextIterator::Close  |  ( |   | )
protected
◆ FirstSection()
 const wchar_t* CRhinoRegProfileContextIterator::FirstSection  |  ( |   | )
virtual
Must override.
Implements CRhinoProfileContextIterator.
◆ FirstValue()
 const wchar_t* CRhinoRegProfileContextIterator::FirstValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ NextSection()
 const wchar_t* CRhinoRegProfileContextIterator::NextSection  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ NextValue()
 const wchar_t* CRhinoRegProfileContextIterator::NextValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
Member Data Documentation
◆ m_hKey
 HKEY CRhinoRegProfileContextIterator::m_hKey
protected