Public Member Functions | Public Attributes | List of all members
RhinoReduceMeshParameters Class Reference
Rhino
#include <rhinoSdkMeshUtilities.h>
 Public Member Functions
RhinoReduceMeshParameters ()
Constructs new reduce mesh parameters with default values. More...
 Public Attributes
bool  | m_bAllowDistortion
bool  | m_bNormalizeMeshSize
If true mesh is fitted to an axis aligned unit cube until reduction is complete. More...
int  | m_iAccuracy
int  | m_iDesiredPolygonCount
Target polygon count. More...
ON_Terminator *  | m_pCancelHandler
Null or a pointer to an ON_Terminator object. Provides a custom way to handle cancelling. More...
ON_SimpleArray< int > *  | m_pFaceTagArray
ON_SimpleArray< ON_COMPONENT_INDEX > *  | m_pLockedComponents
ON_ProgressReporter *  | m_pProgressReporter
Null or a pointer to an ON_ProgressReporter object. Provides custom progress information to caller. More...
ON_wString  | m_sProblemOut
Reports possible problems. More...
Detailed Description
Description: Set of parameters for RhinoReduceMesh function.
Constructor & Destructor Documentation
◆ RhinoReduceMeshParameters()
 RhinoReduceMeshParameters::RhinoReduceMeshParameters  |  ( |   | )
Constructs new reduce mesh parameters with default values.
Member Data Documentation
◆ m_bAllowDistortion
 bool RhinoReduceMeshParameters::m_bAllowDistortion
If true, faces are removed until m_iDesiredPolygonCount is reached, distorting the shape as needed. If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and ignores m_iDesiredPolygonCount.
◆ m_bNormalizeMeshSize
 bool RhinoReduceMeshParameters::m_bNormalizeMeshSize
If true mesh is fitted to an axis aligned unit cube until reduction is complete.
◆ m_iAccuracy
 int RhinoReduceMeshParameters::m_iAccuracy
Integer from 1 to 10 telling how accurate reduction algorithm to use. Greater number gives more accurate results.
◆ m_iDesiredPolygonCount
 int RhinoReduceMeshParameters::m_iDesiredPolygonCount
Target polygon count.
◆ m_pCancelHandler
 ON_Terminator* RhinoReduceMeshParameters::m_pCancelHandler
Null or a pointer to an ON_Terminator object. Provides a custom way to handle cancelling.
◆ m_pFaceTagArray
 ON_SimpleArray<int>* RhinoReduceMeshParameters::m_pFaceTagArray
Null or a pointer to an ON_SimpleArray<int> object with element count equal to mesh face count. Each element is a user defined tag for the mesh face with the same index.Can be used to identify mesh faces before and after calling RhinoReduceMesh.
◆ m_pLockedComponents
 ON_SimpleArray<ON_COMPONENT_INDEX>* RhinoReduceMeshParameters::m_pLockedComponents
Null or a pointer to an ON_SimpleArray<ON_COMPONENT_INDEX> object containing components of type ON_COMPONENT_INDEX::meshtop_vertex and ON_COMPONENT_INDEX::mesh_vertex. Vertices listed here are not moved or deleted in reduction process. Each mesh_vertex will lock the corresponding meshtop_vertex. In other words it is not possible to have a locked and non-locked mesh vertex at the same location.
◆ m_pProgressReporter
 ON_ProgressReporter* RhinoReduceMeshParameters::m_pProgressReporter
Null or a pointer to an ON_ProgressReporter object. Provides custom progress information to caller.
◆ m_sProblemOut
 ON_wString RhinoReduceMeshParameters::m_sProblemOut
Reports possible problems.