Public Member Functions | List of all members
CRhRdkDecalIteratorEx Class Referenceabstract
RDK
#include <RhRdkObjectDataAccess.h>
 Inheritance diagram for CRhRdkDecalIteratorEx:
 Public Member Functions
virtual const CRhRdkDocumentAwareDecal *  | NextDecalEx (void)=0
 Public Member Functions inherited from CRhRdkDecalIterator
virtual  | ~CRhRdkDecalIterator ()
virtual RDK_DECAL_CRC  | CRC (void) const =0
virtual const RDK_DEPRECATED IRhRdkDecal *  | NextDecal (void)=0
virtual void  | Reset (void)=0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class provides a means of iterating over decals. An instance of this object can be obtained by calling CRhRdkObjectDataAccess::NewDecalIterator(). The implementation of this class is thread-safe so that it can be used from multiple threads during rendering.
Member Function Documentation
◆ NextDecalEx()
 virtual const CRhRdkDocumentAwareDecal* CRhRdkDecalIteratorEx::NextDecalEx  |  ( |  void  |   | )
pure virtual
Retrieve the next decal. Supersedes the one above that returns IRhRdkDecal.
Returns
A pointer to the next decal or null if no more decals.