Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhRdkContextTaskOriginWithCEC Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkContextTaskOriginWithCEC:
 Public Member Functions
CRhRdkContextTaskOriginWithCEC (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const IRhRdkContentEditingContext &cec)
virtual  | ~CRhRdkContextTaskOriginWithCEC ()
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const final override
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const final override
virtual const wchar_t *  | TopLevelKind (void) const final override
virtual UUID  | Uuid (void) const final override
 Public Member Functions inherited from CRhRdkContextTaskOrigin
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const =0
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const =0
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
const IRhRdkContentEditingContext &  | CEC (void) const
 Protected Attributes
CImpl *  | m_pImpl
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Used when task origin is context-sensitive and has a CEC.
Constructor & Destructor Documentation
◆ CRhRdkContextTaskOriginWithCEC()
 CRhRdkContextTaskOriginWithCEC::CRhRdkContextTaskOriginWithCEC  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con,
|  const IRhRdkContentEditingContext &  |  cec
)
◆ ~CRhRdkContextTaskOriginWithCEC()
 virtual CRhRdkContextTaskOriginWithCEC::~CRhRdkContextTaskOriginWithCEC  |  ( |   | )
virtual
Member Function Documentation
◆ CEC()
 const IRhRdkContentEditingContext& CRhRdkContextTaskOriginWithCEC::CEC  |  ( |  void  |   | ) |   const
protected
◆ PreviewAppearance()
 virtual const CRhRdkPreviewAppearance* CRhRdkContextTaskOriginWithCEC::PreviewAppearance  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Reimplemented from CRhRdkTaskOrigin.
◆ PreviewMetaData()
 virtual const CRhRdkPreviewMetaData* CRhRdkContextTaskOriginWithCEC::PreviewMetaData  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Reimplemented from CRhRdkTaskOrigin.
◆ TopLevelKind()
 virtual const wchar_t* CRhRdkContextTaskOriginWithCEC::TopLevelKind  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.
◆ Uuid()
 virtual UUID CRhRdkContextTaskOriginWithCEC::Uuid  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkContextTaskOriginWithCEC::m_pImpl
protected