Classes | Public Member Functions | Protected Member Functions | List of all members
CRhRdkTextureEvaluator Class Reference
RDK
#include <IRhRdkTextureEvaluator.h>
 Inheritance diagram for CRhRdkTextureEvaluator:
 Classes
struct  | WRITE_TO_BYTE_DATA
struct  | WRITE_TO_FLOAT_DATA
 Public Member Functions
bool  | AdjustmentOn (void) const
virtual const IChildCallback *  | ChildCallback (void) const override
const CEvalFlags &  | EvaluatorFlags (void) const
virtual void *  | EVF (const wchar_t *, void *) override
bool  | FilteringOn (void) const
virtual bool  | Initialize (void) override
bool  | LocalMappingOn (void) const
bool  | ProjectionChangeOn (void) const
virtual bool  | RegisterChildCallback (IChildCallback *pChildCallback, const CRhRdkTexture &texture, void *pvData) override
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkTextureEvaluator
virtual void  | DeleteThis (void)=0
virtual bool  | GetColor (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, CRhRdkColor &colOut, void *pvData=NULL) const =0
bool  | WriteByteArray (const ON_2iSize &size, unsigned char *buffer) const
bool  | WriteFloatArray (const ON_2iSize &size, float *buffer) const
 Protected Member Functions
CRhRdkTextureEvaluator (IRhRdkTextureEvaluator::CEvalFlags ef)
virtual  | ~CRhRdkTextureEvaluator ()
 Protected Member Functions inherited from IRhRdkTextureEvaluator
virtual  | ~IRhRdkTextureEvaluator ()
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This is the default base class implementation of IRhRdkTextureEvaluator.
Constructor & Destructor Documentation
◆ ~CRhRdkTextureEvaluator()
 virtual CRhRdkTextureEvaluator::~CRhRdkTextureEvaluator  |  ( |   | )
protectedvirtual
◆ CRhRdkTextureEvaluator()
 CRhRdkTextureEvaluator::CRhRdkTextureEvaluator  |  ( |  IRhRdkTextureEvaluator::CEvalFlags  |  ef | )
protected
Member Function Documentation
◆ AdjustmentOn()
 bool CRhRdkTextureEvaluator::AdjustmentOn  |  ( |  void  |   | ) |   const
◆ ChildCallback()
 virtual const IChildCallback* CRhRdkTextureEvaluator::ChildCallback  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkTextureEvaluator::ChildCallback().
Implements IRhRdkTextureEvaluator.
◆ EvaluatorFlags()
 const CEvalFlags& CRhRdkTextureEvaluator::EvaluatorFlags  |  ( |  void  |   | ) |   const
◆ EVF()
 virtual void* CRhRdkTextureEvaluator::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkTextureEvaluator.
Reimplemented in CRhRdkOneColorEvaluator.
◆ FilteringOn()
 bool CRhRdkTextureEvaluator::FilteringOn  |  ( |  void  |   | ) |   const
◆ Initialize()
 virtual bool CRhRdkTextureEvaluator::Initialize  |  ( |  void  |   | )
overridevirtual
Default implementation calls GetColor(ON_origin...).
Implements IRhRdkTextureEvaluator.
◆ LocalMappingOn()
 bool CRhRdkTextureEvaluator::LocalMappingOn  |  ( |  void  |   | ) |   const
◆ ProjectionChangeOn()
 bool CRhRdkTextureEvaluator::ProjectionChangeOn  |  ( |  void  |   | ) |   const
◆ RegisterChildCallback()
 virtual bool CRhRdkTextureEvaluator::RegisterChildCallback  |  ( |  IChildCallback *  |  pChildCallback,
|  const CRhRdkTexture &  |  texture,
|  void *  |  pvData
)
overridevirtual
Implements IRhRdkTextureEvaluator::RegisterChildCallback().
Implements IRhRdkTextureEvaluator.
Reimplemented in CRhRdkTwoColorEvaluator, and CRhRdkOneColorEvaluator.