Public Member Functions | Public Attributes | List of all members
CRhinoMeshDensity Class Reference
Rhino
#include <rhinoSdkMeshObject.h>
 Public Member Functions
CRhinoMeshDensity ()
BOOL32  | IsValid () const
void  | LoadProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
void  | SaveProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
 Public Attributes
int  | m_around
spheres, cylinders, and cones More...
int  | m_vertical
(>=2) number of quads in longitude direction More...
int  | m_x
boxes and planes. More...
int  | m_y
(>=1) number of quads in "y" direction More...
int  | m_z
Detailed Description
Description: CRhinoMeshDensity determines the number of quads created by the RhinoMeshPlane, RhinoMeshBox, and RhinoMeshSphere commands.
Constructor & Destructor Documentation
◆ CRhinoMeshDensity()
 CRhinoMeshDensity::CRhinoMeshDensity  |  ( |   | )
Member Function Documentation
◆ IsValid()
 BOOL32 CRhinoMeshDensity::IsValid  |  ( |   | ) |   const
Returns: true if settings are valid
◆ LoadProfile()
 void CRhinoMeshDensity::LoadProfile  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
)
◆ SaveProfile()
 void CRhinoMeshDensity::SaveProfile  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
)
Member Data Documentation
◆ m_around
 int CRhinoMeshDensity::m_around
spheres, cylinders, and cones
(>=3) number of quads in latitude direction
◆ m_vertical
 int CRhinoMeshDensity::m_vertical
(>=2) number of quads in longitude direction
◆ m_x
 int CRhinoMeshDensity::m_x
boxes and planes.
(>=1) number of quads in "x" direction
◆ m_y
 int CRhinoMeshDensity::m_y
(>=1) number of quads in "y" direction
◆ m_z
 int CRhinoMeshDensity::m_z
(>=1) number of quads in "z" direction