Classes | Public Member Functions | List of all members
ON_FixedSizePoolElementFromIndexAccelerator Class Reference
OpenNURBS
ON_FixedSizePoolElementFromIndexAccelerator is used when a fixed size pool is constant (no more element will be added), large (lots of memory blocks), and lots of calls need to be made to convert an element index into a fixed size pool element pointer. In this case, calling void* ON_FixedSizePoolElementFromIndexAccelerator::FixedSizePoolElement(size_t element_index) replaces calling void* ON_FixedSizePool::Element(size_t element_index) const and is much faster for fixed size pools with lots of blocks and lots of conversions from element_index to element pointer. More...
#include <opennurbs_fsp.h>
 Public Member Functions
ON_FixedSizePoolElementFromIndexAccelerator ()=default
~ON_FixedSizePoolElementFromIndexAccelerator ()
void  | Clear ()
Clears all information set by Initialize(fsp). After calling Clear(), elements can be added to fsp can be More...
void *  | ElementFromIndex (size_t element_index) const
ElementFromIndex(element_index) returns the same pointer that fsp.Element(element_index) would return, where fsp is the ON_FixedSizePool passed to the constructor. For ON_FixedSizePool with large numbers of blocks, ElementFromIndex() is much faster than fsp.Element(element_index). More...
size_t  | Initialize (const ON_FixedSizePool &fsp)
Initialize this ON_FixedSizePoolElementFromIndexAccelerator to find elements in fsp from their index. Any elements added to fsp after calling Initialize() will not be found by ON_FixedSizePoolElementFromIndexAccelerator::ElementFromIndex(). It is strongly suggested that you finish creating fsp before using ON_FixedSizePoolElementFromIndexAccelerator. The computational cost of Initialize() is about fourt times the computational cost of calling fps.Element(element_index) for 4 random valid indices. Call Clear() or ~ON_FixedSizePoolElementFromIndexAccelerator() when you are finished using the accelerated index to element conversion. More...
Detailed Description
ON_FixedSizePoolElementFromIndexAccelerator is used when a fixed size pool is constant (no more element will be added), large (lots of memory blocks), and lots of calls need to be made to convert an element index into a fixed size pool element pointer. In this case, calling void* ON_FixedSizePoolElementFromIndexAccelerator::FixedSizePoolElement(size_t element_index) replaces calling void* ON_FixedSizePool::Element(size_t element_index) const and is much faster for fixed size pools with lots of blocks and lots of conversions from element_index to element pointer.
Constructor & Destructor Documentation
◆ ON_FixedSizePoolElementFromIndexAccelerator()
 ON_FixedSizePoolElementFromIndexAccelerator::ON_FixedSizePoolElementFromIndexAccelerator  |  ( |   | )
default
◆ ~ON_FixedSizePoolElementFromIndexAccelerator()
 ON_FixedSizePoolElementFromIndexAccelerator::~ON_FixedSizePoolElementFromIndexAccelerator  |  ( |   | )
Member Function Documentation
◆ Clear()
 void ON_FixedSizePoolElementFromIndexAccelerator::Clear  |  ( |   | )
Clears all information set by Initialize(fsp). After calling Clear(), elements can be added to fsp can be
◆ ElementFromIndex()
 void* ON_FixedSizePoolElementFromIndexAccelerator::ElementFromIndex  |  ( |  size_t  |  element_index | ) |   const
ElementFromIndex(element_index) returns the same pointer that fsp.Element(element_index) would return, where fsp is the ON_FixedSizePool passed to the constructor. For ON_FixedSizePool with large numbers of blocks, ElementFromIndex() is much faster than fsp.Element(element_index).
Parameters
element_index
Returns
Return the same pointer that fsp.Element(element_index) would return.
◆ Initialize()
 size_t ON_FixedSizePoolElementFromIndexAccelerator::Initialize  |  ( |  const ON_FixedSizePool &  |  fsp | )
Initialize this ON_FixedSizePoolElementFromIndexAccelerator to find elements in fsp from their index. Any elements added to fsp after calling Initialize() will not be found by ON_FixedSizePoolElementFromIndexAccelerator::ElementFromIndex(). It is strongly suggested that you finish creating fsp before using ON_FixedSizePoolElementFromIndexAccelerator. The computational cost of Initialize() is about fourt times the computational cost of calling fps.Element(element_index) for 4 random valid indices. Call Clear() or ~ON_FixedSizePoolElementFromIndexAccelerator() when you are finished using the accelerated index to element conversion.
Parameters
fsp
Returns