Public Member Functions | List of all members
ON_SubDFaceArray Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDFaceArray ()=default
ON_SubDFaceArray (const ON_SubD &subd)
ON_SubDFaceArray (const ON_SubDFaceArray &)=default
unsigned int  | FaceCount () const
ON_SubDFaceArray &  | operator= (const ON_SubDFaceArray &)=default
const class ON_SubDFace *  | operator[] (unsigned int i) const
const ON_SubD &  | SubD () const
Detailed Description
ON_SubDFaceArray Description: Avoid using ON_SubDFaceArray. ON_SubDFaceIterator is more efficient and a better choice.
Constructor & Destructor Documentation
◆ ON_SubDFaceArray() [1/3]
 ON_SubDFaceArray::ON_SubDFaceArray  |  ( |  const ON_SubD &  |  subd | )
◆ ON_SubDFaceArray() [2/3]
 ON_SubDFaceArray::ON_SubDFaceArray  |  ( |   | )
default
◆ ON_SubDFaceArray() [3/3]
 ON_SubDFaceArray::ON_SubDFaceArray  |  ( |  const ON_SubDFaceArray &  |   | )
default
Member Function Documentation
◆ FaceCount()
 unsigned int ON_SubDFaceArray::FaceCount  |  ( |   | ) |   const
inline
◆ operator=()
 ON_SubDFaceArray& ON_SubDFaceArray::operator=  |  ( |  const ON_SubDFaceArray &  |   | )
default
◆ operator[]()
 const class ON_SubDFace* ON_SubDFaceArray::operator[]  |  ( |  unsigned int  |  i | ) |   const
inline
◆ SubD()
 const ON_SubD& ON_SubDFaceArray::SubD  |  ( |   | ) |   const
inline