Public Member Functions | Public Attributes | List of all members
ON_CURVE_POINT Class Reference
OpenNURBS
#include <opennurbs_plus.h>
 Public Member Functions
ON_CURVE_POINT ()
 Public Attributes
ON_COMPONENT_INDEX  | m_ci
const class ON_CurveTreeNode *  | m_cnode
const class ON_Curve *  | m_curve
C++ default destructor, copy constructor, and operator= work fine. More...
const ON_Mesh *  | m_mesh
nullptr if m_ci is unset More...
double  | m_node_t
bezier parameter in m_cnode More...
unsigned int  | m_sn
ON_CURVE_POINT serial number. More...
double  | m_t
curve parameter More...
Constructor & Destructor Documentation
◆ ON_CURVE_POINT()
 ON_CURVE_POINT::ON_CURVE_POINT  |  ( |   | )
Member Data Documentation
◆ m_ci
 ON_COMPONENT_INDEX ON_CURVE_POINT::m_ci
If this intersection is as a result of a mesh face, mesh edge intersection then m_ci.m_type = ON_COMPONENT_INDEX::meshtop_edge and m_index will be an index into the m_mesh->Topology().m_tope array. m_t will be the parameter on the line from edge.vi[0] to edge.vi[1]
◆ m_cnode
 const class ON_CurveTreeNode* ON_CURVE_POINT::m_cnode
◆ m_curve
 const class ON_Curve* ON_CURVE_POINT::m_curve
C++ default destructor, copy constructor, and operator= work fine.
◆ m_mesh
 const ON_Mesh* ON_CURVE_POINT::m_mesh
nullptr if m_ci is unset
◆ m_node_t
 double ON_CURVE_POINT::m_node_t
bezier parameter in m_cnode
◆ m_sn
 unsigned int ON_CURVE_POINT::m_sn
ON_CURVE_POINT serial number.
◆ m_t
 double ON_CURVE_POINT::m_t
curve parameter