Public Member Functions | Static Public Member Functions | Friends | List of all members
ON_Hash32TableItem Class Reference
OpenNURBS
#include <opennurbs_hash_table.h>
 Public Member Functions
ON_Hash32TableItem ()=default
ON_Hash32TableItem (const ON_Hash32TableItem &)=default
~ON_Hash32TableItem ()=default
void  | ClearHashTableSerialNumberForExperts ()
ON__UINT32  | HashTableItemHash () const
ON__UINT32  | HashTableSerialNumber () const
ON_Hash32TableItem &  | operator= (const ON_Hash32TableItem &)=default
 Static Public Member Functions
static ON__UINT32  | Hash32FromId (const ON_UUID &id)
static ON__UINT32  | Hash32FromSHA1Hash (const class ON_SHA1_Hash &sha1_hash)
 Friends
class  | ON_Hash32Table
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. defines ON_Hash32Table
Constructor & Destructor Documentation
◆ ON_Hash32TableItem() [1/2]
 ON_Hash32TableItem::ON_Hash32TableItem  |  ( |   | )
default
◆ ~ON_Hash32TableItem()
 ON_Hash32TableItem::~ON_Hash32TableItem  |  ( |   | )
default
◆ ON_Hash32TableItem() [2/2]
 ON_Hash32TableItem::ON_Hash32TableItem  |  ( |  const ON_Hash32TableItem &  |   | )
default
Member Function Documentation
◆ ClearHashTableSerialNumberForExperts()
 void ON_Hash32TableItem::ClearHashTableSerialNumberForExperts  |  ( |   | )
Description: Useful when copying hash tables to remove the hash table reference from a copied hash item. Never remove the hash table reference from an item that is still in a hash table.
◆ Hash32FromId()
 static ON__UINT32 ON_Hash32TableItem::Hash32FromId  |  ( |  const ON_UUID &  |  id | )
static
◆ Hash32FromSHA1Hash()
 static ON__UINT32 ON_Hash32TableItem::Hash32FromSHA1Hash  |  ( |  const class ON_SHA1_Hash &  |  sha1_hash | )
static
◆ HashTableItemHash()
 ON__UINT32 ON_Hash32TableItem::HashTableItemHash  |  ( |   | ) |   const
Returns: If this item has been added to an ON_Hash32Table.AddItem(hash32,item pointer) then the value of hash3d passed as the first argument to ON_Hash32Table.AddItem(hash32,item pointer) is returned. This is the value the ON_Hash32Table uses for this item. Otherwise 0 is returned. Remarks: This function is useful when copying hash tables.
count = src_hash_table.ItemCount(); MyHashTableItems src_items[count]; ///< items added to src_hash_table
/ copy src_hash_table MyHashTableItems copied_items[count]; copied_items = src_items; for (unsigned i = 0; i < count; ++i) { ON_SubDSurfaceInterpolatortHash32TableItem& hitem = copied_items[i]; hitem.ClearHashTableSerialNumberForExperts(); m_htable.AddItem(hitem.HashTableItemHash(), &hitem); }
◆ HashTableSerialNumber()
 ON__UINT32 ON_Hash32TableItem::HashTableSerialNumber  |  ( |   | ) |   const
◆ operator=()
 ON_Hash32TableItem& ON_Hash32TableItem::operator=  |  ( |  const ON_Hash32TableItem &  |   | )
default
Friends And Related Function Documentation
◆ ON_Hash32Table
 friend class ON_Hash32Table
friend