Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoPropListProfileContext Class Reference
Rhino
#include <RhinoSdkMacUiProfileContext.h>
 Inheritance diagram for CRhinoPropListProfileContext:
 Public Member Functions
CRhinoPropListProfileContext (CRhinoProfileContext::context_location ct)
virtual  | ~CRhinoPropListProfileContext ()
CRhinoProfileContextIterator *  | GetNewIterator (const wchar_t *section)
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *) const
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *value, bool defaultValue) const
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *value, BOOL32 defaultValue) const
bool  | LoadProfileBool (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32 *) const
bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *value, COLORREF defaultValue) const
bool  | LoadProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color *) const
bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *value, double defaultValue) const
bool  | LoadProfileDouble (const wchar_t *lpszSection, LPCTSTR lpszEntry, double *) const
bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *value, int defaultValue) const
bool  | LoadProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32 *) const
bool  | LoadProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, int *) const
bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value) const
bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &value, const ON_Color &defaultValue) const
bool  | LoadProfileRGBA (const wchar_t *lpszSection, LPCTSTR lpszEntry, ON_Color &) const
bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &value, const char *defaultValue) const
bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &value, const wchar_t *defaultValue) const
bool  | LoadProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, ON_wString &) const
bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value) const
bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value, const CRhinoStringDictionary &defaultValue) const
bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *value, const UUID &defaultValue) const
id  | ProfileKeyFor (LPCTSTR lpszSection, LPCTSTR lpszEntry=NULL) const
virtual MRPropertyList *  | PropertyList () const
void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool) const
void  | SaveProfileBool (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32) const
void  | SaveProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color) const
void  | SaveProfileDouble (const wchar_t *lpszSection, LPCTSTR lpszEntry, double) const
void  | SaveProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, int) const
void  | SaveProfileRGBA (const wchar_t *lpszSection, LPCTSTR lpszEntry, const ON_Color &) const
bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_wString > &sValues) const
bool  | SaveProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const char *) const
bool  | SaveProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const wchar_t *) const
void  | SetPropListFileName (const wchar_t *)
 Public Member Functions inherited from CRhinoProfileContext
CRhinoProfileContext (context_location ct)
virtual  | ~CRhinoProfileContext ()
virtual bool  | IsSynchronizing () const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *) const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *value, const ON_3dPoint &defaultValue) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *value, const ON_3dVector &defaultValue) const
virtual bool  | LoadProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, void *pValue, ULONG &nBytesOut) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *) const
bool  | LoadProfileLegacyPlugMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, ON_MeshParameters *mp, int *mesh_ui_style) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *value, const ON_MeshParameters &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &value, const ON_ClassArray< ON_String > &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value, const ON_ClassArray< ON_wString > &defaultValue) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *value, const POINT &defaultValue) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *value, const RECT &defaultValue) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, char *, int) const
The following version of LoadProfileString() all call the above version and convert the CString. More...
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &) const =0
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, wchar_t *, int) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *value, const ON_Xform &defaultValue) const
context_location  | ProfileContextLocation () const
virtual void  | SaveProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dPoint &) const
virtual void  | SaveProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dVector &) const
virtual bool  | SaveProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const void *pValue, ULONG nBytes) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32) const
virtual void  | SaveProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF) const
virtual void  | SaveProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double) const
virtual void  | SaveProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int) const
void  | SaveProfileLegacyPlugInMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, const ON_MeshParameters &mp, int mesh_ui_style) const
virtual void  | SaveProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_MeshParameters &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_2iPoint &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const POINT &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_4iRect &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const RECT &) const
virtual void  | SaveProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Color &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const char *) const =0
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_String > &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const wchar_t *) const =0
virtual bool  | SaveProfileStringDictioary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const CRhinoStringDictionary &value) const
virtual bool  | SaveProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, const UUID &uuid) const
virtual void  | SaveProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Xform &) const
 Protected Member Functions
bool  | RegWriteProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const class CString &sValue, CRhinoProfileContext::context_location nProfile) const
 Protected Attributes
MRPropertyList *  | m_pPropertyList
ON_wString  | m_wFileName
 Friends
class  | CRhinoPropListProfileContextIterator
 Additional Inherited Members
 Public Types inherited from CRhinoProfileContext
enum  | context_location : unsigned int {
 cl_global_current_user = 0, cl_scheme_current_user, cl_root_local_machine, cl_plugins_current_user,
 cl_plugins_local_machine
 }
Detailed Description
class CRhinoPropListProfileContext
Constructor & Destructor Documentation
◆ CRhinoPropListProfileContext()
 CRhinoPropListProfileContext::CRhinoPropListProfileContext  |  ( |  CRhinoProfileContext::context_location  |  ct | )
◆ ~CRhinoPropListProfileContext()
 virtual CRhinoPropListProfileContext::~CRhinoPropListProfileContext  |  ( |   | )
virtual
Member Function Documentation
◆ GetNewIterator()
 CRhinoProfileContextIterator* CRhinoPropListProfileContext::GetNewIterator  |  ( |  const wchar_t *  |  section | )
virtual
Required CRhinoProfileContext overrides
Implements CRhinoProfileContext.
◆ LoadProfileBool() [1/4]
 bool CRhinoPropListProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool *
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileBool() [2/4]
 bool CRhinoPropListProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool *  |  value,
|  bool  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileBool() [3/4]
 bool CRhinoPropListProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  BOOL32 *  |  value,
|  BOOL32  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileBool() [4/4]
 bool CRhinoPropListProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL32 *
) |   |  const
◆ LoadProfileColor() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileColor  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  COLORREF *  |  value,
|  COLORREF  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileColor() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileColor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color *
) |   |  const
◆ LoadProfileDouble() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  double *  |  value,
|  double  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileDouble() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  double *
) |   |  const
◆ LoadProfileInt() [1/3]
 bool CRhinoPropListProfileContext::LoadProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  int *  |  value,
|  int  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileInt() [2/3]
 bool CRhinoPropListProfileContext::LoadProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL32 *
) |   |  const
◆ LoadProfileInt() [3/3]
 bool CRhinoPropListProfileContext::LoadProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  int *
) |   |  const
◆ LoadProfileMultiString()
 bool CRhinoPropListProfileContext::LoadProfileMultiString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_ClassArray< ON_wString > &  |  value
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileRGBA() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_Color &  |  value,
|  const ON_Color &  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileRGBA() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color &
) |   |  const
◆ LoadProfileString() [1/3]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_String &  |  value,
|  const char *  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileString() [2/3]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_wString &  |  value,
|  const wchar_t *  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileString() [3/3]
 bool CRhinoPropListProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_wString &
) |   |  const
◆ LoadProfileStringDictionary() [1/2]
 bool CRhinoPropListProfileContext::LoadProfileStringDictionary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  CRhinoStringDictionary &  |  value
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileStringDictionary() [2/2]
 bool CRhinoPropListProfileContext::LoadProfileStringDictionary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  CRhinoStringDictionary &  |  value,
|  const CRhinoStringDictionary &  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ LoadProfileUuid()
 bool CRhinoPropListProfileContext::LoadProfileUuid  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  UUID *  |  value,
|  const UUID &  |  defaultValue
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ ProfileKeyFor()
 id CRhinoPropListProfileContext::ProfileKeyFor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry = NULL
) |   |  const
◆ PropertyList()
 virtual MRPropertyList* CRhinoPropListProfileContext::PropertyList  |  ( |   | ) |   const
virtual
Reimplemented in CRhinoPropListFileProfileContext.
◆ RegWriteProfileString()
 bool CRhinoPropListProfileContext::RegWriteProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const class CString &  |  sValue,
|  CRhinoProfileContext::context_location  |  nProfile
) |   |  const
protected
Local protected methods
◆ SaveProfileBool() [1/2]
 void CRhinoPropListProfileContext::SaveProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ SaveProfileBool() [2/2]
 void CRhinoPropListProfileContext::SaveProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  BOOL32
) |   |  const
◆ SaveProfileColor()
 void CRhinoPropListProfileContext::SaveProfileColor  |  ( |  LPCTSTR  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  ON_Color
) |   |  const
◆ SaveProfileDouble()
 void CRhinoPropListProfileContext::SaveProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  double
) |   |  const
◆ SaveProfileInt()
 void CRhinoPropListProfileContext::SaveProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  int
) |   |  const
◆ SaveProfileRGBA()
 void CRhinoPropListProfileContext::SaveProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const ON_Color &
) |   |  const
The LoadProfileColor/SaveProfileColor functions ignore alpha. If you want to save a color with alpha information, use the following RGBA functions
◆ SaveProfileString() [1/3]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_ClassArray< ON_wString > &  |  sValues
) |   |  const
virtual
Reimplemented from CRhinoProfileContext.
◆ SaveProfileString() [2/3]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const char *
) |   |  const
◆ SaveProfileString() [3/3]
 bool CRhinoPropListProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  LPCTSTR  |  lpszEntry,
|  const wchar_t *
) |   |  const
◆ SetPropListFileName()
 void CRhinoPropListProfileContext::SetPropListFileName  |  ( |  const wchar_t *  |   | )
Local public methods
Friends And Related Function Documentation
◆ CRhinoPropListProfileContextIterator
 friend class CRhinoPropListProfileContextIterator
friend
Member Data Documentation
◆ m_pPropertyList
 MRPropertyList* CRhinoPropListProfileContext::m_pPropertyList
protected
◆ m_wFileName
 ON_wString CRhinoPropListProfileContext::m_wFileName
protected