Public Member Functions | Public Attributes | List of all members
ON_ClippingPlaneDataStore Class Reference
OpenNURBS
#include <opennurbs_plane.h>
 Public Member Functions
ON_ClippingPlaneDataStore ()
ON_ClippingPlaneDataStore (const ON_ClippingPlaneDataStore &src)
~ON_ClippingPlaneDataStore ()
ON_ClippingPlaneDataStore &  | operator= (const ON_ClippingPlaneDataStore &src)
 Public Attributes
unsigned int  | m_sn =0
Detailed Description
The only reason this class exists is to maintain extra information on ON_ClippingPlane without changing the size of the ON_ClippingPlane class (to not break the SDK). This class helps maintain a list of additional information associated with an ON_ClippingPlane. Pretend it does not exist
Constructor & Destructor Documentation
◆ ON_ClippingPlaneDataStore() [1/2]
 ON_ClippingPlaneDataStore::ON_ClippingPlaneDataStore  |  ( |   | )
◆ ON_ClippingPlaneDataStore() [2/2]
 ON_ClippingPlaneDataStore::ON_ClippingPlaneDataStore  |  ( |  const ON_ClippingPlaneDataStore &  |  src | )
◆ ~ON_ClippingPlaneDataStore()
 ON_ClippingPlaneDataStore::~ON_ClippingPlaneDataStore  |  ( |   | )
Member Function Documentation
◆ operator=()
 ON_ClippingPlaneDataStore& ON_ClippingPlaneDataStore::operator=  |  ( |  const ON_ClippingPlaneDataStore &  |  src | )
Member Data Documentation
◆ m_sn
 unsigned int ON_ClippingPlaneDataStore::m_sn =0