Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_DisplayMaterialRef Class Reference
OpenNURBS
#include <opennurbs_linestyle.h>
 Public Member Functions
ON_DisplayMaterialRef ()
int  | Compare (const ON_DisplayMaterialRef &other) const
bool  | operator!= (const ON_DisplayMaterialRef &other) const
bool  | operator< (const ON_DisplayMaterialRef &other) const
bool  | operator<= (const ON_DisplayMaterialRef &other) const
bool  | operator== (const ON_DisplayMaterialRef &other) const
bool  | operator> (const ON_DisplayMaterialRef &other) const
bool  | operator>= (const ON_DisplayMaterialRef &other) const
 Public Attributes
ON_UUID  | m_display_material_id
id used to find display attributes More...
ON_UUID  | m_viewport_id
 Static Public Attributes
static const ON_UUID  | m_invisible_in_detail_id
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Class ON_DisplayMaterialRef Description: Objects can have per viewport display properties that override a viewport's default display properties. These overrides are stored on ON_3dmObjectAttributes as a list of ON_DisplayMaterialRefs.
Example: For example, by default a viewport might display objects using a wireframe, but one special object may need to be shaded. In this case the special object would have a display material ref with the "wireframe" viewport's id and the id of a display material that specified shading.
Constructor & Destructor Documentation
◆ ON_DisplayMaterialRef()
 ON_DisplayMaterialRef::ON_DisplayMaterialRef  |  ( |   | )
Description: Default constructor sets both ids to nil.
Member Function Documentation
◆ Compare()
 int ON_DisplayMaterialRef::Compare  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator!=()
 bool ON_DisplayMaterialRef::operator!=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator<()
 bool ON_DisplayMaterialRef::operator<  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator<=()
 bool ON_DisplayMaterialRef::operator<=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator==()
 bool ON_DisplayMaterialRef::operator==  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator>()
 bool ON_DisplayMaterialRef::operator>  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
◆ operator>=()
 bool ON_DisplayMaterialRef::operator>=  |  ( |  const ON_DisplayMaterialRef &  |  other | ) |   const
Member Data Documentation
◆ m_display_material_id
 ON_UUID ON_DisplayMaterialRef::m_display_material_id
id used to find display attributes
◆ m_invisible_in_detail_id
 const ON_UUID ON_DisplayMaterialRef::m_invisible_in_detail_id
static
For Rhino V4 the per detail visibility attribute is implemented through a display material reference on an object. This is ONLY for detail viewports and only for V4. Keep this uuid around so the per detail attributes in future versions of Rhino can be implemented a different way. {1403A7E4-E7AD-4a01-A2AA-41DAE6BE7ECB}
◆ m_viewport_id
 ON_UUID ON_DisplayMaterialRef::m_viewport_id
C++ default destructor, copy constructor and operator= work fine. identifies the ON_Viewport If nil, then the display material will be used in all viewports that are not explicitly referenced in other ON_DisplayMaterialRefs.