Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoEdgeAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoEdgeAnalysisSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoEdgeAnalysisSettings &other) const
bool  | operator== (const CRhinoEdgeAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
ON_Color  | m_show_edge_color
int  | m_show_edges
0 = all, 1 = naked, 2 = non-manifold More...
 Static Public Attributes
static const CRhinoEdgeAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoEdgeAnalysisSettings()
 CRhinoEdgeAnalysisSettings::CRhinoEdgeAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoEdgeAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoEdgeAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoEdgeAnalysisSettings::operator!=  |  ( |  const CRhinoEdgeAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoEdgeAnalysisSettings::operator==  |  ( |  const CRhinoEdgeAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoEdgeAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoEdgeAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoEdgeAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoEdgeAnalysisSettings CRhinoEdgeAnalysisSettings::Default
static
◆ m_show_edge_color
 ON_Color CRhinoEdgeAnalysisSettings::m_show_edge_color
color used to enhance display edges in commands like ShowEdges and ShowNakedEdges.
◆ m_show_edges
 int CRhinoEdgeAnalysisSettings::m_show_edges
0 = all, 1 = naked, 2 = non-manifold