Public Types | Public Member Functions | List of all members
CRhRdkContent::CRenderCRCFlags Class Referencefinal
#include <RhRdkContent.h>
 Public Types
enum  | : ON__UINT64 {
 rcrc_Normal = 0x00, rcrc_ExcludeLinearWorkflow = 0x01, rcrc_ExcludeLocalMapping = 0x02, rcrc_ExcludeUnits = 0x04,
 rcrc_Reserved2 = 0x08, rcrc_ForSimulation = rcrc_ExcludeLinearWorkflow, rcrc_ExcludeDocumentEffects = rcrc_ExcludeLinearWorkflow | rcrc_ExcludeUnits | rcrc_Reserved2
 }
 Public Member Functions
CRenderCRCFlags (const ON__UINT64 &f=rcrc_Normal)
void  | AddFlag (const ON__UINT64 &f)
ON_wString  | DebugString (void) const
const ON__UINT64 &  | Flags (void) const
const wchar_t *  | GetExcludedParamNames (void) const
bool  | HasFlag (const ON__UINT64 &f) const
operator const ON__UINT64 & (void) const
bool  | operator!= (const CRenderCRCFlags &flags) const
bool  | operator== (const CRenderCRCFlags &flags) const
void  | SetExcludedParamNames (const wchar_t *wsz)
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : ON__UINT64
Enumerator
rcrc_Normal
rcrc_ExcludeLinearWorkflow
rcrc_ExcludeLocalMapping
rcrc_ExcludeUnits
rcrc_Reserved2
rcrc_ForSimulation
rcrc_ExcludeDocumentEffects
Constructor & Destructor Documentation
◆ CRenderCRCFlags()
 CRhRdkContent::CRenderCRCFlags::CRenderCRCFlags  |  ( |  const ON__UINT64 &  |  f = rcrc_Normal | )
Member Function Documentation
◆ AddFlag()
 void CRhRdkContent::CRenderCRCFlags::AddFlag  |  ( |  const ON__UINT64 &  |  f | )
◆ DebugString()
 ON_wString CRhRdkContent::CRenderCRCFlags::DebugString  |  ( |  void  |   | ) |   const
◆ Flags()
 const ON__UINT64& CRhRdkContent::CRenderCRCFlags::Flags  |  ( |  void  |   | ) |   const
◆ GetExcludedParamNames()
 const wchar_t* CRhRdkContent::CRenderCRCFlags::GetExcludedParamNames  |  ( |  void  |   | ) |   const
Get a semicolon-delimited string of param names to exclude from the render CRC.
◆ HasFlag()
 bool CRhRdkContent::CRenderCRCFlags::HasFlag  |  ( |  const ON__UINT64 &  |  f | ) |   const
◆ operator const ON__UINT64 &()
 CRhRdkContent::CRenderCRCFlags::operator const ON__UINT64 &  |  ( |  void  |   | ) |   const
◆ operator!=()
 bool CRhRdkContent::CRenderCRCFlags::operator!=  |  ( |  const CRenderCRCFlags &  |  flags | ) |   const
◆ operator==()
 bool CRhRdkContent::CRenderCRCFlags::operator==  |  ( |  const CRenderCRCFlags &  |  flags | ) |   const
◆ SetExcludedParamNames()
 void CRhRdkContent::CRenderCRCFlags::SetExcludedParamNames  |  ( |  const wchar_t *  |  wsz | )
Set a semicolon-delimited string of param names to exclude from the render CRC.