Public Member Functions | Static Public Attributes | List of all members
ON_AggregateComponentStatus Class Reference
OpenNURBS
#include <opennurbs_compstat.h>
 Inheritance diagram for ON_AggregateComponentStatus:
 Public Member Functions
ON_AggregateComponentStatus ()=default
ON_AggregateComponentStatus (const class ON_AggregateComponentStatusEx &)
ON_AggregateComponentStatus (const ON_AggregateComponentStatus &)=default
~ON_AggregateComponentStatus ()=default
bool  | Add (const ON_AggregateComponentStatus &aggregate_status)
bool  | Add (ON_ComponentStatus component_status)
ON_ComponentStatus  | AggregateStatus () const
bool  | ClearAggregateStatus (ON_ComponentStatus states_to_clear)
bool  | ClearAllStates ()
unsigned int  | ComponentCount () const
unsigned int  | DamagedCount () const
unsigned int  | HiddenCount () const
unsigned int  | HighlightedCount () const
bool  | IsCurrent () const
bool  | IsEmpty () const
unsigned int  | LockedCount () const
void  | MarkAsNotCurrent ()
ON_AggregateComponentStatus &  | operator= (const class ON_AggregateComponentStatusEx &)
ON_AggregateComponentStatus &  | operator= (const ON_AggregateComponentStatus &)=default
unsigned int  | SelectedCount () const
unsigned int  | SelectedPersistentCount () const
 Static Public Attributes
static const ON_AggregateComponentStatus  | Empty
static const ON_AggregateComponentStatus  | NotCurrent
Detailed Description
ON_AggregateComponentStatus ON_AggregateComponentStatus is obsolete. It exists because the virtual interface on ON_Object and the member on ON_Brep cannot be changed without breakky the pubic C++ SDK. Whenever possible, use ON_AggregateComponentStatusEx.
Constructor & Destructor Documentation
◆ ON_AggregateComponentStatus() [1/3]
 ON_AggregateComponentStatus::ON_AggregateComponentStatus  |  ( |   | )
default
◆ ~ON_AggregateComponentStatus()
 ON_AggregateComponentStatus::~ON_AggregateComponentStatus  |  ( |   | )
default
◆ ON_AggregateComponentStatus() [2/3]
 ON_AggregateComponentStatus::ON_AggregateComponentStatus  |  ( |  const ON_AggregateComponentStatus &  |   | )
default
◆ ON_AggregateComponentStatus() [3/3]
 ON_AggregateComponentStatus::ON_AggregateComponentStatus  |  ( |  const class ON_AggregateComponentStatusEx &  |   | )
Member Function Documentation
◆ Add() [1/2]
 bool ON_AggregateComponentStatus::Add  |  ( |  const ON_AggregateComponentStatus &  |  aggregate_status | )
Description: Add the status information in aggregate_status to this aggregate status. Parameters: aggregate_status - [in] Returns: true if successful. false if information is not current and Add failed.
◆ Add() [2/2]
 bool ON_AggregateComponentStatus::Add  |  ( |  ON_ComponentStatus  |  component_status | )
Description: Add the status information in component_status to this aggregate status. Parameters: component_status - [in] Returns: true if successful. false if information is not current and Add failed.
◆ AggregateStatus()
 ON_ComponentStatus ON_AggregateComponentStatus::AggregateStatus  |  ( |   | ) |   const
◆ ClearAggregateStatus()
 bool ON_AggregateComponentStatus::ClearAggregateStatus  |  ( |  ON_ComponentStatus  |  states_to_clear | )
Description: Sets all states specified by states_to_clear to clear.
 Does not change current mark. Does not change component count. Returns true if successful. false if information is not current and ClearAggregateStatus() failed.
◆ ClearAllStates()
 bool ON_AggregateComponentStatus::ClearAllStates  |  ( |   | )
Description: Sets all states to clear.
 Marks status as current. Does not change component count Returns true if successful. false if information is not current and ClearAllStates() failed.
◆ ComponentCount()
 unsigned int ON_AggregateComponentStatus::ComponentCount  |  ( |   | ) |   const
◆ DamagedCount()
 unsigned int ON_AggregateComponentStatus::DamagedCount  |  ( |   | ) |   const
◆ HiddenCount()
 unsigned int ON_AggregateComponentStatus::HiddenCount  |  ( |   | ) |   const
◆ HighlightedCount()
 unsigned int ON_AggregateComponentStatus::HighlightedCount  |  ( |   | ) |   const
◆ IsCurrent()
 bool ON_AggregateComponentStatus::IsCurrent  |  ( |   | ) |   const
Returns: true if the information is current (valid, up to date, ...). false if the information is not current. Remarks: If the information is not current, all counts are zero and states are clear.
◆ IsEmpty()
 bool ON_AggregateComponentStatus::IsEmpty  |  ( |   | ) |   const
Returns: true if this is empty false if not empty.
◆ LockedCount()
 unsigned int ON_AggregateComponentStatus::LockedCount  |  ( |   | ) |   const
◆ MarkAsNotCurrent()
 void ON_AggregateComponentStatus::MarkAsNotCurrent  |  ( |   | )
Description: Mark the information as not current. Erases all information.
◆ operator=() [1/2]
 ON_AggregateComponentStatus& ON_AggregateComponentStatus::operator=  |  ( |  const class ON_AggregateComponentStatusEx &  |   | )
◆ operator=() [2/2]
 ON_AggregateComponentStatus& ON_AggregateComponentStatus::operator=  |  ( |  const ON_AggregateComponentStatus &  |   | )
default
◆ SelectedCount()
 unsigned int ON_AggregateComponentStatus::SelectedCount  |  ( |   | ) |   const
Returns: Number of components that are selected or persistently selected.
◆ SelectedPersistentCount()
 unsigned int ON_AggregateComponentStatus::SelectedPersistentCount  |  ( |   | ) |   const
Returns: Number of components that are persistently selected.
Member Data Documentation
◆ Empty
 const ON_AggregateComponentStatus ON_AggregateComponentStatus::Empty
static
◆ NotCurrent
 const ON_AggregateComponentStatus ON_AggregateComponentStatus::NotCurrent
static