Public Types | Public Member Functions | List of all members
CRhinoProfileContext Class Referenceabstract
RhinoUI
#include <rhinoSdkUiProfileContext.h>
 Inheritance diagram for CRhinoProfileContext:
 Public Types
enum  | context_location : unsigned int {
 cl_global_current_user = 0, cl_scheme_current_user, cl_root_local_machine, cl_plugins_current_user,
 cl_plugins_local_machine
 }
 Public Member Functions
CRhinoProfileContext (context_location ct)
virtual  | ~CRhinoProfileContext ()
virtual CRhinoProfileContextIterator *  | GetNewIterator (const wchar_t *section)=0
virtual bool  | IsSynchronizing () const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *) const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *value, const ON_3dPoint &defaultValue) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *value, const ON_3dVector &defaultValue) const
virtual bool  | LoadProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, void *pValue, ULONG &nBytesOut) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *value, bool defaultValue) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *value, BOOL32 defaultValue) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *value, COLORREF defaultValue) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *value, double defaultValue) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *value, int defaultValue) const
bool  | LoadProfileLegacyPlugMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, ON_MeshParameters *mp, int *mesh_ui_style) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *value, const ON_MeshParameters &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &value, const ON_ClassArray< ON_String > &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value, const ON_ClassArray< ON_wString > &defaultValue) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *value, const POINT &defaultValue) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *value, const RECT &defaultValue) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &value, const ON_Color &defaultValue) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, char *, int) const
The following version of LoadProfileString() all call the above version and convert the CString. More...
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &value, const char *defaultValue) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &) const =0
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &value, const wchar_t *defaultValue) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, wchar_t *, int) const
virtual bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value) const
virtual bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value, const CRhinoStringDictionary &defaultValue) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *value, const UUID &defaultValue) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *value, const ON_Xform &defaultValue) const
context_location  | ProfileContextLocation () const
virtual void  | SaveProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dPoint &) const
virtual void  | SaveProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dVector &) const
virtual bool  | SaveProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const void *pValue, ULONG nBytes) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32) const
virtual void  | SaveProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF) const
virtual void  | SaveProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double) const
virtual void  | SaveProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int) const
void  | SaveProfileLegacyPlugInMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, const ON_MeshParameters &mp, int mesh_ui_style) const
virtual void  | SaveProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_MeshParameters &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_2iPoint &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const POINT &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_4iRect &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const RECT &) const
virtual void  | SaveProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Color &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const char *) const =0
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_String > &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_wString > &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const wchar_t *) const =0
virtual bool  | SaveProfileStringDictioary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const CRhinoStringDictionary &value) const
virtual bool  | SaveProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, const UUID &uuid) const
virtual void  | SaveProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Xform &) const
Detailed Description
class CRhinoProfileContext
Member Enumeration Documentation
◆ context_location
 enum CRhinoProfileContext::context_location : unsigned int
Enumerator
cl_global_current_user
cl_scheme_current_user
cl_root_local_machine
"build date" is used to prevent breaking the SDK. These map to the root of the Rhino registry ( "Software\McNeel\Rhinoceros<version>\ )
cl_plugins_current_user
plug-ins profile is used for storing plug-in information
cl_plugins_local_machine
Constructor & Destructor Documentation
◆ CRhinoProfileContext()
 CRhinoProfileContext::CRhinoProfileContext  |  ( |  context_location  |  ct | )
◆ ~CRhinoProfileContext()
 virtual CRhinoProfileContext::~CRhinoProfileContext  |  ( |   | )
virtual
Member Function Documentation
◆ GetNewIterator()
 virtual CRhinoProfileContextIterator* CRhinoProfileContext::GetNewIterator  |  ( |  const wchar_t *  |  section | )
pure virtual
This method must be overridden to provide a CRhinoProfileContextIterator which is responsible for iterating section names and values associated with this profile context. The overridden method need to derive a class from CRhinoProfileContextIterator, and return a new pointer to the derived class. It is the responsibility of the calling function to delete the returned pointer.
Implemented in CRhinoIniProfileContext, CRhinoRegProfileContext, and CRhinoPropListProfileContext.
◆ IsSynchronizing()
 virtual bool CRhinoProfileContext::IsSynchronizing  |  ( |   | ) |   const
virtual
◆ LoadProfile3dPoint() [1/2]
 virtual bool CRhinoProfileContext::LoadProfile3dPoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_3dPoint *
) |   |  const
virtual
◆ LoadProfile3dPoint() [2/2]
 virtual bool CRhinoProfileContext::LoadProfile3dPoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_3dPoint *  |  value,
|  const ON_3dPoint &  |  defaultValue
) |   |  const
virtual
◆ LoadProfile3dVector() [1/2]
 virtual bool CRhinoProfileContext::LoadProfile3dVector  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_3dVector *
) |   |  const
virtual
◆ LoadProfile3dVector() [2/2]
 virtual bool CRhinoProfileContext::LoadProfile3dVector  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_3dVector *  |  value,
|  const ON_3dVector &  |  defaultValue
) |   |  const
virtual
◆ LoadProfileBinary()
 virtual bool CRhinoProfileContext::LoadProfileBinary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  void *  |  pValue,
|  ULONG &  |  nBytesOut
) |   |  const
virtual
Reimplemented in CRhinoRegProfileContext.
◆ LoadProfileBool() [1/4]
 virtual bool CRhinoProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool *
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileBool() [2/4]
 virtual bool CRhinoProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool *  |  value,
|  bool  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileBool() [3/4]
 virtual bool CRhinoProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  BOOL32 *
) |   |  const
virtual
◆ LoadProfileBool() [4/4]
 virtual bool CRhinoProfileContext::LoadProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  BOOL32 *  |  value,
|  BOOL32  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileColor() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileColor  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  COLORREF *
) |   |  const
virtual
◆ LoadProfileColor() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileColor  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  COLORREF *  |  value,
|  COLORREF  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileDouble() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  double *
) |   |  const
virtual
◆ LoadProfileDouble() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  double *  |  value,
|  double  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileInt() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  int *
) |   |  const
virtual
◆ LoadProfileInt() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  int *  |  value,
|  int  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileLegacyPlugMeshParameters()
 bool CRhinoProfileContext::LoadProfileLegacyPlugMeshParameters  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  plugin_prefix,
|  ON_MeshParameters *  |  mp,
|  int *  |  mesh_ui_style
) |   |  const
Used to read export UDO, RAW, KML, GTS, CD, 3DS plug-in mesh parameters in legacy format. Other applications should use LoadProfileMeshParameters().
◆ LoadProfileMeshParameters() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileMeshParameters  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_MeshParameters *
) |   |  const
virtual
◆ LoadProfileMeshParameters() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileMeshParameters  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_MeshParameters *  |  value,
|  const ON_MeshParameters &  |  defaultValue
) |   |  const
virtual
◆ LoadProfileMultiString() [1/4]
 virtual bool CRhinoProfileContext::LoadProfileMultiString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_ClassArray< ON_String > &
) |   |  const
virtual
The default implementation does nothing, CRhinoRegProfileContext is the only class that current implements these.
Reimplemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileMultiString() [2/4]
 virtual bool CRhinoProfileContext::LoadProfileMultiString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_ClassArray< ON_String > &  |  value,
|  const ON_ClassArray< ON_String > &  |  defaultValue
) |   |  const
virtual
◆ LoadProfileMultiString() [3/4]
 virtual bool CRhinoProfileContext::LoadProfileMultiString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_ClassArray< ON_wString > &  |  value
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext, CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileMultiString() [4/4]
 virtual bool CRhinoProfileContext::LoadProfileMultiString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_ClassArray< ON_wString > &  |  value,
|  const ON_ClassArray< ON_wString > &  |  defaultValue
) |   |  const
virtual
◆ LoadProfilePoint() [1/2]
 virtual bool CRhinoProfileContext::LoadProfilePoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  POINT *
) |   |  const
virtual
◆ LoadProfilePoint() [2/2]
 virtual bool CRhinoProfileContext::LoadProfilePoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  POINT *  |  value,
|  const POINT &  |  defaultValue
) |   |  const
virtual
◆ LoadProfileRect() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileRect  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  RECT *
) |   |  const
virtual
◆ LoadProfileRect() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileRect  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  RECT *  |  value,
|  const RECT &  |  defaultValue
) |   |  const
virtual
◆ LoadProfileRGBA() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_Color &
) |   |  const
virtual
◆ LoadProfileRGBA() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_Color &  |  value,
|  const ON_Color &  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileString() [1/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  char *  |  ,
|  int
) |   |  const
virtual
The following version of LoadProfileString() all call the above version and convert the CString.
Reimplemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileString() [2/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_String &
) |   |  const
virtual
Reimplemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileString() [3/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_String &  |  value,
|  const char *  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileString() [4/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_wString &
) |   |  const
pure virtual
All the LoadProfile* functions eventually call this LoadProfileString(...,CString&) member. You MUST override the following method. When you override the SaveProfileString(...) above the compiler can not find the other overloaded methods so at a minimum you must override them and call the base class
Implemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileString() [5/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_wString &  |  value,
|  const wchar_t *  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileString() [6/6]
 virtual bool CRhinoProfileContext::LoadProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  wchar_t *  |  ,
|  int
) |   |  const
virtual
Reimplemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ LoadProfileStringDictionary() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileStringDictionary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  CRhinoStringDictionary &  |  value
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileStringDictionary() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileStringDictionary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  CRhinoStringDictionary &  |  value,
|  const CRhinoStringDictionary &  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileUuid() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileUuid  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  UUID *
) |   |  const
virtual
◆ LoadProfileUuid() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileUuid  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  UUID *  |  value,
|  const UUID &  |  defaultValue
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ LoadProfileXform() [1/2]
 virtual bool CRhinoProfileContext::LoadProfileXform  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_Xform *
) |   |  const
virtual
◆ LoadProfileXform() [2/2]
 virtual bool CRhinoProfileContext::LoadProfileXform  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  ON_Xform *  |  value,
|  const ON_Xform &  |  defaultValue
) |   |  const
virtual
◆ ProfileContextLocation()
 context_location CRhinoProfileContext::ProfileContextLocation  |  ( |   | ) |   const
◆ SaveProfile3dPoint()
 virtual void CRhinoProfileContext::SaveProfile3dPoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_3dPoint &
) |   |  const
virtual
◆ SaveProfile3dVector()
 virtual void CRhinoProfileContext::SaveProfile3dVector  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_3dVector &
) |   |  const
virtual
◆ SaveProfileBinary()
 virtual bool CRhinoProfileContext::SaveProfileBinary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const void *  |  pValue,
|  ULONG  |  nBytes
) |   |  const
virtual
The default implementation of the *ProfileBinary(...) methods simply return false, CRhinoRegProfileContext is currently the only class that implements these
Reimplemented in CRhinoRegProfileContext.
◆ SaveProfileBool() [1/2]
 virtual void CRhinoProfileContext::SaveProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  bool
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext.
◆ SaveProfileBool() [2/2]
 virtual void CRhinoProfileContext::SaveProfileBool  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  BOOL32
) |   |  const
virtual
◆ SaveProfileColor()
 virtual void CRhinoProfileContext::SaveProfileColor  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  COLORREF
) |   |  const
virtual
◆ SaveProfileDouble()
 virtual void CRhinoProfileContext::SaveProfileDouble  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  double
) |   |  const
virtual
◆ SaveProfileInt()
 virtual void CRhinoProfileContext::SaveProfileInt  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  int
) |   |  const
virtual
◆ SaveProfileLegacyPlugInMeshParameters()
 void CRhinoProfileContext::SaveProfileLegacyPlugInMeshParameters  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  plugin_prefix,
|  const ON_MeshParameters &  |  mp,
|  int  |  mesh_ui_style
) |   |  const
Used to save export UDO, RAW, KML, GTS, CD, 3DS plug-in mesh parameters in legacy format. Other applications should use SaveProfileMeshParameters().
◆ SaveProfileMeshParameters()
 virtual void CRhinoProfileContext::SaveProfileMeshParameters  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_MeshParameters &
) |   |  const
virtual
◆ SaveProfilePoint() [1/2]
 virtual void CRhinoProfileContext::SaveProfilePoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_2iPoint &
) |   |  const
virtual
◆ SaveProfilePoint() [2/2]
 virtual void CRhinoProfileContext::SaveProfilePoint  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const POINT &
) |   |  const
virtual
◆ SaveProfileRect() [1/2]
 virtual void CRhinoProfileContext::SaveProfileRect  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_4iRect &
) |   |  const
virtual
◆ SaveProfileRect() [2/2]
 virtual void CRhinoProfileContext::SaveProfileRect  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const RECT &
) |   |  const
virtual
◆ SaveProfileRGBA()
 virtual void CRhinoProfileContext::SaveProfileRGBA  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_Color &
) |   |  const
virtual
The LoadProfileColor/SaveProfileColor functions ignore alpha. If you want to save a color with alpha information, use the following RGBA functions
◆ SaveProfileString() [1/4]
 virtual bool CRhinoProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const char *
) |   |  const
pure virtual
The SaveProfile*() functions write to strings to the desired output location. You must derive a class from CRhinoProfileContext and provide this method. The LoadProfile*() functions return TRUE if the requested entry is found and is valid.
NOTE: Never apply localization to the lpszSection and lpszEntry parameters. The lpszSection and lpszEntry parameters are one of the few situations in the Rhino core where we must use const wchar_t* types instead of wchar_t*.
All lpszSection and lpszEntry parameters in core Rhino used symbols from the ASCII character set. Plug-in developers who want to avoid localization and UNICODE vs MBCS issues are encouraged to adopt the same ASCII approach.
All the SaveProfile* functions eventually call one of these SaveProfileString() members. You MUST override the first two methods. When you override the SaveProfileString(...) above the compiler can not find the other overloaded methods so at a minimum you must override them and call the base class
Implemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ SaveProfileString() [2/4]
 virtual bool CRhinoProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_ClassArray< ON_String > &
) |   |  const
virtual
The default implementation of these do nothing. CRhinoRegProfileContext is the only class that current implements these as registry multi-strings.
Reimplemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ SaveProfileString() [3/4]
 virtual bool CRhinoProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_ClassArray< ON_wString > &
) |   |  const
virtual
Reimplemented in CRhinoPropListProfileContext, CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ SaveProfileString() [4/4]
 virtual bool CRhinoProfileContext::SaveProfileString  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const wchar_t *
) |   |  const
pure virtual
Implemented in CRhinoIniProfileContext, and CRhinoRegProfileContext.
◆ SaveProfileStringDictioary()
 virtual bool CRhinoProfileContext::SaveProfileStringDictioary  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const CRhinoStringDictionary &  |  value
) |   |  const
virtual
◆ SaveProfileUuid()
 virtual bool CRhinoProfileContext::SaveProfileUuid  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const UUID &  |  uuid
) |   |  const
virtual
◆ SaveProfileXform()
 virtual void CRhinoProfileContext::SaveProfileXform  |  ( |  const wchar_t *  |  lpszSection,
|  const wchar_t *  |  lpszEntry,
|  const ON_Xform &
) |   |  const
virtual