Public Attributes | List of all members
CRhinoOnAfterPostReadViewUpdate::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
const CRhinoFileReadOptions *  | m_fro
File reading information. More...
Member Data Documentation
◆ m_fro
 const CRhinoFileReadOptions* CRhinoOnAfterPostReadViewUpdate::CParameters::m_fro
File reading information.