Public Member Functions | Public Attributes | List of all members
ON_StringBuffer Class Reference
OpenNURBS
#include <opennurbs_string.h>
 Public Member Functions
ON_StringBuffer ()
ON_StringBuffer (char *stack_buffer, size_t stack_buffer_capacity)
~ON_StringBuffer ()
bool  | GrowBuffer (size_t buffer_capacity)
 Public Attributes
char *  | m_buffer
size_t  | m_buffer_capacity
Detailed Description
ON_String is a UTF-8 char string on all platforms ON_wString is a UTF-16 encoded wchar_t string on Windows platforms ON_wString is a UTF-32 encoded wchar_t string on Windows platforms
Constructor & Destructor Documentation
◆ ON_StringBuffer() [1/2]
 ON_StringBuffer::ON_StringBuffer  |  ( |   | )
◆ ON_StringBuffer() [2/2]
 ON_StringBuffer::ON_StringBuffer  |  ( |  char *  |  stack_buffer,
|  size_t  |  stack_buffer_capacity
)
◆ ~ON_StringBuffer()
 ON_StringBuffer::~ON_StringBuffer  |  ( |   | )
Member Function Documentation
◆ GrowBuffer()
 bool ON_StringBuffer::GrowBuffer  |  ( |  size_t  |  buffer_capacity | )
Member Data Documentation
◆ m_buffer
 char* ON_StringBuffer::m_buffer
◆ m_buffer_capacity
 size_t ON_StringBuffer::m_buffer_capacity