Classes | Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoUiHolder Class Referenceabstract
RDK
#include <IRhRdkSectionHolder.h>
 Inheritance diagram for IRhinoUiHolder:
 Classes
class  | IIterator
 Public Types
enum  | Margins : unsigned int { Margins::Top, Margins::Bottom, Margins::Left, Margins::Right }
enum  | Styles : unsigned int { Styles::Flat }
 Public Member Functions
virtual bool  | AttachSection (IRhinoUiSection *pSection)=0
virtual void  | BeginAttachDetachSections (void)=0
virtual bool  | DetachSection (IRhinoUiSection &s)=0
virtual bool  | EnableHeaderButton (IRhinoUiSection &s, int index, bool bEnable)=0
virtual void  | EndAttachDetachSections (void)=0
virtual bool  | ExpandSection (IRhinoUiSection &s, bool bExpand, bool bEnsureVisible)=0
virtual int  | GetScrollPos (void) const =0
virtual int  | GetSectionCount (void) const =0
virtual bool  | IsSectionExpanded (const IRhinoUiSection &s) const =0
virtual int  | Margin (Margins m) const =0
virtual IIterator *  | NewIterator (void) const =0
virtual void  | SetBackgroundColor (const ON_Color &col)=0
virtual void  | SetEmptyText (const wchar_t *wsz)=0
virtual_su void  | SetFullHeightSection (IRhinoUiSection &section)
virtual void  | SetMargin (Margins m, int pixels)=0
virtual void  | SetScrollPos (int pos, bool bRedraw)=0
virtual void  | SetSettingsSubKey (const wchar_t *wsz)=0
virtual bool  | ShowHeaderButton (IRhinoUiSection &s, int index, bool bShow)=0
virtual void  | UpdateAllViews (unsigned int flags)=0
virtual UUID  | Uuid (void) const =0
 Public Member Functions inherited from IRhinoUiWindow
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
virtual void  | Delete (void)=0
virtual void  | Enable (bool bEnable)=0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual HWND  | GetWindow (void)=0
virtual bool  | IsCreated (void) const =0
virtual bool  | IsEnabled (void) const =0
virtual bool  | IsShown (void) const =0
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false)=0
virtual HWND  | Parent (void) const =0
virtual void  | Refresh (bool bImmediate=false)=0
virtual void  | SetFocus (void)=0
virtual void  | SetParent (HWND parent)=0
virtual void  | Show (bool bShow)=0
 Static Public Member Functions
static IRhinoUiHolder *  | New (RhRdkUiFrameworks f, const ON_4iRect &rect, const ON_Color &colBackground, HWND hParent=NULL, IRhinoUiHolder::Styles style=IRhinoUiHolder::Styles::Flat)
 Protected Member Functions
virtual  | ~IRhinoUiHolder ()
 Protected Member Functions inherited from IRhinoUiWindow
virtual  | ~IRhinoUiWindow ()
Member Enumeration Documentation
◆ Margins
 enum IRhinoUiHolder::Margins : unsigned int
strong
Enumerator
Top
Bottom
Left
Right
◆ Styles
 enum IRhinoUiHolder::Styles : unsigned int
strong
Enumerator
Flat
Constructor & Destructor Documentation
◆ ~IRhinoUiHolder()
 virtual IRhinoUiHolder::~IRhinoUiHolder  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ AttachSection()
 virtual bool IRhinoUiHolder::AttachSection  |  ( |  IRhinoUiSection *  |  pSection | )
pure virtual
Attaches a section to the holder. The holder takes ownership of the section.
Parameters
pSection | is a pointer to a new section.
Returns
true if successful, else false.
◆ BeginAttachDetachSections()
 virtual void IRhinoUiHolder::BeginAttachDetachSections  |  ( |  void  |   | )
pure virtual
Call this before attaching or detaching more than one section. This optimizes the process and reduces the amount of flicker when attaching or detaching multiple sections.
◆ DetachSection()
 virtual bool IRhinoUiHolder::DetachSection  |  ( |  IRhinoUiSection &  |  s | )
pure virtual
Detaches a section from the holder. The section is hidden, unparented from the holder and returned to the ownership of the caller. If you are not planning to reuse the section, you must call Delete() on it.
◆ EnableHeaderButton()
 virtual bool IRhinoUiHolder::EnableHeaderButton  |  ( |  IRhinoUiSection &  |  s,
|  int  |  index,
|  bool  |  bEnable
)
pure virtual
Enable or disable a section's header button.
Parameters
s | is the section.
index | is the index of the button.
bEnable | is the enable state.
◆ EndAttachDetachSections()
 virtual void IRhinoUiHolder::EndAttachDetachSections  |  ( |  void  |   | )
pure virtual
Call this after attaching or detaching more than one section.
◆ ExpandSection()
 virtual bool IRhinoUiHolder::ExpandSection  |  ( |  IRhinoUiSection &  |  s,
|  bool  |  bExpand,
|  bool  |  bEnsureVisible
)
pure virtual
Expands or collapses a section.
Parameters
s | is the section.
bExpand | is true to expand the section, false to collapse it.
bEnsureVisible | is true to scroll the section into view, else false.
Returns
true if successful, else false.
◆ GetScrollPos()
 virtual int IRhinoUiHolder::GetScrollPos  |  ( |  void  |   | ) |   const
pure virtual
return The vertical scroll bar position.
◆ GetSectionCount()
 virtual int IRhinoUiHolder::GetSectionCount  |  ( |  void  |   | ) |   const
pure virtual
◆ IsSectionExpanded()
 virtual bool IRhinoUiHolder::IsSectionExpanded  |  ( |  const IRhinoUiSection &  |  s | ) |   const
pure virtual
Returns
true if a section is expanded, else false.
Parameters
s | is the section to check.
◆ Margin()
 virtual int IRhinoUiHolder::Margin  |  ( |  Margins  |  m | ) |   const
pure virtual
◆ New()
 static IRhinoUiHolder* IRhinoUiHolder::New  |  ( |  RhRdkUiFrameworks  |  f,
|  const ON_4iRect &  |  rect,
|  const ON_Color &  |  colBackground,
|  HWND  |  hParent = NULL,
|  IRhinoUiHolder::Styles  |  style = IRhinoUiHolder::Styles::Flat
)
static
Create a new holder.
Parameters
f | is the framework to use.
rect | is the initial rect for the holder.
colBackground | obsolete. The background color is now automatically set based on the current Rhino color scheme.
hParent | is the holder's parent window.
style | is the holder style (for future use).
Returns
A pointer to the holder if successful, or null on failure. The caller shall delete the holder when it is no longer needed.
See also
IRhinoUiWindow::Delete().
◆ NewIterator()
 virtual IIterator* IRhinoUiHolder::NewIterator  |  ( |  void  |   | ) |   const
pure virtual
Get a section iterator. The caller shall delete the iterator when no longer needed.
◆ SetBackgroundColor()
 virtual void IRhinoUiHolder::SetBackgroundColor  |  ( |  const ON_Color &  |  col | )
pure virtual
OBSOLETE. Always uses Rhino compliant colors.
◆ SetEmptyText()
 virtual void IRhinoUiHolder::SetEmptyText  |  ( |  const wchar_t *  |  wsz | )
pure virtual
Sets text to be displayed in the holder when there are no sections.
◆ SetFullHeightSection()
 virtual_su void IRhinoUiHolder::SetFullHeightSection  |  ( |  IRhinoUiSection &  |  section | )
Sets a section as 'full height'. This means it expands to use the available space below it.
◆ SetMargin()
 virtual void IRhinoUiHolder::SetMargin  |  ( |  Margins  |  m,
|  int  |  pixels
)
pure virtual
◆ SetScrollPos()
 virtual void IRhinoUiHolder::SetScrollPos  |  ( |  int  |  pos,
|  bool  |  bRedraw
)
pure virtual
Sets the vertical scroll bar position.
◆ SetSettingsSubKey()
 virtual void IRhinoUiHolder::SetSettingsSubKey  |  ( |  const wchar_t *  |  wsz | )
pure virtual
Optionally call this to specify a sub-key for storing section settings.
◆ ShowHeaderButton()
 virtual bool IRhinoUiHolder::ShowHeaderButton  |  ( |  IRhinoUiSection &  |  s,
|  int  |  index,
|  bool  |  bShow
)
pure virtual
Show or hide a section's header button.
Parameters
s | is the section.
index | is the index of the button.
bShow | is the show state.
◆ UpdateAllViews()
 virtual void IRhinoUiHolder::UpdateAllViews  |  ( |  unsigned int  |  flags | )
pure virtual
Calls UpdateView() on all sections.
Parameters
flags | specifies what to update. See the enum at IRhinoUiSection::UpdateView()
◆ Uuid()
 virtual UUID IRhinoUiHolder::Uuid  |  ( |  void  |   | ) |   const
pure virtual
Returns
The unique identifier of the holder.