Public Member Functions | List of all members
ON_ConvexHullPoint2 Class Reference
OpenNURBS
#include <opennurbs_convex_poly.h>
 Inheritance diagram for ON_ConvexHullPoint2:
 Public Member Functions
ON_ConvexHullPoint2 ()=default
ON_ConvexHullPoint2 (int init_capacity)
virtual  | ~ON_ConvexHullPoint2 () override
int  | AppendVertex (const ON_3dPoint &P)
return index of new vertex. must set Adjacent Indices. More...
virtual int  | Count () const override
void  | Empty ()
virtual double  | MaximumCoordinate () const override
bool  | SetCapacity (int vcnt)
virtual int  | SupportIndex (ON_3dVector W, int i0) const override
Support map. More...
virtual ON_3dVector  | Vertex (int j) const override
 Public Member Functions inherited from ON_ConvexPoly
virtual  | ~ON_ConvexPoly ()
ON_3dPoint  | Evaluate (ON_4dex dex, ON_4dPoint B) const
bool  | GetClosestPoint (const ON_ConvexPoly &BHull, ON_4dex &Adex, ON_4dex &Bdex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPoint (ON_3dPoint P0, ON_4dex &dex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPointSeeded (const ON_ConvexPoly &BHull, ON_4dex &Adex, ON_4dex &Bdex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPointSeeded (ON_3dPoint P0, ON_4dex &dex, ON_4dPoint &Bary, double maximum_distance=ON_DBL_MAX) const
bool  | IsValid4Dex (const ON_4dex &D) const
ON_3dPoint  | Support (ON_3dVector W, int i0=0) const
 Additional Inherited Members
 Static Public Member Functions inherited from ON_ConvexPoly
static bool  | IsValid4DexN (const ON_4dex &D, int n)
static bool  | Standardize (ON_4dex &D, ON_4dPoint &B)
Detailed Description
3d convex hull defined by an explicit collection of points called vertices. Note: vertices need not be extreme points
Constructor & Destructor Documentation
◆ ON_ConvexHullPoint2() [1/2]
 ON_ConvexHullPoint2::ON_ConvexHullPoint2  |  ( |   | )
default
◆ ON_ConvexHullPoint2() [2/2]
 ON_ConvexHullPoint2::ON_ConvexHullPoint2  |  ( |  int  |  init_capacity | )
inline
◆ ~ON_ConvexHullPoint2()
 virtual ON_ConvexHullPoint2::~ON_ConvexHullPoint2  |  ( |   | )
inlineoverridevirtual
Member Function Documentation
◆ AppendVertex()
 int ON_ConvexHullPoint2::AppendVertex  |  ( |  const ON_3dPoint &  |  P | )
return index of new vertex. must set Adjacent Indices.
◆ Count()
 virtual int ON_ConvexHullPoint2::Count  |  ( |   | ) |   const
inlineoverridevirtual
Returns: Number of vertices >=0
Implements ON_ConvexPoly.
◆ Empty()
 void ON_ConvexHullPoint2::Empty  |  ( |   | )
◆ MaximumCoordinate()
 virtual double ON_ConvexHullPoint2::MaximumCoordinate  |  ( |   | ) |   const
overridevirtual
Description: This is a bound on the collection of vertices. Vertex(i).MaximumCoordinate()<= MaximumCoordinate() for all i
Implements ON_ConvexPoly.
◆ SetCapacity()
 bool ON_ConvexHullPoint2::SetCapacity  |  ( |  int  |  vcnt | )
inline
◆ SupportIndex()
 virtual int ON_ConvexHullPoint2::SupportIndex  |  ( |  ON_3dVector  |  W,
|  int  |  i0
) |   |  const
inlineoverridevirtual
Support map.
Implements ON_ConvexPoly.
◆ Vertex()
 virtual ON_3dVector ON_ConvexHullPoint2::Vertex  |  ( |  int  |  i | ) |   const
inlineoverridevirtual
Returns: Vertex[i] for i=0,...,Count()-1
Implements ON_ConvexPoly.