Public Member Functions | List of all members
ON_SimpleFixedSizePool< T > Class Template Reference
OpenNURBS
#include <opennurbs_fsp.h>
 Inheritance diagram for ON_SimpleFixedSizePool< T >:
 Public Member Functions
ON_SimpleFixedSizePool ()
construction //////////////////////////////////////////////////////// More...
~ON_SimpleFixedSizePool ()
size_t  | ActiveElementCount () const
T *  | AllocateElement ()
bool  | Create (size_t element_count_estimate, size_t block_element_count)
void  | Destroy ()
T *  | Element (size_t element_index) const
size_t  | ElementIndex (T *) const
void  | ReturnAll ()
void  | ReturnElement (T *p)
size_t  | SizeofElement () const
size_t  | TotalElementCount () const