Public Member Functions | Public Attributes | List of all members
ON_MappingMeshInfo Class Reference
OpenNURBS
#include <opennurbs_texture_mapping.h>
 Public Member Functions
ON_MappingMeshInfo ()
void  | GenerateDerivedData ()
Derived data. More...
const int *  | SourceIdFaces (const int sourceId, int &countOut) const
 Public Attributes
ON_SimpleArray< int >  | m_faceSourceIds
ON_GeometryFingerprint  | m_geometryFingerprint
Constructor & Destructor Documentation
◆ ON_MappingMeshInfo()
 ON_MappingMeshInfo::ON_MappingMeshInfo  |  ( |   | )
Member Function Documentation
◆ GenerateDerivedData()
 void ON_MappingMeshInfo::GenerateDerivedData  |  ( |   | )
Derived data.
◆ SourceIdFaces()
 const int* ON_MappingMeshInfo::SourceIdFaces  |  ( |  const int  |  sourceId,
|  int &  |  countOut
) |   |  const
Member Data Documentation
◆ m_faceSourceIds
 ON_SimpleArray<int> ON_MappingMeshInfo::m_faceSourceIds
◆ m_geometryFingerprint
 ON_GeometryFingerprint ON_MappingMeshInfo::m_geometryFingerprint