Public Types | Public Member Functions | Static Public Member Functions | List of all members
ON_BrepQuadFacePackSide Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Public Types
enum  | : unsigned { SeedCapacity = 8 }
 Public Member Functions
ON_BrepQuadFacePackSide ()
ON_BrepQuadFacePackSide (const ON_BrepQuadFacePackSide &)=default
ON_BrepQuadFacePackSide (ON_BrepFace *face, int ti)
~ON_BrepQuadFacePackSide ()=default
ON_Brep *  | Brep () const
bool  | ChangeSurface (ON_NurbsSurface *surface)
ON_BrepFace *  | Face () const
bool  | IsNotNull () const
bool  | IsNull () const
bool  | IsPackable (int valence=4, unsigned pack_id=0) const
bool  | Mark () const
const ON_BrepQuadFacePackSide  | NeighborFace (unsigned relative_side_dex, bool check_pack_id=true) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr) const
bool  | operator!= (const ON_BrepQuadFacePackSide &rhs)
ON_BrepQuadFacePackSide &  | operator= (const ON_BrepQuadFacePackSide &)=default
bool  | operator== (const ON_BrepQuadFacePackSide &rhs)
unsigned  | PackId () const
const ON_BrepQuadFacePackSide  | RelativeSide (unsigned relative_side_dex) const
const ON_BrepTrim *  | RelativeTrim (unsigned relative_side_dex) const
void  | SetMark (bool bMark) const
void  | SetPackId (unsigned int pack_id)
const ON_BrepTrim *  | Trim () const
int  | TrimDex () const
 Static Public Member Functions
static const bool  | CheckBrepFaceTrimsAreFullIsoSides (const ON_BrepFace *face)
static const bool  | CheckCornersValence (const ON_BrepFace *face, int valence=4)
static bool  | CheckStar (const ON_BrepQuadFacePackSide *star, unsigned star_count, unsigned pack_id=0)
static bool  | CheckStar (const ON_SimpleArray< ON_BrepQuadFacePackSide > &star, unsigned pack_id=0)
static bool  | CheckStrip (const ON_BrepQuadFacePackSide *strip, unsigned strip_count, int valence=4, unsigned pack_id=0)
static bool  | CheckStrip (const ON_SimpleArray< ON_BrepQuadFacePackSide > &strip, int valence=4, unsigned pack_id=0)
static const ON_BrepQuadFacePackSide  | CreateValid (const ON_BrepFace *face, int trim_dex)
static bool  | GetPackCornerTagged (const ON_BrepFace *face, ON_BrepQuadFacePackSide *corner)
static bool  | GetPackSeed (const ON_BrepFace *face, unsigned count, ON_BrepQuadFacePackSide group[ON_BrepQuadFacePackSide::SeedCapacity][ON_BrepQuadFacePackSide::SeedCapacity])
static unsigned  | GetStar (ON_BrepQuadFacePackSide f, ON_BrepQuadFacePackSide *star, unsigned star_capacity)
static unsigned  | GetStar (ON_BrepQuadFacePackSide f, ON_SimpleArray< ON_BrepQuadFacePackSide > &star, unsigned star_capacity)
static unsigned  | GetStrip (ON_BrepQuadFacePackSide f, ON_BrepQuadFacePackSide *strip, unsigned strip_capacity)
static unsigned  | GetStrip (ON_BrepQuadFacePackSide f, ON_SimpleArray< ON_BrepQuadFacePackSide > &strip, unsigned strip_capacity)
static unsigned  | GetStripTagged (ON_BrepQuadFacePackSide f, ON_SimpleArray< ON_BrepQuadFacePackSide > &strip)
static bool  | IsPackableFace (const ON_BrepFace *face, int valence=4, unsigned pack_id=0)
static const bool  | MoveToNextIsoSideTrim (const ON_BrepFace *face, int *ti)
static bool  | MoveToStripEndTagged (ON_BrepQuadFacePackSide *f)
static void  | ReverseStrip (ON_BrepQuadFacePackSide *strip, unsigned strip_count)
static const bool  | RewindToIsoSideTrimStart (const ON_BrepFace *face, int *ti)
static void  | SetStarMark (bool bMark, const ON_BrepQuadFacePackSide *star, unsigned count)
static void  | SetStripMark (bool bMark, const ON_BrepQuadFacePackSide *strip, unsigned count)
static bool  | StripsAreNeighbors (const ON_BrepQuadFacePackSide *strip0, unsigned strip0_side_dex, const ON_BrepQuadFacePackSide *strip1, unsigned strip1_side_dex, unsigned count, bool check_pack_id=true)
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned
Enumerator
SeedCapacity
Constructor & Destructor Documentation
◆ ON_BrepQuadFacePackSide() [1/3]
 ON_BrepQuadFacePackSide::ON_BrepQuadFacePackSide  |  ( |   | )
inline
◆ ~ON_BrepQuadFacePackSide()
 ON_BrepQuadFacePackSide::~ON_BrepQuadFacePackSide  |  ( |   | )
default
◆ ON_BrepQuadFacePackSide() [2/3]
 ON_BrepQuadFacePackSide::ON_BrepQuadFacePackSide  |  ( |  const ON_BrepQuadFacePackSide &  |   | )
default
◆ ON_BrepQuadFacePackSide() [3/3]
 ON_BrepQuadFacePackSide::ON_BrepQuadFacePackSide  |  ( |  ON_BrepFace *  |  face,
|  int  |  ti
)
inline
Member Function Documentation
◆ Brep()
 ON_Brep* ON_BrepQuadFacePackSide::Brep  |  ( |   | ) |   const
inline
◆ ChangeSurface()
 bool ON_BrepQuadFacePackSide::ChangeSurface  |  ( |  ON_NurbsSurface *  |  surface | )
◆ CheckBrepFaceTrimsAreFullIsoSides()
 static const bool ON_BrepQuadFacePackSide::CheckBrepFaceTrimsAreFullIsoSides  |  ( |  const ON_BrepFace *  |  face | )
static
◆ CheckCornersValence()
 static const bool ON_BrepQuadFacePackSide::CheckCornersValence  |  ( |  const ON_BrepFace *  |  face,
|  int  |  valence = 4
)
static
◆ CheckStar() [1/2]
 static bool ON_BrepQuadFacePackSide::CheckStar  |  ( |  const ON_BrepQuadFacePackSide *  |  star,
|  unsigned  |  star_count,
|  unsigned  |  pack_id = 0
)
static
◆ CheckStar() [2/2]
 static bool ON_BrepQuadFacePackSide::CheckStar  |  ( |  const ON_SimpleArray< ON_BrepQuadFacePackSide > &  |  star,
|  unsigned  |  pack_id = 0
)
static
◆ CheckStrip() [1/2]
 static bool ON_BrepQuadFacePackSide::CheckStrip  |  ( |  const ON_BrepQuadFacePackSide *  |  strip,
|  unsigned  |  strip_count,
|  int  |  valence = 4,
|  unsigned  |  pack_id = 0
)
static
◆ CheckStrip() [2/2]
 static bool ON_BrepQuadFacePackSide::CheckStrip  |  ( |  const ON_SimpleArray< ON_BrepQuadFacePackSide > &  |  strip,
|  int  |  valence = 4,
|  unsigned  |  pack_id = 0
)
static
◆ CreateValid()
 static const ON_BrepQuadFacePackSide ON_BrepQuadFacePackSide::CreateValid  |  ( |  const ON_BrepFace *  |  face,
|  int  |  trim_dex
)
static
◆ Face()
 ON_BrepFace* ON_BrepQuadFacePackSide::Face  |  ( |   | ) |   const
inline
◆ GetPackCornerTagged()
 static bool ON_BrepQuadFacePackSide::GetPackCornerTagged  |  ( |  const ON_BrepFace *  |  face,
|  ON_BrepQuadFacePackSide *  |  corner
)
static
◆ GetPackSeed()
 static bool ON_BrepQuadFacePackSide::GetPackSeed  |  ( |  const ON_BrepFace *  |  face,
|  unsigned  |  count,
|  ON_BrepQuadFacePackSide  |  group[ON_BrepQuadFacePackSide::SeedCapacity][ON_BrepQuadFacePackSide::SeedCapacity]
)
static
◆ GetStar() [1/2]
 static unsigned ON_BrepQuadFacePackSide::GetStar  |  ( |  ON_BrepQuadFacePackSide  |  f,
|  ON_BrepQuadFacePackSide *  |  star,
|  unsigned  |  star_capacity
)
static
◆ GetStar() [2/2]
 static unsigned ON_BrepQuadFacePackSide::GetStar  |  ( |  ON_BrepQuadFacePackSide  |  f,
|  ON_SimpleArray< ON_BrepQuadFacePackSide > &  |  star,
|  unsigned  |  star_capacity
)
static
◆ GetStrip() [1/2]
 static unsigned ON_BrepQuadFacePackSide::GetStrip  |  ( |  ON_BrepQuadFacePackSide  |  f,
|  ON_BrepQuadFacePackSide *  |  strip,
|  unsigned  |  strip_capacity
)
static
◆ GetStrip() [2/2]
 static unsigned ON_BrepQuadFacePackSide::GetStrip  |  ( |  ON_BrepQuadFacePackSide  |  f,
|  ON_SimpleArray< ON_BrepQuadFacePackSide > &  |  strip,
|  unsigned  |  strip_capacity
)
static
◆ GetStripTagged()
 static unsigned ON_BrepQuadFacePackSide::GetStripTagged  |  ( |  ON_BrepQuadFacePackSide  |  f,
|  ON_SimpleArray< ON_BrepQuadFacePackSide > &  |  strip
)
static
◆ IsNotNull()
 bool ON_BrepQuadFacePackSide::IsNotNull  |  ( |   | ) |   const
inline
◆ IsNull()
 bool ON_BrepQuadFacePackSide::IsNull  |  ( |   | ) |   const
inline
◆ IsPackable()
 bool ON_BrepQuadFacePackSide::IsPackable  |  ( |  int  |  valence = 4,
|  unsigned  |  pack_id = 0
) |   |  const
inline
◆ IsPackableFace()
 static bool ON_BrepQuadFacePackSide::IsPackableFace  |  ( |  const ON_BrepFace *  |  face,
|  int  |  valence = 4,
|  unsigned  |  pack_id = 0
)
static
◆ Mark()
 bool ON_BrepQuadFacePackSide::Mark  |  ( |   | ) |   const
inline
◆ MoveToNextIsoSideTrim()
 static const bool ON_BrepQuadFacePackSide::MoveToNextIsoSideTrim  |  ( |  const ON_BrepFace *  |  face,
|  int *  |  ti
)
static
◆ MoveToStripEndTagged()
 static bool ON_BrepQuadFacePackSide::MoveToStripEndTagged  |  ( |  ON_BrepQuadFacePackSide *  |  f | )
static
◆ NeighborFace()
 const ON_BrepQuadFacePackSide ON_BrepQuadFacePackSide::NeighborFace  |  ( |  unsigned  |  relative_side_dex,
|  bool  |  check_pack_id = true
) |   |  const
◆ NurbsSurface()
 ON_NurbsSurface* ON_BrepQuadFacePackSide::NurbsSurface  |  ( |  ON_NurbsSurface *  |  pNurbsSurface = nullptr | ) |   const
inline
◆ operator!=()
 bool ON_BrepQuadFacePackSide::operator!=  |  ( |  const ON_BrepQuadFacePackSide &  |  rhs | )
inline
◆ operator=()
 ON_BrepQuadFacePackSide& ON_BrepQuadFacePackSide::operator=  |  ( |  const ON_BrepQuadFacePackSide &  |   | )
default
◆ operator==()
 bool ON_BrepQuadFacePackSide::operator==  |  ( |  const ON_BrepQuadFacePackSide &  |  rhs | )
inline
◆ PackId()
 unsigned ON_BrepQuadFacePackSide::PackId  |  ( |   | ) |   const
inline
◆ RelativeSide()
 const ON_BrepQuadFacePackSide ON_BrepQuadFacePackSide::RelativeSide  |  ( |  unsigned  |  relative_side_dex | ) |   const
◆ RelativeTrim()
 const ON_BrepTrim* ON_BrepQuadFacePackSide::RelativeTrim  |  ( |  unsigned  |  relative_side_dex | ) |   const
◆ ReverseStrip()
 static void ON_BrepQuadFacePackSide::ReverseStrip  |  ( |  ON_BrepQuadFacePackSide *  |  strip,
|  unsigned  |  strip_count
)
static
◆ RewindToIsoSideTrimStart()
 static const bool ON_BrepQuadFacePackSide::RewindToIsoSideTrimStart  |  ( |  const ON_BrepFace *  |  face,
|  int *  |  ti
)
static
◆ SetMark()
 void ON_BrepQuadFacePackSide::SetMark  |  ( |  bool  |  bMark | ) |   const
inline
◆ SetPackId()
 void ON_BrepQuadFacePackSide::SetPackId  |  ( |  unsigned int  |  pack_id | )
inline
◆ SetStarMark()
 static void ON_BrepQuadFacePackSide::SetStarMark  |  ( |  bool  |  bMark,
|  const ON_BrepQuadFacePackSide *  |  star,
|  unsigned  |  count
)
static
◆ SetStripMark()
 static void ON_BrepQuadFacePackSide::SetStripMark  |  ( |  bool  |  bMark,
|  const ON_BrepQuadFacePackSide *  |  strip,
|  unsigned  |  count
)
static
◆ StripsAreNeighbors()
 static bool ON_BrepQuadFacePackSide::StripsAreNeighbors  |  ( |  const ON_BrepQuadFacePackSide *  |  strip0,
|  unsigned  |  strip0_side_dex,
|  const ON_BrepQuadFacePackSide *  |  strip1,
|  unsigned  |  strip1_side_dex,
|  unsigned  |  count,
|  bool  |  check_pack_id = true
)
static
◆ Trim()
 const ON_BrepTrim* ON_BrepQuadFacePackSide::Trim  |  ( |   | ) |   const
inline
◆ TrimDex()
 int ON_BrepQuadFacePackSide::TrimDex  |  ( |   | ) |   const
inline