Public Member Functions | List of all members
CRhRdkContentArrayNC Class Reference
RDK
#include <RhRdkContent.h>
 Inheritance diagram for CRhRdkContentArrayNC:
 Public Member Functions
void  | Dump (const CRhRdkContent::DumpContext &dc, unsigned int gds_flags) const
void  | FromArrayOfConst (const CRhRdkContentArray &a)
void  | ToArrayOfConst (OUT CRhRdkContentArray &a) const
 Public Member Functions inherited from ON_SimpleArray< CRhRdkContent * >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< CRhRdkContent * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
ON_SimpleArray (size_t, CRhRdkContent *)
create an array of given size and initialize all items to the given value More...
virtual  | ~ON_SimpleArray ()
void  | Append (const CRhRdkContent * &)
void  | Append (int, const CRhRdkContent * *)
Append copy of an array T[count]. More...
CRhRdkContent * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
CRhRdkContent * *  | Array ()
The Array() function return the. More...
const CRhRdkContent * *  | Array () const
m_a pointer value. More...
CRhRdkContent * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const CRhRdkContent * *  | At (int) const
CRhRdkContent * *  | At (ON__INT64)
const CRhRdkContent * *  | At (ON__INT64) const
CRhRdkContent * *  | At (ON__UINT64)
const CRhRdkContent * *  | At (ON__UINT64) const
CRhRdkContent * *  | At (unsigned int)
const CRhRdkContent * *  | At (unsigned int) const
CRhRdkContent * *  | begin ()
Support STL iterators and algorithms. More...
CRhRdkContent * const *  | begin () const
int  | BinarySearch (const CRhRdkContent * *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const CRhRdkContent * *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *), int) const
const CRhRdkContent * *  | BinarySearchPtr (const CRhRdkContent * *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *)) const
const CRhRdkContent * *  | BinarySearchPtr (const CRhRdkContent * *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *), int) const
int  | Capacity () const
capacity of array More...
CRhRdkContent * const *  | cbegin () const
CRhRdkContent * const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
CRhRdkContent * *  | end ()
CRhRdkContent * const *  | end () const
CRhRdkContent * *  | First ()
const CRhRdkContent * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *))
void  | Insert (int, const CRhRdkContent * &)
int  | InsertInSortedList (const CRhRdkContent * &, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *))
int  | InsertInSortedList (const CRhRdkContent * &, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *), int)
CRhRdkContent * *  | KeepArray ()
CRhRdkContent * *  | Last ()
const CRhRdkContent * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const CRhRdkContent * * () const
operator CRhRdkContent ** ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_SimpleArray< CRhRdkContent * > &other) const=delete
ON_SimpleArray< CRhRdkContent * > &  | operator= (const ON_SimpleArray< CRhRdkContent * > &)
bool  | operator== (const ON_SimpleArray< CRhRdkContent * > &other) const=delete
CRhRdkContent * &  | operator[] (int)
const CRhRdkContent * &  | operator[] (int) const
CRhRdkContent * &  | operator[] (ON__INT64)
const CRhRdkContent * &  | operator[] (ON__INT64) const
CRhRdkContent * &  | operator[] (ON__UINT64)
const CRhRdkContent * &  | operator[] (ON__UINT64) const
CRhRdkContent * &  | operator[] (unsigned int)
const CRhRdkContent * &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Prepend (int, const CRhRdkContent * *)
Prepend copy of an array T[count]. More...
bool  | QuickSort (int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
bool  | QuickSortAndRemoveDuplicates (int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
virtual CRhRdkContent * *  | Realloc (CRhRdkContent * *, int)
low level memory management ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
void  | RemoveIf (bool(*predicate)(const CRhRdkContent * &key))
void  | RemoveValue (const CRhRdkContent * &)
CRhRdkContent * *  | Reserve (size_t)
memory management //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const CRhRdkContent * &) const
int  | Search (const CRhRdkContent * *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
void  | SetArray (CRhRdkContent * *p)
void  | SetArray (CRhRdkContent * *p, int count, int capacity)
CRhRdkContent * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | SetRange (int from, int count, CRhRdkContent *)
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *, void *), void *) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const CRhRdkContent * *, const CRhRdkContent * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< CRhRdkContent * >
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< CRhRdkContent * >
CRhRdkContent * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Detailed Description
Non-const version of CRhRdkContentArray. Used for holding temporary non-const contents immediately after creation.
Member Function Documentation
◆ Dump()
 void CRhRdkContentArrayNC::Dump  |  ( |  const CRhRdkContent::DumpContext &  |  dc,
|  unsigned int  |  gds_flags
) |   |  const
Dump this content array to a 'dump context'.
◆ FromArrayOfConst()
 void CRhRdkContentArrayNC::FromArrayOfConst  |  ( |  const CRhRdkContentArray &  |  a | )
Copy content pointers from a const array to this array.
◆ ToArrayOfConst()
 void CRhRdkContentArrayNC::ToArrayOfConst  |  ( |  OUT CRhRdkContentArray &  |  a | ) |   const
Copy content pointers from this array to a const array.