Public Member Functions | Static Public Attributes | List of all members
ON_TextRunArray Class Reference
OpenNURBS
#include <opennurbs_textrun.h>
 Inheritance diagram for ON_TextRunArray:
 Public Member Functions
ON_TextRunArray ()=default
ON_TextRunArray (const ON_TextRunArray &src)
Duplicate runs are managed text runs. More...
~ON_TextRunArray ()
Calls Destroy(true,true) More...
void  | AppendRun (ON_TextRun *&run)
ON_TextRun *const *  | Array () const
int  | Count () const
bool  | Get2dCorners (ON_2dPoint corners[4]) const
void  | InsertRun (int i, ON_TextRun *&run)
ON_TextRunArray &  | operator= (const ON_TextRunArray &src)
Duplicate runs are managed text runs. More...
ON_TextRun *  | operator[] (int i)
const ON_TextRun *  | operator[] (int i) const
void  | RemoveRun (int i)
void  | SetApplyKerning (bool applyKerning)
void  | SetLineSpaceScale (double scale)
void  | SetTextHeight (double height)
ON_SHA1_Hash  | TextRunArrayContentHash () const
ON_SHA1_Hash  | TextRunArrayContentHash (bool bEvaluateFields) const
unsigned int  | UnsignedCount () const
 Static Public Attributes
static const ON_TextRunArray  | EmptyArray
Constructor & Destructor Documentation
◆ ON_TextRunArray() [1/2]
 ON_TextRunArray::ON_TextRunArray  |  ( |   | )
default
◆ ~ON_TextRunArray()
 ON_TextRunArray::~ON_TextRunArray  |  ( |   | )
Calls Destroy(true,true)
◆ ON_TextRunArray() [2/2]
 ON_TextRunArray::ON_TextRunArray  |  ( |  const ON_TextRunArray &  |  src | )
Duplicate runs are managed text runs.
Member Function Documentation
◆ AppendRun()
 void ON_TextRunArray::AppendRun  |  ( |  ON_TextRun *&  |  run | )
Run must be a managed run or on the heap. The destructor will return managed runs and delete unmanaged runs.
◆ Array()
 ON_TextRun* const* ON_TextRunArray::Array  |  ( |   | ) |   const
◆ Count()
 int ON_TextRunArray::Count  |  ( |   | ) |   const
◆ Get2dCorners()
 bool ON_TextRunArray::Get2dCorners  |  ( |  ON_2dPoint  |  corners[4] | ) |   const
◆ InsertRun()
 void ON_TextRunArray::InsertRun  |  ( |  int  |  i,
|  ON_TextRun *&  |  run
)
Run must be a managed run or on the heap. The destructor will return managed runs and delete unmanaged runs.
◆ operator=()
 ON_TextRunArray& ON_TextRunArray::operator=  |  ( |  const ON_TextRunArray &  |  src | )
Duplicate runs are managed text runs.
◆ operator[]() [1/2]
 ON_TextRun* ON_TextRunArray::operator[]  |  ( |  int  |  i | )
◆ operator[]() [2/2]
 const ON_TextRun* ON_TextRunArray::operator[]  |  ( |  int  |  i | ) |   const
◆ RemoveRun()
 void ON_TextRunArray::RemoveRun  |  ( |  int  |  i | )
◆ SetApplyKerning()
 void ON_TextRunArray::SetApplyKerning  |  ( |  bool  |  applyKerning | )
◆ SetLineSpaceScale()
 void ON_TextRunArray::SetLineSpaceScale  |  ( |  double  |  scale | )
◆ SetTextHeight()
 void ON_TextRunArray::SetTextHeight  |  ( |  double  |  height | )
Parameters: bReturnManagedRuns - [in] True: Managed runs will be returned. False: Caller must explicitly handle managed runs. bDeleteUnmanagedRuns - [in] True: Unmanaged runs are deleted. False: Caller must explicitly handle unmanaged runs.
◆ TextRunArrayContentHash() [1/2]
 ON_SHA1_Hash ON_TextRunArray::TextRunArrayContentHash  |  ( |   | ) |   const
Returns: A hash of the information that determines the text content with evaluated fields.
◆ TextRunArrayContentHash() [2/2]
 ON_SHA1_Hash ON_TextRunArray::TextRunArrayContentHash  |  ( |  bool  |  bEvaluateFields | ) |   const
Parameters: bEvaluateFields - [in] true - hash text with fields evaluated false - hash text with fields unevaluated Returns: A hash of the information that determines the text content without evaluating the fields.
◆ UnsignedCount()
 unsigned int ON_TextRunArray::UnsignedCount  |  ( |   | ) |   const
Member Data Documentation
◆ EmptyArray
 const ON_TextRunArray ON_TextRunArray::EmptyArray
static
ON_TextRun*& AppendNew(); void Append(int, ON_TextRun* const *); void Append(ON_TextRun* const);