Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_BrepStarFacePack Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Public Member Functions
ON_Brep *  | Brep () const
ON_BrepVertex *  | Center () const
unsigned  | FaceCount () const
bool  | IsEmpty () const
bool  | IsNotEmpty () const
 Static Public Member Functions
static const ON_BrepStarFacePack  | GetPack (const ON_BrepFace *face, unsigned int pack_id)
static const ON_BrepStarFacePack  | GetPackTagged (const ON_BrepFace *face, unsigned count)
 Public Attributes
unsigned  | m_size = 0U
ON_BrepQuadFacePackSide  | m_start {}
 Static Public Attributes
static const ON_BrepStarFacePack  | Empty
Member Function Documentation
◆ Brep()
 ON_Brep* ON_BrepStarFacePack::Brep  |  ( |   | ) |   const
2025-04-02, Pierre, RH-86605: C++20: User-declared constructors (including defaulted ones) prevent aggregate initialization. Go back to compiler-declared default constructors. ON_BrepStarFacePack() = default; ~ON_BrepStarFacePack() = default; ON_BrepStarFacePack(const ON_BrepStarFacePack&) = default; ON_BrepStarFacePack& operator=(const ON_BrepStarFacePack&) = default;
◆ Center()
 ON_BrepVertex* ON_BrepStarFacePack::Center  |  ( |   | ) |   const
inline
◆ FaceCount()
 unsigned ON_BrepStarFacePack::FaceCount  |  ( |   | ) |   const
inline
◆ GetPack()
 static const ON_BrepStarFacePack ON_BrepStarFacePack::GetPack  |  ( |  const ON_BrepFace *  |  face,
|  unsigned int  |  pack_id
)
static
Parameters: face - [in] The star pack will be grown around one of the vertices of this face. pack_id - [in] If a star pack is found, this is the id that will be assigned to each ON_BrepFace.m_pack_id in the quad pack. Returns: If a pack is found, ON_BrepStarFacePack has details. Otherwise, ON_BrepStarFacePack::Empty is returned.
◆ GetPackTagged()
 static const ON_BrepStarFacePack ON_BrepStarFacePack::GetPackTagged  |  ( |  const ON_BrepFace *  |  face,
|  unsigned  |  count
)
static
◆ IsEmpty()
 bool ON_BrepStarFacePack::IsEmpty  |  ( |   | ) |   const
inline
◆ IsNotEmpty()
 bool ON_BrepStarFacePack::IsNotEmpty  |  ( |   | ) |   const
inline
Member Data Documentation
◆ Empty
 const ON_BrepStarFacePack ON_BrepStarFacePack::Empty
static
◆ m_size
 unsigned ON_BrepStarFacePack::m_size = 0U
◆ m_start
 ON_BrepQuadFacePackSide ON_BrepStarFacePack::m_start {}