Public Types | Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetCircle Class Reference
RhinoGet
Input to the RhinoGetCircle() More...
#include <rhinoSdkGetCircle.h>
 Inheritance diagram for CArgsRhinoGetCircle:
 Public Types
enum  | {
 circle_type, cylinder_type, cone_type, sphere_type,
 torus_type, sphere_type_ex, cylinder_type_ex, arc_type,
 mesh_sphere_type, cone_type_ex
 }
enum  | eCircleResult {
 nothing, center, twopt, threept,
 ttr, ttt, fitpoints, around,
 cancel, error
 }
Results of main Circle Command function. More...
 Public Member Functions
CArgsRhinoGetCircle ()
CArgsRhinoGetCircle (const CArgsRhinoGetCircle &)
~CArgsRhinoGetCircle ()
BOOL32  | AllowDeformable () const
int  | ArgsType () const
return type of args class circle, cone, cylinder, sphere More...
int  | AroundDirectionCount () const
number of faces in the around direction More...
int  | AroundDirectionMinCount () const
const CRhinoCommandOptionName &  | AroundMeshDensityDirectionPrompt () const
prompt for number of faces in the around direction More...
int  | ConeCylConstraint () const
bool  | ConeCylOptionAvailable () const
double  | DefaultSize () const
BOOL32  | Deformable () const
int  | Degree () const
const ON_wString &  | DiameterPrompt () const
std::function< void(const ON_Circle &)>  | DynamicCircleCallback () const
BOOL32  | DynamicDrawSphere () const
void  | EnableConeCylOption (bool bAvailable=true)
void  | EnableDynamicDrawSphere (BOOL32 bDrawSphere=TRUE)
void  | EnableVerticalCircleOption (BOOL32 bAvailable=TRUE)
bool  | GetCap () const
eCircleResult  | GetCircleType ()
CArgsRhinoGetCircle &  | operator= (const CArgsRhinoGetCircle &)
const ON_Plane &  | Plane () const
const ON_3dPoint &  | Point0 () const
const ON_3dPoint &  | Point1 () const
const ON_3dPoint &  | Point2 () const
int  | PointCount () const
const ON_wString &  | Prompt0 () const
const ON_wString &  | Prompt1 () const
const ON_wString &  | Prompt2 () const
bool  | PromptForMeshDensity () const
const ON_wString &  | RadiusPrompt () const
void  | SetAllowDeformable (BOOL32 b=TRUE)
void  | SetAroundDirectionCount (int count)
void  | SetAroundDirectionMinCount (int count)
void  | SetAroundMeshDensityDirectionPrompt (const CRhinoCommandOptionName &prompt)
void  | SetCap (bool bCap=true)
void  | SetCircleType (eCircleResult mode)
void  | SetConeCylConstraint (int i=0)
void  | SetDefaultSize (double)
Set the default size to use - diameter or radius depending on m_bUseDiameter. More...
void  | SetDeformable (BOOL32 bDeformable=TRUE)
void  | SetDegree (int degree)
void  | SetDiameterPrompt (const wchar_t *)
Set a custom prompt to use for getting the diameter. More...
void  | SetDynamicCircleCallback (std::function< void(const ON_Circle &)> callback)
void  | SetPlane (const ON_Plane &)
Set a plane. More...
void  | SetPoint0 (const ON_3dPoint &)
Set the first point to use instead of asking for one. More...
void  | SetPoint1 (const ON_3dPoint &)
Set the second point to use instead of asking for one. More...
void  | SetPoint2 (const ON_3dPoint &point)
Set the third point to use instead of asking for one. More...
void  | SetPointCount (int count)
void  | SetPrompt0 (const wchar_t *)
Set a custom prompt to use for getting the first (center) point. More...
void  | SetPrompt1 (const wchar_t *)
Set a custom prompt to use for getting the second point. More...
void  | SetPrompt2 (const wchar_t *)
Set a custom prompt to use for getting third point. More...
void  | SetPromptForMeshDensity (bool bMeshDensity=true)
void  | SetRadiusPrompt (const wchar_t *)
Set a custom prompt to use for getting the radius. More...
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseDefaultSize (BOOL32=TRUE)
Use the default size when getting diameter/radius. More...
void  | SetUseDiameterMode (BOOL32=TRUE)
void  | SetUsePlane (BOOL32=TRUE)
Constrain the circle to a plane - Center/radius, 2point, 3point only. More...
void  | SetUsePoint0 (BOOL32=TRUE)
Use the first point and don't ask for one. More...
void  | SetUsePoint1 (BOOL32=TRUE)
Use the second point and don't ask for one. More...
void  | SetVerticalCircle (BOOL32 bSelected=TRUE)
void  | SetVerticalDirectionCount (int count)
void  | SetVerticalDirectionMinCount (int count)
void  | SetVerticalMeshDensityDirectionPrompt (const CRhinoCommandOptionName &prompt)
bool  | UseActiveLayerLinetype () const
BOOL32  | UseDefaultSize () const
BOOL32  | UseDiameterMode () const
BOOL32  | UsePlane () const
BOOL32  | UsePoint0 () const
BOOL32  | UsePoint1 () const
BOOL32  | VerticalCircle () const
BOOL32  | VerticalCircleOptionAvailable () const
int  | VerticalDirectionCount () const
number of faces in the vertical direction More...
int  | VerticalDirectionMinCount () const
const CRhinoCommandOptionName &  | VerticalMeshDensityDirectionPrompt () const
prompt for number of faces in the vertical direction More...
 Protected Attributes
BOOL32  | m_allow_deformable
display deformable prompt or not More...
int  | m_ArgsType
bool  | m_bCap = false
[io] Used when RhinoGetCircle is called by a primitive solid command like cylinder or cone More...
bool  | m_bConeCylAvailable
[i] TRUE if "Vertical" option is available and applies to VerticalConeCyl More...
BOOL32  | m_bDynamicDrawSphere
[i] More...
BOOL32  | m_bUseDefaultSize
[i] Defaultsize is valid More...
BOOL32  | m_bUseDiameterMode
[io] Get size in diameter mode instead of radius More...
BOOL32  | m_bUsePlane
[i] Constrain the circle to a plane More...
BOOL32  | m_bUsePoint0
[i] Use first (center) instead of asking for point More...
BOOL32  | m_bUsePoint1
[i] Use second instead of asking for point More...
BOOL32  | m_bVerticalCircle
[io] Make the circle axis parallel to the current construction plane More...
BOOL32  | m_bVerticalCircleAvailable
[i] TRUE if "Vertical" option is available and applies to VerticalCircle More...
int  | m_ConeCylConstraint
[io] 0 = none, 1 = vertical, 2 = aroundcurve More...
double  | m_defaultsize
[i] if( m_bUseDefaultSize) radius or diameter (center/radius, ttr, AroundCurve only) More...
BOOL32  | m_deformable
make circle deformable or not More...
int  | m_degree
deformable degree More...
std::function< void(const ON_Circle &)>  | m_dynamicCircleCallback
CRhinoCommandOptionName  | m_mesh_density_around_direction_prompt
int  | m_mesh_density_AroundDirection
int  | m_mesh_density_MinAroundDirection
int  | m_mesh_density_MinVerticalDirection
CRhinoCommandOptionName  | m_mesh_density_vertical_direction_prompt
int  | m_mesh_density_VerticalDirection
ON_Plane  | m_plane
[i] if( m_bUsePlane) constrain to this plane More...
ON_3dPoint  | m_point0
[i] if( m_bHavePoint0) first point specified here (center/radius, 2pt, 3pt only) More...
ON_3dPoint  | m_point1
[i] if( m_bHavePoint1) second point specified here (3pt only) More...
ON_3dPoint  | m_point2
[i] if( m_bHavePoint2) second point specified here (3pt only) More...
int  | m_point_count
deformable cv count More...
ON_wString  | m_prompt0
[i] Prompt for first or center point More...
ON_wString  | m_prompt1
[i] Prompt for second point More...
ON_wString  | m_prompt2
[i] Prompt for third point More...
ON_wString  | m_promptdiameter
[i] Prompt when getting size in diameter mode More...
bool  | m_PromptForMeshDensity
ON_wString  | m_promptradius
[i] Prompt when getting size in radius mode More...
eCircleResult  | m_result
[o] What mode was used More...
Detailed Description
Input to the RhinoGetCircle()
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
circle_type
cylinder_type
cone_type
sphere_type
torus_type
sphere_type_ex
cylinder_type_ex
arc_type
mesh_sphere_type
cone_type_ex
◆ eCircleResult
 enum CArgsRhinoGetCircle::eCircleResult
Results of main Circle Command function.
Enumerator
nothing
no result
center
Center/size - m_centerpoint is valid.
twopt
2point
threept
3point
ttr
TTR.
ttt
TTT.
fitpoints
least squares fit points
around
Around curve.
cancel
User canceled.
error
Something went wrong.
Constructor & Destructor Documentation
◆ CArgsRhinoGetCircle() [1/2]
 CArgsRhinoGetCircle::CArgsRhinoGetCircle  |  ( |   | )
◆ ~CArgsRhinoGetCircle()
 CArgsRhinoGetCircle::~CArgsRhinoGetCircle  |  ( |   | )
◆ CArgsRhinoGetCircle() [2/2]
 CArgsRhinoGetCircle::CArgsRhinoGetCircle  |  ( |  const CArgsRhinoGetCircle &  |   | )
Member Function Documentation
◆ AllowDeformable()
 BOOL32 CArgsRhinoGetCircle::AllowDeformable  |  ( |   | ) |   const
◆ ArgsType()
 int CArgsRhinoGetCircle::ArgsType  |  ( |   | ) |   const
return type of args class circle, cone, cylinder, sphere
◆ AroundDirectionCount()
 int CArgsRhinoGetCircle::AroundDirectionCount  |  ( |   | ) |   const
number of faces in the around direction
◆ AroundDirectionMinCount()
 int CArgsRhinoGetCircle::AroundDirectionMinCount  |  ( |   | ) |   const
◆ AroundMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetCircle::AroundMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in the around direction
◆ ConeCylConstraint()
 int CArgsRhinoGetCircle::ConeCylConstraint  |  ( |   | ) |   const
Description: Returns the state of the cone/cyl constraint option. When the cone/cyl option is selected, the circle is being made as a base for a cone/cyl. By default the vertical cone/cyl option not available but is not selected. By default the "Vertical" option applies to VerticalCircle. Returns: 0 for None, 1 for Vertical and 2 for AroundCurve See Also: SetVerticalConeCyl, EnableVerticalConeCylOption VerticalCircle, EnableVerticalCircleOption
◆ ConeCylOptionAvailable()
 bool CArgsRhinoGetCircle::ConeCylOptionAvailable  |  ( |   | ) |   const
◆ DefaultSize()
 double CArgsRhinoGetCircle::DefaultSize  |  ( |   | ) |   const
◆ Deformable()
 BOOL32 CArgsRhinoGetCircle::Deformable  |  ( |   | ) |   const
◆ Degree()
 int CArgsRhinoGetCircle::Degree  |  ( |   | ) |   const
◆ DiameterPrompt()
 const ON_wString& CArgsRhinoGetCircle::DiameterPrompt  |  ( |   | ) |   const
◆ DynamicCircleCallback()
 std::function<void(const ON_Circle&)> CArgsRhinoGetCircle::DynamicCircleCallback  |  ( |   | ) |   const
Description: Get callback function for doing custom dynamic drawing Returns: Callback function Remarks: Good for custom drawing when calling RhinoGetSphere
◆ DynamicDrawSphere()
 BOOL32 CArgsRhinoGetCircle::DynamicDrawSphere  |  ( |   | ) |   const
Use a fit curve instead or a rational ot primitive one void SetDeformable( BOOL32 set = TRUE); BOOL32 Deformable() const; Description: If TRUE, then during the interactive part of RhinoGetCircle, a sphere is drawn.
◆ EnableConeCylOption()
 void CArgsRhinoGetCircle::EnableConeCylOption  |  ( |  bool  |  bAvailable = true | )
Description: If the vertical cone/cyl option is available, then the "Vertical" option applies to a cone/cyl base circle and appears at the initial point pick. Parameters: bAvailable - [in] TRUE to make the "Vertical" option available on the first pick and have it apply as a cone/cyl option. See Also: SetVerticalConeCyl, VerticalConeCyl VerticalCircle, EnableVerticalCircleOption
◆ EnableDynamicDrawSphere()
 void CArgsRhinoGetCircle::EnableDynamicDrawSphere  |  ( |  BOOL32  |  bDrawSphere = TRUE | )
Description: Set DynamicDrawSphere state. Parameters: bDrawSphere - [in] TRUE to draw a sphere instead of a circle
◆ EnableVerticalCircleOption()
 void CArgsRhinoGetCircle::EnableVerticalCircleOption  |  ( |  BOOL32  |  bAvailable = TRUE | )
Description: If the vertical circle option is available, then the "Vertical" option applies to circles and appears at the initial point pick. Parameters: bAvailable - [in] TRUE to make the "Vertical" option available on the first pick and have it apply as a vertical circle option. See Also: VerticalCircle, EnableVerticalCircleOption VerticalConeCyl, EnableVerticalConeCylOption
◆ GetCap()
 bool CArgsRhinoGetCircle::GetCap  |  ( |   | ) |   const
◆ GetCircleType()
 eCircleResult CArgsRhinoGetCircle::GetCircleType  |  ( |   | )
◆ operator=()
 CArgsRhinoGetCircle& CArgsRhinoGetCircle::operator=  |  ( |  const CArgsRhinoGetCircle &  |   | )
◆ Plane()
 const ON_Plane& CArgsRhinoGetCircle::Plane  |  ( |   | ) |   const
◆ Point0()
 const ON_3dPoint& CArgsRhinoGetCircle::Point0  |  ( |   | ) |   const
◆ Point1()
 const ON_3dPoint& CArgsRhinoGetCircle::Point1  |  ( |   | ) |   const
◆ Point2()
 const ON_3dPoint& CArgsRhinoGetCircle::Point2  |  ( |   | ) |   const
◆ PointCount()
 int CArgsRhinoGetCircle::PointCount  |  ( |   | ) |   const
◆ Prompt0()
 const ON_wString& CArgsRhinoGetCircle::Prompt0  |  ( |   | ) |   const
◆ Prompt1()
 const ON_wString& CArgsRhinoGetCircle::Prompt1  |  ( |   | ) |   const
◆ Prompt2()
 const ON_wString& CArgsRhinoGetCircle::Prompt2  |  ( |   | ) |   const
◆ PromptForMeshDensity()
 bool CArgsRhinoGetCircle::PromptForMeshDensity  |  ( |   | ) |   const
◆ RadiusPrompt()
 const ON_wString& CArgsRhinoGetCircle::RadiusPrompt  |  ( |   | ) |   const
◆ SetAllowDeformable()
 void CArgsRhinoGetCircle::SetAllowDeformable  |  ( |  BOOL32  |  b = TRUE | )
Description: Set/Get state of allowing deformable options to be processed. Parameters: b - [in] whether or not to display a Deformable prompt
◆ SetAroundDirectionCount()
 void CArgsRhinoGetCircle::SetAroundDirectionCount  |  ( |  int  |  count | )
◆ SetAroundDirectionMinCount()
 void CArgsRhinoGetCircle::SetAroundDirectionMinCount  |  ( |  int  |  count | )
◆ SetAroundMeshDensityDirectionPrompt()
 void CArgsRhinoGetCircle::SetAroundMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |  prompt | )
◆ SetCap()
 void CArgsRhinoGetCircle::SetCap  |  ( |  bool  |  bCap = true | )
Description: Sets and gets a bool to determine whether solid primitive commands like Cylinder or Cone should "Cap" the output. Parameters: bCap - [in] value of the cap bool
◆ SetCircleType()
 void CArgsRhinoGetCircle::SetCircleType  |  ( |  eCircleResult  |  mode | )
Description: Set/Get mode of circle creation. Parameters: mode - [in] CArgsRhinoGetCircle::eCircleResult
◆ SetConeCylConstraint()
 void CArgsRhinoGetCircle::SetConeCylConstraint  |  ( |  int  |  i = 0 | )
Description: Set the state of the vertical cone/cyl option. Parameters: bSelected - [in] TRUE to select this option. Remarks: Use EnableVerticalConeCylOption to control if the "Vertical" option applies to a cone/cyl base circle and appears at the initial point pick. See Also: VerticalConeCyl, EnableVerticalConeCylOption VerticalCircle, EnableVerticalCircleOption
◆ SetDefaultSize()
 void CArgsRhinoGetCircle::SetDefaultSize  |  ( |  double  |   | )
Set the default size to use - diameter or radius depending on m_bUseDiameter.
◆ SetDeformable()
 void CArgsRhinoGetCircle::SetDeformable  |  ( |  BOOL32  |  bDeformable = TRUE | )
Description: Set/Get deformable flag Parameters: bDeformable - [in] whether or not circle is to be mad deformable
◆ SetDegree()
 void CArgsRhinoGetCircle::SetDegree  |  ( |  int  |  degree | )
Description: Set/Get degree of nurbs curve used for deformable circle Parameters: degree - [in] curve degree
◆ SetDiameterPrompt()
 void CArgsRhinoGetCircle::SetDiameterPrompt  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the diameter.
◆ SetDynamicCircleCallback()
 void CArgsRhinoGetCircle::SetDynamicCircleCallback  |  ( |  std::function< void(const ON_Circle &)>  |  callback | )
Description: Set callback function for doing custom dynamic drawing Parameters: callback [in] Callback function for dynamic drawing Remarks: Good for custom drawing when calling RhinoGetSphere
◆ SetPlane()
 void CArgsRhinoGetCircle::SetPlane  |  ( |  const ON_Plane &  |   | )
Set a plane.
◆ SetPoint0()
 void CArgsRhinoGetCircle::SetPoint0  |  ( |  const ON_3dPoint &  |   | )
Set the first point to use instead of asking for one.
◆ SetPoint1()
 void CArgsRhinoGetCircle::SetPoint1  |  ( |  const ON_3dPoint &  |   | )
Set the second point to use instead of asking for one.
◆ SetPoint2()
 void CArgsRhinoGetCircle::SetPoint2  |  ( |  const ON_3dPoint &  |  point | )
Set the third point to use instead of asking for one.
◆ SetPointCount()
 void CArgsRhinoGetCircle::SetPointCount  |  ( |  int  |  count | )
Description: Set/Get number of CVs in nurbs curve used for deformable circle Parameters: count - [in] CV count
◆ SetPrompt0()
 void CArgsRhinoGetCircle::SetPrompt0  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the first (center) point.
◆ SetPrompt1()
 void CArgsRhinoGetCircle::SetPrompt1  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the second point.
◆ SetPrompt2()
 void CArgsRhinoGetCircle::SetPrompt2  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting third point.
◆ SetPromptForMeshDensity()
 void CArgsRhinoGetCircle::SetPromptForMeshDensity  |  ( |  bool  |  bMeshDensity = true | )
Interface to allow primitive mesh creation to use RhinoGetPlane, RhinoGetBox, RhinoGetCircle etc.
◆ SetRadiusPrompt()
 void CArgsRhinoGetCircle::SetRadiusPrompt  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the radius.
◆ SetUseActiveLayerLinetype()
 void CArgsRhinoGetCircle::SetUseActiveLayerLinetype  |  ( |  bool  |  on | )
When true the linetype of the active layer is used for dynamic drawing.
◆ SetUseDefaultSize()
 void CArgsRhinoGetCircle::SetUseDefaultSize  |  ( |  BOOL32  |   = TRUE | )
Use the default size when getting diameter/radius.
◆ SetUseDiameterMode()
 void CArgsRhinoGetCircle::SetUseDiameterMode  |  ( |  BOOL32  |   = TRUE | )
Use Diameter mode (instead of radius mode) for getting the size Also qualifies the meaning of m_size
◆ SetUsePlane()
 void CArgsRhinoGetCircle::SetUsePlane  |  ( |  BOOL32  |   = TRUE | )
Constrain the circle to a plane - Center/radius, 2point, 3point only.
◆ SetUsePoint0()
 void CArgsRhinoGetCircle::SetUsePoint0  |  ( |  BOOL32  |   = TRUE | )
Use the first point and don't ask for one.
◆ SetUsePoint1()
 void CArgsRhinoGetCircle::SetUsePoint1  |  ( |  BOOL32  |   = TRUE | )
Use the second point and don't ask for one.
◆ SetVerticalCircle()
 void CArgsRhinoGetCircle::SetVerticalCircle  |  ( |  BOOL32  |  bSelected = TRUE | )
Description: Set the state of the vertical circle option. Parameters: bSelected - [in] TRUE to select this option. Remarks: Use EnableVerticalCircleOption to control if the "Vertical" applies to circles and appears at the initial point pick. See Also: VerticalCircle, EnableVerticalCircleOption VerticalConeCyl, EnableVerticalConeCylOption
◆ SetVerticalDirectionCount()
 void CArgsRhinoGetCircle::SetVerticalDirectionCount  |  ( |  int  |  count | )
◆ SetVerticalDirectionMinCount()
 void CArgsRhinoGetCircle::SetVerticalDirectionMinCount  |  ( |  int  |  count | )
◆ SetVerticalMeshDensityDirectionPrompt()
 void CArgsRhinoGetCircle::SetVerticalMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |  prompt | )
◆ UseActiveLayerLinetype()
 bool CArgsRhinoGetCircle::UseActiveLayerLinetype  |  ( |   | ) |   const
◆ UseDefaultSize()
 BOOL32 CArgsRhinoGetCircle::UseDefaultSize  |  ( |   | ) |   const
◆ UseDiameterMode()
 BOOL32 CArgsRhinoGetCircle::UseDiameterMode  |  ( |   | ) |   const
◆ UsePlane()
 BOOL32 CArgsRhinoGetCircle::UsePlane  |  ( |   | ) |   const
◆ UsePoint0()
 BOOL32 CArgsRhinoGetCircle::UsePoint0  |  ( |   | ) |   const
◆ UsePoint1()
 BOOL32 CArgsRhinoGetCircle::UsePoint1  |  ( |   | ) |   const
◆ VerticalCircle()
 BOOL32 CArgsRhinoGetCircle::VerticalCircle  |  ( |   | ) |   const
Make the circle vertical to the current cplane with the axis in the cplane Description: Returns the state of the vertical circle option. When the vertical circle option is selected, the circle is made vertical to the current cplane with the axis in the cplane. By default the vertical circle option is available but is not selected. Returns: TRUE if the vertical circle option is selected. See Also: SetVerticalCircle, EnableVerticalCircleOption VerticalConeCyl, EnableVerticalConeCylOption
◆ VerticalCircleOptionAvailable()
 BOOL32 CArgsRhinoGetCircle::VerticalCircleOptionAvailable  |  ( |   | ) |   const
◆ VerticalDirectionCount()
 int CArgsRhinoGetCircle::VerticalDirectionCount  |  ( |   | ) |   const
number of faces in the vertical direction
◆ VerticalDirectionMinCount()
 int CArgsRhinoGetCircle::VerticalDirectionMinCount  |  ( |   | ) |   const
◆ VerticalMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetCircle::VerticalMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in the vertical direction
Member Data Documentation
◆ m_allow_deformable
 BOOL32 CArgsRhinoGetCircle::m_allow_deformable
protected
display deformable prompt or not
◆ m_ArgsType
 int CArgsRhinoGetCircle::m_ArgsType
protected
This variable is to distinguish whether this class is really a CArgsRhinoGetCircle or the derived class CArgsRhinoGetCylinder, CArgsRhinoGetCone. It is set to plane_type in the constructor for the plane, which is called first, and box_type in the constructor for the box. ArgsType() returns the value of m_ArgsType
◆ m_bCap
 bool CArgsRhinoGetCircle::m_bCap = false
protected
[io] Used when RhinoGetCircle is called by a primitive solid command like cylinder or cone
◆ m_bConeCylAvailable
 bool CArgsRhinoGetCircle::m_bConeCylAvailable
protected
[i] TRUE if "Vertical" option is available and applies to VerticalConeCyl
◆ m_bDynamicDrawSphere
 BOOL32 CArgsRhinoGetCircle::m_bDynamicDrawSphere
protected
[i]
◆ m_bUseDefaultSize
 BOOL32 CArgsRhinoGetCircle::m_bUseDefaultSize
protected
[i] Defaultsize is valid
◆ m_bUseDiameterMode
 BOOL32 CArgsRhinoGetCircle::m_bUseDiameterMode
protected
[io] Get size in diameter mode instead of radius
◆ m_bUsePlane
 BOOL32 CArgsRhinoGetCircle::m_bUsePlane
protected
[i] Constrain the circle to a plane
◆ m_bUsePoint0
 BOOL32 CArgsRhinoGetCircle::m_bUsePoint0
protected
[i] Use first (center) instead of asking for point
◆ m_bUsePoint1
 BOOL32 CArgsRhinoGetCircle::m_bUsePoint1
protected
[i] Use second instead of asking for point
◆ m_bVerticalCircle
 BOOL32 CArgsRhinoGetCircle::m_bVerticalCircle
protected
[io] Make the circle axis parallel to the current construction plane
◆ m_bVerticalCircleAvailable
 BOOL32 CArgsRhinoGetCircle::m_bVerticalCircleAvailable
protected
[i] TRUE if "Vertical" option is available and applies to VerticalCircle
◆ m_ConeCylConstraint
 int CArgsRhinoGetCircle::m_ConeCylConstraint
protected
[io] 0 = none, 1 = vertical, 2 = aroundcurve
◆ m_defaultsize
 double CArgsRhinoGetCircle::m_defaultsize
protected
[i] if( m_bUseDefaultSize) radius or diameter (center/radius, ttr, AroundCurve only)
◆ m_deformable
 BOOL32 CArgsRhinoGetCircle::m_deformable
protected
make circle deformable or not
◆ m_degree
 int CArgsRhinoGetCircle::m_degree
protected
deformable degree
◆ m_dynamicCircleCallback
 std::function<void(const ON_Circle&)> CArgsRhinoGetCircle::m_dynamicCircleCallback
protected
◆ m_mesh_density_around_direction_prompt
 CRhinoCommandOptionName CArgsRhinoGetCircle::m_mesh_density_around_direction_prompt
protected
◆ m_mesh_density_AroundDirection
 int CArgsRhinoGetCircle::m_mesh_density_AroundDirection
protected
◆ m_mesh_density_MinAroundDirection
 int CArgsRhinoGetCircle::m_mesh_density_MinAroundDirection
protected
◆ m_mesh_density_MinVerticalDirection
 int CArgsRhinoGetCircle::m_mesh_density_MinVerticalDirection
protected
◆ m_mesh_density_vertical_direction_prompt
 CRhinoCommandOptionName CArgsRhinoGetCircle::m_mesh_density_vertical_direction_prompt
protected
◆ m_mesh_density_VerticalDirection
 int CArgsRhinoGetCircle::m_mesh_density_VerticalDirection
protected
◆ m_plane
 ON_Plane CArgsRhinoGetCircle::m_plane
protected
[i] if( m_bUsePlane) constrain to this plane
◆ m_point0
 ON_3dPoint CArgsRhinoGetCircle::m_point0
protected
[i] if( m_bHavePoint0) first point specified here (center/radius, 2pt, 3pt only)
◆ m_point1
 ON_3dPoint CArgsRhinoGetCircle::m_point1
protected
[i] if( m_bHavePoint1) second point specified here (3pt only)
◆ m_point2
 ON_3dPoint CArgsRhinoGetCircle::m_point2
protected
[i] if( m_bHavePoint2) second point specified here (3pt only)
◆ m_point_count
 int CArgsRhinoGetCircle::m_point_count
protected
deformable cv count
◆ m_prompt0
 ON_wString CArgsRhinoGetCircle::m_prompt0
protected
[i] Prompt for first or center point
◆ m_prompt1
 ON_wString CArgsRhinoGetCircle::m_prompt1
protected
[i] Prompt for second point
◆ m_prompt2
 ON_wString CArgsRhinoGetCircle::m_prompt2
protected
[i] Prompt for third point
◆ m_promptdiameter
 ON_wString CArgsRhinoGetCircle::m_promptdiameter
protected
[i] Prompt when getting size in diameter mode
◆ m_PromptForMeshDensity
 bool CArgsRhinoGetCircle::m_PromptForMeshDensity
protected
Interface to allow primitive mesh creation to use RhinoGetCylinder, RhinoGetCone, etc.
◆ m_promptradius
 ON_wString CArgsRhinoGetCircle::m_promptradius
protected
[i] Prompt when getting size in radius mode
◆ m_result
 eCircleResult CArgsRhinoGetCircle::m_result
protected
[o] What mode was used