Public Types | Public Member Functions | List of all members
CRhRdkRendererSupportOptions Class Reference
RDK
#include <RhRdkRendererSupportOptions.h>
 Public Types
enum  | {
 size1 = 128, size2 = 256, size3 = 512, size4 = 1024,
 size5 = 2048
 }
enum  | eInitialLocation { render_content, last_opened_folder, custom_folder }
 Public Member Functions
CRhRdkRendererSupportOptions ()
virtual  | ~CRhRdkRendererSupportOptions ()
int  | AdaptiveBakingQuality (void) const
virtual bool  | AlwaysShowSunPreview (void) const
bool  | AlwaysUnpackEmbeddedFilesToTemp (void) const
virtual int  | AutoSaveKeepAmount (void) const
virtual bool  | AutoSaveRenderings (void) const
int  | BakingQueueThreads (void) const
ON_wString  | BlockContent_CustomPath (void) const
ON_wString  | BlockContent_CustomPathList (void) const
eInitialLocation  | BlockContent_InitialLocation (void) const
ON_wString  | BlockContent_InitialLocationCustomFolder (void) const
ON_wString  | BlockContent_LastNavigatedFolder (void) const
void  | BlockContent_SetCustomPath (const wchar_t *wszPath)
void  | BlockContent_SetCustomPathList (const wchar_t *wszPath)
void  | BlockContent_SetInitialLocation (eInitialLocation l)
void  | BlockContent_SetInitialLocationCustomFolder (const wchar_t *wszPath)
void  | BlockContent_SetLastNavigatedFolder (const wchar_t *wszPath)
void  | BlockContent_SetShowBlockContent (bool b)
void  | BlockContent_SetShowCustom (bool b)
void  | BlockContent_SetShowDocuments (bool b)
void  | BlockContent_SetUseDefaultLocation (bool bUseDefault)
bool  | BlockContent_ShowBlockContent (void) const
bool  | BlockContent_ShowCustom (void) const
bool  | BlockContent_ShowDocuments (void) const
bool  | BlockContent_UseDefaultLocation (void) const
virtual bool  | CheckSupportFilesBeforeRendering (void) const
virtual bool  | CombineEditors (void) const
bool  | CombineSimilarTextures (void) const
virtual RDK_DEPRECATED ON_wString  | CustomLibraryPath (void) const
virtual RDK_DEPRECATED ON_wString  | CustomPaths (void) const
virtual COLORREF  | DarkPreviewCheckerColor (void) const
bool  | EmbedFilesDocumentDefault (void) const
virtual bool  | EnablePreviewJobLog (void) const
virtual void *  | EVF (const wchar_t *, void *)
ON_wString  | FileExplorer_CustomPath (void) const
ON_wString  | FileExplorer_CustomPathList (void) const
eInitialLocation  | FileExplorer_InitialLocation (void) const
ON_wString  | FileExplorer_InitialLocationCustomFolder (void) const
ON_wString  | FileExplorer_LastNavigatedFolder (void) const
void  | FileExplorer_SetCustomPath (const wchar_t *wszPath)
void  | FileExplorer_SetCustomPathList (const wchar_t *wszPath)
void  | FileExplorer_SetInitialLocation (eInitialLocation l)
void  | FileExplorer_SetInitialLocationCustomFolder (const wchar_t *wszPath)
void  | FileExplorer_SetLastNavigatedFolder (const wchar_t *wszPath)
void  | FileExplorer_SetShowCustom (bool b)
void  | FileExplorer_SetShowDocuments (bool b)
void  | FileExplorer_SetShowRenderContent (bool b)
void  | FileExplorer_SetUseDefaultLocation (bool bUseDefault)
bool  | FileExplorer_ShowCustom (void) const
bool  | FileExplorer_ShowDocuments (void) const
bool  | FileExplorer_ShowRenderContent (void) const
bool  | FileExplorer_UseDefaultLocation (void) const
ON_wString  | GetLastSavedRenderFileExtension (void) const
virtual bool  | HarvestContentParameters (void) const
virtual int  | LabelFormatLoc (void) const
virtual int  | LabelFormatUTC (void) const
ON_wString  | Libraries_CustomPath (void) const
ON_wString  | Libraries_CustomPathList (void) const
eInitialLocation  | Libraries_InitialLocation (void) const
ON_wString  | Libraries_InitialLocationCustomFolder (void) const
ON_wString  | Libraries_LastNavigatedFolder (void) const
void  | Libraries_SetCustomPath (const wchar_t *wszPath)
void  | Libraries_SetCustomPathList (const wchar_t *wszPath)
void  | Libraries_SetInitialLocation (eInitialLocation l)
void  | Libraries_SetInitialLocationCustomFolder (const wchar_t *wszPath)
void  | Libraries_SetLastNavigatedFolder (const wchar_t *wszPath)
void  | Libraries_SetShowCustom (bool b)
void  | Libraries_SetShowDocuments (bool b)
void  | Libraries_SetShowRenderContent (bool b)
void  | Libraries_SetUseDefaultLocation (bool bUseDefault)
bool  | Libraries_ShowCustom (void) const
bool  | Libraries_ShowDocuments (void) const
bool  | Libraries_ShowRenderContent (void) const
bool  | Libraries_UseDefaultLocation (void) const
virtual RDK_DEPRECATED eInitialLocation  | LibrariesInitialLocation (void) const
virtual RDK_DEPRECATED ON_wString  | LibrariesInitialLocationCustomFolder (void) const
virtual COLORREF  | LightPreviewCheckerColor (void) const
virtual_su int  | MaxDynamicIconCacheMB (void) const
virtual int  | MaxPreviewCacheMB (void) const
virtual int  | MaxPreviewSeconds (void) const
virtual bool  | MultithreadedTextureEvaluation (void) const
bool  | NeverEmbedFiles (void) const
void  | PopulateAdvancedOptions (void) const
virtual bool  | PreferNativeRenderer (void) const
virtual ON_wString  | PreferredUnpackFolder (void) const
bool  | PreserveDeletedChildTextures (void) const
virtual bool  | PreviewCustomRenderMeshes (void) const
bool  | SaveCompressedTextureFiles (void) const
void  | SetAdaptiveBakingQuality (int)
virtual void  | SetAlwaysShowSunPreview (bool b)
void  | SetAlwaysUnpackEmbeddedFilesToTemp (bool b)
virtual void  | SetAutoSaveKeepAmount (int value)
virtual void  | SetAutoSaveRenderings (bool b)
void  | SetBakingQueueThreads (int)
virtual void  | SetCheckSupportFilesBeforeRendering (bool b)
virtual void  | SetCombineEditors (bool b)
void  | SetCombineSimilarTextures (bool b)
virtual RDK_DEPRECATED void  | SetCustomLibraryPath (const wchar_t *wszPath)
virtual RDK_DEPRECATED void  | SetCustomPaths (const wchar_t *wszPath)
void  | SetEmbedFilesDocumentDefault (bool b)
virtual void  | SetHarvestContentParameters (bool b)
virtual void  | SetLabelFormatLoc (int value)
virtual void  | SetLabelFormatUTC (int value)
void  | SetLastSavedRenderFileExtension (const wchar_t *wszExt)
virtual RDK_DEPRECATED void  | SetLibrariesInitialLocation (eInitialLocation l)
virtual RDK_DEPRECATED void  | SetLibrariesInitialLocationCustomFolder (const wchar_t *wszPath)
virtual void  | SetMultithreadedTextureEvaluation (bool b)
void  | SetNeverEmbedFiles (bool b)
virtual void  | SetPreferNativeRenderer (bool b)
virtual void  | SetPreferredUnpackFolder (const wchar_t *wszPath)
void  | SetPreserveDeletedChildTextures (bool)
virtual void  | SetPreviewCustomRenderMeshes (bool b)
void  | SetSaveCompressedTextureFiles (bool b)
virtual RDK_DEPRECATED void  | SetShowCustom (bool b)
virtual void  | SetShowDetailsPanel (bool b)
virtual RDK_DEPRECATED void  | SetShowDocuments (bool b)
virtual RDK_DEPRECATED void  | SetShowRenderContent (bool b)
void  | SetSmartMergeChoice (bool bIsPaste, RhRdkSmartMergeChoice smc)
virtual RDK_DEPRECATED void  | SetTextureSize (int size, bool bSendEvent=true)
virtual RDK_DEPRECATED void  | SetUseDefaultLibraryPath (bool bUseDefault)
virtual void  | SetUsePreviewCache (bool b)
virtual void  | SetUseQuickInitialPreview (bool b)
virtual RDK_DEPRECATED bool  | ShowCustom (void) const
virtual bool  | ShowDetailsPanel (void) const
virtual RDK_DEPRECATED bool  | ShowDocuments (void) const
virtual RDK_DEPRECATED bool  | ShowRenderContent (void) const
RhRdkSmartMergeChoice  | SmartMergeChoice (bool bIsPaste) const
virtual int  | TextureSize (void) const
virtual RDK_DEPRECATED bool  | UseDefaultLibraryPath (void) const
virtual bool  | UsePreview (void) const
virtual bool  | UsePreviewCache (void) const
virtual bool  | UseQuickInitialPreview (void) const
virtual bool  | UseRenderedPreview (void) const
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
size1
size2
size3
size4
size5
◆ eInitialLocation
 enum CRhRdkRendererSupportOptions::eInitialLocation
Enumerator
render_content
last_opened_folder
custom_folder
Constructor & Destructor Documentation
◆ CRhRdkRendererSupportOptions()
 CRhRdkRendererSupportOptions::CRhRdkRendererSupportOptions  |  ( |   | )
◆ ~CRhRdkRendererSupportOptions()
 virtual CRhRdkRendererSupportOptions::~CRhRdkRendererSupportOptions  |  ( |   | )
virtual
Member Function Documentation
◆ AdaptiveBakingQuality()
 int CRhRdkRendererSupportOptions::AdaptiveBakingQuality  |  ( |  void  |   | ) |   const
◆ AlwaysShowSunPreview()
 virtual bool CRhRdkRendererSupportOptions::AlwaysShowSunPreview  |  ( |  void  |   | ) |   const
virtual
◆ AlwaysUnpackEmbeddedFilesToTemp()
 bool CRhRdkRendererSupportOptions::AlwaysUnpackEmbeddedFilesToTemp  |  ( |  void  |   | ) |   const
◆ AutoSaveKeepAmount()
 virtual int CRhRdkRendererSupportOptions::AutoSaveKeepAmount  |  ( |  void  |   | ) |   const
virtual
◆ AutoSaveRenderings()
 virtual bool CRhRdkRendererSupportOptions::AutoSaveRenderings  |  ( |  void  |   | ) |   const
virtual
◆ BakingQueueThreads()
 int CRhRdkRendererSupportOptions::BakingQueueThreads  |  ( |  void  |   | ) |   const
◆ BlockContent_CustomPath()
 ON_wString CRhRdkRendererSupportOptions::BlockContent_CustomPath  |  ( |  void  |   | ) |   const
◆ BlockContent_CustomPathList()
 ON_wString CRhRdkRendererSupportOptions::BlockContent_CustomPathList  |  ( |  void  |   | ) |   const
◆ BlockContent_InitialLocation()
 eInitialLocation CRhRdkRendererSupportOptions::BlockContent_InitialLocation  |  ( |  void  |   | ) |   const
◆ BlockContent_InitialLocationCustomFolder()
 ON_wString CRhRdkRendererSupportOptions::BlockContent_InitialLocationCustomFolder  |  ( |  void  |   | ) |   const
◆ BlockContent_LastNavigatedFolder()
 ON_wString CRhRdkRendererSupportOptions::BlockContent_LastNavigatedFolder  |  ( |  void  |   | ) |   const
◆ BlockContent_SetCustomPath()
 void CRhRdkRendererSupportOptions::BlockContent_SetCustomPath  |  ( |  const wchar_t *  |  wszPath | )
◆ BlockContent_SetCustomPathList()
 void CRhRdkRendererSupportOptions::BlockContent_SetCustomPathList  |  ( |  const wchar_t *  |  wszPath | )
◆ BlockContent_SetInitialLocation()
 void CRhRdkRendererSupportOptions::BlockContent_SetInitialLocation  |  ( |  eInitialLocation  |  l | )
◆ BlockContent_SetInitialLocationCustomFolder()
 void CRhRdkRendererSupportOptions::BlockContent_SetInitialLocationCustomFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ BlockContent_SetLastNavigatedFolder()
 void CRhRdkRendererSupportOptions::BlockContent_SetLastNavigatedFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ BlockContent_SetShowBlockContent()
 void CRhRdkRendererSupportOptions::BlockContent_SetShowBlockContent  |  ( |  bool  |  b | )
◆ BlockContent_SetShowCustom()
 void CRhRdkRendererSupportOptions::BlockContent_SetShowCustom  |  ( |  bool  |  b | )
◆ BlockContent_SetShowDocuments()
 void CRhRdkRendererSupportOptions::BlockContent_SetShowDocuments  |  ( |  bool  |  b | )
◆ BlockContent_SetUseDefaultLocation()
 void CRhRdkRendererSupportOptions::BlockContent_SetUseDefaultLocation  |  ( |  bool  |  bUseDefault | )
◆ BlockContent_ShowBlockContent()
 bool CRhRdkRendererSupportOptions::BlockContent_ShowBlockContent  |  ( |  void  |   | ) |   const
◆ BlockContent_ShowCustom()
 bool CRhRdkRendererSupportOptions::BlockContent_ShowCustom  |  ( |  void  |   | ) |   const
◆ BlockContent_ShowDocuments()
 bool CRhRdkRendererSupportOptions::BlockContent_ShowDocuments  |  ( |  void  |   | ) |   const
◆ BlockContent_UseDefaultLocation()
 bool CRhRdkRendererSupportOptions::BlockContent_UseDefaultLocation  |  ( |  void  |   | ) |   const
◆ CheckSupportFilesBeforeRendering()
 virtual bool CRhRdkRendererSupportOptions::CheckSupportFilesBeforeRendering  |  ( |  void  |   | ) |   const
virtual
◆ CombineEditors()
 virtual bool CRhRdkRendererSupportOptions::CombineEditors  |  ( |  void  |   | ) |   const
virtual
◆ CombineSimilarTextures()
 bool CRhRdkRendererSupportOptions::CombineSimilarTextures  |  ( |  void  |   | ) |   const
◆ CustomLibraryPath()
 virtual RDK_DEPRECATED ON_wString CRhRdkRendererSupportOptions::CustomLibraryPath  |  ( |  void  |   | ) |   const
virtual
◆ CustomPaths()
 virtual RDK_DEPRECATED ON_wString CRhRdkRendererSupportOptions::CustomPaths  |  ( |  void  |   | ) |   const
virtual
◆ DarkPreviewCheckerColor()
 virtual COLORREF CRhRdkRendererSupportOptions::DarkPreviewCheckerColor  |  ( |  void  |   | ) |   const
virtual
◆ EmbedFilesDocumentDefault()
 bool CRhRdkRendererSupportOptions::EmbedFilesDocumentDefault  |  ( |  void  |   | ) |   const
◆ EnablePreviewJobLog()
 virtual bool CRhRdkRendererSupportOptions::EnablePreviewJobLog  |  ( |  void  |   | ) |   const
virtual
◆ EVF()
 virtual void* CRhRdkRendererSupportOptions::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
◆ FileExplorer_CustomPath()
 ON_wString CRhRdkRendererSupportOptions::FileExplorer_CustomPath  |  ( |  void  |   | ) |   const
◆ FileExplorer_CustomPathList()
 ON_wString CRhRdkRendererSupportOptions::FileExplorer_CustomPathList  |  ( |  void  |   | ) |   const
◆ FileExplorer_InitialLocation()
 eInitialLocation CRhRdkRendererSupportOptions::FileExplorer_InitialLocation  |  ( |  void  |   | ) |   const
◆ FileExplorer_InitialLocationCustomFolder()
 ON_wString CRhRdkRendererSupportOptions::FileExplorer_InitialLocationCustomFolder  |  ( |  void  |   | ) |   const
◆ FileExplorer_LastNavigatedFolder()
 ON_wString CRhRdkRendererSupportOptions::FileExplorer_LastNavigatedFolder  |  ( |  void  |   | ) |   const
◆ FileExplorer_SetCustomPath()
 void CRhRdkRendererSupportOptions::FileExplorer_SetCustomPath  |  ( |  const wchar_t *  |  wszPath | )
◆ FileExplorer_SetCustomPathList()
 void CRhRdkRendererSupportOptions::FileExplorer_SetCustomPathList  |  ( |  const wchar_t *  |  wszPath | )
◆ FileExplorer_SetInitialLocation()
 void CRhRdkRendererSupportOptions::FileExplorer_SetInitialLocation  |  ( |  eInitialLocation  |  l | )
◆ FileExplorer_SetInitialLocationCustomFolder()
 void CRhRdkRendererSupportOptions::FileExplorer_SetInitialLocationCustomFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ FileExplorer_SetLastNavigatedFolder()
 void CRhRdkRendererSupportOptions::FileExplorer_SetLastNavigatedFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ FileExplorer_SetShowCustom()
 void CRhRdkRendererSupportOptions::FileExplorer_SetShowCustom  |  ( |  bool  |  b | )
◆ FileExplorer_SetShowDocuments()
 void CRhRdkRendererSupportOptions::FileExplorer_SetShowDocuments  |  ( |  bool  |  b | )
◆ FileExplorer_SetShowRenderContent()
 void CRhRdkRendererSupportOptions::FileExplorer_SetShowRenderContent  |  ( |  bool  |  b | )
◆ FileExplorer_SetUseDefaultLocation()
 void CRhRdkRendererSupportOptions::FileExplorer_SetUseDefaultLocation  |  ( |  bool  |  bUseDefault | )
◆ FileExplorer_ShowCustom()
 bool CRhRdkRendererSupportOptions::FileExplorer_ShowCustom  |  ( |  void  |   | ) |   const
◆ FileExplorer_ShowDocuments()
 bool CRhRdkRendererSupportOptions::FileExplorer_ShowDocuments  |  ( |  void  |   | ) |   const
◆ FileExplorer_ShowRenderContent()
 bool CRhRdkRendererSupportOptions::FileExplorer_ShowRenderContent  |  ( |  void  |   | ) |   const
◆ FileExplorer_UseDefaultLocation()
 bool CRhRdkRendererSupportOptions::FileExplorer_UseDefaultLocation  |  ( |  void  |   | ) |   const
◆ GetLastSavedRenderFileExtension()
 ON_wString CRhRdkRendererSupportOptions::GetLastSavedRenderFileExtension  |  ( |  void  |   | ) |   const
◆ HarvestContentParameters()
 virtual bool CRhRdkRendererSupportOptions::HarvestContentParameters  |  ( |  void  |   | ) |   const
virtual
◆ LabelFormatLoc()
 virtual int CRhRdkRendererSupportOptions::LabelFormatLoc  |  ( |  void  |   | ) |   const
virtual
◆ LabelFormatUTC()
 virtual int CRhRdkRendererSupportOptions::LabelFormatUTC  |  ( |  void  |   | ) |   const
virtual
◆ Libraries_CustomPath()
 ON_wString CRhRdkRendererSupportOptions::Libraries_CustomPath  |  ( |  void  |   | ) |   const
◆ Libraries_CustomPathList()
 ON_wString CRhRdkRendererSupportOptions::Libraries_CustomPathList  |  ( |  void  |   | ) |   const
◆ Libraries_InitialLocation()
 eInitialLocation CRhRdkRendererSupportOptions::Libraries_InitialLocation  |  ( |  void  |   | ) |   const
◆ Libraries_InitialLocationCustomFolder()
 ON_wString CRhRdkRendererSupportOptions::Libraries_InitialLocationCustomFolder  |  ( |  void  |   | ) |   const
◆ Libraries_LastNavigatedFolder()
 ON_wString CRhRdkRendererSupportOptions::Libraries_LastNavigatedFolder  |  ( |  void  |   | ) |   const
◆ Libraries_SetCustomPath()
 void CRhRdkRendererSupportOptions::Libraries_SetCustomPath  |  ( |  const wchar_t *  |  wszPath | )
◆ Libraries_SetCustomPathList()
 void CRhRdkRendererSupportOptions::Libraries_SetCustomPathList  |  ( |  const wchar_t *  |  wszPath | )
◆ Libraries_SetInitialLocation()
 void CRhRdkRendererSupportOptions::Libraries_SetInitialLocation  |  ( |  eInitialLocation  |  l | )
◆ Libraries_SetInitialLocationCustomFolder()
 void CRhRdkRendererSupportOptions::Libraries_SetInitialLocationCustomFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ Libraries_SetLastNavigatedFolder()
 void CRhRdkRendererSupportOptions::Libraries_SetLastNavigatedFolder  |  ( |  const wchar_t *  |  wszPath | )
◆ Libraries_SetShowCustom()
 void CRhRdkRendererSupportOptions::Libraries_SetShowCustom  |  ( |  bool  |  b | )
◆ Libraries_SetShowDocuments()
 void CRhRdkRendererSupportOptions::Libraries_SetShowDocuments  |  ( |  bool  |  b | )
◆ Libraries_SetShowRenderContent()
 void CRhRdkRendererSupportOptions::Libraries_SetShowRenderContent  |  ( |  bool  |  b | )
◆ Libraries_SetUseDefaultLocation()
 void CRhRdkRendererSupportOptions::Libraries_SetUseDefaultLocation  |  ( |  bool  |  bUseDefault | )
◆ Libraries_ShowCustom()
 bool CRhRdkRendererSupportOptions::Libraries_ShowCustom  |  ( |  void  |   | ) |   const
◆ Libraries_ShowDocuments()
 bool CRhRdkRendererSupportOptions::Libraries_ShowDocuments  |  ( |  void  |   | ) |   const
◆ Libraries_ShowRenderContent()
 bool CRhRdkRendererSupportOptions::Libraries_ShowRenderContent  |  ( |  void  |   | ) |   const
◆ Libraries_UseDefaultLocation()
 bool CRhRdkRendererSupportOptions::Libraries_UseDefaultLocation  |  ( |  void  |   | ) |   const
◆ LibrariesInitialLocation()
 virtual RDK_DEPRECATED eInitialLocation CRhRdkRendererSupportOptions::LibrariesInitialLocation  |  ( |  void  |   | ) |   const
virtual
◆ LibrariesInitialLocationCustomFolder()
 virtual RDK_DEPRECATED ON_wString CRhRdkRendererSupportOptions::LibrariesInitialLocationCustomFolder  |  ( |  void  |   | ) |   const
virtual
◆ LightPreviewCheckerColor()
 virtual COLORREF CRhRdkRendererSupportOptions::LightPreviewCheckerColor  |  ( |  void  |   | ) |   const
virtual
◆ MaxDynamicIconCacheMB()
 virtual_su int CRhRdkRendererSupportOptions::MaxDynamicIconCacheMB  |  ( |  void  |   | ) |   const
◆ MaxPreviewCacheMB()
 virtual int CRhRdkRendererSupportOptions::MaxPreviewCacheMB  |  ( |  void  |   | ) |   const
virtual
◆ MaxPreviewSeconds()
 virtual int CRhRdkRendererSupportOptions::MaxPreviewSeconds  |  ( |  void  |   | ) |   const
virtual
◆ MultithreadedTextureEvaluation()
 virtual bool CRhRdkRendererSupportOptions::MultithreadedTextureEvaluation  |  ( |  void  |   | ) |   const
virtual
◆ NeverEmbedFiles()
 bool CRhRdkRendererSupportOptions::NeverEmbedFiles  |  ( |  void  |   | ) |   const
◆ PopulateAdvancedOptions()
 void CRhRdkRendererSupportOptions::PopulateAdvancedOptions  |  ( |  void  |   | ) |   const
◆ PreferNativeRenderer()
 virtual bool CRhRdkRendererSupportOptions::PreferNativeRenderer  |  ( |  void  |   | ) |   const
virtual
◆ PreferredUnpackFolder()
 virtual ON_wString CRhRdkRendererSupportOptions::PreferredUnpackFolder  |  ( |  void  |   | ) |   const
virtual
◆ PreserveDeletedChildTextures()
 bool CRhRdkRendererSupportOptions::PreserveDeletedChildTextures  |  ( |  void  |   | ) |   const
◆ PreviewCustomRenderMeshes()
 virtual bool CRhRdkRendererSupportOptions::PreviewCustomRenderMeshes  |  ( |  void  |   | ) |   const
virtual
◆ SaveCompressedTextureFiles()
 bool CRhRdkRendererSupportOptions::SaveCompressedTextureFiles  |  ( |  void  |   | ) |   const
◆ SetAdaptiveBakingQuality()
 void CRhRdkRendererSupportOptions::SetAdaptiveBakingQuality  |  ( |  int  |   | )
◆ SetAlwaysShowSunPreview()
 virtual void CRhRdkRendererSupportOptions::SetAlwaysShowSunPreview  |  ( |  bool  |  b | )
virtual
◆ SetAlwaysUnpackEmbeddedFilesToTemp()
 void CRhRdkRendererSupportOptions::SetAlwaysUnpackEmbeddedFilesToTemp  |  ( |  bool  |  b | )
◆ SetAutoSaveKeepAmount()
 virtual void CRhRdkRendererSupportOptions::SetAutoSaveKeepAmount  |  ( |  int  |  value | )
virtual
◆ SetAutoSaveRenderings()
 virtual void CRhRdkRendererSupportOptions::SetAutoSaveRenderings  |  ( |  bool  |  b | )
virtual
◆ SetBakingQueueThreads()
 void CRhRdkRendererSupportOptions::SetBakingQueueThreads  |  ( |  int  |   | )
◆ SetCheckSupportFilesBeforeRendering()
 virtual void CRhRdkRendererSupportOptions::SetCheckSupportFilesBeforeRendering  |  ( |  bool  |  b | )
virtual
◆ SetCombineEditors()
 virtual void CRhRdkRendererSupportOptions::SetCombineEditors  |  ( |  bool  |  b | )
virtual
◆ SetCombineSimilarTextures()
 void CRhRdkRendererSupportOptions::SetCombineSimilarTextures  |  ( |  bool  |  b | )
◆ SetCustomLibraryPath()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetCustomLibraryPath  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetCustomPaths()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetCustomPaths  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetEmbedFilesDocumentDefault()
 void CRhRdkRendererSupportOptions::SetEmbedFilesDocumentDefault  |  ( |  bool  |  b | )
◆ SetHarvestContentParameters()
 virtual void CRhRdkRendererSupportOptions::SetHarvestContentParameters  |  ( |  bool  |  b | )
virtual
◆ SetLabelFormatLoc()
 virtual void CRhRdkRendererSupportOptions::SetLabelFormatLoc  |  ( |  int  |  value | )
virtual
◆ SetLabelFormatUTC()
 virtual void CRhRdkRendererSupportOptions::SetLabelFormatUTC  |  ( |  int  |  value | )
virtual
◆ SetLastSavedRenderFileExtension()
 void CRhRdkRendererSupportOptions::SetLastSavedRenderFileExtension  |  ( |  const wchar_t *  |  wszExt | )
◆ SetLibrariesInitialLocation()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetLibrariesInitialLocation  |  ( |  eInitialLocation  |  l | )
virtual
◆ SetLibrariesInitialLocationCustomFolder()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetLibrariesInitialLocationCustomFolder  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetMultithreadedTextureEvaluation()
 virtual void CRhRdkRendererSupportOptions::SetMultithreadedTextureEvaluation  |  ( |  bool  |  b | )
virtual
◆ SetNeverEmbedFiles()
 void CRhRdkRendererSupportOptions::SetNeverEmbedFiles  |  ( |  bool  |  b | )
◆ SetPreferNativeRenderer()
 virtual void CRhRdkRendererSupportOptions::SetPreferNativeRenderer  |  ( |  bool  |  b | )
virtual
◆ SetPreferredUnpackFolder()
 virtual void CRhRdkRendererSupportOptions::SetPreferredUnpackFolder  |  ( |  const wchar_t *  |  wszPath | )
virtual
◆ SetPreserveDeletedChildTextures()
 void CRhRdkRendererSupportOptions::SetPreserveDeletedChildTextures  |  ( |  bool  |   | )
◆ SetPreviewCustomRenderMeshes()
 virtual void CRhRdkRendererSupportOptions::SetPreviewCustomRenderMeshes  |  ( |  bool  |  b | )
virtual
◆ SetSaveCompressedTextureFiles()
 void CRhRdkRendererSupportOptions::SetSaveCompressedTextureFiles  |  ( |  bool  |  b | )
◆ SetShowCustom()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetShowCustom  |  ( |  bool  |  b | )
virtual
◆ SetShowDetailsPanel()
 virtual void CRhRdkRendererSupportOptions::SetShowDetailsPanel  |  ( |  bool  |  b | )
virtual
◆ SetShowDocuments()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetShowDocuments  |  ( |  bool  |  b | )
virtual
◆ SetShowRenderContent()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetShowRenderContent  |  ( |  bool  |  b | )
virtual
◆ SetSmartMergeChoice()
 void CRhRdkRendererSupportOptions::SetSmartMergeChoice  |  ( |  bool  |  bIsPaste,
|  RhRdkSmartMergeChoice  |  smc
)
◆ SetTextureSize()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetTextureSize  |  ( |  int  |  size,
|  bool  |  bSendEvent = true
)
virtual
◆ SetUseDefaultLibraryPath()
 virtual RDK_DEPRECATED void CRhRdkRendererSupportOptions::SetUseDefaultLibraryPath  |  ( |  bool  |  bUseDefault | )
virtual
◆ SetUsePreviewCache()
 virtual void CRhRdkRendererSupportOptions::SetUsePreviewCache  |  ( |  bool  |  b | )
virtual
◆ SetUseQuickInitialPreview()
 virtual void CRhRdkRendererSupportOptions::SetUseQuickInitialPreview  |  ( |  bool  |  b | )
virtual
◆ ShowCustom()
 virtual RDK_DEPRECATED bool CRhRdkRendererSupportOptions::ShowCustom  |  ( |  void  |   | ) |   const
virtual
◆ ShowDetailsPanel()
 virtual bool CRhRdkRendererSupportOptions::ShowDetailsPanel  |  ( |  void  |   | ) |   const
virtual
◆ ShowDocuments()
 virtual RDK_DEPRECATED bool CRhRdkRendererSupportOptions::ShowDocuments  |  ( |  void  |   | ) |   const
virtual
◆ ShowRenderContent()
 virtual RDK_DEPRECATED bool CRhRdkRendererSupportOptions::ShowRenderContent  |  ( |  void  |   | ) |   const
virtual
◆ SmartMergeChoice()
 RhRdkSmartMergeChoice CRhRdkRendererSupportOptions::SmartMergeChoice  |  ( |  bool  |  bIsPaste | ) |   const
◆ TextureSize()
 virtual int CRhRdkRendererSupportOptions::TextureSize  |  ( |  void  |   | ) |   const
virtual
◆ UseDefaultLibraryPath()
 virtual RDK_DEPRECATED bool CRhRdkRendererSupportOptions::UseDefaultLibraryPath  |  ( |  void  |   | ) |   const
virtual
◆ UsePreview()
 virtual bool CRhRdkRendererSupportOptions::UsePreview  |  ( |  void  |   | ) |   const
virtual
◆ UsePreviewCache()
 virtual bool CRhRdkRendererSupportOptions::UsePreviewCache  |  ( |  void  |   | ) |   const
virtual
◆ UseQuickInitialPreview()
 virtual bool CRhRdkRendererSupportOptions::UseQuickInitialPreview  |  ( |  void  |   | ) |   const
virtual
◆ UseRenderedPreview()
 virtual bool CRhRdkRendererSupportOptions::UseRenderedPreview  |  ( |  void  |   | ) |   const
virtual