Public Member Functions | Protected Member Functions | List of all members
CRhinoSkinDLLEx Class Referenceabstract
Rhino
#include <rhinoSdkSkinDll.h>
 Inheritance diagram for CRhinoSkinDLLEx:
 Public Member Functions
CRhinoSkinDLLEx ()
virtual void  | OnBeginLoadPlugins (int expected_count)=0
virtual void  | OnInitIntanceEvent (int event_id, const wchar_t *description)=0
virtual void  | OnRhinoAbout ()
Default implementation calls ShowSplash(true) More...
 Public Member Functions inherited from CRhinoSkinDLL
CRhinoSkinDLL ()
virtual  | ~CRhinoSkinDLL ()
virtual const wchar_t *  | ApplicationName ()=0
virtual HICON  | MainRhinoIcon ()=0
virtual HMENU  | MainRhinoMenu ()
virtual void  | ShowSplash (bool bShow)=0
virtual UUID  | SkinPlugInID ()=0
 Protected Member Functions
CRhinoSkinDLLEx (const CRhinoSkinDLLEx &)
Not implemented, do not use. More...
const CRhinoSkinDLLEx &  | operator= (const CRhinoSkinDLLEx &)
Not implemented, do not use. More...
 Protected Member Functions inherited from CRhinoSkinDLL
CRhinoSkinDLL (const CRhinoSkinDLL &)
Not implemented, do not use. More...
const CRhinoSkinDLL &  | operator= (const CRhinoSkinDLL &)
Not implemented, do not use. More...
Constructor & Destructor Documentation
◆ CRhinoSkinDLLEx() [1/2]
 CRhinoSkinDLLEx::CRhinoSkinDLLEx  |  ( |   | )
◆ CRhinoSkinDLLEx() [2/2]
 CRhinoSkinDLLEx::CRhinoSkinDLLEx  |  ( |  const CRhinoSkinDLLEx &  |   | )
protected
Not implemented, do not use.
Member Function Documentation
◆ OnBeginLoadPlugins()
 virtual void CRhinoSkinDLLEx::OnBeginLoadPlugins  |  ( |  int  |  expected_count | )
pure virtual
◆ OnInitIntanceEvent()
 virtual void CRhinoSkinDLLEx::OnInitIntanceEvent  |  ( |  int  |  event_id,
|  const wchar_t *  |  description
)
pure virtual
1000 = License manager check complete 2000 = MainWindowCreated 3000 = Builtin Commands Registered 4000 = Begin Load Plug-In 5000 = End Load Plug-In
◆ OnRhinoAbout()
 virtual void CRhinoSkinDLLEx::OnRhinoAbout  |  ( |   | )
virtual
Default implementation calls ShowSplash(true)
◆ operator=()
 const CRhinoSkinDLLEx& CRhinoSkinDLLEx::operator=  |  ( |  const CRhinoSkinDLLEx &  |   | )
protected
Not implemented, do not use.