Public Member Functions | Protected Member Functions | List of all members
CRhinoUiTabCtrl Class Reference
RhinoUI
CRhinoUiTabCtrl. More...
#include <RhinoSdkUiTabCtrl.h>
 Inheritance diagram for CRhinoUiTabCtrl:
 Public Member Functions
CRhinoUiTabCtrl ()
virtual  | ~CRhinoUiTabCtrl ()
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnNcPaint ()
 Protected Member Functions
virtual void  | PreSubclassWindow ()
Detailed Description
CRhinoUiTabCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiTabCtrl()
 CRhinoUiTabCtrl::CRhinoUiTabCtrl  |  ( |   | )
◆ ~CRhinoUiTabCtrl()
 virtual CRhinoUiTabCtrl::~CRhinoUiTabCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ DrawItem()
 virtual void CRhinoUiTabCtrl::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
virtual
◆ OnCreate()
 afx_msg int CRhinoUiTabCtrl::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiTabCtrl::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnNcPaint()
 afx_msg void CRhinoUiTabCtrl::OnNcPaint  |  ( |   | )
◆ PreSubclassWindow()
 virtual void CRhinoUiTabCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
Reimplemented in CRhinoUiTabPageCtrl.