Static Public Member Functions | List of all members
ON_TextContext Class Reference
OpenNURBS
#include <opennurbs_textcontext.h>
 Static Public Member Functions
static int  | ConvertCodepointsToString (int cplen, const ON__UINT32 *cp, ON_wString &str)
Use ON_FontGlyph::GetGlyphList to measure strings. More...
static int  | ConvertStringToCodepoints (const wchar_t *str, ON__UINT32 *&cp)
static const ON_wString  | FormatRtfString (const wchar_t *rtfstr, const ON_DimStyle *dimstyle, bool clear_bold, bool set_bold, bool clear_italic, bool set_italic, bool clear_underline, bool set_underline, bool clear_facename, bool set_facename, const wchar_t *override_facename)
static bool  | RtfFirstCharProperties (const wchar_t *rtfstr, bool &bold, bool &italic, bool &underline, ON_wString &facename)
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Function Documentation
◆ ConvertCodepointsToString()
 static int ON_TextContext::ConvertCodepointsToString  |  ( |  int  |  cplen,
|  const ON__UINT32 *  |  cp,
|  ON_wString &  |  str
)
static
Use ON_FontGlyph::GetGlyphList to measure strings.
◆ ConvertStringToCodepoints()
 static int ON_TextContext::ConvertStringToCodepoints  |  ( |  const wchar_t *  |  str,
|  ON__UINT32 *&  |  cp
)
static
◆ FormatRtfString()
 static const ON_wString ON_TextContext::FormatRtfString  |  ( |  const wchar_t *  |  rtfstr,
|  const ON_DimStyle *  |  dimstyle,
|  bool  |  clear_bold,
|  bool  |  set_bold,
|  bool  |  clear_italic,
|  bool  |  set_italic,
|  bool  |  clear_underline,
|  bool  |  set_underline,
|  bool  |  clear_facename,
|  bool  |  set_facename,
|  const wchar_t *  |  override_facename
)
static
◆ RtfFirstCharProperties()
 static bool ON_TextContext::RtfFirstCharProperties  |  ( |  const wchar_t *  |  rtfstr,
|  bool &  |  bold,
|  bool &  |  italic,
|  bool &  |  underline,
|  ON_wString &  |  facename
)
static