Public Member Functions | List of all members
CRhRdkFileDialogFilter Class Reference
RDK
#include <RhRdkFileDialogFilter.h>
 Inheritance diagram for CRhRdkFileDialogFilter:
 Public Member Functions
CRhRdkFileDialogFilter ()
virtual  | ~CRhRdkFileDialogFilter ()
virtual void  | Add (const ON_wString &sName, const ON_wString &sFriendlyPattern, const wchar_t *wszPattern=nullptr)
virtual const wchar_t *  | Buffer (bool bConvertBars=true) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkFileDialogFilter()
 CRhRdkFileDialogFilter::CRhRdkFileDialogFilter  |  ( |   | )
◆ ~CRhRdkFileDialogFilter()
 virtual CRhRdkFileDialogFilter::~CRhRdkFileDialogFilter  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 virtual void CRhRdkFileDialogFilter::Add  |  ( |  const ON_wString &  |  sName,
|  const ON_wString &  |  sFriendlyPattern,
|  const wchar_t *  |  wszPattern = nullptr
)
virtual
Add a filter to the collection.
Parameters
sName | is the localized name. e.g., "JPEG File"
sFriendlyPattern | is the human-readable pattern. e.g., "*.jpg, *.jpeg" Parentheses are added automatically.
wszPattern | is the optional machine-readable pattern. e.g., "*.jpg;*.jpeg" If null, uses sFriendlyPattern.
◆ Buffer()
 virtual const wchar_t* CRhRdkFileDialogFilter::Buffer  |  ( |  bool  |  bConvertBars = true | ) |   const
virtual
Get output for use in CFileDialog() or CFileDialog::m_ofn.lpstrFilter.
Parameters
bConvertBars | is true to convert bars (|) to zeroes, false to leave bars intact. Typically you will pass false to use the result as the constructor param for CFileDialog, and true when using CFileDialog::m_ofn.lpstrFilter.