Public Member Functions | List of all members
CRhinoUuidCollection Class Reference
Rhino
#include <rhinoSdkEventWatcher.h>
 Inheritance diagram for CRhinoUuidCollection:
 Public Member Functions
CRhinoUuidCollection ()
CRhinoUuidCollection (const CRhinoUuidCollection &src)
CRhinoUuidCollection (int capacity)
~CRhinoUuidCollection ()
bool  | AddUuid (ON_UUID uuid, bool bCheckForDupicates=true)
int  | Count () const
void  | Empty ()
bool  | FindUuid (ON_UUID uuid) const
CRhinoUuidCollection &  | operator= (CRhinoUuidCollection &src)
bool  | RemoveUuid (ON_UUID uuid)
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: The CRhinoUuidCollection class provides a tool to efficiently maintain a collection of uuids and determine if a uuid is in the collection. This class is useful when an event watcher needs to watch for events happening to a specific object.
Constructor & Destructor Documentation
◆ CRhinoUuidCollection() [1/3]
 CRhinoUuidCollection::CRhinoUuidCollection  |  ( |   | )
◆ CRhinoUuidCollection() [2/3]
 CRhinoUuidCollection::CRhinoUuidCollection  |  ( |  int  |  capacity | )
◆ ~CRhinoUuidCollection()
 CRhinoUuidCollection::~CRhinoUuidCollection  |  ( |   | )
◆ CRhinoUuidCollection() [3/3]
 CRhinoUuidCollection::CRhinoUuidCollection  |  ( |  const CRhinoUuidCollection &  |  src | )
Member Function Documentation
◆ AddUuid()
 bool CRhinoUuidCollection::AddUuid  |  ( |  ON_UUID  |  uuid,
|  bool  |  bCheckForDupicates = true
)
Description: Adds a uuid to the collection. Parameters: uuid - [in] id to add. bCheckForDupicates - [in] if true, then the uuid is not added if it is already in the collection. If you know uuid is not in the collection or you don't care about dupicates, and you are going to have a large collection of uuids, then setting bCheckForDupicates=false will speed up the addition of uuids. Returns: True if uuid was added. False if uuid was not added because it is already in the collection.
◆ Count()
 int CRhinoUuidCollection::Count  |  ( |   | ) |   const
Returns: Number of active uuids in the collection.
◆ Empty()
 void CRhinoUuidCollection::Empty  |  ( |   | )
Description: Provides an efficient way to empty a collection so that it can be used again.
◆ FindUuid()
 bool CRhinoUuidCollection::FindUuid  |  ( |  ON_UUID  |  uuid | ) |   const
Description: Determine if a uuid is in the collection. Returns: True if uuid is in the collection.
◆ operator=()
 CRhinoUuidCollection& CRhinoUuidCollection::operator=  |  ( |  CRhinoUuidCollection &  |  src | )
◆ RemoveUuid()
 bool CRhinoUuidCollection::RemoveUuid  |  ( |  ON_UUID  |  uuid | )
Description: Adds a uuid to the collection. Parameters: uuid - [in] id to remove Returns: True if uuid was in collection and was removed. False if uuid was not in the collection.