Public Member Functions | Public Attributes | List of all members
ON_CurveRegionBoundaryElement Class Reference
OpenNURBS
#include <opennurbs_hatch.h>
 Public Member Functions
ON_CurveRegionBoundaryElement ()
ON_CurveRegionBoundaryElement (const ON_CurveRegionBoundaryElement &src)
~ON_CurveRegionBoundaryElement ()
ON_CurveRegionBoundaryElement &  | operator= (const ON_CurveRegionBoundaryElement &src)
 Public Attributes
bool  | m_bReversed
int  | m_curve_id
ON_Interval  | m_subdomain
Detailed Description
Part of a boundary. An element has a curve subdomain and a flag to say whether that piece of curve should be reversed
Constructor & Destructor Documentation
◆ ON_CurveRegionBoundaryElement() [1/2]
 ON_CurveRegionBoundaryElement::ON_CurveRegionBoundaryElement  |  ( |   | )
◆ ON_CurveRegionBoundaryElement() [2/2]
 ON_CurveRegionBoundaryElement::ON_CurveRegionBoundaryElement  |  ( |  const ON_CurveRegionBoundaryElement &  |  src | )
◆ ~ON_CurveRegionBoundaryElement()
 ON_CurveRegionBoundaryElement::~ON_CurveRegionBoundaryElement  |  ( |   | )
Member Function Documentation
◆ operator=()
 ON_CurveRegionBoundaryElement& ON_CurveRegionBoundaryElement::operator=  |  ( |  const ON_CurveRegionBoundaryElement &  |  src | )
Member Data Documentation
◆ m_bReversed
 bool ON_CurveRegionBoundaryElement::m_bReversed
◆ m_curve_id
 int ON_CurveRegionBoundaryElement::m_curve_id
◆ m_subdomain
 ON_Interval ON_CurveRegionBoundaryElement::m_subdomain