Public Member Functions | Protected Attributes | List of all members
CRhRdkEnterModeBase Class Referenceabstract
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkEnterModeBase:
 Public Member Functions
CRhRdkEnterModeBase ()
virtual  | ~CRhRdkEnterModeBase ()=0
 Protected Attributes
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkEnterModeBase()
 CRhRdkEnterModeBase::CRhRdkEnterModeBase  |  ( |   | )
◆ ~CRhRdkEnterModeBase()
 virtual CRhRdkEnterModeBase::~CRhRdkEnterModeBase  |  ( |   | )
pure virtual
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkEnterModeBase::m_pImpl
protected