Public Member Functions | Static Public Attributes | List of all members
CRhinoUiColorButton Class Reference
RhinoUI
#include <RhinoSdkUiColorButton.h>
 Inheritance diagram for CRhinoUiColorButton:
 Public Member Functions
CRhinoUiColorButton ()
virtual  | ~CRhinoUiColorButton ()
COLORREF  | Color ()
HPALETTE  | ColorPalette ()
void  | Initialize (COLORREF color=::GetSysColor(COLOR_BTNFACE), HPALETTE hPalette=0, bool bSuppressTextWhenEnabled=true)
virtual bool  | OnButtonClicked ()
virtual bool  | OnColorButtonClicked ()
CRhinoUiButton override. More...
void  | SetColor (COLORREF cr)
void  | SetColor (const unsigned char r, const unsigned char g, const unsigned char b)
void  | SetColorPalette (HPALETTE hp)
 Public Member Functions inherited from CRhinoUiButton
CRhinoUiButton ()
virtual  | ~CRhinoUiButton ()
COLORREF  | ButtonColor () const
bool  | ButtonIsHot () const
void  | DrawButtonBitmap (CDC &dc, CRect r)
bool  | DrawButtonFrame () const
void  | DrawButtonText (CDC &dc, CRect rText)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
CImageList *  | GetImageList (image_list il) const
CSize  | GetImageListImageSize (image_list il) const
int  | GetImageListIndex (image_list il) const
const wchar_t *  | GetToolTipText () const
bool  | IsBitmapButton () const
bool  | IsColorButton () const
bool  | IsMenuButton () const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
void  | OnCustomMouseButtonDown ()
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
Event handlers. More...
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnMButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnRButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnRButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnTimer (UINT_PTR nIDEvent)
void  | SetButtonColor (COLORREF cr=ON_UNSET_COLOR)
CImageList *  | SetImageList (CImageList *pImageList, image_list il)
int  | SetImageListIndex (int iIndex, image_list il)
bool  | SetIsMenuButton (bool b)
bool  | SetSuppressButtonFrameWhenNotHot (bool b)
void  | SetSuppressTextWhenEnabled (bool b)
void  | SetToolTipText (const wchar_t *lpsTip)
bool  | SuppressButtonFrameWhenNotHot () const
bool  | SuppressTextWhenEnabled () const
 Static Public Attributes
static const UINT  | m_on_button_clicked_msg_id
 Static Public Attributes inherited from CRhinoUiButton
static const UINT  | m_on_color_changed_msg_id
static const UINT  | m_on_menu_button_down
static const UINT  | m_on_mouse_button_down
 Additional Inherited Members
 Public Types inherited from CRhinoUiButton
enum  | image_list { il_normal = 0, il_disabled, force_32bit_image_list = 0xFFFFFFFF }
enum  | mouse_down_button { mdb_left = 0, mdb_right, mdb_middle }
 Public Attributes inherited from CRhinoUiButton
class CRhUiButtonExtension *  | m__button_sdk_extension
 Protected Types inherited from CRhinoUiButton
enum  | {
 tool_tip_timer = 100, tool_tip_cleanup_timer = 101, tool_tip_cleanup_delay = 500, track_mode_no_track = 0,
 track_mode_no_button_down = 1, track_mode_lbutton_down = 2, track_mode_mbutton_down = 3, track_mode_rbutton_down = 4,
 force_32bit_button = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiButton
void  | EndTracking ()
void  | EndTrackToolTip ()
bool  | MakeOwnerDraw ()
bool  | MouseOkToDisplayToolTip ()
bool  | MouseOverThisButton ()
virtual BOOL32  | OnChildNotify (UINT message, WPARAM wParam, LPARAM lParam, LRESULT *pLResult)
bool  | OnMouseButtonDown (mouse_down_button mdb, UINT nFlags, CPoint point)
bool  | OnMouseButtonUp (mouse_down_button mdb, UINT nFlags, CPoint point)
virtual void  | PreSubclassWindow ()
CWnd overrides. More...
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
bool  | StartTracking ()
bool  | ToolTipIsVisible () const
bool  | TrackToolTip (bool bShow, LPRECT lpR)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes inherited from CRhinoUiButton
bool  | m_bIsMenuButton
bool  | m_bSuppressButtonFrameWhenNotHot
bool  | m_bSuppressTextWhenEnabled
COLORREF  | m_crButton
Color button properties. More...
CImageList *  | m_image_list_disabled
int  | m_image_list_disabled_index
CImageList *  | m_image_list_normal
Bitmap button properties. More...
int  | m_image_list_normal_index
CSize  | m_image_size_disabled
CSize  | m_image_size_normal
CRect  | m_rToolTip
int  | m_track_mode
Tooltip. More...
bool  | m_traking_over_button
ON_wString  | m_wToolTip
 Static Protected Attributes inherited from CRhinoUiButton
static CRhinoUiToolTip  | m_tooltip
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// CRhinoUiColorButton
This class is provided strictly for backwards compatibility
Constructor & Destructor Documentation
◆ CRhinoUiColorButton()
 CRhinoUiColorButton::CRhinoUiColorButton  |  ( |   | )
◆ ~CRhinoUiColorButton()
 virtual CRhinoUiColorButton::~CRhinoUiColorButton  |  ( |   | )
virtual
Member Function Documentation
◆ Color()
 COLORREF CRhinoUiColorButton::Color  |  ( |   | )
◆ ColorPalette()
 HPALETTE CRhinoUiColorButton::ColorPalette  |  ( |   | )
◆ Initialize()
 void CRhinoUiColorButton::Initialize  |  ( |  COLORREF  |  color = ::GetSysColor(COLOR_BTNFACE),
|  HPALETTE  |  hPalette = 0,
|  bool  |  bSuppressTextWhenEnabled = true
)
◆ OnButtonClicked()
 virtual bool CRhinoUiColorButton::OnButtonClicked  |  ( |   | )
virtual
Reimplemented in CRhinoColorButton.
◆ OnColorButtonClicked()
 virtual bool CRhinoUiColorButton::OnColorButtonClicked  |  ( |   | )
virtual
CRhinoUiButton override.
Reimplemented from CRhinoUiButton.
◆ SetColor() [1/2]
 void CRhinoUiColorButton::SetColor  |  ( |  COLORREF  |  cr | )
◆ SetColor() [2/2]
 void CRhinoUiColorButton::SetColor  |  ( |  const unsigned char  |  r,
|  const unsigned char  |  g,
|  const unsigned char  |  b
)
◆ SetColorPalette()
 void CRhinoUiColorButton::SetColorPalette  |  ( |  HPALETTE  |  hp | )
Member Data Documentation
◆ m_on_button_clicked_msg_id
 const UINT CRhinoUiColorButton::m_on_button_clicked_msg_id
static
Use ON_REGISTERED_MESSAGE( CRhinoUiColorButton::m_on_button_clicked_msg_id, OnRhinoUiColorButtonClicked) macro to get button click notification. The WPARAM and LPARAM are the same as BN_CLICKED notification.