Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
CRhinoDisplayAttrsMgr Class Reference
Rhino
#include <RhinoSdkDisplayAttrsMgr.h>
 Public Member Functions
virtual  | ~CRhinoDisplayAttrsMgr (void)
 Static Public Member Functions
static bool  | AddDisplayAttrs (const CDisplayPipelineAttributes &, bool bSupportsShadeCmd, bool bSupportsShading, bool bAddToMenu)
static DisplayAttrsMgrListDesc *  | AddNewEntry (const wchar_t *local_name)
static const ON_UUID  | AmbientOcclusionModeId ()
static DisplayAttrsMgrListDesc *  | AppendNewEntry (bool bSupportsShadeCmd, bool bSupportsShading, bool bAddToMenu)
static DisplayAttrsMgrListDesc *  | AppendNewEntry (void)
static const ON_UUID  | ArchitectureModeId ()
static const ON_UUID  | ArtisticModeId ()
static DisplayAttrsMgrListDesc *  | CopyExistingEntry (ON_UUID id, const wchar_t *local_name)
static DisplayAttrsMgrListDesc *  | CreateDuplicateAttrs (const DisplayAttrsMgrListDesc &)
static DisplayAttrsMgrListDesc *  | CreateNewAttrs (const ON_wString &Name, const ON_UUID &DerivedFrom)
static const CDisplayPipelineAttributes *  | FindDisplayAttrs (const ON_UUID &)
static DisplayAttrsMgrListDesc *  | FindDisplayAttrsDesc (const ON_UUID &)
static DisplayAttrsMgrListDesc *  | FindDisplayAttrsDesc (const wchar_t *local_name)
static void  | FormatValidDisplayName (ON_wString &sName)
static int  | GetDisplayAttrsList (DisplayAttrsMgrList &)
static int  | GetShadedDisplayAttrsList (DisplayAttrsMgrList &)
static double  | GetWireZBias (void)
static const ON_UUID  | GhostedModeId ()
static const CDisplayPipelineAttributes *  | IntGDIWireframeAttrs (void)
static const CDisplayPipelineAttributes *  | IntOGLWireframeAttrs (void)
static const CDisplayPipelineAttributes *  | IntShadedAttrs (void)
static bool  | IsBuiltInAttributes (const CDisplayPipelineAttributes *)
static bool  | IsInternalAttributes (const CDisplayPipelineAttributes *)
static bool  | IsModified (void)
static bool  | IsTechnicalMode (const CDisplayPipelineAttributes *)
static void  | LoadProfile (CRhinoProfileContext &)
load from registry More...
static const ON_UUID  | MonochromeModeId ()
static const ON_UUID  | PenModeId ()
static const wchar_t *  | ProfileSection ()
static const ON_UUID  | RaytracedModeId ()
static bool  | RemoveEntry (const ON_UUID &)
static const ON_UUID  | RenderedModeId ()
static const ON_UUID  | RenderedShadowsModeId ()
static void  | SaveProfile (CRhinoProfileContext &)
save in registry More...
static void  | SetIsModified (bool)
static void  | SetWireZBias (double)
static const ON_UUID  | ShadedModeId ()
static const CDisplayPipelineAttributes *  | StdArchitectureAttrs (void)
static const CDisplayPipelineAttributes *  | StdArcticAttrs (void)
static const CDisplayPipelineAttributes *  | StdArtisticAttrs (void)
static const CDisplayPipelineAttributes *  | StdGhostedAttrs (void)
static const CDisplayPipelineAttributes *  | StdMonochromeAttrs (void)
static const CDisplayPipelineAttributes *  | StdPenAttrs (void)
static const CDisplayPipelineAttributes *  | StdRaytracedAttrs (void)
static const CDisplayPipelineAttributes *  | StdRenderedAttrs (void)
static const CDisplayPipelineAttributes *  | StdRenderedShadowsAttrs (void)
static const CDisplayPipelineAttributes *  | StdShadedAttrs (void)
static const CDisplayPipelineAttributes *  | StdTechAttrs (void)
static const CDisplayPipelineAttributes *  | StdWireframeAttrs (void)
static const CDisplayPipelineAttributes *  | StdXrayAttrs (void)
static const ON_UUID  | TechModeId ()
static bool  | UpdateAttributes (const DisplayAttrsMgrListDesc &)
static void  | UpdateReferencedPipelines (void)
static const ON_UUID  | WireframeModeId ()
static const ON_UUID  | XRayModeId ()
 Static Public Attributes
static int  | m_nMajor
static int  | m_nMinor
Constructor & Destructor Documentation
◆ ~CRhinoDisplayAttrsMgr()
 virtual CRhinoDisplayAttrsMgr::~CRhinoDisplayAttrsMgr  |  ( |  void  |   | )
virtual
Member Function Documentation
◆ AddDisplayAttrs()
 static bool CRhinoDisplayAttrsMgr::AddDisplayAttrs  |  ( |  const CDisplayPipelineAttributes &  |  ,
|  bool  |  bSupportsShadeCmd,
|  bool  |  bSupportsShading,
|  bool  |  bAddToMenu
)
static
◆ AddNewEntry()
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::AddNewEntry  |  ( |  const wchar_t *  |  local_name | )
static
◆ AmbientOcclusionModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::AmbientOcclusionModeId  |  ( |   | )
static
◆ AppendNewEntry() [1/2]
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::AppendNewEntry  |  ( |  bool  |  bSupportsShadeCmd,
|  bool  |  bSupportsShading,
|  bool  |  bAddToMenu
)
static
◆ AppendNewEntry() [2/2]
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::AppendNewEntry  |  ( |  void  |   | )
static
◆ ArchitectureModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::ArchitectureModeId  |  ( |   | )
static
◆ ArtisticModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::ArtisticModeId  |  ( |   | )
static
◆ CopyExistingEntry()
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::CopyExistingEntry  |  ( |  ON_UUID  |  id,
|  const wchar_t *  |  local_name
)
static
◆ CreateDuplicateAttrs()
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::CreateDuplicateAttrs  |  ( |  const DisplayAttrsMgrListDesc &  |   | )
static
◆ CreateNewAttrs()
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::CreateNewAttrs  |  ( |  const ON_wString &  |  Name,
|  const ON_UUID &  |  DerivedFrom
)
static
◆ FindDisplayAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::FindDisplayAttrs  |  ( |  const ON_UUID &  |   | )
static
◆ FindDisplayAttrsDesc() [1/2]
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::FindDisplayAttrsDesc  |  ( |  const ON_UUID &  |   | )
static
◆ FindDisplayAttrsDesc() [2/2]
 static DisplayAttrsMgrListDesc* CRhinoDisplayAttrsMgr::FindDisplayAttrsDesc  |  ( |  const wchar_t *  |  local_name | )
static
◆ FormatValidDisplayName()
 static void CRhinoDisplayAttrsMgr::FormatValidDisplayName  |  ( |  ON_wString &  |  sName | )
static
◆ GetDisplayAttrsList()
 static int CRhinoDisplayAttrsMgr::GetDisplayAttrsList  |  ( |  DisplayAttrsMgrList &  |   | )
static
◆ GetShadedDisplayAttrsList()
 static int CRhinoDisplayAttrsMgr::GetShadedDisplayAttrsList  |  ( |  DisplayAttrsMgrList &  |   | )
static
◆ GetWireZBias()
 static double CRhinoDisplayAttrsMgr::GetWireZBias  |  ( |  void  |   | )
static
◆ GhostedModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::GhostedModeId  |  ( |   | )
static
◆ IntGDIWireframeAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::IntGDIWireframeAttrs  |  ( |  void  |   | )
static
Deprecated:
CRhinoDisplayAttrsMgr::IntGDIWireframeAttrs is obsolete, please remove all references. Use CRhinoDisplayAttrsMgr::StdWireframeAttrs instead.
◆ IntOGLWireframeAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::IntOGLWireframeAttrs  |  ( |  void  |   | )
static
Deprecated:
CRhinoDisplayAttrsMgr::IntOGLWireframeAttrs is obsolete, please remove all references. Use CRhinoDisplayAttrsMgr::StdWireframeAttrs instead.
◆ IntShadedAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::IntShadedAttrs  |  ( |  void  |   | )
static
Deprecated:
CRhinoDisplayAttrsMgr::IntShadedAttrs is obsolete, please remove all references. Use CRhinoDisplayAttrsMgr::StdShadedAttrs instead.
◆ IsBuiltInAttributes()
 static bool CRhinoDisplayAttrsMgr::IsBuiltInAttributes  |  ( |  const CDisplayPipelineAttributes *  |   | )
static
◆ IsInternalAttributes()
 static bool CRhinoDisplayAttrsMgr::IsInternalAttributes  |  ( |  const CDisplayPipelineAttributes *  |   | )
static
Deprecated:
CRhinoDisplayAttrsMgr::IsInternalAttributes is obsolete, please remove all references.
◆ IsModified()
 static bool CRhinoDisplayAttrsMgr::IsModified  |  ( |  void  |   | )
static
◆ IsTechnicalMode()
 static bool CRhinoDisplayAttrsMgr::IsTechnicalMode  |  ( |  const CDisplayPipelineAttributes *  |   | )
static
◆ LoadProfile()
 static void CRhinoDisplayAttrsMgr::LoadProfile  |  ( |  CRhinoProfileContext &  |   | )
static
load from registry
◆ MonochromeModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::MonochromeModeId  |  ( |   | )
static
◆ PenModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::PenModeId  |  ( |   | )
static
◆ ProfileSection()
 static const wchar_t* CRhinoDisplayAttrsMgr::ProfileSection  |  ( |   | )
static
◆ RaytracedModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::RaytracedModeId  |  ( |   | )
static
◆ RemoveEntry()
 static bool CRhinoDisplayAttrsMgr::RemoveEntry  |  ( |  const ON_UUID &  |   | )
static
◆ RenderedModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::RenderedModeId  |  ( |   | )
static
◆ RenderedShadowsModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::RenderedShadowsModeId  |  ( |   | )
static
◆ SaveProfile()
 static void CRhinoDisplayAttrsMgr::SaveProfile  |  ( |  CRhinoProfileContext &  |   | )
static
save in registry
◆ SetIsModified()
 static void CRhinoDisplayAttrsMgr::SetIsModified  |  ( |  bool  |   | )
static
◆ SetWireZBias()
 static void CRhinoDisplayAttrsMgr::SetWireZBias  |  ( |  double  |   | )
static
◆ ShadedModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::ShadedModeId  |  ( |   | )
static
◆ StdArchitectureAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdArchitectureAttrs  |  ( |  void  |   | )
static
◆ StdArcticAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdArcticAttrs  |  ( |  void  |   | )
static
◆ StdArtisticAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdArtisticAttrs  |  ( |  void  |   | )
static
◆ StdGhostedAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdGhostedAttrs  |  ( |  void  |   | )
static
◆ StdMonochromeAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdMonochromeAttrs  |  ( |  void  |   | )
static
◆ StdPenAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdPenAttrs  |  ( |  void  |   | )
static
◆ StdRaytracedAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdRaytracedAttrs  |  ( |  void  |   | )
static
◆ StdRenderedAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdRenderedAttrs  |  ( |  void  |   | )
static
◆ StdRenderedShadowsAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdRenderedShadowsAttrs  |  ( |  void  |   | )
static
◆ StdShadedAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdShadedAttrs  |  ( |  void  |   | )
static
◆ StdTechAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdTechAttrs  |  ( |  void  |   | )
static
◆ StdWireframeAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdWireframeAttrs  |  ( |  void  |   | )
static
◆ StdXrayAttrs()
 static const CDisplayPipelineAttributes* CRhinoDisplayAttrsMgr::StdXrayAttrs  |  ( |  void  |   | )
static
◆ TechModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::TechModeId  |  ( |   | )
static
◆ UpdateAttributes()
 static bool CRhinoDisplayAttrsMgr::UpdateAttributes  |  ( |  const DisplayAttrsMgrListDesc &  |   | )
static
◆ UpdateReferencedPipelines()
 static void CRhinoDisplayAttrsMgr::UpdateReferencedPipelines  |  ( |  void  |   | )
static
◆ WireframeModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::WireframeModeId  |  ( |   | )
static
◆ XRayModeId()
 static const ON_UUID CRhinoDisplayAttrsMgr::XRayModeId  |  ( |   | )
static
Member Data Documentation
◆ m_nMajor
 int CRhinoDisplayAttrsMgr::m_nMajor
static
◆ m_nMinor
 int CRhinoDisplayAttrsMgr::m_nMinor
static