Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoDirectionAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoDirectionAnalysisSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoDirectionAnalysisSettings &other) const
bool  | operator== (const CRhinoDirectionAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
 Public Attributes
bool  | m_bDirection
bool  | m_bU
bool  | m_bV
ON_Color  | m_color
 Static Public Attributes
static const CRhinoDirectionAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoDirectionAnalysisSettings()
 CRhinoDirectionAnalysisSettings::CRhinoDirectionAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoDirectionAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoDirectionAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoDirectionAnalysisSettings::operator!=  |  ( |  const CRhinoDirectionAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoDirectionAnalysisSettings::operator==  |  ( |  const CRhinoDirectionAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoDirectionAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoDirectionAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoDirectionAnalysisSettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoDirectionAnalysisSettings CRhinoDirectionAnalysisSettings::Default
static
◆ m_bDirection
 bool CRhinoDirectionAnalysisSettings::m_bDirection
◆ m_bU
 bool CRhinoDirectionAnalysisSettings::m_bU
◆ m_bV
 bool CRhinoDirectionAnalysisSettings::m_bV
◆ m_color
 ON_Color CRhinoDirectionAnalysisSettings::m_color