Public Member Functions | Static Public Attributes | List of all members
CRhRdkObjectAncestry Class Reference
RDK
#include <RhRdkObjectDataAccess.h>
 Inheritance diagram for CRhRdkObjectAncestry:
 Public Member Functions
CRhRdkObjectAncestry ()
CRhRdkObjectAncestry (const CRhRdkObjectAncestry &src)
CRhRdkObjectAncestry (const CRhRdkObjectAncestry *pSrc)
CRhRdkObjectAncestry (const ON_SimpleArray< const CRhinoInstanceObject * > &a)
virtual  | ~CRhRdkObjectAncestry ()
const ON_SimpleArray< const CRhinoInstanceObject * > &  | Ancestry (void) const
ON_Xform  | CompleteTransform (void) const
bool  | IsTopLevel (void) const
const CRhRdkObjectAncestry &  | operator+= (const CRhinoInstanceObject *pObject)
const CRhRdkObjectAncestry &  | operator= (const CRhRdkObjectAncestry &)
const CRhinoInstanceObject *  | TopLevelParent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Attributes
static const CRhRdkObjectAncestry  | empty
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class describes the parent chain for an object so that the "By Parent" material source can be properly implemented. When a reference to this class is required, and the object is inside a block or worksession, supply the full parent chain starting from the object that is in the document itself (usually the block reference), followed by the nested block reference or concrete geometry object...until you reach the object itself.
Constructor & Destructor Documentation
◆ CRhRdkObjectAncestry() [1/4]
 CRhRdkObjectAncestry::CRhRdkObjectAncestry  |  ( |   | )
◆ CRhRdkObjectAncestry() [2/4]
 CRhRdkObjectAncestry::CRhRdkObjectAncestry  |  ( |  const CRhRdkObjectAncestry &  |  src | )
◆ CRhRdkObjectAncestry() [3/4]
 CRhRdkObjectAncestry::CRhRdkObjectAncestry  |  ( |  const CRhRdkObjectAncestry *  |  pSrc | )
◆ CRhRdkObjectAncestry() [4/4]
 CRhRdkObjectAncestry::CRhRdkObjectAncestry  |  ( |  const ON_SimpleArray< const CRhinoInstanceObject * > &  |  a | )
◆ ~CRhRdkObjectAncestry()
 virtual CRhRdkObjectAncestry::~CRhRdkObjectAncestry  |  ( |   | )
virtual
Member Function Documentation
◆ Ancestry()
 const ON_SimpleArray<const CRhinoInstanceObject*>& CRhRdkObjectAncestry::Ancestry  |  ( |  void  |   | ) |   const
◆ CompleteTransform()
 ON_Xform CRhRdkObjectAncestry::CompleteTransform  |  ( |  void  |   | ) |   const
◆ IsTopLevel()
 bool CRhRdkObjectAncestry::IsTopLevel  |  ( |  void  |   | ) |   const
◆ operator+=()
 const CRhRdkObjectAncestry& CRhRdkObjectAncestry::operator+=  |  ( |  const CRhinoInstanceObject *  |  pObject | )
◆ operator=()
 const CRhRdkObjectAncestry& CRhRdkObjectAncestry::operator=  |  ( |  const CRhRdkObjectAncestry &  |   | )
◆ TopLevelParent()
 const CRhinoInstanceObject* CRhRdkObjectAncestry::TopLevelParent  |  ( |  void  |   | ) |   const
Member Data Documentation
◆ empty
 const CRhRdkObjectAncestry CRhRdkObjectAncestry::empty
static