Public Member Functions | List of all members
ON_SubDComponentIdList Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDComponentIdList:
 Public Member Functions
ON_SubDComponentIdList ()=default
ON_SubDComponentIdList (const ON_SubDComponentIdList &)=default
~ON_SubDComponentIdList ()=default
void  | AddId (ON_SubDComponentId cid)
void  | AddId (ON_SubDComponentPtr cptr)
void  | AddIdList (const ON_SubDComponentIdList &list)
bool  | InList (ON_SubDComponentId cid) const
bool  | InList (ON_SubDComponentPtr cptr) const
bool  | InListPassesResult () const
Value Passes(cptr) returns when cptr is in the list. More...
ON_SubDComponentIdList &  | operator= (const ON_SubDComponentIdList &)=default
ON_SubDComponentId  | operator[] (unsigned int i) const
bool  | Passes (const ON_SubDComponentPtr cptr) const override
void  | SetInListPassesResult (bool bInListPassesResult)
unsigned int  | UnsignedCount () const
 Public Member Functions inherited from ON_SubDComponentTest
ON_SubDComponentTest ()=default
ON_SubDComponentTest (const ON_SubDComponentTest &)=default
ON_SubDComponentTest (ON__UINT_PTR ptr)
virtual  | ~ON_SubDComponentTest ()
ON_SubDComponentTest &  | operator= (const ON_SubDComponentTest &)=default
bool  | Passes (const class ON_SubDEdge *e) const
bool  | Passes (const class ON_SubDFace *f) const
bool  | Passes (const class ON_SubDVertex *v) const
 Additional Inherited Members
 Static Public Attributes inherited from ON_SubDComponentTest
static const ON_SubDComponentTest  | AllFail
Passes() returns false for every component. More...
static const ON_SubDComponentTest  | AllPass
Passes() returns true for every non nullptr component. More...
 Protected Attributes inherited from ON_SubDComponentTest
ON__UINT_PTR  | m_ptr = 0
classes derived from ON_SubDVertexFilter may use m_ptr as they see fit including to completely ignore it. More...
Constructor & Destructor Documentation
◆ ON_SubDComponentIdList() [1/2]
 ON_SubDComponentIdList::ON_SubDComponentIdList  |  ( |   | )
default
◆ ~ON_SubDComponentIdList()
 ON_SubDComponentIdList::~ON_SubDComponentIdList  |  ( |   | )
default
◆ ON_SubDComponentIdList() [2/2]
 ON_SubDComponentIdList::ON_SubDComponentIdList  |  ( |  const ON_SubDComponentIdList &  |   | )
default
Member Function Documentation
◆ AddId() [1/2]
 void ON_SubDComponentIdList::AddId  |  ( |  ON_SubDComponentId  |  cid | )
◆ AddId() [2/2]
 void ON_SubDComponentIdList::AddId  |  ( |  ON_SubDComponentPtr  |  cptr | )
◆ AddIdList()
 void ON_SubDComponentIdList::AddIdList  |  ( |  const ON_SubDComponentIdList &  |  list | )
Add all Ids in list to m_id_list. Do not sort or remove duplicates. Assumes list elements all pass el.IsSet(). Parameters: list - in
◆ InList() [1/2]
 bool ON_SubDComponentIdList::InList  |  ( |  ON_SubDComponentId  |  cid | ) |   const
Parameters: cid - in Returns: true if cid is in this list.
◆ InList() [2/2]
 bool ON_SubDComponentIdList::InList  |  ( |  ON_SubDComponentPtr  |  cptr | ) |   const
Parameters: cptr - in Returns: true if cptr's id is in this list.
◆ InListPassesResult()
 bool ON_SubDComponentIdList::InListPassesResult  |  ( |   | ) |   const
Value Passes(cptr) returns when cptr is in the list.
◆ operator=()
 ON_SubDComponentIdList& ON_SubDComponentIdList::operator=  |  ( |  const ON_SubDComponentIdList &  |   | )
default
◆ operator[]()
 ON_SubDComponentId ON_SubDComponentIdList::operator[]  |  ( |  unsigned int  |  i | ) |   const
◆ Passes()
 bool ON_SubDComponentIdList::Passes  |  ( |  const ON_SubDComponentPtr  |  cptr | ) |   const
overridevirtual
Returns: returns InListPassesResult() when cptr id is in the list. returns !InListPassesResult() when cptr id is not the list. Remarks: AddId is safe to use in multithreaded contexts.
Reimplemented from ON_SubDComponentTest.
◆ SetInListPassesResult()
 void ON_SubDComponentIdList::SetInListPassesResult  |  ( |  bool  |  bInListPassesResult | )
◆ UnsignedCount()
 unsigned int ON_SubDComponentIdList::UnsignedCount  |  ( |   | ) |   const