Static Public Member Functions | List of all members
ON_ShutLining::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static bool  | AutoUpdate (void)
static bool  | Faceted (void)
static bool  | ForceUpdate (void)
static double  | Tolerance (void)
Member Function Documentation
◆ AutoUpdate()
 static bool ON_ShutLining::Defaults::AutoUpdate  |  ( |  void  |   | )
static
◆ Faceted()
 static bool ON_ShutLining::Defaults::Faceted  |  ( |  void  |   | )
static
◆ ForceUpdate()
 static bool ON_ShutLining::Defaults::ForceUpdate  |  ( |  void  |   | )
static
◆ Tolerance()
 static double ON_ShutLining::Defaults::Tolerance  |  ( |  void  |   | )
static