Public Member Functions | Public Attributes | List of all members
CRhinoContourInput Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Member Functions
CRhinoContourInput ()
 Public Attributes
int  | m_AssignLayerBy
This parameter is now used to assign attributes (not just layer - treat like Assign Attributes: ByLayer/ByInput) More...
ON_SimpleArray< const ON_3dmObjectAttributes * >  | m_attribs
input Attributes More...
bool  | m_bAddOutputToDocument
default is false More...
ON_3dPoint  | m_basept
base point for vector that is normal to contour planes and used as contour limit if m_limit_range is true More...
bool  | m_bGroupByContourPlane
default is false More...
bool  | m_bShowCount
default is false More...
int  | m_CountIncrement
default is 1 More...
ON_3dPoint  | m_endpt
end point for vector that is normal to contour planes and used as contour limit if m_limit_range is true More...
ON_SimpleArray< const ON_Geometry * >  | m_geom
input geometry More...
double  | m_interval
distance between contours More...
int  | m_JoinCurves
BOOL32  | m_limit_range
true if contours are only to be made between m_basept and m_endpt More...
Detailed Description
Description: Input class for MakeRhinoContours functions below.
Constructor & Destructor Documentation
◆ CRhinoContourInput()
 CRhinoContourInput::CRhinoContourInput  |  ( |   | )
Member Data Documentation
◆ m_AssignLayerBy
 int CRhinoContourInput::m_AssignLayerBy
This parameter is now used to assign attributes (not just layer - treat like Assign Attributes: ByLayer/ByInput)
0 = CurrentLayer, 1 = InputObject
◆ m_attribs
 ON_SimpleArray<const ON_3dmObjectAttributes*> CRhinoContourInput::m_attribs
input Attributes
◆ m_bAddOutputToDocument
 bool CRhinoContourInput::m_bAddOutputToDocument
default is false
To add output directly to the document set m_bAddOutputToDocument to true. If m_bAddOutputToDocument is true, group output by cut plane by setting m_bGroupByContourPlane to true.
◆ m_basept
 ON_3dPoint CRhinoContourInput::m_basept
base point for vector that is normal to contour planes and used as contour limit if m_limit_range is true
◆ m_bGroupByContourPlane
 bool CRhinoContourInput::m_bGroupByContourPlane
default is false
◆ m_bShowCount
 bool CRhinoContourInput::m_bShowCount
default is false
◆ m_CountIncrement
 int CRhinoContourInput::m_CountIncrement
default is 1
◆ m_endpt
 ON_3dPoint CRhinoContourInput::m_endpt
end point for vector that is normal to contour planes and used as contour limit if m_limit_range is true
◆ m_geom
 ON_SimpleArray<const ON_Geometry*> CRhinoContourInput::m_geom
input geometry
◆ m_interval
 double CRhinoContourInput::m_interval
distance between contours
◆ m_JoinCurves
 int CRhinoContourInput::m_JoinCurves
0 = NoJoin, 1 = ByPolySurface, 2 = ByContourPlane
◆ m_limit_range
 BOOL32 CRhinoContourInput::m_limit_range
true if contours are only to be made between m_basept and m_endpt