Public Member Functions | Public Attributes | List of all members
CRhinoNamedColor Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoNamedColor ()
 Public Attributes
ON_Color  | m_color
ON_wString  | m_color_name
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoNamedColor()
 CRhinoNamedColor::CRhinoNamedColor  |  ( |   | )
Member Data Documentation
◆ m_color
 ON_Color CRhinoNamedColor::m_color
◆ m_color_name
 ON_wString CRhinoNamedColor::m_color_name