Public Member Functions | List of all members
ON_MeshNgonAllocator Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshNgonAllocator () ON_NOEXCEPT
~ON_MeshNgonAllocator ()
ON_MeshNgon *  | AllocateNgon (unsigned int Vcount, unsigned int Fcount)
ON_MeshNgon *  | CopyNgon (const ON_MeshNgon *ngon)
void  | DeallocateAllNgons ()
bool  | DeallocateNgon (ON_MeshNgon *ngon)
ON_MeshNgon *  | ReallocateNgon (ON_MeshNgon *ngon, unsigned int Vcount, unsigned int Fcount)
Constructor & Destructor Documentation
◆ ON_MeshNgonAllocator()
 ON_MeshNgonAllocator::ON_MeshNgonAllocator  |  ( |   | )
◆ ~ON_MeshNgonAllocator()
 ON_MeshNgonAllocator::~ON_MeshNgonAllocator  |  ( |   | )
Member Function Documentation
◆ AllocateNgon()
 ON_MeshNgon* ON_MeshNgonAllocator::AllocateNgon  |  ( |  unsigned int  |  Vcount,
|  unsigned int  |  Fcount
)
Parameters: Vcount - [in] >= 3 Fcount - [in] >= 0
◆ CopyNgon()
 ON_MeshNgon* ON_MeshNgonAllocator::CopyNgon  |  ( |  const ON_MeshNgon *  |  ngon | )
Description: Returns a copy of ngon. Parameters: ngon - [in] Returns: If
◆ DeallocateAllNgons()
 void ON_MeshNgonAllocator::DeallocateAllNgons  |  ( |   | )
Description: Deallocate every n-gon managed by this allocator.
◆ DeallocateNgon()
 bool ON_MeshNgonAllocator::DeallocateNgon  |  ( |  ON_MeshNgon *  |  ngon | )
Parameters: ngon - in] An ngon pointer value that was previously returned by this allocator's AllocateNgon() or CopyNgon() function.
◆ ReallocateNgon()
 ON_MeshNgon* ON_MeshNgonAllocator::ReallocateNgon  |  ( |  ON_MeshNgon *  |  ngon,
|  unsigned int  |  Vcount,
|  unsigned int  |  Fcount
)
Parameters: Vcount - [in] >= 3 Fcount - [in] >= 0