Public Types | Public Member Functions | List of all members
CRhRdkEnterMode Class Reference
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkEnterMode:
 Public Types
enum  | eMode { GUI = 0, CommandLine = 1, Quiet = 2, force32bit_mode = 0xFFFFFFFF }
 Public Member Functions
CRhRdkEnterMode (eMode)
virtual  | ~CRhRdkEnterMode ()
 Public Member Functions inherited from CRhRdkEnterModeBase
CRhRdkEnterModeBase ()
virtual  | ~CRhRdkEnterModeBase ()=0
 Additional Inherited Members
 Protected Attributes inherited from CRhRdkEnterModeBase
CImpl *  | m_pImpl
Member Enumeration Documentation
◆ eMode
 enum CRhRdkEnterMode::eMode
Enumerator
GUI
CommandLine
Quiet
force32bit_mode
Constructor & Destructor Documentation
◆ CRhRdkEnterMode()
 CRhRdkEnterMode::CRhRdkEnterMode  |  ( |  eMode  |   | )
◆ ~CRhRdkEnterMode()
 virtual CRhRdkEnterMode::~CRhRdkEnterMode  |  ( |   | )
virtual