Public Types | Public Member Functions | Public Attributes | List of all members
ON_CIXEvent Class Reference
OpenNURBS
Curve/ImplicitFunction intersection event. More...
#include <opennurbs_plus_implicitfn.h>
 Public Types
enum  | AmbigType : int { AmbigType::Unknown = 0, AmbigType::Tangent = 1, AmbigType::TangentEnd = 2, AmbigType::Transverse = 3 }
enum  | Type : int { Type::Unknown = 0, Type::NoEvent = 1, Type::Point = 2, Type::Overlap = 3 }
 Public Member Functions
ON_CIXEvent ()
 Public Attributes
ON_Interval  | m_domain
ON_3dPoint  | m_point
Type  | m_type
Detailed Description
Curve/ImplicitFunction intersection event.
Member Enumeration Documentation
◆ AmbigType
 enum ON_CIXEvent::AmbigType : int
strong
Enumerator
Unknown
Tangent
TangentEnd
Transverse
◆ Type
 enum ON_CIXEvent::Type : int
strong
Enumerator
Unknown
unknown event type
NoEvent
no point or overlap
Point
point intersection
Overlap
overlap intersection
Constructor & Destructor Documentation
◆ ON_CIXEvent()
 ON_CIXEvent::ON_CIXEvent  |  ( |   | )
inline
Member Data Documentation
◆ m_domain
 ON_Interval ON_CIXEvent::m_domain
the overlap interval [t0, t1] with t0 < t1 of the overlapping curve, or the point parameter t as [t, t]
◆ m_point
 ON_3dPoint ON_CIXEvent::m_point
◆ m_type
 Type ON_CIXEvent::m_type