Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentAndPoint Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentAndPoint ()=default
ON_SubDComponentAndPoint (const ON_SubDComponentAndPoint &)=default
~ON_SubDComponentAndPoint ()=default
const ON_SubDComponentPtr  | Component () const
ON_SubDComponentAndPoint &  | operator= (const ON_SubDComponentAndPoint &)=default
const ON_3dPoint  | Point () const
void  | SetComponent (ON_SubDComponentPtr cptr)
void  | SetPoint (ON_3dPoint P)
 Static Public Member Functions
static int  | CompareComponent (const ON_SubDComponentAndPoint *lhs, const ON_SubDComponentAndPoint *rhs)
static int  | CompareComponentAndDirection (const ON_SubDComponentAndPoint *lhs, const ON_SubDComponentAndPoint *rhs)
static int  | CompareComponentAndDirectionAndPoint (const ON_SubDComponentAndPoint *lhs, const ON_SubDComponentAndPoint *rhs)
static int  | CompareComponentAndPoint (const ON_SubDComponentAndPoint *lhs, const ON_SubDComponentAndPoint *rhs)
static int  | ComparePoint (const ON_SubDComponentAndPoint *lhs, const ON_SubDComponentAndPoint *rhs)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDEdge *e, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDEdgePtr eptr, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDFace *f, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDFacePtr fptr, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDVertex *v, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (const ON_SubDVertexPtr vptr, ON_3dPoint P)
static const ON_SubDComponentAndPoint  | Create (ON_SubDComponentPtr cptr, ON_3dPoint P)
 Public Attributes
ON_SubDComponentPtr  | m_cptr = ON_SubDComponentPtr::Null
ON_3dPoint  | m_P = ON_3dPoint::NanPoint
 Static Public Attributes
static const ON_SubDComponentAndPoint  | NullAndNan
static const ON_SubDComponentAndPoint  | NullAndOrigin
Detailed Description
ON_SubDComponentAndPoint
Constructor & Destructor Documentation
◆ ON_SubDComponentAndPoint() [1/2]
 ON_SubDComponentAndPoint::ON_SubDComponentAndPoint  |  ( |   | )
default
◆ ~ON_SubDComponentAndPoint()
 ON_SubDComponentAndPoint::~ON_SubDComponentAndPoint  |  ( |   | )
default
◆ ON_SubDComponentAndPoint() [2/2]
 ON_SubDComponentAndPoint::ON_SubDComponentAndPoint  |  ( |  const ON_SubDComponentAndPoint &  |   | )
default
Member Function Documentation
◆ CompareComponent()
 static int ON_SubDComponentAndPoint::CompareComponent  |  ( |  const ON_SubDComponentAndPoint *  |  lhs,
|  const ON_SubDComponentAndPoint *  |  rhs
)
static
Description: Compare Component() using ON_SubDComponentPtr::CompareComponent().
◆ CompareComponentAndDirection()
 static int ON_SubDComponentAndPoint::CompareComponentAndDirection  |  ( |  const ON_SubDComponentAndPoint *  |  lhs,
|  const ON_SubDComponentAndPoint *  |  rhs
)
static
Description: Compare Component() using ON_SubDComponentPtr::CompareComponentAndDirection().
◆ CompareComponentAndDirectionAndPoint()
 static int ON_SubDComponentAndPoint::CompareComponentAndDirectionAndPoint  |  ( |  const ON_SubDComponentAndPoint *  |  lhs,
|  const ON_SubDComponentAndPoint *  |  rhs
)
static
Description: Dictionary compare using ON_SubDComponentAndPoint::CompareComponentAndDirection() and ON_SubDComponentAndPoint::Point() in that order.
◆ CompareComponentAndPoint()
 static int ON_SubDComponentAndPoint::CompareComponentAndPoint  |  ( |  const ON_SubDComponentAndPoint *  |  lhs,
|  const ON_SubDComponentAndPoint *  |  rhs
)
static
Description: Dictionary compare Component() and Point() in that order.
◆ ComparePoint()
 static int ON_SubDComponentAndPoint::ComparePoint  |  ( |  const ON_SubDComponentAndPoint *  |  lhs,
|  const ON_SubDComponentAndPoint *  |  rhs
)
static
Description: Compare Point() uses ON_3dPoint::Compare() to compare lhs and rhs Point() values.
◆ Component()
 const ON_SubDComponentPtr ON_SubDComponentAndPoint::Component  |  ( |   | ) |   const
◆ Create() [1/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDEdge *  |  e,
|  ON_3dPoint  |  P
)
static
◆ Create() [2/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDEdgePtr  |  eptr,
|  ON_3dPoint  |  P
)
static
◆ Create() [3/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDFace *  |  f,
|  ON_3dPoint  |  P
)
static
◆ Create() [4/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDFacePtr  |  fptr,
|  ON_3dPoint  |  P
)
static
◆ Create() [5/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDVertex *  |  v,
|  ON_3dPoint  |  P
)
static
◆ Create() [6/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  const ON_SubDVertexPtr  |  vptr,
|  ON_3dPoint  |  P
)
static
◆ Create() [7/7]
 static const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::Create  |  ( |  ON_SubDComponentPtr  |  cptr,
|  ON_3dPoint  |  P
)
static
◆ operator=()
 ON_SubDComponentAndPoint& ON_SubDComponentAndPoint::operator=  |  ( |  const ON_SubDComponentAndPoint &  |   | )
default
◆ Point()
 const ON_3dPoint ON_SubDComponentAndPoint::Point  |  ( |   | ) |   const
◆ SetComponent()
 void ON_SubDComponentAndPoint::SetComponent  |  ( |  ON_SubDComponentPtr  |  cptr | )
◆ SetPoint()
 void ON_SubDComponentAndPoint::SetPoint  |  ( |  ON_3dPoint  |  P | )
Member Data Documentation
◆ m_cptr
 ON_SubDComponentPtr ON_SubDComponentAndPoint::m_cptr = ON_SubDComponentPtr::Null
◆ m_P
 ON_3dPoint ON_SubDComponentAndPoint::m_P = ON_3dPoint::NanPoint
◆ NullAndNan
 const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::NullAndNan
static
◆ NullAndOrigin
 const ON_SubDComponentAndPoint ON_SubDComponentAndPoint::NullAndOrigin
static