Public Member Functions | List of all members
ON_BrepTrimArray Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepTrimArray:
 Public Member Functions
ON_BrepTrimArray ()
~ON_BrepTrimArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepTrim >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (const ON_ObjectArray< ON_BrepTrim > &)
ON_ObjectArray (size_t)
size_t parameter = initial capacity More...
~ON_ObjectArray ()
override for struct member deallocation, etc. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *))
ON_ObjectArray< ON_BrepTrim > &  | operator= (const ON_ObjectArray< ON_BrepTrim > &)
bool  | QuickSort (int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *))
ON_BrepTrim *  | Realloc (ON_BrepTrim *, int)
 Public Member Functions inherited from ON_ClassArray< ON_BrepTrim >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< ON_BrepTrim > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const ON_BrepTrim &)
void  | Append (int, const ON_BrepTrim *)
Append copy of an array T[count]. More...
ON_BrepTrim &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepTrim *  | Array ()
The Array() function return the. More...
const ON_BrepTrim *  | Array () const
m_a pointer value. More...
ON_BrepTrim *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_BrepTrim *  | At (int) const
ON_BrepTrim *  | At (ON__INT64)
const ON_BrepTrim *  | At (ON__INT64) const
ON_BrepTrim *  | At (ON__UINT64)
const ON_BrepTrim *  | At (ON__UINT64) const
ON_BrepTrim *  | At (unsigned int)
const ON_BrepTrim *  | At (unsigned int) const
ON_BrepTrim *  | begin ()
Support STL iterators and algorithms. More...
ON_BrepTrim const *  | begin () const
int  | BinarySearch (const ON_BrepTrim *, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_BrepTrim *, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *), int) const
int  | Capacity () const
capacity of array More...
ON_BrepTrim const *  | cbegin () const
ON_BrepTrim const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_BrepTrim *  | end ()
ON_BrepTrim const *  | end () const
ON_BrepTrim *  | First ()
const ON_BrepTrim *  | First () const
returns nullptr if count = 0 More...
void  | Insert (int, const ON_BrepTrim &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const ON_BrepTrim &, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *))
int  | InsertInSortedList (const ON_BrepTrim &, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *), int)
ON_BrepTrim *  | KeepArray ()
ON_BrepTrim *  | Last ()
const ON_BrepTrim *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const ON_BrepTrim * () const
operator ON_BrepTrim * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< ON_BrepTrim > &other) const=delete
ON_ClassArray< ON_BrepTrim > &  | operator= (const ON_ClassArray< ON_BrepTrim > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< ON_BrepTrim > &other) const=delete
ON_BrepTrim &  | operator[] (int)
const ON_BrepTrim &  | operator[] (int) const
ON_BrepTrim &  | operator[] (ON__INT64)
const ON_BrepTrim &  | operator[] (ON__INT64) const
ON_BrepTrim &  | operator[] (ON__UINT64)
const ON_BrepTrim &  | operator[] (ON__UINT64) const
ON_BrepTrim &  | operator[] (unsigned int)
const ON_BrepTrim &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepTrim *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_BrepTrim *, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *)) const
void  | SetArray (ON_BrepTrim *p)
void  | SetArray (ON_BrepTrim *p, int count, int capacity)
ON_BrepTrim *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepTrim *, const ON_BrepTrim *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepTrim >
void  | ConstructDefaultElement (ON_BrepTrim *)
void  | DestroyElement (ON_BrepTrim &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepTrim >
ON_BrepTrim *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_BrepTrimArray()
 ON_BrepTrimArray::ON_BrepTrimArray  |  ( |   | )
◆ ~ON_BrepTrimArray()
 ON_BrepTrimArray::~ON_BrepTrimArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepTrimArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepTrimArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepTrimArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const