Public Member Functions | List of all members
CRhRdkSubNodeTaskOrigin Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkSubNodeTaskOrigin:
 Public Member Functions
CRhRdkSubNodeTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const CRhRdkInstanceIdArray &aInstance, class CRhRdkChildSlotHelper *pCSH, bool bLocked)
virtual  | ~CRhRdkSubNodeTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const override
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const final override
bool  | IsForChildSlot (const wchar_t *wszChildSlotName) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const override
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result res) const override
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
virtual const wchar_t *  | TopLevelKind (void) const override
virtual UUID  | Uuid (void) const final override
 Public Member Functions inherited from CRhRdkContextTaskOrigin
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Used when task origin is a sub-node control.
Constructor & Destructor Documentation
◆ CRhRdkSubNodeTaskOrigin()
 CRhRdkSubNodeTaskOrigin::CRhRdkSubNodeTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con,
|  const CRhRdkInstanceIdArray &  |  aInstance,
|  class CRhRdkChildSlotHelper *  |  pCSH,
|  bool  |  bLocked
)
◆ ~CRhRdkSubNodeTaskOrigin()
 virtual CRhRdkSubNodeTaskOrigin::~CRhRdkSubNodeTaskOrigin  |  ( |   | )
virtual
Member Function Documentation
◆ Control()
 virtual IRhRdkTaskCollection::Control CRhRdkSubNodeTaskOrigin::Control  |  ( |  void  |   | ) |   const
overridevirtual
Implements CRhRdkTaskOrigin.
Reimplemented in CRhRdkColorButtonTaskOrigin.
◆ GetSelectionImpl()
 virtual void CRhRdkSubNodeTaskOrigin::GetSelectionImpl  |  ( |  CRhRdkContentArray &  |  aContentOut | ) |   const
finaloverridevirtual
Implement this to get the contents that have been selected by the user.
Parameters
aContentOut | accepts the selected contents.
Implements CRhRdkTaskOrigin.
◆ IsForChildSlot()
 bool CRhRdkSubNodeTaskOrigin::IsForChildSlot  |  ( |  const wchar_t *  |  wszChildSlotName | ) |   const
◆ OnBeginExecuteTask()
 virtual void CRhRdkSubNodeTaskOrigin::OnBeginExecuteTask  |  ( |  const UUID &  |  uuidTask | ) |   const
overridevirtual
Reimplemented from CRhRdkTaskOrigin.
◆ OnEndExecuteTask()
 virtual void CRhRdkSubNodeTaskOrigin::OnEndExecuteTask  |  ( |  const UUID &  |  uuidTask,
|  CRhRdkTask::Result  |  res
) |   |  const
overridevirtual
Reimplemented from CRhRdkTaskOrigin.
◆ SupportsTask()
 virtual bool CRhRdkSubNodeTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  task | ) |   const
overridevirtual
Reimplemented from CRhRdkContextTaskOrigin.
◆ TopLevelKind()
 virtual const wchar_t* CRhRdkSubNodeTaskOrigin::TopLevelKind  |  ( |  void  |   | ) |   const
overridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.
◆ Uuid()
 virtual UUID CRhRdkSubNodeTaskOrigin::Uuid  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.