Public Types | Public Member Functions | Static Public Member Functions | List of all members
CRhRdkSimulatedEnvironment Class Reference
RDK
#include <Proto_ON_Environment.h>
 Public Types
enum  | BackgroundProjections : unsigned int {
 BackgroundProjections::Planar = 0, BackgroundProjections::Spherical = 1, BackgroundProjections::Emap = 2, BackgroundProjections::Box = 3,
 BackgroundProjections::Automatic = 4, BackgroundProjections::Lightprobe = 5, BackgroundProjections::Cubemap = 6, BackgroundProjections::VerticalCrossCubemap = 7,
 BackgroundProjections::HorizontalCrossCubemap = 8, BackgroundProjections::Hemispherical = 9
 }
 Public Member Functions
CRhRdkSimulatedEnvironment ()
CRhRdkSimulatedEnvironment (const CRhRdkSimulatedEnvironment &src)
virtual  | ~CRhRdkSimulatedEnvironment ()
ON_Color  | BackgroundColor (void) const
const CRhRdkSimulatedTexture &  | BackgroundImage (void) const
BackgroundProjections  | BackgroundProjection (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
const CRhRdkSimulatedEnvironment &  | operator= (const CRhRdkSimulatedEnvironment &src)
bool  | operator== (const CRhRdkSimulatedEnvironment &src) const
void  | SetBackgroundColor (ON_Color color)
void  | SetBackgroundImage (const CRhRdkSimulatedTexture &tex)
void  | SetBackgroundProjection (BackgroundProjections proj)
 Static Public Member Functions
static BackgroundProjections  | AutomaticProjectionFromChildTexture (const CRhRdkTexture *pChildTexture)
static BackgroundProjections  | ProjectionFromString (const wchar_t *wsz)
static const wchar_t *  | StringFromProjection (BackgroundProjections proj)
Member Enumeration Documentation
◆ BackgroundProjections
 enum CRhRdkSimulatedEnvironment::BackgroundProjections : unsigned int
strong
Enumerator
Planar
Spherical
Emap
Box
Automatic
Lightprobe
Cubemap
VerticalCrossCubemap
HorizontalCrossCubemap
Hemispherical
Constructor & Destructor Documentation
◆ CRhRdkSimulatedEnvironment() [1/2]
 CRhRdkSimulatedEnvironment::CRhRdkSimulatedEnvironment  |  ( |   | )
◆ CRhRdkSimulatedEnvironment() [2/2]
 CRhRdkSimulatedEnvironment::CRhRdkSimulatedEnvironment  |  ( |  const CRhRdkSimulatedEnvironment &  |  src | )
◆ ~CRhRdkSimulatedEnvironment()
 virtual CRhRdkSimulatedEnvironment::~CRhRdkSimulatedEnvironment  |  ( |   | )
virtual
Member Function Documentation
◆ AutomaticProjectionFromChildTexture()
 static BackgroundProjections CRhRdkSimulatedEnvironment::AutomaticProjectionFromChildTexture  |  ( |  const CRhRdkTexture *  |  pChildTexture | )
static
◆ BackgroundColor()
 ON_Color CRhRdkSimulatedEnvironment::BackgroundColor  |  ( |  void  |   | ) |   const
◆ BackgroundImage()
 const CRhRdkSimulatedTexture& CRhRdkSimulatedEnvironment::BackgroundImage  |  ( |  void  |   | ) |   const
◆ BackgroundProjection()
 BackgroundProjections CRhRdkSimulatedEnvironment::BackgroundProjection  |  ( |  void  |   | ) |   const
◆ EVF()
 virtual void* CRhRdkSimulatedEnvironment::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ operator=()
 const CRhRdkSimulatedEnvironment& CRhRdkSimulatedEnvironment::operator=  |  ( |  const CRhRdkSimulatedEnvironment &  |  src | )
◆ operator==()
 bool CRhRdkSimulatedEnvironment::operator==  |  ( |  const CRhRdkSimulatedEnvironment &  |  src | ) |   const
◆ ProjectionFromString()
 static BackgroundProjections CRhRdkSimulatedEnvironment::ProjectionFromString  |  ( |  const wchar_t *  |  wsz | )
static
◆ SetBackgroundColor()
 void CRhRdkSimulatedEnvironment::SetBackgroundColor  |  ( |  ON_Color  |  color | )
◆ SetBackgroundImage()
 void CRhRdkSimulatedEnvironment::SetBackgroundImage  |  ( |  const CRhRdkSimulatedTexture &  |  tex | )
◆ SetBackgroundProjection()
 void CRhRdkSimulatedEnvironment::SetBackgroundProjection  |  ( |  BackgroundProjections  |  proj | )
◆ StringFromProjection()
 static const wchar_t* CRhRdkSimulatedEnvironment::StringFromProjection  |  ( |  BackgroundProjections  |  proj | )
static