Public Member Functions | List of all members
ON_BrepEdgeArray Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepEdgeArray:
 Public Member Functions
ON_BrepEdgeArray ()
~ON_BrepEdgeArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepEdge >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (const ON_ObjectArray< ON_BrepEdge > &)
ON_ObjectArray (size_t)
size_t parameter = initial capacity More...
~ON_ObjectArray ()
override for struct member deallocation, etc. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *))
ON_ObjectArray< ON_BrepEdge > &  | operator= (const ON_ObjectArray< ON_BrepEdge > &)
bool  | QuickSort (int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *))
ON_BrepEdge *  | Realloc (ON_BrepEdge *, int)
 Public Member Functions inherited from ON_ClassArray< ON_BrepEdge >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< ON_BrepEdge > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const ON_BrepEdge &)
void  | Append (int, const ON_BrepEdge *)
Append copy of an array T[count]. More...
ON_BrepEdge &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepEdge *  | Array ()
The Array() function return the. More...
const ON_BrepEdge *  | Array () const
m_a pointer value. More...
ON_BrepEdge *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_BrepEdge *  | At (int) const
ON_BrepEdge *  | At (ON__INT64)
const ON_BrepEdge *  | At (ON__INT64) const
ON_BrepEdge *  | At (ON__UINT64)
const ON_BrepEdge *  | At (ON__UINT64) const
ON_BrepEdge *  | At (unsigned int)
const ON_BrepEdge *  | At (unsigned int) const
ON_BrepEdge *  | begin ()
Support STL iterators and algorithms. More...
ON_BrepEdge const *  | begin () const
int  | BinarySearch (const ON_BrepEdge *, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_BrepEdge *, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *), int) const
int  | Capacity () const
capacity of array More...
ON_BrepEdge const *  | cbegin () const
ON_BrepEdge const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_BrepEdge *  | end ()
ON_BrepEdge const *  | end () const
ON_BrepEdge *  | First ()
const ON_BrepEdge *  | First () const
returns nullptr if count = 0 More...
void  | Insert (int, const ON_BrepEdge &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const ON_BrepEdge &, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *))
int  | InsertInSortedList (const ON_BrepEdge &, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *), int)
ON_BrepEdge *  | KeepArray ()
ON_BrepEdge *  | Last ()
const ON_BrepEdge *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const ON_BrepEdge * () const
operator ON_BrepEdge * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< ON_BrepEdge > &other) const=delete
ON_ClassArray< ON_BrepEdge > &  | operator= (const ON_ClassArray< ON_BrepEdge > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< ON_BrepEdge > &other) const=delete
ON_BrepEdge &  | operator[] (int)
const ON_BrepEdge &  | operator[] (int) const
ON_BrepEdge &  | operator[] (ON__INT64)
const ON_BrepEdge &  | operator[] (ON__INT64) const
ON_BrepEdge &  | operator[] (ON__UINT64)
const ON_BrepEdge &  | operator[] (ON__UINT64) const
ON_BrepEdge &  | operator[] (unsigned int)
const ON_BrepEdge &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepEdge *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_BrepEdge *, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *)) const
void  | SetArray (ON_BrepEdge *p)
void  | SetArray (ON_BrepEdge *p, int count, int capacity)
ON_BrepEdge *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepEdge *, const ON_BrepEdge *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepEdge >
void  | ConstructDefaultElement (ON_BrepEdge *)
void  | DestroyElement (ON_BrepEdge &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepEdge >
ON_BrepEdge *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_BrepEdgeArray()
 ON_BrepEdgeArray::ON_BrepEdgeArray  |  ( |   | )
◆ ~ON_BrepEdgeArray()
 ON_BrepEdgeArray::~ON_BrepEdgeArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepEdgeArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepEdgeArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepEdgeArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const