Public Member Functions | List of all members
CRhRdkAction Class Referenceabstract
RDK
#include <RhRdkAction.h>
 Inheritance diagram for CRhRdkAction:
 Public Member Functions
CRhRdkAction (const UUID &uuidClient)
virtual  | ~CRhRdkAction ()
virtual ON_wString  | Caption (void) const =0
virtual bool  | Checked (void) const
virtual UUID  | Client (void) const
virtual WORD  | CommandId (void) const
virtual bool  | Enabled (void) const
virtual bool  | Execute (void)=0
virtual int  | Group (void) const
virtual bool  | Icon (const ON_2iSize &size, CRhinoDib &dibOut) const =0
virtual void  | SetActions (class CRhRdkActions *)
virtual void  | SetChecked (bool bCheck)
virtual void  | SetEnabled (bool bEnable)
virtual ON_wString  | ToolTip (void) const =0
virtual UUID  | Uuid (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class is deprecated in favor of CRhRdkCustomTask.
Constructor & Destructor Documentation
◆ CRhRdkAction()
 CRhRdkAction::CRhRdkAction  |  ( |  const UUID &  |  uuidClient | )
◆ ~CRhRdkAction()
 virtual CRhRdkAction::~CRhRdkAction  |  ( |   | )
virtual
Member Function Documentation
◆ Caption()
 virtual ON_wString CRhRdkAction::Caption  |  ( |  void  |   | ) |   const
pure virtual
◆ Checked()
 virtual bool CRhRdkAction::Checked  |  ( |  void  |   | ) |   const
virtual
◆ Client()
 virtual UUID CRhRdkAction::Client  |  ( |  void  |   | ) |   const
virtual
◆ CommandId()
 virtual WORD CRhRdkAction::CommandId  |  ( |  void  |   | ) |   const
virtual
◆ Enabled()
 virtual bool CRhRdkAction::Enabled  |  ( |  void  |   | ) |   const
virtual
◆ Execute()
 virtual bool CRhRdkAction::Execute  |  ( |  void  |   | )
pure virtual
◆ Group()
 virtual int CRhRdkAction::Group  |  ( |  void  |   | ) |   const
inlinevirtual
◆ Icon()
 virtual bool CRhRdkAction::Icon  |  ( |  const ON_2iSize &  |  size,
|  CRhinoDib &  |  dibOut
) |   |  const
pure virtual
◆ SetActions()
 virtual void CRhRdkAction::SetActions  |  ( |  class CRhRdkActions *  |   | )
virtual
◆ SetChecked()
 virtual void CRhRdkAction::SetChecked  |  ( |  bool  |  bCheck | )
virtual
◆ SetEnabled()
 virtual void CRhRdkAction::SetEnabled  |  ( |  bool  |  bEnable | )
virtual
◆ ToolTip()
 virtual ON_wString CRhRdkAction::ToolTip  |  ( |  void  |   | ) |   const
pure virtual
◆ Uuid()
 virtual UUID CRhRdkAction::Uuid  |  ( |  void  |   | ) |   const
pure virtual