Public Member Functions | List of all members
CRhRdkImportFromFile Class Referencefinal
RDK
#include <RhRdkTask.h>
 Public Member Functions
CRhRdkImportFromFile ()
~CRhRdkImportFromFile ()
bool  | Execute (const IRhRdkTaskOrigin &origin, CRhRdkContentArray &aContentOut) const
Constructor & Destructor Documentation
◆ CRhRdkImportFromFile()
 CRhRdkImportFromFile::CRhRdkImportFromFile  |  ( |   | )
◆ ~CRhRdkImportFromFile()
 CRhRdkImportFromFile::~CRhRdkImportFromFile  |  ( |   | )
Member Function Documentation
◆ Execute()
 bool CRhRdkImportFromFile::Execute  |  ( |  const IRhRdkTaskOrigin &  |  origin,
|  CRhRdkContentArray &  |  aContentOut
) |   |  const