Public Member Functions | List of all members
CRhinoMeshRef Class Reference
RhinoGet
#include <rhinoSdkGetObject.h>
 Inheritance diagram for CRhinoMeshRef:
 Public Member Functions
CRhinoMeshRef ()
CRhinoMeshRef (const CRhinoMeshRef &)
CRhinoMeshRef (CRhinoObject *, ON_Mesh *, BOOL32)
~CRhinoMeshRef ()
const ON_Mesh *  | Mesh () const
mesh object More...
CRhinoMeshRef &  | operator= (const CRhinoMeshRef &)
 Public Member Functions inherited from CRhinoObjRef
CRhinoObjRef ()
CRhinoObjRef (class CRhinoPolyEdge *polyedge, ON_3dmObjectAttributes *attributes)
CRhinoObjRef (const class CRhinoDoc &doc, class CRhinoPolyEdge *polyedge, const ON_3dmObjectAttributes *attributes)
CRhinoObjRef (const CRhinoObject *object)
CRhinoObjRef (const CRhinoObject *object, const class CRhinoGetObject &go)
CRhinoObjRef (const CRhinoObject *object, const CRhinoPickContext &pick_context)
CRhinoObjRef (const CRhinoObject *object, const ON_Geometry *geometry, BOOL32 bProxyGeometry)
CRhinoObjRef (const CRhinoObjRef &)
CRhinoObjRef (const ON_ObjRef &)
CRhinoObjRef (const UUID &object_uuid)
CRhinoObjRef (unsigned int doc_sn, const ON_ObjRef &)
CRhinoObjRef (unsigned int doc_sn, const UUID &object_uuid)
~CRhinoObjRef ()
const ON_Annotation *  | Annotation () const
const ON_Annotation *  | AnnotationParameter (double *annotation_parameter) const
bool  | BindToRuntimeObject ()
const ON_Brep *  | Brep () const
const ON_Curve *  | Curve () const
const ON_Curve *  | CurveParameter (double *curve_parameter) const
void  | DecrementReferenceCount ()
unsigned int  | DocumentRuntimeSerialNumber () const
const ON_BrepEdge *  | Edge () const
const ON_BrepEdge *  | Edge (bool bAllowProxy) const
const ON_Extrusion *  | Extrusion () const
const ON_BrepFace *  | Face () const
const ON_BrepFace *  | Face (bool bAllowProxy) const
int  | Flags () const
const ON_Geometry *  | Geometry () const
ON_COMPONENT_INDEX  | GeometryComponentIndex () const
CRhinoObject::GEOMETRY_TYPE  | GeometryType () const
const class CRhinoInstanceObject *  | GetInstanceTransformation (ON_Xform &xform, ON_SimpleArray< CNestedIRef > *nested_iref=0) const
bool  | IsSubGeometry () const
const ON_Light *  | Light () const
const ON_BrepLoop *  | Loop () const
const ON_Mesh *  | Mesh () const
const ON_MeshComponentRef *  | MeshComponentRef () const
const CRhinoObject *  | Object () const
ON_UUID  | ObjectUuid () const
bool  | operator!= (const CRhinoObjRef &) const
CRhinoObjRef &  | operator= (const CRhinoObjRef &)
bool  | operator== (const CRhinoObjRef &) const
const ON_Point *  | Point () const
const ON_PointCloud *  | PointCloud () const
unsigned int  | RhinoObjectRuntimeSerialNumber () const
const ON_TextContent *  | RichText () const
double  | SelectionDepth () const
double  | SelectionDistance () const
int  | SelectionMethod () const
bool  | SelectionPoint (ON_3dPoint &) const
int  | SelectionStyle () const
class CRhinoView *  | SelectionView () const
unsigned int  | SelectionViewDetailSerialNumber () const
void  | SetAnnotationSelectionPoint (ON_COMPONENT_INDEX component_index, const ON_3dPoint &point)
void  | SetCurveSelectionPoint (double curve_parameter, const ON_3dPoint &point)
void  | SetDetails (int flags, CRhinoObject::GEOMETRY_TYPE geotype, ON_COMPONENT_INDEX ci)
void  | SetEdgeSelectionPoint (double edge_parameter, const ON_3dPoint &point, const ON_BrepEdge &edge, const ON_BrepTrim &trim)
bool  | SetMeshEdgeSelectionPoint (int edge_index, double t, const ON_MeshTopology &meshtop)
bool  | SetMeshFaceSelectionPoint (int face_index, const double t[4], const ON_Mesh &mesh)
bool  | SetMeshVertexSelectionPoint (int vertex_index, const ON_Mesh &mesh)
bool  | SetParentInstanceObject (const class CRhinoInstanceObject *iref_object, int idef_geometry_index)
void  | SetSelectionComponent (ON_COMPONENT_INDEX component_index)
void  | SetSelectionDepth (double)
void  | SetSelectionDetailView (class CRhinoView *page_view, unsigned int detail_object_sn)
void  | SetSelectionDistance (double)
void  | SetSelectionPoint (const ON_3dPoint &point)
void  | SetSelectionView (class CRhinoView *)
void  | SetSurfaceSelectionPoint (double u, double v, const ON_3dPoint &point)
const ON_SubD *  | SubD () const
const ON_SubDComponentPtr  | SubDComponent () const
const ON_SubDComponentRef *  | SubDComponentRef () const
const ON_SubDEdge *  | SubDEdge () const
const ON_SubDComponentRef  | SubDEdgeRef () const
const ON_SubDFace *  | SubDFace () const
const ON_SubDComponentRef  | SubDFaceRef () const
ON_SubDRef  | SubDRef () const
const ON_SubDVertex *  | SubDVertex () const
const ON_SubDComponentRef  | SubDVertexRef () const
const ON_Surface *  | Surface () const
const ON_Surface *  | SurfaceParameter (double *u, double *v) const
const ON_BrepTrim *  | Trim () const
const ON_BrepTrim *  | Trim (bool bAllowProxy) const
const ON_BrepTrim *  | TrimParameter (double *trim_parameter) const
 Public Member Functions inherited from ON_ObjRef
ON_ObjRef ()
ON_ObjRef (const ON_ObjRef &src)
~ON_ObjRef ()
void  | DecrementProxyReferenceCount ()
void  | Destroy ()
ON_ObjRef &  | operator= (const ON_ObjRef &src)
const ON_Object *  | ProxyObject (int proxy_object_index) const
int  | ProxyReferenceCount () const
bool  | Read (ON_BinaryArchive &)
void  | RemapObjectId (const ON_SimpleArray< ON_UuidPair > &uuid_remap)
bool  | SetParentIRef (const ON_InstanceRef &iref, ON_UUID iref_id, int idef_geometry_index)
void  | SetProxy (ON_Object *proxy1, ON_Object *proxy2, bool bCountReferences)
bool  | Write (ON_BinaryArchive &) const
 Additional Inherited Members
 Public Attributes inherited from ON_ObjRef
ON_SimpleArray< ON_ObjRef_IRefID >  | m__iref
ON_COMPONENT_INDEX  | m_component_index
ON_ObjRefEvaluationParameter  | m_evp
const ON_Geometry *  | m_geometry
int  | m_geometry_type
ON::osnap_mode  | m_osnap_mode
const ON_Geometry *  | m_parent_geometry
ON_3dPoint  | m_point
unsigned  | m_rhino_doc_sn = 0
If m_rhino_doc_sn > 0, then is the value of ofthe Rhino doc CRhinoDoc::m_rhino_doc_sn that contains the object with m_runtime_sn or the document that should be searched for the object with id = m_uuid. More...
unsigned int  | m_runtime_sn
If m_runtime_sn > 0, then it is the value of a Rhino object's CRhinoObject::m_runtime_object_serial_number field. The serial number is used instead of the pointer to prevent crashes in cases when the CRhinoObject is deleted but an ON_ObjRef continues to reference the Rhino object. The value of m_runtime_sn is not saved in archives because it generally changes if you save and reload an archive. The Rhino document containing the CRhinoObject is identified by the m_rhino_doc_sn field below. More...
ON_UUID  | m_uuid
Detailed Description
CRhinoMeshRef is used to return mesh objects CLASS CRhinoMeshRef
Constructor & Destructor Documentation
◆ CRhinoMeshRef() [1/3]
 CRhinoMeshRef::CRhinoMeshRef  |  ( |   | )
◆ CRhinoMeshRef() [2/3]
 CRhinoMeshRef::CRhinoMeshRef  |  ( |  CRhinoObject *  |  ,
|  ON_Mesh *  |  ,
|  BOOL32
)
◆ ~CRhinoMeshRef()
 CRhinoMeshRef::~CRhinoMeshRef  |  ( |   | )
◆ CRhinoMeshRef() [3/3]
 CRhinoMeshRef::CRhinoMeshRef  |  ( |  const CRhinoMeshRef &  |   | )
Member Function Documentation
◆ Mesh()
 const ON_Mesh* CRhinoMeshRef::Mesh  |  ( |   | ) |   const
mesh object
◆ operator=()
 CRhinoMeshRef& CRhinoMeshRef::operator=  |  ( |  const CRhinoMeshRef &  |   | )