Public Types | Public Member Functions | Public Attributes | List of all members
ON_MeshIntersectionOptions Class Reference
OpenNURBS
Provides a mechanism for lazily evaluating mesh data. More...
#include <opennurbs_mesh.h>
 Inheritance diagram for ON_MeshIntersectionOptions:
 Public Types
enum  | Accuracy { Accuracy::ForVisualization, Accuracy::Standard }
Defines the desired accuracy of the intersection calculation. More...
 Public Member Functions
ON_MeshIntersectionOptions ()
~ON_MeshIntersectionOptions ()
ON_MeshIntersectionCache *  | MeshIntersectionCache () const
Defaults to nullptr. More...
bool  | MultithreadingEnabled () const
Defaults to true. More...
ON_ProgressReporter *  | ProgressReporter () const
Defaults to nullptr. More...
Accuracy  | RequestedAccuracy () const
Defaults to Accuracy::Standard. More...
void  | SetMeshIntersectionCache (ON_MeshIntersectionCache *cache)
void  | SetMultithreadingEnabled (bool enabled)
void  | SetProgressReporter (ON_ProgressReporter *reporter)
void  | SetRequestedAccuracy (Accuracy accuracy)
void  | SetTerminator (ON_Terminator *terminator)
void  | SetTextLog (ON_TextLog *log)
ON_Terminator *  | Terminator () const
Defaults to nullptr. More...
ON_TextLog *  | TextLog () const
Defaults to nullptr. More...
double  | Tolerance () const
Defaults to ON_ZERO_TOLERANCE void SetTolerance(double tolerance);. More...
 Public Attributes
ON_MeshIntersectionOptionsImplementation *  | m_impl
Detailed Description
Provides a mechanism for lazily evaluating mesh data.
Member Enumeration Documentation
◆ Accuracy
 enum ON_MeshIntersectionOptions::Accuracy
strong
Defines the desired accuracy of the intersection calculation.
Enumerator
ForVisualization
Fastest, lower quality, no overlap detection.
Standard
Default.
Constructor & Destructor Documentation
◆ ON_MeshIntersectionOptions()
 ON_MeshIntersectionOptions::ON_MeshIntersectionOptions  |  ( |   | )
◆ ~ON_MeshIntersectionOptions()
 ON_MeshIntersectionOptions::~ON_MeshIntersectionOptions  |  ( |   | )
Member Function Documentation
◆ MeshIntersectionCache()
 ON_MeshIntersectionCache* ON_MeshIntersectionOptions::MeshIntersectionCache  |  ( |   | ) |   const
Defaults to nullptr.
◆ MultithreadingEnabled()
 bool ON_MeshIntersectionOptions::MultithreadingEnabled  |  ( |   | ) |   const
Defaults to true.
◆ ProgressReporter()
 ON_ProgressReporter* ON_MeshIntersectionOptions::ProgressReporter  |  ( |   | ) |   const
Defaults to nullptr.
◆ RequestedAccuracy()
 Accuracy ON_MeshIntersectionOptions::RequestedAccuracy  |  ( |   | ) |   const
Defaults to Accuracy::Standard.
◆ SetMeshIntersectionCache()
 void ON_MeshIntersectionOptions::SetMeshIntersectionCache  |  ( |  ON_MeshIntersectionCache *  |  cache | )
◆ SetMultithreadingEnabled()
 void ON_MeshIntersectionOptions::SetMultithreadingEnabled  |  ( |  bool  |  enabled | )
◆ SetProgressReporter()
 void ON_MeshIntersectionOptions::SetProgressReporter  |  ( |  ON_ProgressReporter *  |  reporter | )
◆ SetRequestedAccuracy()
 void ON_MeshIntersectionOptions::SetRequestedAccuracy  |  ( |  Accuracy  |  accuracy | )
◆ SetTerminator()
 void ON_MeshIntersectionOptions::SetTerminator  |  ( |  ON_Terminator *  |  terminator | )
◆ SetTextLog()
 void ON_MeshIntersectionOptions::SetTextLog  |  ( |  ON_TextLog *  |  log | )
◆ Terminator()
 ON_Terminator* ON_MeshIntersectionOptions::Terminator  |  ( |   | ) |   const
Defaults to nullptr.
◆ TextLog()
 ON_TextLog* ON_MeshIntersectionOptions::TextLog  |  ( |   | ) |   const
Defaults to nullptr.
◆ Tolerance()
 double ON_MeshIntersectionOptions::Tolerance  |  ( |   | ) |   const
Defaults to ON_ZERO_TOLERANCE void SetTolerance(double tolerance);.
Member Data Documentation
◆ m_impl
 ON_MeshIntersectionOptionsImplementation* ON_MeshIntersectionOptions::m_impl