Public Types | Public Member Functions | List of all members
CRhRdkSunDialog Class Reference
RDK
#include <RhRdkSun.h>
 Inheritance diagram for CRhRdkSunDialog:
 Public Types
enum  | {
 ss_sun_options = 0x00000001, ss_skylight = 0x00000002, ss_sun_position = 0x00000004, ss_date_and_time = 0x00000008,
 ss_location = 0x00000010, ss_settings = 0x00000020, ss_all = 0x000000FF, ss_force_32_bit = 0xFFFFFFFF
 }
enum  | { so_lean_ui = 0x00000001, so_no_shadow = 0x00000002, so_force_32_bit = 0xFFFFFFFF }
 Public Member Functions
CRhRdkSunDialog (HWND pParent=NULL)
virtual  | ~CRhRdkSunDialog ()
virtual bool  | DoModal (void) const
virtual bool  | IgnoreOn (void) const
virtual UINT  | SectionOptions (void) const
virtual void  | SetCaption (const wchar_t *wszCaption)
void  | SetController (CRhRdkControllerPtr con)
virtual void  | SetIgnoreOn (bool b)
virtual void  | SetSectionOptions (UINT uFlags)
virtual void  | SetShowingSections (UINT uFlags)
virtual UINT  | ShowingSections (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class is a wrapper around a modal sun dialog. It is only used internally. SDK clients should not attempt to use this as it requires internal RDK classes to be used successfully. [SDK_UNFREEZE] Remove this from the public SDK.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
ss_sun_options
ss_skylight
ss_sun_position
ss_date_and_time
ss_location
ss_settings
ss_all
ss_force_32_bit
◆ anonymous enum
 anonymous enum
Enumerator
so_lean_ui
so_no_shadow
so_force_32_bit
Constructor & Destructor Documentation
◆ CRhRdkSunDialog()
 CRhRdkSunDialog::CRhRdkSunDialog  |  ( |  HWND  |  pParent = NULL | )
◆ ~CRhRdkSunDialog()
 virtual CRhRdkSunDialog::~CRhRdkSunDialog  |  ( |   | )
virtual
Member Function Documentation
◆ DoModal()
 virtual bool CRhRdkSunDialog::DoModal  |  ( |  void  |   | ) |   const
virtual
Call this method to display the sun dialog.
Returns
true if the user clicked OK, or false if the user cancelled.
◆ IgnoreOn()
 virtual bool CRhRdkSunDialog::IgnoreOn  |  ( |  void  |   | ) |   const
virtual
Returns
true if all UI is visible and usable even when 'on' is unchecked.
◆ SectionOptions()
 virtual UINT CRhRdkSunDialog::SectionOptions  |  ( |  void  |   | ) |   const
virtual
Get section options.
◆ SetCaption()
 virtual void CRhRdkSunDialog::SetCaption  |  ( |  const wchar_t *  |  wszCaption | )
virtual
Set the caption of the dialog. The default caption is "Sun Angle Calculator".
◆ SetController()
 void CRhRdkSunDialog::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
Set the controller for the dialog to get and set the sun data. The controller must have at least one data source that responds to uuidData_RdkSun.
◆ SetIgnoreOn()
 virtual void CRhRdkSunDialog::SetIgnoreOn  |  ( |  bool  |  b | )
virtual
Set if all UI is visible and usable even when 'on' is unchecked.
◆ SetSectionOptions()
 virtual void CRhRdkSunDialog::SetSectionOptions  |  ( |  UINT  |  uFlags | )
virtual
Set options for the dialog sections.
Parameters
uFlags | specifies the options as a bit-mask.
◆ SetShowingSections()
 virtual void CRhRdkSunDialog::SetShowingSections  |  ( |  UINT  |  uFlags | )
virtual
Set which sections of the dialog should be displayed.
Parameters
uFlags | specifies which sections to make visible as a bit-mask. The default is all sections are shown (depending on the state of manual control).
◆ ShowingSections()
 virtual UINT CRhRdkSunDialog::ShowingSections  |  ( |  void  |   | ) |   const
virtual
Get which sections of the dialog will be displayed.