Public Types | Public Member Functions | Protected Attributes | List of all members
CRhinoUiProgressCtrl Class Reference
RhinoUI
CRhinoUiProgressCtrl. More...
#include <RhinoSdkUiProgressCtrl.h>
 Inheritance diagram for CRhinoUiProgressCtrl:
 Public Types
enum  | display_mode { display_test = 1, display_percent = 2, display_text_and_percent = 3, force_32bit_display_mode = 0xFFFFFFFF }
 Public Member Functions
CRhinoUiProgressCtrl ()
virtual  | ~CRhinoUiProgressCtrl ()
COLORREF  | GetBkColor ()
Sets the text visibility. More...
COLORREF  | GetForeColor ()
Get an set the background color. More...
CString  | GetText ()
Advances the current position by a specified increment. More...
COLORREF  | GetTextBkColor ()
Get an set the foreground color. More...
COLORREF  | GetTextForeColor ()
Get an set the text background color. More...
int  | OffsetPos (int nPos)
Advances the current position by a step. More...
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg LRESULT  | OnGetText (WPARAM, LPARAM)
afx_msg void  | OnPaint ()
afx_msg LRESULT  | OnSetText (WPARAM, LPARAM)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
void  | SetBkColor (COLORREF cf)
void  | SetForeColor (COLORREF cf)
int  | SetPos (int nPos)
Sets the step increment. More...
void  | SetRange (int nLower, int nUpper)
void  | SetShowStyle (int nStyle)
Sets the text font. More...
void  | SetShowText (bool bShow)
Sets the text display style. More...
int  | SetStep (int nStep)
Sets the lower and upper range. More...
void  | SetText (LPCTSTR lpText)
void  | SetTextBkColor (COLORREF cf)
BOOL32  | SetTextFont (const LOGFONT &lf)
Gets and sets the text. More...
void  | SetTextForeColor (COLORREF cf)
int  | StepIt ()
Sets the position. More...
 Protected Attributes
bool  | m_bShowText
Text visibility. More...
COLORREF  | m_cfBackground
Background color. More...
COLORREF  | m_cfForeground
Foreground color. More...
COLORREF  | m_cfTextBackground
Text background color. More...
COLORREF  | m_cfTextForeground
Text foreground color. More...
CFont  | m_Font
Text font. More...
int  | m_nBarWidth
Vidth of the progress bar. More...
int  | m_nMax
Maximum range value. More...
int  | m_nMin
Minimum range value. More...
int  | m_nPos
Current position. More...
int  | m_nShowStyle
Text show style. More...
int  | m_nStepSize
Step increment. More...
CString  | m_strText
Progress bar text. More...
Detailed Description
CRhinoUiProgressCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Member Enumeration Documentation
◆ display_mode
 enum CRhinoUiProgressCtrl::display_mode
Enumerator
display_test
display_percent
display_text_and_percent
force_32bit_display_mode
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiProgressCtrl()
 CRhinoUiProgressCtrl::CRhinoUiProgressCtrl  |  ( |   | )
◆ ~CRhinoUiProgressCtrl()
 virtual CRhinoUiProgressCtrl::~CRhinoUiProgressCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ GetBkColor()
 COLORREF CRhinoUiProgressCtrl::GetBkColor  |  ( |   | )
inline
Sets the text visibility.
◆ GetForeColor()
 COLORREF CRhinoUiProgressCtrl::GetForeColor  |  ( |   | )
inline
Get an set the background color.
◆ GetText()
 CString CRhinoUiProgressCtrl::GetText  |  ( |   | )
inline
Advances the current position by a specified increment.
◆ GetTextBkColor()
 COLORREF CRhinoUiProgressCtrl::GetTextBkColor  |  ( |   | )
inline
Get an set the foreground color.
◆ GetTextForeColor()
 COLORREF CRhinoUiProgressCtrl::GetTextForeColor  |  ( |   | )
inline
Get an set the text background color.
◆ OffsetPos()
 int CRhinoUiProgressCtrl::OffsetPos  |  ( |  int  |  nPos | )
Advances the current position by a step.
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiProgressCtrl::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnGetText()
 afx_msg LRESULT CRhinoUiProgressCtrl::OnGetText  |  ( |  WPARAM  |  ,
|  LPARAM
)
◆ OnPaint()
 afx_msg void CRhinoUiProgressCtrl::OnPaint  |  ( |   | )
◆ OnSetText()
 afx_msg LRESULT CRhinoUiProgressCtrl::OnSetText  |  ( |  WPARAM  |  ,
|  LPARAM
)
◆ OnSize()
 afx_msg void CRhinoUiProgressCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ SetBkColor()
 void CRhinoUiProgressCtrl::SetBkColor  |  ( |  COLORREF  |  cf | )
inline
◆ SetForeColor()
 void CRhinoUiProgressCtrl::SetForeColor  |  ( |  COLORREF  |  cf | )
inline
◆ SetPos()
 int CRhinoUiProgressCtrl::SetPos  |  ( |  int  |  nPos | )
Sets the step increment.
◆ SetRange()
 void CRhinoUiProgressCtrl::SetRange  |  ( |  int  |  nLower,
|  int  |  nUpper
)
◆ SetShowStyle()
 void CRhinoUiProgressCtrl::SetShowStyle  |  ( |  int  |  nStyle | )
Sets the text font.
◆ SetShowText()
 void CRhinoUiProgressCtrl::SetShowText  |  ( |  bool  |  bShow | )
Sets the text display style.
◆ SetStep()
 int CRhinoUiProgressCtrl::SetStep  |  ( |  int  |  nStep | )
Sets the lower and upper range.
◆ SetText()
 void CRhinoUiProgressCtrl::SetText  |  ( |  LPCTSTR  |  lpText | )
◆ SetTextBkColor()
 void CRhinoUiProgressCtrl::SetTextBkColor  |  ( |  COLORREF  |  cf | )
inline
◆ SetTextFont()
 BOOL32 CRhinoUiProgressCtrl::SetTextFont  |  ( |  const LOGFONT &  |  lf | )
Gets and sets the text.
◆ SetTextForeColor()
 void CRhinoUiProgressCtrl::SetTextForeColor  |  ( |  COLORREF  |  cf | )
inline
◆ StepIt()
 int CRhinoUiProgressCtrl::StepIt  |  ( |   | )
Sets the position.
Member Data Documentation
◆ m_bShowText
 bool CRhinoUiProgressCtrl::m_bShowText
protected
Text visibility.
◆ m_cfBackground
 COLORREF CRhinoUiProgressCtrl::m_cfBackground
protected
Background color.
◆ m_cfForeground
 COLORREF CRhinoUiProgressCtrl::m_cfForeground
protected
Foreground color.
◆ m_cfTextBackground
 COLORREF CRhinoUiProgressCtrl::m_cfTextBackground
protected
Text background color.
◆ m_cfTextForeground
 COLORREF CRhinoUiProgressCtrl::m_cfTextForeground
protected
Text foreground color.
◆ m_Font
 CFont CRhinoUiProgressCtrl::m_Font
protected
Text font.
◆ m_nBarWidth
 int CRhinoUiProgressCtrl::m_nBarWidth
protected
Vidth of the progress bar.
◆ m_nMax
 int CRhinoUiProgressCtrl::m_nMax
protected
Maximum range value.
◆ m_nMin
 int CRhinoUiProgressCtrl::m_nMin
protected
Minimum range value.
◆ m_nPos
 int CRhinoUiProgressCtrl::m_nPos
protected
Current position.
◆ m_nShowStyle
 int CRhinoUiProgressCtrl::m_nShowStyle
protected
Text show style.
◆ m_nStepSize
 int CRhinoUiProgressCtrl::m_nStepSize
protected
Step increment.
◆ m_strText
 CString CRhinoUiProgressCtrl::m_strText
protected
Progress bar text.