Public Member Functions | List of all members
ON_RtfFirstChar::TextRun Class Reference
#include <opennurbs_textiterator.h>
 Public Member Functions
TextRun ()
void  | AddText (const wchar_t *str)
int  | FontIndex ()
void  | InitRun ()
bool  | IsBold () const
bool  | IsItalic () const
bool  | IsStrikeThrough () const
bool  | IsUnderlined () const
void  | SetBold (bool b)
void  | SetFontIndex (int index)
void  | SetItalic (bool b)
void  | SetStrikeThrough (bool b)
void  | SetType (ON_TextRun::RunType type)
void  | SetUnderlined (bool b)
const ON_wString &  | Text ()
ON_TextRun::RunType  | Type () const
Constructor & Destructor Documentation
◆ TextRun()
 ON_RtfFirstChar::TextRun::TextRun  |  ( |   | )
inline
Member Function Documentation
◆ AddText()
 void ON_RtfFirstChar::TextRun::AddText  |  ( |  const wchar_t *  |  str | )
inline
◆ FontIndex()
 int ON_RtfFirstChar::TextRun::FontIndex  |  ( |   | )
inline
◆ InitRun()
 void ON_RtfFirstChar::TextRun::InitRun  |  ( |   | )
inline
◆ IsBold()
 bool ON_RtfFirstChar::TextRun::IsBold  |  ( |   | ) |   const
inline
◆ IsItalic()
 bool ON_RtfFirstChar::TextRun::IsItalic  |  ( |   | ) |   const
inline
◆ IsStrikeThrough()
 bool ON_RtfFirstChar::TextRun::IsStrikeThrough  |  ( |   | ) |   const
inline
◆ IsUnderlined()
 bool ON_RtfFirstChar::TextRun::IsUnderlined  |  ( |   | ) |   const
inline
◆ SetBold()
 void ON_RtfFirstChar::TextRun::SetBold  |  ( |  bool  |  b | )
inline
◆ SetFontIndex()
 void ON_RtfFirstChar::TextRun::SetFontIndex  |  ( |  int  |  index | )
inline
◆ SetItalic()
 void ON_RtfFirstChar::TextRun::SetItalic  |  ( |  bool  |  b | )
inline
◆ SetStrikeThrough()
 void ON_RtfFirstChar::TextRun::SetStrikeThrough  |  ( |  bool  |  b | )
inline
◆ SetType()
 void ON_RtfFirstChar::TextRun::SetType  |  ( |  ON_TextRun::RunType  |  type | )
inline
◆ SetUnderlined()
 void ON_RtfFirstChar::TextRun::SetUnderlined  |  ( |  bool  |  b | )
inline
◆ Text()
 const ON_wString& ON_RtfFirstChar::TextRun::Text  |  ( |   | )
inline
◆ Type()
 ON_TextRun::RunType ON_RtfFirstChar::TextRun::Type  |  ( |   | ) |   const
inline