Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ON_Environment Class Reference
OpenNURBS
ON_Environment. More...
#include <opennurbs_render_content.h>
 Inheritance diagram for ON_Environment:
 Public Types
enum  | BackgroundProjections : unsigned int {
 BackgroundProjections::Planar = 0, BackgroundProjections::Spherical = 1, BackgroundProjections::Emap = 2, BackgroundProjections::Box = 3,
 BackgroundProjections::Automatic = 4, BackgroundProjections::LightProbe = 5, BackgroundProjections::CubeMap = 6, BackgroundProjections::VerticalCrossCubeMap = 7,
 BackgroundProjections::HorizontalCrossCubeMap = 8, BackgroundProjections::Hemispherical = 9
 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
ON_Environment ()
ON_Environment (const ON_Environment &src)
virtual  | ~ON_Environment ()
virtual ON_Color  | BackgroundColor (void) const
virtual const ON_Texture &  | BackgroundImage (void) const
virtual BackgroundProjections  | BackgroundProjection (void) const
virtual bool  | operator!= (const ON_Environment &src) const
virtual const ON_Environment &  | operator= (const ON_Environment &src)
virtual bool  | operator== (const ON_Environment &src) const
virtual void  | SetBackgroundColor (const ON_Color &col)
virtual void  | SetBackgroundImage (const ON_Texture &tex)
virtual void  | SetBackgroundProjection (BackgroundProjections proj)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual bool  | IsValid (class ON_TextLog *text_log=nullptr) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
virtual unsigned int  | SizeOf () const
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static BackgroundProjections  | ProjectionFromString (const wchar_t *proj)
static const wchar_t *  | StringFromProjection (BackgroundProjections proj)
 Protected Member Functions
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
Emergency virtual function for future expansion. More...
Detailed Description
ON_Environment.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Enumeration Documentation
◆ BackgroundProjections
 enum ON_Environment::BackgroundProjections : unsigned int
strong
Enumerator
Planar
Spherical
Equirectangular projection.
Emap
Mirror ball.
Box
Automatic
LightProbe
CubeMap
VerticalCrossCubeMap
HorizontalCrossCubeMap
Hemispherical
Constructor & Destructor Documentation
◆ ON_Environment() [1/2]
 ON_Environment::ON_Environment  |  ( |   | )
◆ ON_Environment() [2/2]
 ON_Environment::ON_Environment  |  ( |  const ON_Environment &  |  src | )
◆ ~ON_Environment()
 virtual ON_Environment::~ON_Environment  |  ( |   | )
virtual
Member Function Documentation
◆ BackgroundColor()
 virtual ON_Color ON_Environment::BackgroundColor  |  ( |  void  |   | ) |   const
virtual
◆ BackgroundImage()
 virtual const ON_Texture& ON_Environment::BackgroundImage  |  ( |  void  |   | ) |   const
virtual
◆ BackgroundProjection()
 virtual BackgroundProjections ON_Environment::BackgroundProjection  |  ( |  void  |   | ) |   const
virtual
◆ EVF()
 virtual void* ON_Environment::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
protectedvirtual
Emergency virtual function for future expansion.
◆ operator!=()
 virtual bool ON_Environment::operator!=  |  ( |  const ON_Environment &  |  src | ) |   const
virtual
◆ operator=()
 virtual const ON_Environment& ON_Environment::operator=  |  ( |  const ON_Environment &  |  src | )
virtual
◆ operator==()
 virtual bool ON_Environment::operator==  |  ( |  const ON_Environment &  |  src | ) |   const
virtual
◆ ProjectionFromString()
 static BackgroundProjections ON_Environment::ProjectionFromString  |  ( |  const wchar_t *  |  proj | )
static
◆ SetBackgroundColor()
 virtual void ON_Environment::SetBackgroundColor  |  ( |  const ON_Color &  |  col | )
virtual
◆ SetBackgroundImage()
 virtual void ON_Environment::SetBackgroundImage  |  ( |  const ON_Texture &  |  tex | )
virtual
◆ SetBackgroundProjection()
 virtual void ON_Environment::SetBackgroundProjection  |  ( |  BackgroundProjections  |  proj | )
virtual
◆ StringFromProjection()
 static const wchar_t* ON_Environment::StringFromProjection  |  ( |  BackgroundProjections  |  proj | )
static