Public Member Functions | Protected Member Functions | List of all members
CRhinoBrepObject Class Reference
Rhino
#include <rhinoSdkBrepObject.h>
 Inheritance diagram for CRhinoBrepObject:
 Public Member Functions
CRhinoBrepObject ()
assigns a new object UUID More...
CRhinoBrepObject (const CRhinoBrepObject &)
copies source object UUID More...
CRhinoBrepObject (const ON_3dmObjectAttributes &)
assigns a new object UUID More...
~CRhinoBrepObject ()
ON_BoundingBox  | BoundingBox () const override
virtual CRhinoObject::BoundingBox override More...
ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const override
virtual CRhinoObject::BoundingBox override More...
const ON_Brep *  | Brep () const
class CRhBrepDisplay *  | BrepDisplay () const
bool  | BrepDisplayExists () const
int  | CreateMeshes (ON::mesh_type, const ON_MeshParameters &, bool bIgnoreCustom=false) override
virtual CRhinoObject::CreateMeshes override More...
void  | DeleteFromDocNotification () override
void  | DestroyMeshes (ON::mesh_type meshType, bool deleteMeshes=true) override
virtual CRhinoObject::DestroyMeshes override More...
void  | DestroyRuntimeCache (bool bDelete=true) override
void  | Draw (CRhinoDisplayPipeline &dp) const override
virtual CRhinoObject::Draw override More...
void  | DrawHighlightedSubObjects (CRhinoDisplayPipeline &dp) const override
virtual CRhinoObject::DrawHighlightedSubObjects override More...
void  | DrawSubObject (CRhinoDisplayPipeline &dp, ON_COMPONENT_INDEX componentIndex) const override
virtual CRhinoObject::DrawSubObject override More...
virtual void  | DrawV6 (class CRhinoObjectDrawContext *drawContext) const RHINO_NOEXCEPT override
virtual CRhinoObject::DrawV6 override More...
void  | EnableGrips (bool gripsOn) override
virtual CRhinoObject::EnableGrips override More...
bool  | GetFrame (ON_Plane &plane) const override
int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &componentIndices) const override
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
Servicing the fake-virtual function in CRhinoObject. More...
int  | GetMeshes (ON::mesh_type, ON_SimpleArray< const ON_Mesh * > &) const override
virtual CRhinoObject::GetMeshes override More...
int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &componentIndices) const override
int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=nullptr) const override
virtual CRhinoObject::GetSubObjects override More...
bool  | GetTightBoundingBox (ON_BoundingBox &tightBbox, bool growBox=false, const ON_Xform *xform=nullptr) const override
virtual CRhinoObject::GetTightBoundingBox override More...
int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curveList) const override
virtual CRhinoObject::GetWireframeCurves override More...
bool  | HighlightRequiresRedraw () const override
bool  | HighlightSubObject (ON_COMPONENT_INDEX componentIndex, bool highlight=true) const override
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
bool  | IsMeshable (ON::mesh_type) const override
virtual CRhinoObject::IsMeshable override More...
bool  | IsSolid () const override
virtual CRhinoObject::IsSolid override More...
bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX componentIndex) const override
true if specified component is highlighted More...
bool  | IsSubObjectSelected (ON_COMPONENT_INDEX componentIndex) const override
int  | MeshCount (ON::mesh_type meshType, const ON_MeshParameters *mp=nullptr) const override
virtual CRhinoObject::MeshCount override More...
const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int meshIndex, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &displayAttrs) const override
virtual CRhinoObject::MeshDisplayAttributes override More...
ON::object_type  | ObjectType () const override
ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const override
virtual CRhinoObject::OnDoubleClick override More...
CRhinoBrepObject &  | operator= (const CRhinoBrepObject &)
copies source object UUID More...
int  | Pick (const CRhinoPickContext &pickContext, CRhinoObjRefArray &objRefs) const override
virtual CRhinoObject::Pick override More...
bool  | PickFilter (const CRhinoGetObject &go, bool) const override
virtual CRhinoObject::PickFilter override More...
bool  | PromotePreviewMeshes (ON::mesh_type) override
int  | SelectSubObject (ON_COMPONENT_INDEX componentIndex, bool select=true, bool synchHighlight=true, bool persistentSelect=false) const override
void  | SetBrep (ON_Brep *brep)
~CRhinoBrepObject() will delete the brep More...
bool  | SetRenderMeshParameters (const ON_MeshParameters &mp) override
virtual CRhinoObject::SetRenderMeshParameters override More...
bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *objectXform, bool lazy=true) const override
virtual CRhinoObject::SetTextureCoordinates override More...
const wchar_t *  | ShortDescription (bool plural) const override
bool  | SnapTo (const CRhinoSnapContext &snapContext, CRhinoSnapEvent &snapEvent) const override
virtual CRhinoObject::SnapTo override More...
int  | UnhighlightAllSubObjects () override
returns number of changed subobjects More...
int  | UnselectAllSubObjects () override
returns number of unselected subobjects More...
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
virtual void  | AddToDocNotification ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
bool  | Highlight (bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Protected Member Functions
int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &componentsWithSubobjectMaterials) const override
bool  | HasSubobjectMaterials () const override
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=nullptr) const override
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=nullptr) const override
int  | SubObjectsAreHighlighted () const override
returns number of highlighted subobjects More...
int  | SubObjectsAreSelected () const override
virtual overrides to support subobject selection More...
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoBrepObject() [1/3]
 CRhinoBrepObject::CRhinoBrepObject  |  ( |   | )
assigns a new object UUID
◆ CRhinoBrepObject() [2/3]
 CRhinoBrepObject::CRhinoBrepObject  |  ( |  const ON_3dmObjectAttributes &  |   | )
assigns a new object UUID
◆ ~CRhinoBrepObject()
 CRhinoBrepObject::~CRhinoBrepObject  |  ( |   | )
◆ CRhinoBrepObject() [3/3]
 CRhinoBrepObject::CRhinoBrepObject  |  ( |  const CRhinoBrepObject &  |   | )
copies source object UUID
Member Function Documentation
◆ BoundingBox() [1/2]
 ON_BoundingBox CRhinoBrepObject::BoundingBox  |  ( |   | ) |   const
overridevirtual
virtual CRhinoObject::BoundingBox override
Reimplemented from CRhinoObject.
◆ BoundingBox() [2/2]
 ON_BoundingBox CRhinoBrepObject::BoundingBox  |  ( |  const class CRhinoViewport *  |  pViewport | ) |   const
overridevirtual
virtual CRhinoObject::BoundingBox override
Reimplemented from CRhinoObject.
◆ Brep()
 const ON_Brep* CRhinoBrepObject::Brep  |  ( |   | ) |   const
◆ BrepDisplay()
 class CRhBrepDisplay* CRhinoBrepObject::BrepDisplay  |  ( |   | ) |   const
◆ BrepDisplayExists()
 bool CRhinoBrepObject::BrepDisplayExists  |  ( |   | ) |   const
◆ CreateMeshes()
 int CRhinoBrepObject::CreateMeshes  |  ( |  ON::mesh_type  |  ,
|  const ON_MeshParameters &  |  ,
|  bool  |  bIgnoreCustom = false
)
overridevirtual
virtual CRhinoObject::CreateMeshes override
Reimplemented from CRhinoObject.
◆ DeleteFromDocNotification()
 void CRhinoBrepObject::DeleteFromDocNotification  |  ( |   | )
overridevirtual
Description: This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
Reimplemented from CRhinoObject.
◆ DestroyMeshes()
 void CRhinoBrepObject::DestroyMeshes  |  ( |  ON::mesh_type  |  meshType,
|  bool  |  deleteMeshes = true
)
overridevirtual
virtual CRhinoObject::DestroyMeshes override
Reimplemented from CRhinoObject.
◆ DestroyRuntimeCache()
 void CRhinoBrepObject::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Expert interface Description: Expert user function. If you are using openNURBS in its default configuration to read and write 3dm archives, you never need to call this function. Many objects employ lazy creation of (runtime) caches that save information to help speed geometric calculations. This function will destroy all runtime information. Parameters: bDelete - [in] if true, any cached information is properly deleted. If false, any cached information is simply discarded. This is useful when the cached information may be in alternate memory pools that are managed in nonstandard ways.
Reimplemented from ON_Object.
◆ Draw()
 void CRhinoBrepObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | ) |   const
overridevirtual
virtual CRhinoObject::Draw override
Reimplemented from CRhinoObject.
◆ DrawHighlightedSubObjects()
 void CRhinoBrepObject::DrawHighlightedSubObjects  |  ( |  CRhinoDisplayPipeline &  |  dp | ) |   const
overridevirtual
virtual CRhinoObject::DrawHighlightedSubObjects override
Reimplemented from CRhinoObject.
◆ DrawSubObject()
 void CRhinoBrepObject::DrawSubObject  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  ON_COMPONENT_INDEX  |  componentIndex
) |   |  const
overridevirtual
virtual CRhinoObject::DrawSubObject override
Reimplemented from CRhinoObject.
◆ DrawV6()
 virtual void CRhinoBrepObject::DrawV6  |  ( |  class CRhinoObjectDrawContext *  |  drawContext | ) |   const
overridevirtual
virtual CRhinoObject::DrawV6 override
Reimplemented from CRhinoObject.
◆ EnableGrips()
 void CRhinoBrepObject::EnableGrips  |  ( |  bool  |  gripsOn | )
overridevirtual
virtual CRhinoObject::EnableGrips override
Reimplemented from CRhinoObject.
◆ GetFrame()
 bool CRhinoBrepObject::GetFrame  |  ( |  ON_Plane &  |  plane | ) |   const
overridevirtual
Description: Gets 3d frame for object. Parameters: plane - [out] 3d frame Returns: true if successful
Reimplemented from CRhinoObject.
◆ GetHighlightedSubObjects()
 int CRhinoBrepObject::GetHighlightedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all highlighted sub-objects Parameters: component_indices - [out] component indices of highlighted sub-objects. Returns: number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ GetMeshes() [1/2]
 std::vector<std::shared_ptr<const ON_Mesh> > CRhinoBrepObject::GetMeshes  |  ( |  ON::mesh_type  |  mesh_type | ) |   const
Servicing the fake-virtual function in CRhinoObject.
◆ GetMeshes() [2/2]
 int CRhinoBrepObject::GetMeshes  |  ( |  ON::mesh_type  |  ,
|  ON_SimpleArray< const ON_Mesh * > &
) |   |  const
overridevirtual
virtual CRhinoObject::GetMeshes override
Reimplemented from CRhinoObject.
◆ GetSelectedSubObjects()
 int CRhinoBrepObject::GetSelectedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all selected sub-objects Parameters: component_indices - [out] component indices of selected sub-objects. Returns: number of selected subobjects
Reimplemented from CRhinoObject.
◆ GetSubobjectMaterialComponents()
 int CRhinoBrepObject::GetSubobjectMaterialComponents  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  componentsWithSubobjectMaterials | ) |   const
overrideprotectedvirtual
Reimplemented from CRhinoObject.
◆ GetSubObjects()
 int CRhinoBrepObject::GetSubObjects  |  ( |  ON_SimpleArray< CRhinoObject * > &  |  subObjects,
|  const class CRhinoViewport *  |  pViewport = nullptr
) |   |  const
overridevirtual
virtual CRhinoObject::GetSubObjects override
Reimplemented from CRhinoObject.
◆ GetTightBoundingBox()
 bool CRhinoBrepObject::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tightBbox,
|  bool  |  growBox = false,
|  const ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual CRhinoObject::GetTightBoundingBox override
Reimplemented from CRhinoObject.
◆ GetWireframeCurves()
 int CRhinoBrepObject::GetWireframeCurves  |  ( |  ON_SimpleArray< ON_Curve * > &  |  curveList | ) |   const
overridevirtual
virtual CRhinoObject::GetWireframeCurves override
Reimplemented from CRhinoObject.
◆ HasSubobjectMaterials()
 bool CRhinoBrepObject::HasSubobjectMaterials  |  ( |   | ) |   const
overrideprotectedvirtual
Reimplemented from CRhinoObject.
◆ HighlightRequiresRedraw()
 bool CRhinoBrepObject::HighlightRequiresRedraw  |  ( |   | ) |   const
overridevirtual
true if pixels used by highlighted object differ from pixels used by highlighted object.
Reimplemented from CRhinoObject.
◆ HighlightSubObject()
 bool CRhinoBrepObject::HighlightSubObject  |  ( |  ON_COMPONENT_INDEX  |  componentIndex,
|  bool  |  highlight = true
) |   |  const
overridevirtual
Reimplemented from CRhinoObject.
◆ InitialObjectFrame()
 ON_Plane CRhinoBrepObject::InitialObjectFrame  |  ( |  const CRhinoDoc &  |   | ) |   const
◆ IsMeshable()
 bool CRhinoBrepObject::IsMeshable  |  ( |  ON::mesh_type  |   | ) |   const
overridevirtual
virtual CRhinoObject::IsMeshable override
Reimplemented from CRhinoObject.
◆ IsSolid()
 bool CRhinoBrepObject::IsSolid  |  ( |   | ) |   const
overridevirtual
virtual CRhinoObject::IsSolid override
Reimplemented from CRhinoObject.
◆ IsSubObjectHighlighted()
 bool CRhinoBrepObject::IsSubObjectHighlighted  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
true if specified component is highlighted
Reimplemented from CRhinoObject.
◆ IsSubObjectSelected()
 bool CRhinoBrepObject::IsSubObjectSelected  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
Description: Check sub-object selection state. Parameters: component_index - [in] index of subobject to check Remarks: subobject cannot be persistently selected Returns: @untitled table false sub-object is not selected true sub-object is selected
Reimplemented from CRhinoObject.
◆ MeshCount()
 int CRhinoBrepObject::MeshCount  |  ( |  ON::mesh_type  |  meshType,
|  const ON_MeshParameters *  |  mp = nullptr
) |   |  const
overridevirtual
virtual CRhinoObject::MeshCount override
Reimplemented from CRhinoObject.
◆ MeshDisplayAttributes()
 const class CDisplayPipelineAttributes* CRhinoBrepObject::MeshDisplayAttributes  |  ( |  int  |  meshIndex,
|  const ON_Mesh &  |  mesh,
|  const class CDisplayPipelineAttributes &  |  displayAttrs
) |   |  const
overridevirtual
virtual CRhinoObject::MeshDisplayAttributes override
Reimplemented from CRhinoObject.
◆ ObjectMaterial() [1/5]
 virtual const CRhinoMaterial& CRhinoObject::ObjectMaterial
protected
Description: Gets the material used to render the object's front side. Parameters: plugin_id - [in] (optional) If not present, the plugin_id returned by RhinoApp().GetDefaultRenderApp() is used. Returns: A reference to a rendering material. When no material is explicitly specified, this is the default material RhinoApp().AppSettings().DefaultMaterial().
NOTE WELL: If the material table is modified, this pointer will become invalid. Do not use this pointer for saving long term reference to the material. Use the material index or id instead. See Also CRhinoObjectAttributes::ObjectMaterialRef CRhinoMaterialTable::GetMaterials CRhinoObject::ObjectMaterialRef
◆ ObjectMaterial() [2/5]
 virtual const CRhinoMaterial& CRhinoObject::ObjectMaterial
protected
◆ ObjectMaterial() [3/5]
 virtual const CRhinoMaterial& CRhinoObject::ObjectMaterial
protected
This is now the preferred version of the function. This should be used to get materials component-wise in all cases.
◆ ObjectMaterial() [4/5]
 const CRhinoMaterial& CRhinoBrepObject::ObjectMaterial  |  ( |  const ON_COMPONENT_INDEX &  |  ci,
|  const ON_UUID &  |  plugin_id = RhinoDefaultRendererId(),
|  const ON_3dmObjectAttributes *  |  attrs = nullptr
) |   |  const
overrideprotectedvirtual
This is now the preferred version of the function. This should be used to get materials component-wise in all cases.
Reimplemented from CRhinoObject.
◆ ObjectMaterial() [5/5]
 virtual const CRhinoMaterial& CRhinoObject::ObjectMaterial
protected
◆ ObjectRdkMaterial()
 const CRhRdkMaterial* CRhinoBrepObject::ObjectRdkMaterial  |  ( |  const ON_COMPONENT_INDEX &  |  ci,
|  const ON_UUID &  |  plugin_id = RhinoDefaultRendererId(),
|  const ON_3dmObjectAttributes *  |  attrs = nullptr
) |   |  const
overrideprotectedvirtual
This version of ObjectMaterial returns the RDK material associated with an object if there is one. It directly corresponds to the function above that returns the material in the document material table.
Reimplemented from CRhinoObject.
◆ ObjectType()
 ON::object_type CRhinoBrepObject::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: Returns a constant that determines the type of CRhinoObject. Returns: ON::brep_object Remarks: A brep object can be a surface or polysurface. An annotation object can be anything derived from CRhinoAnnotation.
Implements CRhinoObject.
◆ OnDoubleClick()
 ON_wString CRhinoBrepObject::OnDoubleClick  |  ( |  const CRhinoDoubleClickContext &  |  double_click_context | ) |   const
overridevirtual
virtual CRhinoObject::OnDoubleClick override
Reimplemented from CRhinoObject.
◆ operator=()
 CRhinoBrepObject& CRhinoBrepObject::operator=  |  ( |  const CRhinoBrepObject &  |   | )
copies source object UUID
◆ Pick()
 int CRhinoBrepObject::Pick  |  ( |  const CRhinoPickContext &  |  pickContext,
|  CRhinoObjRefArray &  |  objRefs
) |   |  const
overridevirtual
virtual CRhinoObject::Pick override
Reimplemented from CRhinoObject.
◆ PickFilter()
 bool CRhinoBrepObject::PickFilter  |  ( |  const CRhinoGetObject &  |  go,
|  bool
) |   |  const
override
virtual CRhinoObject::PickFilter override
◆ PromotePreviewMeshes()
 bool CRhinoBrepObject::PromotePreviewMeshes  |  ( |  ON::mesh_type  |   | )
overridevirtual
Reimplemented from CRhinoObject.
◆ SelectSubObject()
 int CRhinoBrepObject::SelectSubObject  |  ( |  ON_COMPONENT_INDEX  |  component_index,
|  bool  |  bSelect = true,
|  bool  |  bSynchHighlight = true,
|  bool  |  bPersistentSelect = false
) |   |  const
overridevirtual
Description: Reports if an object can be selected. Parameters: component_index - [in] index of subobject to check bSelect - [in] (default=true) bSynchHighlight - [in] (default=true) If true, then the object is highlighted if it is selected and not highlighted if is not selected. bPersistentSelect - [in] (default=false) Subobjects that are persistently selected stay selected when a command terminates. Returns: 0: object is not selected 1: object is selected 2: object is selected persistently Remarks: Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on. See Also: CRhinoDoc::UnselectAll CRhinoView::UnselectAllSubObjects
Reimplemented from CRhinoObject.
◆ SetBrep()
 void CRhinoBrepObject::SetBrep  |  ( |  ON_Brep *  |  brep | )
~CRhinoBrepObject() will delete the brep
◆ SetRenderMeshParameters()
 bool CRhinoBrepObject::SetRenderMeshParameters  |  ( |  const ON_MeshParameters &  |  mp | )
overridevirtual
virtual CRhinoObject::SetRenderMeshParameters override
Reimplemented from CRhinoObject.
◆ SetTextureCoordinates()
 bool CRhinoBrepObject::SetTextureCoordinates  |  ( |  const ON_TextureMapping &  |  mapping,
|  const ON_Xform *  |  objectXform,
|  bool  |  lazy = true
) |   |  const
overridevirtual
virtual CRhinoObject::SetTextureCoordinates override
Reimplemented from CRhinoObject.
◆ ShortDescription()
 const wchar_t* CRhinoBrepObject::ShortDescription  |  ( |  bool  |  plural | ) |   const
overridevirtual
Description: virtual CRhinoObject::ShortDescription override Returns: "surface", "surfaces", "polysurface", or "polysurfaces"
Implements CRhinoObject.
◆ SnapTo()
 bool CRhinoBrepObject::SnapTo  |  ( |  const CRhinoSnapContext &  |  snapContext,
|  CRhinoSnapEvent &  |  snapEvent
) |   |  const
overridevirtual
virtual CRhinoObject::SnapTo override
Reimplemented from CRhinoObject.
◆ SubObjectsAreHighlighted()
 int CRhinoBrepObject::SubObjectsAreHighlighted  |  ( |   | ) |   const
overrideprotectedvirtual
returns number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ SubObjectsAreSelected()
 int CRhinoBrepObject::SubObjectsAreSelected  |  ( |   | ) |   const
overrideprotectedvirtual
virtual overrides to support subobject selection
Reimplemented from CRhinoObject.
◆ UnhighlightAllSubObjects()
 int CRhinoBrepObject::UnhighlightAllSubObjects  |  ( |   | )
overridevirtual
returns number of changed subobjects
Reimplemented from CRhinoObject.
◆ UnselectAllSubObjects()
 int CRhinoBrepObject::UnselectAllSubObjects  |  ( |   | )
overridevirtual
returns number of unselected subobjects
Reimplemented from CRhinoObject.