Public Attributes | List of all members
ON_MeshXPointPair Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Attributes
class ON_MeshXPoint *  | m_mxpoint [2]
Member Data Documentation
◆ m_mxpoint
 class ON_MeshXPoint* ON_MeshXPointPair::m_mxpoint[2]