Public Member Functions | List of all members
ON_XMeshIntersector Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Public Member Functions
ON_XMeshIntersector (const ON_Mesh &M0, const ON_Mesh &M1, bool bMultiThread)
~ON_XMeshIntersector ()
ON_Mesh *  | ConvertToOnMesh (int i)
void  | GetComponents (ON_SimpleArray< ON_XMeshVertex * > V[2], ON_SimpleArray< ON_XMeshEdge * > E[2], ON_SimpleArray< ON_XMeshFace * > F[2], ON_SimpleArray< ON_XMeshFF * > &FF, ON_SimpleArray< ON_XMeshEvent * > &X, ON_SimpleArray< ON_XMeshEventComponentString > &S)
void  | GetEventPoints (ON_SimpleArray< ON_3dPoint > &pts) const
For debugging. More...
void  | GetLabels (int mi, ON_ClassArray< ON_TextDot > &Dots) const
bool  | IntersectFaces (double test_tolerance)
bool  | IsValid () const
Constructor & Destructor Documentation
◆ ON_XMeshIntersector()
 ON_XMeshIntersector::ON_XMeshIntersector  |  ( |  const ON_Mesh &  |  M0,
|  const ON_Mesh &  |  M1,
|  bool  |  bMultiThread
)
◆ ~ON_XMeshIntersector()
 ON_XMeshIntersector::~ON_XMeshIntersector  |  ( |   | )
Member Function Documentation
◆ ConvertToOnMesh()
 ON_Mesh* ON_XMeshIntersector::ConvertToOnMesh  |  ( |  int  |  i | )
◆ GetComponents()
 void ON_XMeshIntersector::GetComponents  |  ( |  ON_SimpleArray< ON_XMeshVertex * >  |  V[2],
|  ON_SimpleArray< ON_XMeshEdge * >  |  E[2],
|  ON_SimpleArray< ON_XMeshFace * >  |  F[2],
|  ON_SimpleArray< ON_XMeshFF * > &  |  FF,
|  ON_SimpleArray< ON_XMeshEvent * > &  |  X,
|  ON_SimpleArray< ON_XMeshEventComponentString > &  |  S
)
◆ GetEventPoints()
 void ON_XMeshIntersector::GetEventPoints  |  ( |  ON_SimpleArray< ON_3dPoint > &  |  pts | ) |   const
For debugging.
◆ GetLabels()
 void ON_XMeshIntersector::GetLabels  |  ( |  int  |  mi,
|  ON_ClassArray< ON_TextDot > &  |  Dots
) |   |  const
◆ IntersectFaces()
 bool ON_XMeshIntersector::IntersectFaces  |  ( |  double  |  test_tolerance | )
◆ IsValid()
 bool ON_XMeshIntersector::IsValid  |  ( |   | ) |   const