Public Member Functions | List of all members
ON_HermiteSurface Class Reference
OpenNURBS
#include <opennurbs_nurbssurface.h>
 Public Member Functions
ON_HermiteSurface ()
ON_HermiteSurface (int u_count, int v_count)
Constructs a u_count by v_count grid. More...
~ON_HermiteSurface ()
bool  | Create (int u_count, int v_count)
Constructs a u_count by v_count grid. More...
const ON_ClassArray< ON_SimpleArray< ON_3dPoint > > &  | GridPoints () const
Grid of points to interpolate. More...
bool  | IsValid () const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr)
Create an ON_NurbsSurface satisfying Hermite interpolation conditions at a grid of points. More...
ON_3dPoint  | PointAt (int u, int v) const
Grid of points to interpolate. More...
void  | SetPointAt (int u, int v, const ON_3dPoint &point)
void  | SetTwistAt (int u, int v, const ON_3dVector &dir)
void  | SetUParameterAt (int u, double param)
void  | SetUTangentAt (int u, int v, const ON_3dVector &dir)
void  | SetVParameterAt (int v, double param)
void  | SetVTangentAt (int u, int v, const ON_3dVector &dir)
ON_3dVector  | TwistAt (int u, int v) const
Grid of twist vectors (mixed second partial derivatives) to interpolate. More...
const ON_ClassArray< ON_SimpleArray< ON_3dVector > > &  | Twists () const
Grid of twist vectors (mixed second partial derivatives) to interpolate. More...
int  | UCount () const
Returns the number of parameters in the "u" direction. More...
double  | UParameterAt (int u) const
const ON_SimpleArray< double > &  | UParameters () const
The "u" parameters defining the grid of parameter values. More...
ON_3dVector  | UTangentAt (int u, int v) const
Grid of "u" tangent directions (actually first derivatives) to interpolate. More...
const ON_ClassArray< ON_SimpleArray< ON_3dVector > > &  | UTangents () const
Grid of "u" tangent directions (actually first derivatives) to interpolate. More...
int  | VCount () const
Returns the number of parameters in the "v" direction. More...
double  | VParameterAt (int v) const
const ON_SimpleArray< double > &  | VParameters () const
The "v" parameters defining the grid of parameter values. More...
ON_3dVector  | VTangentAt (int u, int v) const
Grid of "v" tangent directions (actually first derivatives) to interpolate. More...
const ON_ClassArray< ON_SimpleArray< ON_3dVector > > &  | VTangents () const
Grid of "v" tangent directions (actually first derivatives) to interpolate. More...
Detailed Description
Description: Create an ON_NurbsSurface satisfying Hermite interpolation conditions at a grid of points. Remarks: See static ON_NurbsSurface::CreateHermiteSurface for details.
Constructor & Destructor Documentation
◆ ON_HermiteSurface() [1/2]
 ON_HermiteSurface::ON_HermiteSurface  |  ( |   | )
◆ ON_HermiteSurface() [2/2]
 ON_HermiteSurface::ON_HermiteSurface  |  ( |  int  |  u_count,
|  int  |  v_count
)
Constructs a u_count by v_count grid.
◆ ~ON_HermiteSurface()
 ON_HermiteSurface::~ON_HermiteSurface  |  ( |   | )
Member Function Documentation
◆ Create()
 bool ON_HermiteSurface::Create  |  ( |  int  |  u_count,
|  int  |  v_count
)
Constructs a u_count by v_count grid.
◆ GridPoints()
 const ON_ClassArray<ON_SimpleArray<ON_3dPoint> >& ON_HermiteSurface::GridPoints  |  ( |   | ) |   const
Grid of points to interpolate.
◆ IsValid()
 bool ON_HermiteSurface::IsValid  |  ( |   | ) |   const
◆ NurbsSurface()
 ON_NurbsSurface* ON_HermiteSurface::NurbsSurface  |  ( |  ON_NurbsSurface *  |  pNurbsSurface = nullptr | )
Create an ON_NurbsSurface satisfying Hermite interpolation conditions at a grid of points.
◆ PointAt()
 ON_3dPoint ON_HermiteSurface::PointAt  |  ( |  int  |  u,
|  int  |  v
) |   |  const
Grid of points to interpolate.
◆ SetPointAt()
 void ON_HermiteSurface::SetPointAt  |  ( |  int  |  u,
|  int  |  v,
|  const ON_3dPoint &  |  point
)
◆ SetTwistAt()
 void ON_HermiteSurface::SetTwistAt  |  ( |  int  |  u,
|  int  |  v,
|  const ON_3dVector &  |  dir
)
◆ SetUParameterAt()
 void ON_HermiteSurface::SetUParameterAt  |  ( |  int  |  u,
|  double  |  param
)
◆ SetUTangentAt()
 void ON_HermiteSurface::SetUTangentAt  |  ( |  int  |  u,
|  int  |  v,
|  const ON_3dVector &  |  dir
)
◆ SetVParameterAt()
 void ON_HermiteSurface::SetVParameterAt  |  ( |  int  |  v,
|  double  |  param
)
◆ SetVTangentAt()
 void ON_HermiteSurface::SetVTangentAt  |  ( |  int  |  u,
|  int  |  v,
|  const ON_3dVector &  |  dir
)
◆ TwistAt()
 ON_3dVector ON_HermiteSurface::TwistAt  |  ( |  int  |  u,
|  int  |  v
) |   |  const
Grid of twist vectors (mixed second partial derivatives) to interpolate.
◆ Twists()
 const ON_ClassArray<ON_SimpleArray<ON_3dVector> >& ON_HermiteSurface::Twists  |  ( |   | ) |   const
Grid of twist vectors (mixed second partial derivatives) to interpolate.
◆ UCount()
 int ON_HermiteSurface::UCount  |  ( |   | ) |   const
Returns the number of parameters in the "u" direction.
◆ UParameterAt()
 double ON_HermiteSurface::UParameterAt  |  ( |  int  |  u | ) |   const
Specifies the "u" parameters defining the grid of parameter values. These parameters are strictly increasing.
◆ UParameters()
 const ON_SimpleArray<double>& ON_HermiteSurface::UParameters  |  ( |   | ) |   const
The "u" parameters defining the grid of parameter values.
◆ UTangentAt()
 ON_3dVector ON_HermiteSurface::UTangentAt  |  ( |  int  |  u,
|  int  |  v
) |   |  const
Grid of "u" tangent directions (actually first derivatives) to interpolate.
◆ UTangents()
 const ON_ClassArray<ON_SimpleArray<ON_3dVector> >& ON_HermiteSurface::UTangents  |  ( |   | ) |   const
Grid of "u" tangent directions (actually first derivatives) to interpolate.
◆ VCount()
 int ON_HermiteSurface::VCount  |  ( |   | ) |   const
Returns the number of parameters in the "v" direction.
◆ VParameterAt()
 double ON_HermiteSurface::VParameterAt  |  ( |  int  |  v | ) |   const
Specifies the "v" parameters defining the grid of parameter values. These parameters are strictly increasing.
◆ VParameters()
 const ON_SimpleArray<double>& ON_HermiteSurface::VParameters  |  ( |   | ) |   const
The "v" parameters defining the grid of parameter values.
◆ VTangentAt()
 ON_3dVector ON_HermiteSurface::VTangentAt  |  ( |  int  |  u,
|  int  |  v
) |   |  const
Grid of "v" tangent directions (actually first derivatives) to interpolate.
◆ VTangents()
 const ON_ClassArray<ON_SimpleArray<ON_3dVector> >& ON_HermiteSurface::VTangents  |  ( |   | ) |   const
Grid of "v" tangent directions (actually first derivatives) to interpolate.