Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | Friends | List of all members
CRhinoDetailViewObject Class Reference
Rhino
#include <rhinoSdkDetailObject.h>
 Inheritance diagram for CRhinoDetailViewObject:
 Public Types
enum  | ScaleFormat : unsigned int {
 ScaleFormat::None, ScaleFormat::PageLengthToOne, ScaleFormat::OneToModelLength, ScaleFormat::OneInchToModelLengthFeet,
 ScaleFormat::ModelLengthInchToOneFoot, ScaleFormat::ModelLengthInchToOneFootInch, ScaleFormat::PageLengthToOneUnitSystem, ScaleFormat::OneToModelLengthUnitSystem
 }
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
CRhinoDetailViewObject ()
assigns a new object UUID More...
CRhinoDetailViewObject (const CRhinoDetailViewObject &)
copies source object UUID More...
CRhinoDetailViewObject (const CRhinoPageView &parent_page, ON_2dPoint page_corner1, ON_2dPoint page_corner2)
CRhinoDetailViewObject (const ON_3dmObjectAttributes &)
assigns a new object UUID More...
~CRhinoDetailViewObject ()
void  | AddToDocNotification () override
const ON_NurbsCurve &  | BoundaryCurve () const
void  | DescriptiveTitle (ON_wString &str) const
void  | DollyExtents ()
bool  | DollyExtents (double border, bool bSelected)
void  | Draw (CRhinoDisplayPipeline &dp) const override
Draws object based on pipeline display attributes... More...
void  | EnableGrips (bool bGripsOn) override
virtual CRhinoObject::EnableGrips override More...
const ON_DetailView &  | GetDetailView () const
bool  | GetFormattedScale (ScaleFormat format, ON_wString &str) const
bool  | GetModelLength (double paper_length, double &model_length) const
bool  | GetPageXforms (ON_Xform *pWorldToPage, ON_Xform *pPageToWorld) const
bool  | GetPaperLength (double model_length, double &paper_length) const
bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox=false, const ON_Xform *xform=nullptr) const override
void  | InvalidateScale ()
void  | MemoryRelocate () override
virtual ON_Object override More...
ON::object_type  | ObjectType () const override
virtual CRhinoObject override returns ON::detail_object More...
CRhinoDetailViewObject &  | operator= (const CRhinoDetailViewObject &)
copies source object UUID More...
CRhinoPageView *  | ParentPageView () const
int  | Pick (const CRhinoPickContext &, CRhinoObjRefArray &) const override
bool  | PickFilter (const CRhinoGetObject &, bool) const override
bool  | PrepareToWrite (int archive_3dm_version) override
bool  | ScreenPointInBoundary (const CRhinoViewport &parent_vp, const ON_2iPoint &screen_pt)
bool  | SetBoundaryCurve (const ON_Curve &curve)
bool  | SetDetailView (const ON_DetailView &detail_view)
bool  | SetRectangleBoundary (ON_2dPoint corner1, ON_2dPoint corner2)
No support for any boundary other than rectangles at this point. More...
bool  | SetScale (double model_length, const ON_UnitSystem &model_units, double paper_length, const ON_UnitSystem &paper_units)
bool  | SetScale (double model_length, double paper_length)
const wchar_t *  | ShortDescription (bool bPlural) const override
bool  | SnapTo (const CRhinoSnapContext &snap_context, CRhinoSnapEvent &snap_event) const override
CRhinoViewport &  | Viewport ()
const CRhinoViewport &  | Viewport () const
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox () const
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
virtual void  | DeleteFromDocNotification ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual void  | DrawHighlightedSubObjects (class CRhinoDisplayPipeline &) const
virtual void  | DrawSubObject (class CRhinoDisplayPipeline &, ON_COMPONENT_INDEX) const
Draws wireframe representation of a sub object. More...
virtual void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
virtual bool  | GetFrame (ON_Plane &plane) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
virtual int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh * > &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=NULL) const
virtual int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curve_list) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
virtual bool  | HighlightRequiresRedraw () const
virtual bool  | HighlightSubObject (ON_COMPONENT_INDEX component_index, bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
virtual bool  | IsSolid () const
virtual bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX component_index) const
true if specified component is highlighted More...
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
virtual bool  | IsSubObjectSelected (ON_COMPONENT_INDEX component_index) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
virtual ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
virtual int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
virtual int  | UnhighlightAllSubObjects ()
returns number of changed subobjects More...
virtual int  | UnselectAllSubObjects ()
returns number of unselected subobjects More...
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static const CRhinoDetailViewObject *  | FromViewport (const CRhinoViewport *viewport)
static bool  | GetDetailXform (UINT sn, const CRhinoDoc *pDoc, ON_Xform *pWorldToPage, ON_Xform *pPageToWorld)
static ScaleFormat  | ScaleFormatFromUnsigned (unsigned int scale_format_as_unsigned)
static void  | SetInPrintPreview (bool on)
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Static Public Attributes
static bool  | s_bInPrintPreview
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Friends
class  | CRhinoDoc
class  | SkylightShadowsTilePrintHelper
 Additional Inherited Members
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual int  | SubObjectsAreHighlighted () const
returns number of highlighted subobjects More...
virtual int  | SubObjectsAreSelected () const
returns number of selected subobjects More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. CRhinoDetailViewObject
A detail view is a nested CRhinoViewport placed on a page view with a 2D closed curve boundary. Can be any type of modeling view.
Member Enumeration Documentation
◆ ScaleFormat
 enum CRhinoDetailViewObject::ScaleFormat : unsigned int
strong
Description: Detail scale formats.
Enumerator
None
No formattng.
PageLengthToOne
#:1
OneToModelLength
1:#
OneInchToModelLengthFeet
1" = #'
ModelLengthInchToOneFoot
#" = 1'
ModelLengthInchToOneFootInch
#' = 1'-0"
PageLengthToOneUnitSystem
page unit system:1 model unit system
OneToModelLengthUnitSystem
1 page unit system:# model unit system
Constructor & Destructor Documentation
◆ CRhinoDetailViewObject() [1/4]
 CRhinoDetailViewObject::CRhinoDetailViewObject  |  ( |   | )
assigns a new object UUID
◆ CRhinoDetailViewObject() [2/4]
 CRhinoDetailViewObject::CRhinoDetailViewObject  |  ( |  const ON_3dmObjectAttributes &  |   | )
assigns a new object UUID
◆ CRhinoDetailViewObject() [3/4]
 CRhinoDetailViewObject::CRhinoDetailViewObject  |  ( |  const CRhinoPageView &  |  parent_page,
|  ON_2dPoint  |  page_corner1,
|  ON_2dPoint  |  page_corner2
)
◆ CRhinoDetailViewObject() [4/4]
 CRhinoDetailViewObject::CRhinoDetailViewObject  |  ( |  const CRhinoDetailViewObject &  |   | )
copies source object UUID
◆ ~CRhinoDetailViewObject()
 CRhinoDetailViewObject::~CRhinoDetailViewObject  |  ( |   | )
Member Function Documentation
◆ AddToDocNotification()
 void CRhinoDetailViewObject::AddToDocNotification  |  ( |   | )
overridevirtual
Description: This call informs an object it is about to be added to the list of active objects in the document. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
Reimplemented from CRhinoObject.
◆ BoundaryCurve()
 const ON_NurbsCurve& CRhinoDetailViewObject::BoundaryCurve  |  ( |   | ) |   const
Description: The 2d boundary for this detail in page coordinates
◆ DescriptiveTitle()
 void CRhinoDetailViewObject::DescriptiveTitle  |  ( |  ON_wString &  |  str | ) |   const
Description: Detail objects have two strings that can be used to describe the detail
The m_name string that is part of the object's attributes
The viewport projection title that is part of the ON_3dmView This function combines these two strings to create a single "description" string in the form of attribute_name - projection_title In the case where the attributes name is empty, then Detail - projection_title is returned.
◆ DollyExtents() [1/2]
 void CRhinoDetailViewObject::DollyExtents  |  ( |   | )
◆ DollyExtents() [2/2]
 bool CRhinoDetailViewObject::DollyExtents  |  ( |  double  |  border,
|  bool  |  bSelected
)
Description: Dolly this detail's viewport so its frustum contains the visible, or the selected, objects in the detail. Annotation in a detail is sized in page units, so its model space extents are a function of the detail scale - the value being solved for. A single dolly therefore lands short. This repeats the dolly until the detail scale settles, so calling it a second time does not move the view. Parameters: border: [in] 1.0 fits tightly, > 1.0 leaves a border. bSelected: [in] true to fit the selected objects, false to fit all visible objects. Returns: true if the viewport was dollied.
◆ Draw()
 void CRhinoDetailViewObject::Draw  |  ( |  CRhinoDisplayPipeline &  |   | ) |   const
overridevirtual
Draws object based on pipeline display attributes...
Reimplemented from CRhinoObject.
◆ EnableGrips()
 void CRhinoDetailViewObject::EnableGrips  |  ( |  bool  |  bGripsOn | )
overridevirtual
virtual CRhinoObject::EnableGrips override
Reimplemented from CRhinoObject.
◆ FromViewport()
 static const CRhinoDetailViewObject* CRhinoDetailViewObject::FromViewport  |  ( |  const CRhinoViewport *  |  viewport | )
static
Attempt to get a detail object from a viewport. Only works if the viewport is a viewport that is 'owned' by a detail.
◆ GetDetailView()
 const ON_DetailView& CRhinoDetailViewObject::GetDetailView  |  ( |   | ) |   const
◆ GetDetailXform()
 static bool CRhinoDetailViewObject::GetDetailXform  |  ( |  UINT  |  sn,
|  const CRhinoDoc *  |  pDoc,
|  ON_Xform *  |  pWorldToPage,
|  ON_Xform *  |  pPageToWorld
)
static
◆ GetFormattedScale()
 bool CRhinoDetailViewObject::GetFormattedScale  |  ( |  ScaleFormat  |  format,
|  ON_wString &  |  str
) |   |  const
Description: Returns the detail's scale as a formatted string Parameters: format: [in] The scale format. str: [out] The formatted string. Returns: true if successful
◆ GetModelLength()
 bool CRhinoDetailViewObject::GetModelLength  |  ( |  double  |  paper_length,
|  double &  |  model_length
) |   |  const
◆ GetPageXforms()
 bool CRhinoDetailViewObject::GetPageXforms  |  ( |  ON_Xform *  |  pWorldToPage,
|  ON_Xform *  |  pPageToWorld
) |   |  const
Description: Get detail_world2page transformation. This transformation that maps world coordinates to page coordinates with depth from near (z=1) to far (z= -1). Parameters: pWorldToPage [out] Pointer to ON_Xform to fill in with world to page transform or NULL pPageToWorld [out] Pointer to ON_Xform to fill in with page to world transform or NULL Added 12/10/2009 Lowell
◆ GetPaperLength()
 bool CRhinoDetailViewObject::GetPaperLength  |  ( |  double  |  model_length,
|  double &  |  paper_length
) |   |  const
◆ GetTightBoundingBox()
 bool CRhinoDetailViewObject::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
Description: Get tight bounding box of this Rhino object. Parameters: tight_bbox - [in/out] tight bounding box bGrowBox -[in] (default=false)
 If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of this Rhino object. xform -[in] (default=NULL) If not NULL, the tight bounding box of the transformed Rhino object is calculated. The Rhino object is not modified. Returns: True if the returned tight_bbox is set to a valid bounding box.
Reimplemented from CRhinoObject.
◆ InvalidateScale()
 void CRhinoDetailViewObject::InvalidateScale  |  ( |   | )
◆ MemoryRelocate()
 void CRhinoDetailViewObject::MemoryRelocate  |  ( |   | )
overridevirtual
virtual ON_Object override
Reimplemented from ON_Object.
◆ ObjectType()
 ON::object_type CRhinoDetailViewObject::ObjectType  |  ( |   | ) |   const
overridevirtual
virtual CRhinoObject override returns ON::detail_object
Implements CRhinoObject.
◆ operator=()
 CRhinoDetailViewObject& CRhinoDetailViewObject::operator=  |  ( |  const CRhinoDetailViewObject &  |   | )
copies source object UUID
◆ ParentPageView()
 CRhinoPageView* CRhinoDetailViewObject::ParentPageView  |  ( |   | ) |   const
Description: Every detail view object belongs (displays) to one page view. Page views can be parent to multiple detail views. Return: The CRhinoPageView that this detail view belongs to
◆ Pick()
 int CRhinoDetailViewObject::Pick  |  ( |  const CRhinoPickContext &  |  pick_context,
|  CRhinoObjRefArray &  |  pick_list
) |   |  const
overridevirtual
Description: Expert level tool. Should not normally be used by Rhino plug-ins. Parameters: pick_list: [in/out] If object should be picked, it is appended to the pick_list Returns: Number of items added to pick_list.
Reimplemented from CRhinoObject.
◆ PickFilter()
 bool CRhinoDetailViewObject::PickFilter  |  ( |  const CRhinoGetObject &  |  ,
|  bool
) |   |  const
override
◆ PrepareToWrite()
 bool CRhinoDetailViewObject::PrepareToWrite  |  ( |  int  |  archive_3dm_version | )
overridevirtual
Description: Called before the object is saved to a 3dm archive so that the object pointed to by m_geometry can prepared for writing. Parameters: archive_3dm_version - [in] Version of the 3dm archive 2 = Rhino2, 3 = Rhino3, 4 = Rhino4. Returns: True if m_geometry should be saved. False otherwise.
Reimplemented from CRhinoObject.
◆ ScaleFormatFromUnsigned()
 static ScaleFormat CRhinoDetailViewObject::ScaleFormatFromUnsigned  |  ( |  unsigned int  |  scale_format_as_unsigned | )
static
◆ ScreenPointInBoundary()
 bool CRhinoDetailViewObject::ScreenPointInBoundary  |  ( |  const CRhinoViewport &  |  parent_vp,
|  const ON_2iPoint &  |  screen_pt
)
Description: Return true if the screen point is inside of the detail's boundary curve. Parameters: parent_vp: [in] Page view that this detail is shown in. This function is called inside of page view mouse events and passing the parent viewport is done purely for speed (don't have to look up the parent page) screen_pt: [in] point to test
◆ SetBoundaryCurve()
 bool CRhinoDetailViewObject::SetBoundaryCurve  |  ( |  const ON_Curve &  |  curve | )
Description: Set the boundary curve for this detail object Parameters: curve - [in] must be simple closed 2D curve on XY Plane
◆ SetDetailView()
 bool CRhinoDetailViewObject::SetDetailView  |  ( |  const ON_DetailView &  |  detail_view | )
◆ SetInPrintPreview()
 static void CRhinoDetailViewObject::SetInPrintPreview  |  ( |  bool  |  on | )
static
◆ SetRectangleBoundary()
 bool CRhinoDetailViewObject::SetRectangleBoundary  |  ( |  ON_2dPoint  |  corner1,
|  ON_2dPoint  |  corner2
)
No support for any boundary other than rectangles at this point.
◆ SetScale() [1/2]
 bool CRhinoDetailViewObject::SetScale  |  ( |  double  |  model_length,
|  const ON_UnitSystem &  |  model_units,
|  double  |  paper_length,
|  const ON_UnitSystem &  |  paper_units
)
Description: Set the detail viewport's projection so geometry is displayed at a certain scale Parameters: model_length: [in] reference model length model_units: [in] units for model length paper_length: [in] length on page that the model_length should equal paper_units: [in] units for paper length Returns: true on success false if the viewport's projection is perspective or the input values do not make sense
◆ SetScale() [2/2]
 bool CRhinoDetailViewObject::SetScale  |  ( |  double  |  model_length,
|  double  |  paper_length
)
Description: Set the detail viewport's projection so geometry is displayed at a certain scale Parameters: model_length: [in] reference model length in current model units paper_length: [in] length on page that the model_length should equal in the current page units Returns: true on success false if the viewport's projection is perspective or the input values do not make sense
◆ ShortDescription()
 const wchar_t* CRhinoDetailViewObject::ShortDescription  |  ( |  bool  |  bPlural | ) |   const
overridevirtual
Description: virtual CRhinoObject::ShortDescription override Returns: "detail view" or "detail views"
Implements CRhinoObject.
◆ SnapTo()
 bool CRhinoDetailViewObject::SnapTo  |  ( |  const CRhinoSnapContext &  |  snap_context,
|  CRhinoSnapEvent &  |  snap_event
) |   |  const
overridevirtual
Description: Low level tool for internal use only. See definition of CRhinoObject::SnapTo for detailed information. Remarks: This function should not be used in Rhino plug-ins.
Reimplemented from CRhinoObject.
◆ Viewport() [1/2]
 CRhinoViewport& CRhinoDetailViewObject::Viewport  |  ( |   | )
The nested viewport The viewport's ID should always match the attributes ID
◆ Viewport() [2/2]
 const CRhinoViewport& CRhinoDetailViewObject::Viewport  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoDoc
 friend class CRhinoDoc
friend
◆ SkylightShadowsTilePrintHelper
 friend class SkylightShadowsTilePrintHelper
friend
Member Data Documentation
◆ s_bInPrintPreview
 bool CRhinoDetailViewObject::s_bInPrintPreview
static