Public Member Functions | List of all members
CRhinoWindowCreateOptions Class Reference
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
CRhinoWindowCreateOptions ()
~CRhinoWindowCreateOptions ()
void  | EnglishCaption (const wchar_t *caption)
ON_wString  | EnglishCaption (void) const
void  | LocalizedCaption (const wchar_t *caption)
ON_wString  | LocalizedCaption (void) const
RhinoWindowCreateOptions  | Options () const
void  | Options (RhinoWindowCreateOptions options)
class IRhinoWindow *  | ParentWindow () const
void  | ParentWindow (class IRhinoWindow *parent) const
RHINO_WINDOW_HANDLE  | ParentWindowHandle () const
void  | ParentWindowHandle (RHINO_WINDOW_HANDLE windowHandle) const
Detailed Description
class CRhinoWindowCreateOptions
Description: Generic window representation.
Constructor & Destructor Documentation
◆ CRhinoWindowCreateOptions()
 CRhinoWindowCreateOptions::CRhinoWindowCreateOptions  |  ( |   | )
 Description: Default constructor.
◆ ~CRhinoWindowCreateOptions()
 CRhinoWindowCreateOptions::~CRhinoWindowCreateOptions  |  ( |   | )
 Description: Default destructor.
Member Function Documentation
◆ EnglishCaption() [1/2]
 void CRhinoWindowCreateOptions::EnglishCaption  |  ( |  const wchar_t *  |  caption | )
 Description: Optional english caption
◆ EnglishCaption() [2/2]
 ON_wString CRhinoWindowCreateOptions::EnglishCaption  |  ( |  void  |   | ) |   const
◆ LocalizedCaption() [1/2]
 void CRhinoWindowCreateOptions::LocalizedCaption  |  ( |  const wchar_t *  |  caption | )
 Description: Optional localized caption
◆ LocalizedCaption() [2/2]
 ON_wString CRhinoWindowCreateOptions::LocalizedCaption  |  ( |  void  |   | ) |   const
◆ Options() [1/2]
 RhinoWindowCreateOptions CRhinoWindowCreateOptions::Options  |  ( |   | ) |   const
 Description: Create options, defaults to RhinoWindowCreateOptions::ChildPage
◆ Options() [2/2]
 void CRhinoWindowCreateOptions::Options  |  ( |  RhinoWindowCreateOptions  |  options | )
 Description: Create options, defaults to RhinoWindowCreateOptions::ChildPage
◆ ParentWindow() [1/2]
 class IRhinoWindow* CRhinoWindowCreateOptions::ParentWindow  |  ( |   | ) |   const
 Description: Optional parent window
◆ ParentWindow() [2/2]
 void CRhinoWindowCreateOptions::ParentWindow  |  ( |  class IRhinoWindow *  |  parent | ) |   const
 Description: Optional parent window
◆ ParentWindowHandle() [1/2]
 RHINO_WINDOW_HANDLE CRhinoWindowCreateOptions::ParentWindowHandle  |  ( |   | ) |   const
 Description: Optional parent window
◆ ParentWindowHandle() [2/2]
 void CRhinoWindowCreateOptions::ParentWindowHandle  |  ( |  RHINO_WINDOW_HANDLE  |  windowHandle | ) |   const
 Description: Optional parent window