Public Member Functions | List of all members
ON_CurveArray Class Reference
OpenNURBS
#include <opennurbs_curve.h>
 Inheritance diagram for ON_CurveArray:
 Public Member Functions
ON_CurveArray (int=0)
~ON_CurveArray ()
deletes any non-nullptr curves More...
void  | Destroy ()
deletes curves, sets pointers to nullptr, sets count to zero More...
bool  | Duplicate (ON_CurveArray &) const
bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox=false, const ON_Xform *xform=nullptr) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_SimpleArray< ON_Curve * >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_Curve * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
ON_SimpleArray (size_t, ON_Curve *)
create an array of given size and initialize all items to the given value More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_Curve * &)
void  | Append (int, const ON_Curve * *)
Append copy of an array T[count]. More...
ON_Curve * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_Curve * *  | Array ()
The Array() function return the. More...
const ON_Curve * *  | Array () const
m_a pointer value. More...
ON_Curve * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_Curve * *  | At (int) const
ON_Curve * *  | At (ON__INT64)
const ON_Curve * *  | At (ON__INT64) const
ON_Curve * *  | At (ON__UINT64)
const ON_Curve * *  | At (ON__UINT64) const
ON_Curve * *  | At (unsigned int)
const ON_Curve * *  | At (unsigned int) const
ON_Curve * *  | begin ()
Support STL iterators and algorithms. More...
ON_Curve * const *  | begin () const
int  | BinarySearch (const ON_Curve * *, int(*compar)(const ON_Curve * *, const ON_Curve * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_Curve * *, int(*compar)(const ON_Curve * *, const ON_Curve * *), int) const
const ON_Curve * *  | BinarySearchPtr (const ON_Curve * *, int(*compar)(const ON_Curve * *, const ON_Curve * *)) const
const ON_Curve * *  | BinarySearchPtr (const ON_Curve * *, int(*compar)(const ON_Curve * *, const ON_Curve * *), int) const
int  | Capacity () const
capacity of array More...
ON_Curve * const *  | cbegin () const
ON_Curve * const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_Curve * *  | end ()
ON_Curve * const *  | end () const
ON_Curve * *  | First ()
const ON_Curve * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*compar)(const ON_Curve * *, const ON_Curve * *))
void  | Insert (int, const ON_Curve * &)
int  | InsertInSortedList (const ON_Curve * &, int(*compar)(const ON_Curve * *, const ON_Curve * *))
int  | InsertInSortedList (const ON_Curve * &, int(*compar)(const ON_Curve * *, const ON_Curve * *), int)
ON_Curve * *  | KeepArray ()
ON_Curve * *  | Last ()
const ON_Curve * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_Curve * * () const
operator ON_Curve ** ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_SimpleArray< ON_Curve * > &other) const=delete
ON_SimpleArray< ON_Curve * > &  | operator= (const ON_SimpleArray< ON_Curve * > &)
bool  | operator== (const ON_SimpleArray< ON_Curve * > &other) const=delete
ON_Curve * &  | operator[] (int)
const ON_Curve * &  | operator[] (int) const
ON_Curve * &  | operator[] (ON__INT64)
const ON_Curve * &  | operator[] (ON__INT64) const
ON_Curve * &  | operator[] (ON__UINT64)
const ON_Curve * &  | operator[] (ON__UINT64) const
ON_Curve * &  | operator[] (unsigned int)
const ON_Curve * &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Prepend (int, const ON_Curve * *)
Prepend copy of an array T[count]. More...
bool  | QuickSort (int(*compar)(const ON_Curve * *, const ON_Curve * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
bool  | QuickSortAndRemoveDuplicates (int(*compar)(const ON_Curve * *, const ON_Curve * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
virtual ON_Curve * *  | Realloc (ON_Curve * *, int)
low level memory management ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
void  | RemoveIf (bool(*predicate)(const ON_Curve * &key))
void  | RemoveValue (const ON_Curve * &)
ON_Curve * *  | Reserve (size_t)
memory management //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_Curve * &) const
int  | Search (const ON_Curve * *, int(*compar)(const ON_Curve * *, const ON_Curve * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
void  | SetArray (ON_Curve * *p)
void  | SetArray (ON_Curve * *p, int count, int capacity)
ON_Curve * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | SetRange (int from, int count, ON_Curve *)
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_Curve * *, const ON_Curve * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_Curve * *, const ON_Curve * *, void *), void *) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_Curve * *, const ON_Curve * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_Curve * *, const ON_Curve * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_Curve * >
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_Curve * >
ON_Curve * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_CurveArray()
 ON_CurveArray::ON_CurveArray  |  ( |  int  |   = 0 | )
◆ ~ON_CurveArray()
 ON_CurveArray::~ON_CurveArray  |  ( |   | )
deletes any non-nullptr curves
Member Function Documentation
◆ Destroy()
 void ON_CurveArray::Destroy  |  ( |   | )
deletes curves, sets pointers to nullptr, sets count to zero
◆ Duplicate()
 bool ON_CurveArray::Duplicate  |  ( |  ON_CurveArray &  |   | ) |   const
operator= copies the pointer values duplicate copies the curves themselves
◆ GetTightBoundingBox()
 bool ON_CurveArray::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const ON_Xform *  |  xform = nullptr
) |   |  const
Description: Get tight bounding box of the bezier. Parameters: tight_bbox - [in/out] tight bounding box bGrowBox -[in] (default=false)
 If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of the bezier curve. xform -[in] (default=nullptr) If not nullptr, the tight bounding box of the transformed bezier is calculated. The bezier curve is not modified. Returns: True if the returned tight_bbox is set to a valid bounding box.
◆ Read()
 bool ON_CurveArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_CurveArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const