Public Member Functions | Static Public Attributes | List of all members
ON_UuidPairList2 Class Reference
OpenNURBS
#include <opennurbs_array.h>
 Public Member Functions
ON_UuidPairList2 ()
ON_UuidPairList2 (const ON_UuidPairList2 &src)
~ON_UuidPairList2 ()
bool  | AddPair (const ON_UUID &id1, const ON_UUID &id2)
unsigned int  | Count () const
void  | Empty ()
bool  | FindId1 (const ON_UUID &id1, ON_UUID *id2=0) const
bool  | FindPair (const ON_UUID &id1, const ON_UUID &id2) const
int  | GetId1s (ON_SimpleArray< ON_UUID > &uuid_list) const
void  | ImproveSearchSpeed ()
ON_UuidPairList2 &  | operator= (const ON_UuidPairList2 &src)
bool  | RemovePair (const ON_UUID &id1)
bool  | RemovePair (const ON_UUID &id1, const ON_UUID &id2)
void  | Reserve (size_t capacity)
 Static Public Attributes
static const ON_UuidPairList2  | EmptyList
Constructor & Destructor Documentation
◆ ON_UuidPairList2() [1/2]
 ON_UuidPairList2::ON_UuidPairList2  |  ( |   | )
◆ ~ON_UuidPairList2()
 ON_UuidPairList2::~ON_UuidPairList2  |  ( |   | )
◆ ON_UuidPairList2() [2/2]
 ON_UuidPairList2::ON_UuidPairList2  |  ( |  const ON_UuidPairList2 &  |  src | )
Member Function Documentation
◆ AddPair()
 bool ON_UuidPairList2::AddPair  |  ( |  const ON_UUID &  |  id1,
|  const ON_UUID &  |  id2
)
◆ Count()
 unsigned int ON_UuidPairList2::Count  |  ( |   | ) |   const
◆ Empty()
 void ON_UuidPairList2::Empty  |  ( |   | )
◆ FindId1()
 bool ON_UuidPairList2::FindId1  |  ( |  const ON_UUID &  |  id1,
|  ON_UUID *  |  id2 = 0
) |   |  const
◆ FindPair()
 bool ON_UuidPairList2::FindPair  |  ( |  const ON_UUID &  |  id1,
|  const ON_UUID &  |  id2
) |   |  const
◆ GetId1s()
 int ON_UuidPairList2::GetId1s  |  ( |  ON_SimpleArray< ON_UUID > &  |  uuid_list | ) |   const
◆ ImproveSearchSpeed()
 void ON_UuidPairList2::ImproveSearchSpeed  |  ( |   | )
◆ operator=()
 ON_UuidPairList2& ON_UuidPairList2::operator=  |  ( |  const ON_UuidPairList2 &  |  src | )
◆ RemovePair() [1/2]
 bool ON_UuidPairList2::RemovePair  |  ( |  const ON_UUID &  |  id1 | )
◆ RemovePair() [2/2]
 bool ON_UuidPairList2::RemovePair  |  ( |  const ON_UUID &  |  id1,
|  const ON_UUID &  |  id2
)
◆ Reserve()
 void ON_UuidPairList2::Reserve  |  ( |  size_t  |  capacity | )
Member Data Documentation
◆ EmptyList
 const ON_UuidPairList2 ON_UuidPairList2::EmptyList
static