Public Member Functions | List of all members
IRhinoWindowOnTab Class Referenceabstract
RDK
#include <RhRdkRenderWindowEventSink.h>
 Inheritance diagram for IRhinoWindowOnTab:
 Public Member Functions
virtual void  | OnTabActivateChange (bool active)=0
 Public Member Functions inherited from IRhinoWindow
virtual  | ~IRhinoWindow ()=default
virtual bool  | Create (const CRhinoWindowCreateOptions &options)=0
virtual bool  | Created () const =0
virtual bool  | Destroy ()=0
virtual const wchar_t *  | EnglishCaption () const =0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual RHINO_WINDOW_HANDLE  | Handle (void)=0
virtual bool  | IsEnabled () const =0
virtual bool  | IsVisible () const =0
virtual const wchar_t *  | LocalCaption () const
virtual ON_2iPoint  | Location () const =0
virtual RHINO_WINDOW_HANDLE  | Parent () const =0
virtual void  | Refresh (bool immediate=false)=0
virtual void  | Release ()=0
virtual void  | SetFocused ()=0
virtual void  | SetIsEnabled (bool enable)=0
virtual void  | SetIsVisible (bool visible)=0
virtual void  | SetLocation (ON_2iPoint location)=0
virtual void  | SetParent (RHINO_WINDOW_HANDLE parent)=0
virtual void  | SetSize (ON_2iSize size, bool redraw=false, bool redrawBorder=false)=0
virtual ON_2iSize  | Size () const =0
virtual LPARAM  | WindowProc (unsigned int message, WPARAM wParam, LPARAM lParam)
 Additional Inherited Members
 Protected Member Functions inherited from IRhinoWindow
IRhinoWindow ()=default
IRhinoWindow (const IRhinoWindow &)=delete
IRhinoWindow &  | operator= (const IRhinoWindow &)=delete
Detailed Description
This is an extended IRhinoWindow for windows (panes) which are hosted on a tab control.
Member Function Documentation
◆ OnTabActivateChange()
 virtual void IRhinoWindowOnTab::OnTabActivateChange  |  ( |  bool  |  active | )
pure virtual
Called when the tab is activated or deactivated. A tab is activated when the user clicks on it and deactivated when the user clicks on a different tab.