Public Member Functions | Static Public Member Functions | Static Public Attributes | Friends | List of all members
ON_ComponentManifestItem Class Reference
OpenNURBS
#include <opennurbs_archive.h>
 Public Member Functions
ON_ComponentManifestItem ()=default
ON_ComponentManifestItem (const class ON_ModelComponent &component)
Assigns component type, index, id and name hash. More...
ON_ComponentManifestItem (const class ON_ModelComponent &component, const ON_UUID &manifest_id, const class ON_NameHash &manifest_name_hash)
ON_ComponentManifestItem (const class ON_ModelComponent &component, int manifest_index, const ON_UUID &manifest_id, const class ON_NameHash &manifest_name_hash)
ON_ComponentManifestItem (const ON_ComponentManifestItem &)=default
ON_ComponentManifestItem (ON_ModelComponent::Type component_type, ON__UINT64 m_component_runtime_serial_number, const ON_UUID &manifest_id, const class ON_NameHash &manifest_name_hash)
ON_ComponentManifestItem (ON_ModelComponent::Type component_type, ON__UINT64 m_component_runtime_serial_number, int manifest_index, const ON_UUID &manifest_id, const class ON_NameHash &manifest_name_hash)
~ON_ComponentManifestItem ()=default
ON__UINT64  | ComponentRuntimeSerialNumber () const
ON_ModelComponent::Type  | ComponentType () const
ON_UUID  | Id () const
int  | Index () const
bool  | IsDeleted () const
bool  | IsSystemComponent () const
bool  | IsUnset () const
bool  | IsValid () const
const ON_NameHash &  | NameHash () const
ON_ComponentManifestItem &  | operator= (const ON_ComponentManifestItem &)=default
void  | SetComponentRuntimeSerialNumber (ON__UINT64 component_runtime_serial_number)
void  | SetComponentType (ON_ModelComponent::Type component_type)
void  | SetId (ON_UUID id)
void  | SetIndex (int index)
void  | SetNameHash (const ON_NameHash &name_hash)
 Static Public Member Functions
static int  | CompareComponentType (const ON_ComponentManifestItem *a, const ON_ComponentManifestItem *b)
static int  | CompareId (const ON_ComponentManifestItem *const *a, const ON_ComponentManifestItem *const *b)
static int  | CompareIndex (const ON_ComponentManifestItem *const *a, const ON_ComponentManifestItem *const *b)
static int  | CompareNameHash (const ON_ComponentManifestItem *const *a, const ON_ComponentManifestItem *const *b)
 Static Public Attributes
static const ON_ComponentManifestItem  | UnsetItem
 Friends
class  | ON_ComponentManifestImpl
Constructor & Destructor Documentation
◆ ON_ComponentManifestItem() [1/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  const class ON_ModelComponent &  |  component | )
Assigns component type, index, id and name hash.
◆ ON_ComponentManifestItem() [2/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  const class ON_ModelComponent &  |  component,
|  const ON_UUID &  |  manifest_id,
|  const class ON_NameHash &  |  manifest_name_hash
)
◆ ON_ComponentManifestItem() [3/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  ON_ModelComponent::Type  |  component_type,
|  ON__UINT64  |  m_component_runtime_serial_number,
|  const ON_UUID &  |  manifest_id,
|  const class ON_NameHash &  |  manifest_name_hash
)
◆ ON_ComponentManifestItem() [4/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  const class ON_ModelComponent &  |  component,
|  int  |  manifest_index,
|  const ON_UUID &  |  manifest_id,
|  const class ON_NameHash &  |  manifest_name_hash
)
◆ ON_ComponentManifestItem() [5/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  ON_ModelComponent::Type  |  component_type,
|  ON__UINT64  |  m_component_runtime_serial_number,
|  int  |  manifest_index,
|  const ON_UUID &  |  manifest_id,
|  const class ON_NameHash &  |  manifest_name_hash
)
◆ ON_ComponentManifestItem() [6/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |   | )
default
◆ ~ON_ComponentManifestItem()
 ON_ComponentManifestItem::~ON_ComponentManifestItem  |  ( |   | )
default
◆ ON_ComponentManifestItem() [7/7]
 ON_ComponentManifestItem::ON_ComponentManifestItem  |  ( |  const ON_ComponentManifestItem &  |   | )
default
Member Function Documentation
◆ CompareComponentType()
 static int ON_ComponentManifestItem::CompareComponentType  |  ( |  const ON_ComponentManifestItem *  |  a,
|  const ON_ComponentManifestItem *  |  b
)
static
◆ CompareId()
 static int ON_ComponentManifestItem::CompareId  |  ( |  const ON_ComponentManifestItem *const *  |  a,
|  const ON_ComponentManifestItem *const *  |  b
)
static
◆ CompareIndex()
 static int ON_ComponentManifestItem::CompareIndex  |  ( |  const ON_ComponentManifestItem *const *  |  a,
|  const ON_ComponentManifestItem *const *  |  b
)
static
◆ CompareNameHash()
 static int ON_ComponentManifestItem::CompareNameHash  |  ( |  const ON_ComponentManifestItem *const *  |  a,
|  const ON_ComponentManifestItem *const *  |  b
)
static
◆ ComponentRuntimeSerialNumber()
 ON__UINT64 ON_ComponentManifestItem::ComponentRuntimeSerialNumber  |  ( |   | ) |   const
Return: item component runtime serial number. 0 if it is not set.
◆ ComponentType()
 ON_ModelComponent::Type ON_ComponentManifestItem::ComponentType  |  ( |   | ) |   const
Return: item component type. ON_ModelComponent::Type::Unset if it is not set.
◆ Id()
 ON_UUID ON_ComponentManifestItem::Id  |  ( |   | ) |   const
Return: item id. ON_nil_uuid if is not set.
◆ Index()
 int ON_ComponentManifestItem::Index  |  ( |   | ) |   const
Return: item index. ON_UNSET_INT_INDEX if it is not set.
◆ IsDeleted()
 bool ON_ComponentManifestItem::IsDeleted  |  ( |   | ) |   const
Returns: true if the item is in a deleted state. Name is erased. The component can be found by component serial number, id, or index.
◆ IsSystemComponent()
 bool ON_ComponentManifestItem::IsSystemComponent  |  ( |   | ) |   const
Returns: true if the item is a constant system component.
◆ IsUnset()
 bool ON_ComponentManifestItem::IsUnset  |  ( |   | ) |   const
Returns: true if m_component_type is ON_ModelComponent::Type::Unset or the m_manifest_id is nil.
◆ IsValid()
 bool ON_ComponentManifestItem::IsValid  |  ( |   | ) |   const
Returns: true if m_component_type is not ON_ModelComponent::Type::Unset and the m_manifest_id is not nil.
◆ NameHash()
 const ON_NameHash& ON_ComponentManifestItem::NameHash  |  ( |   | ) |   const
Return: item name hash. ON_NameHash::UnsetNameHash if is not set.
◆ operator=()
 ON_ComponentManifestItem& ON_ComponentManifestItem::operator=  |  ( |  const ON_ComponentManifestItem &  |   | )
default
◆ SetComponentRuntimeSerialNumber()
 void ON_ComponentManifestItem::SetComponentRuntimeSerialNumber  |  ( |  ON__UINT64  |  component_runtime_serial_number | )
◆ SetComponentType()
 void ON_ComponentManifestItem::SetComponentType  |  ( |  ON_ModelComponent::Type  |  component_type | )
◆ SetId()
 void ON_ComponentManifestItem::SetId  |  ( |  ON_UUID  |  id | )
◆ SetIndex()
 void ON_ComponentManifestItem::SetIndex  |  ( |  int  |  index | )
◆ SetNameHash()
 void ON_ComponentManifestItem::SetNameHash  |  ( |  const ON_NameHash &  |  name_hash | )
Friends And Related Function Documentation
◆ ON_ComponentManifestImpl
 friend class ON_ComponentManifestImpl
friend
Member Data Documentation
◆ UnsetItem
 const ON_ComponentManifestItem ON_ComponentManifestItem::UnsetItem
static