Public Attributes | List of all members
CRhinoOnPageViewPropertiesChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
unsigned int  | m_page_view_sn
The page view serial number. More...
unsigned int  | m_rhino_doc_sn
The document runtime serial number. More...
Member Data Documentation
◆ m_page_view_sn
 unsigned int CRhinoOnPageViewPropertiesChanged::CParameters::m_page_view_sn
The page view serial number.
◆ m_rhino_doc_sn
 unsigned int CRhinoOnPageViewPropertiesChanged::CParameters::m_rhino_doc_sn
The document runtime serial number.