Public Member Functions | List of all members
CRhRdkTextureArray Class Referencefinal
RDK
#include <RhRdkTexture.h>
 Inheritance diagram for CRhRdkTextureArray:
 Public Member Functions
void  | Dump (const CRhRdkContent::DumpContext &dc, unsigned int gds_flags) const
void  | PopulateFrom (const CRhRdkContentArray &a)
void  | SetFilename (const wchar_t *file_name, const wchar_t *child_slot_name=nullptr)
RDK_DEPRECATED void  | SetFilename (IRhinoUiController &, const wchar_t *, const wchar_t *csn=nullptr)
 Public Member Functions inherited from ON_SimpleArray< const CRhRdkTexture * >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< const CRhRdkTexture * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
ON_SimpleArray (size_t, const CRhRdkTexture *)
create an array of given size and initialize all items to the given value More...
virtual  | ~ON_SimpleArray ()
void  | Append (const const CRhRdkTexture * &)
void  | Append (int, const const CRhRdkTexture * *)
Append copy of an array T[count]. More...
const CRhRdkTexture * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
const CRhRdkTexture * *  | Array ()
The Array() function return the. More...
const const CRhRdkTexture * *  | Array () const
m_a pointer value. More...
const CRhRdkTexture * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const const CRhRdkTexture * *  | At (int) const
const CRhRdkTexture * *  | At (ON__INT64)
const const CRhRdkTexture * *  | At (ON__INT64) const
const CRhRdkTexture * *  | At (ON__UINT64)
const const CRhRdkTexture * *  | At (ON__UINT64) const
const CRhRdkTexture * *  | At (unsigned int)
const const CRhRdkTexture * *  | At (unsigned int) const
const CRhRdkTexture * *  | begin ()
Support STL iterators and algorithms. More...
const CRhRdkTexture * const *  | begin () const
int  | BinarySearch (const const CRhRdkTexture * *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const const CRhRdkTexture * *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *), int) const
const const CRhRdkTexture * *  | BinarySearchPtr (const const CRhRdkTexture * *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *)) const
const const CRhRdkTexture * *  | BinarySearchPtr (const const CRhRdkTexture * *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *), int) const
int  | Capacity () const
capacity of array More...
const CRhRdkTexture * const *  | cbegin () const
const CRhRdkTexture * const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
const CRhRdkTexture * *  | end ()
const CRhRdkTexture * const *  | end () const
const CRhRdkTexture * *  | First ()
const const CRhRdkTexture * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *))
void  | Insert (int, const const CRhRdkTexture * &)
int  | InsertInSortedList (const const CRhRdkTexture * &, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *))
int  | InsertInSortedList (const const CRhRdkTexture * &, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *), int)
const CRhRdkTexture * *  | KeepArray ()
const CRhRdkTexture * *  | Last ()
const const CRhRdkTexture * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const const CRhRdkTexture * * () const
operator const CRhRdkTexture ** ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_SimpleArray< const CRhRdkTexture * > &other) const=delete
ON_SimpleArray< const CRhRdkTexture * > &  | operator= (const ON_SimpleArray< const CRhRdkTexture * > &)
bool  | operator== (const ON_SimpleArray< const CRhRdkTexture * > &other) const=delete
const CRhRdkTexture * &  | operator[] (int)
const const CRhRdkTexture * &  | operator[] (int) const
const CRhRdkTexture * &  | operator[] (ON__INT64)
const const CRhRdkTexture * &  | operator[] (ON__INT64) const
const CRhRdkTexture * &  | operator[] (ON__UINT64)
const const CRhRdkTexture * &  | operator[] (ON__UINT64) const
const CRhRdkTexture * &  | operator[] (unsigned int)
const const CRhRdkTexture * &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Prepend (int, const const CRhRdkTexture * *)
Prepend copy of an array T[count]. More...
bool  | QuickSort (int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
bool  | QuickSortAndRemoveDuplicates (int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
virtual const CRhRdkTexture * *  | Realloc (const CRhRdkTexture * *, int)
low level memory management ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
void  | RemoveIf (bool(*predicate)(const const CRhRdkTexture * &key))
void  | RemoveValue (const const CRhRdkTexture * &)
const CRhRdkTexture * *  | Reserve (size_t)
memory management //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const const CRhRdkTexture * &) const
int  | Search (const const CRhRdkTexture * *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
void  | SetArray (const CRhRdkTexture * *p)
void  | SetArray (const CRhRdkTexture * *p, int count, int capacity)
const CRhRdkTexture * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | SetRange (int from, int count, const CRhRdkTexture *)
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *, void *), void *) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const const CRhRdkTexture * *, const const CRhRdkTexture * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< const CRhRdkTexture * >
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< const CRhRdkTexture * >
const CRhRdkTexture * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Member Function Documentation
◆ Dump()
 void CRhRdkTextureArray::Dump  |  ( |  const CRhRdkContent::DumpContext &  |  dc,
|  unsigned int  |  gds_flags
) |   |  const
Dump this texture array to a 'dump context'.
◆ PopulateFrom()
 void CRhRdkTextureArray::PopulateFrom  |  ( |  const CRhRdkContentArray &  |  a | )
Populate this texture array from all textures in a content array.
◆ SetFilename() [1/2]
 void CRhRdkTextureArray::SetFilename  |  ( |  const wchar_t *  |  file_name,
|  const wchar_t *  |  child_slot_name = nullptr
)
Call this method to update all of the textures with a new filename for file based textures.
Parameters
file_name | is the new filename.
child_slot_name | is the child slot name of the filename field. If this is null, FS_TEX_FILENAME will be used.
◆ SetFilename() [2/2]
 RDK_DEPRECATED void CRhRdkTextureArray::SetFilename  |  ( |  IRhinoUiController &  |  ,
|  const wchar_t *  |  ,
|  const wchar_t *  |  csn = nullptr
)
This method is deprecated in favor of the one below.