Public Member Functions | List of all members
CRhinoPropListFileProfileContext Class Reference
Rhino
#include <RhinoSdkMacUiProfileContext.h>
 Inheritance diagram for CRhinoPropListFileProfileContext:
 Public Member Functions
CRhinoPropListFileProfileContext (CRhinoProfileContext::context_location ct)
MRPropertyList *  | PropertyList () const
void  | SetPropertyList (MRPropertyList *)
 Public Member Functions inherited from CRhinoPropListProfileContext
CRhinoPropListProfileContext (CRhinoProfileContext::context_location ct)
virtual  | ~CRhinoPropListProfileContext ()
CRhinoProfileContextIterator *  | GetNewIterator (const wchar_t *section)
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *) const
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool *value, bool defaultValue) const
bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *value, BOOL32 defaultValue) const
bool  | LoadProfileBool (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32 *) const
bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *value, COLORREF defaultValue) const
bool  | LoadProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color *) const
bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *value, double defaultValue) const
bool  | LoadProfileDouble (const wchar_t *lpszSection, LPCTSTR lpszEntry, double *) const
bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *value, int defaultValue) const
bool  | LoadProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32 *) const
bool  | LoadProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, int *) const
bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value) const
bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &value, const ON_Color &defaultValue) const
bool  | LoadProfileRGBA (const wchar_t *lpszSection, LPCTSTR lpszEntry, ON_Color &) const
bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &value, const char *defaultValue) const
bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &value, const wchar_t *defaultValue) const
bool  | LoadProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, ON_wString &) const
bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value) const
bool  | LoadProfileStringDictionary (const wchar_t *lpszSection, const wchar_t *lpszEntry, CRhinoStringDictionary &value, const CRhinoStringDictionary &defaultValue) const
bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *value, const UUID &defaultValue) const
id  | ProfileKeyFor (LPCTSTR lpszSection, LPCTSTR lpszEntry=NULL) const
void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, bool) const
void  | SaveProfileBool (const wchar_t *lpszSection, LPCTSTR lpszEntry, BOOL32) const
void  | SaveProfileColor (LPCTSTR lpszSection, LPCTSTR lpszEntry, ON_Color) const
void  | SaveProfileDouble (const wchar_t *lpszSection, LPCTSTR lpszEntry, double) const
void  | SaveProfileInt (const wchar_t *lpszSection, LPCTSTR lpszEntry, int) const
void  | SaveProfileRGBA (const wchar_t *lpszSection, LPCTSTR lpszEntry, const ON_Color &) const
bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_wString > &sValues) const
bool  | SaveProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const char *) const
bool  | SaveProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const wchar_t *) const
void  | SetPropListFileName (const wchar_t *)
 Public Member Functions inherited from CRhinoProfileContext
CRhinoProfileContext (context_location ct)
virtual  | ~CRhinoProfileContext ()
virtual bool  | IsSynchronizing () const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *) const
virtual bool  | LoadProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dPoint *value, const ON_3dPoint &defaultValue) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *) const
virtual bool  | LoadProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_3dVector *value, const ON_3dVector &defaultValue) const
virtual bool  | LoadProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, void *pValue, ULONG &nBytesOut) const
virtual bool  | LoadProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32 *) const
virtual bool  | LoadProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF *) const
virtual bool  | LoadProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double *) const
virtual bool  | LoadProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int *) const
bool  | LoadProfileLegacyPlugMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, ON_MeshParameters *mp, int *mesh_ui_style) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *) const
virtual bool  | LoadProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_MeshParameters *value, const ON_MeshParameters &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_String > &value, const ON_ClassArray< ON_String > &defaultValue) const
virtual bool  | LoadProfileMultiString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_ClassArray< ON_wString > &value, const ON_ClassArray< ON_wString > &defaultValue) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *) const
virtual bool  | LoadProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, POINT *value, const POINT &defaultValue) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *) const
virtual bool  | LoadProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, RECT *value, const RECT &defaultValue) const
virtual bool  | LoadProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Color &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, char *, int) const
The following version of LoadProfileString() all call the above version and convert the CString. More...
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_String &) const
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_wString &) const =0
virtual bool  | LoadProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, wchar_t *, int) const
virtual bool  | LoadProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, UUID *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *) const
virtual bool  | LoadProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, ON_Xform *value, const ON_Xform &defaultValue) const
context_location  | ProfileContextLocation () const
virtual void  | SaveProfile3dPoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dPoint &) const
virtual void  | SaveProfile3dVector (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_3dVector &) const
virtual bool  | SaveProfileBinary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const void *pValue, ULONG nBytes) const
virtual void  | SaveProfileBool (const wchar_t *lpszSection, const wchar_t *lpszEntry, BOOL32) const
virtual void  | SaveProfileColor (const wchar_t *lpszSection, const wchar_t *lpszEntry, COLORREF) const
virtual void  | SaveProfileDouble (const wchar_t *lpszSection, const wchar_t *lpszEntry, double) const
virtual void  | SaveProfileInt (const wchar_t *lpszSection, const wchar_t *lpszEntry, int) const
void  | SaveProfileLegacyPlugInMeshParameters (const wchar_t *lpszSection, const wchar_t *plugin_prefix, const ON_MeshParameters &mp, int mesh_ui_style) const
virtual void  | SaveProfileMeshParameters (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_MeshParameters &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_2iPoint &) const
virtual void  | SaveProfilePoint (const wchar_t *lpszSection, const wchar_t *lpszEntry, const POINT &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_4iRect &) const
virtual void  | SaveProfileRect (const wchar_t *lpszSection, const wchar_t *lpszEntry, const RECT &) const
virtual void  | SaveProfileRGBA (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Color &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const char *) const =0
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_ClassArray< ON_String > &) const
virtual bool  | SaveProfileString (const wchar_t *lpszSection, const wchar_t *lpszEntry, const wchar_t *) const =0
virtual bool  | SaveProfileStringDictioary (const wchar_t *lpszSection, const wchar_t *lpszEntry, const CRhinoStringDictionary &value) const
virtual bool  | SaveProfileUuid (const wchar_t *lpszSection, const wchar_t *lpszEntry, const UUID &uuid) const
virtual void  | SaveProfileXform (const wchar_t *lpszSection, const wchar_t *lpszEntry, const ON_Xform &) const
 Additional Inherited Members
 Public Types inherited from CRhinoProfileContext
enum  | context_location : unsigned int {
 cl_global_current_user = 0, cl_scheme_current_user, cl_root_local_machine, cl_plugins_current_user,
 cl_plugins_local_machine
 }
 Protected Member Functions inherited from CRhinoPropListProfileContext
bool  | RegWriteProfileString (const wchar_t *lpszSection, LPCTSTR lpszEntry, const class CString &sValue, CRhinoProfileContext::context_location nProfile) const
 Protected Attributes inherited from CRhinoPropListProfileContext
MRPropertyList *  | m_pPropertyList
ON_wString  | m_wFileName
Detailed Description
class CRhinoPropListProfileContext
Note: You must call SetPropListFileName() with a valid property list file name or all other methods will fail.
Constructor & Destructor Documentation
◆ CRhinoPropListFileProfileContext()
 CRhinoPropListFileProfileContext::CRhinoPropListFileProfileContext  |  ( |  CRhinoProfileContext::context_location  |  ct | )
Member Function Documentation
◆ PropertyList()
 MRPropertyList* CRhinoPropListFileProfileContext::PropertyList  |  ( |   | ) |   const
virtual
Reimplemented from CRhinoPropListProfileContext.
◆ SetPropertyList()
 void CRhinoPropListFileProfileContext::SetPropertyList  |  ( |  MRPropertyList *  |   | )