Public Member Functions | Public Attributes | List of all members
CRhinoGumball Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumball (const CRhinoGumball &)
CRhinoGumball (CRhinoGumball &&)
CRhinoGumball (ON::active_space)
~CRhinoGumball ()
ON::active_space  | ActiveSpace (void) const
ON_BoundingBox  | BoundingBox (const CRhinoViewport &viewport) const
void  | DrawDynamicGumball (CRhinoDisplayPipeline &dp, GUMBALL_MODE gumball_mode, const ON_Line &drag_line, const CRhinoGumballFrame &start_frame, GUMBALL_MODE highlight_mode=gb_mode_nothing) const
void  | DrawStaticGumball (CRhinoDisplayPipeline &dp, GUMBALL_MODE highlight_mode=gb_mode_nothing) const
bool  | GetPopUpMenuPoint (const CRhinoViewport &vp, ON_2iPoint &popup_menu_point) const
bool  | IsValid () const
const CRhinoGumball &  | operator= (const CRhinoGumball &)
CRhinoGumball &  | operator= (CRhinoGumball &&)
bool  | Pick (const CRhinoPickContext &pick_context, CRhinoGumballPickResult &pick_result) const
bool  | Read (ON_BinaryArchive &binary_archive)
void  | SetActiveSpace (ON::active_space)
bool  | SetCenter (const ON_3dPoint &center)
bool  | SetFromArc (const ON_Arc &arc)
bool  | SetFromBoundingBox (ON_BoundingBox bbox)
bool  | SetFromBoundingBox (ON_Plane frame, ON_BoundingBox bbox)
bool  | SetFromBrepObject (const CRhinoBrepObject &brep, double dTol=ON_ZERO_TOLERANCE)
bool  | SetFromCircle (const ON_Circle &circle)
bool  | SetFromClippingPlane (const ON_PlaneSurface &clipping_plane)
bool  | SetFromCurve (const ON_Curve &curve)
bool  | SetFromEllipse (const ON_Ellipse &ellipse)
bool  | SetFromExtrusion (const ON_Extrusion &extrusion)
bool  | SetFromExtrusionObject (const CRhinoExtrusionObject &ext, double dTol=ON_ZERO_TOLERANCE)
bool  | SetFromHatch (const ON_Hatch &hatch)
bool  | SetFromLight (const ON_Light &light)
bool  | SetFromLine (const ON_Line &line)
bool  | SetFromMeshObject (const CRhinoMeshObject &ext, double dTol=ON_ZERO_TOLERANCE)
bool  | SetFromMorphControlObject (const CRhinoMorphControl &mc, double dTol=ON_ZERO_TOLERANCE)
bool  | SetFromPlane (const ON_Plane &plane)
bool  | SetFromSubDObject (const CRhinoSubDObject &ext, double dTol=ON_ZERO_TOLERANCE)
void  | SetToDefaultGumball ()
bool  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &binary_archive) const
 Public Attributes
CRhinoGumballAppearance  | m_appearance
CRhinoGumballFrame  | m_frame
Detailed Description
CRhinoGumball class - frame and appearance settings
Constructor & Destructor Documentation
◆ CRhinoGumball() [1/3]
 CRhinoGumball::CRhinoGumball  |  ( |  ON::active_space  |   | )
Deprecated:
Gumball should be created with the view type CRhinoGumball();
◆ ~CRhinoGumball()
 CRhinoGumball::~CRhinoGumball  |  ( |   | )
◆ CRhinoGumball() [2/3]
 CRhinoGumball::CRhinoGumball  |  ( |  const CRhinoGumball &  |   | )
◆ CRhinoGumball() [3/3]
 CRhinoGumball::CRhinoGumball  |  ( |  CRhinoGumball &&  |   | )
Member Function Documentation
◆ ActiveSpace()
 ON::active_space CRhinoGumball::ActiveSpace  |  ( |  void  |   | ) |   const
◆ BoundingBox()
 ON_BoundingBox CRhinoGumball::BoundingBox  |  ( |  const CRhinoViewport &  |  viewport | ) |   const
Returns: World coordinate bounding box. The bounding box depends on the viewport that is displaying the gumball.
◆ DrawDynamicGumball()
 void CRhinoGumball::DrawDynamicGumball  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  GUMBALL_MODE  |  gumball_mode,
|  const ON_Line &  |  drag_line,
|  const CRhinoGumballFrame &  |  start_frame,
|  GUMBALL_MODE  |  highlight_mode = gb_mode_nothing
) |   |  const
Description: Draw gumball and dragging decorations that indicate how the gumball is moving. Parameters: dp - [in] gumball_mode - [in] gb_mode_nothing will draw complete gumball or pass the mode returned by CRhinoGumball::Pick(...) to draw what matters when a dynamic drag is happening. drag_line - [in] line returned by m_frame.Drag(...) start_frame - [in] starting point for the gumball highlight_mode - [in] indicates which gumball element to draw highlighted
◆ DrawStaticGumball()
 void CRhinoGumball::DrawStaticGumball  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  GUMBALL_MODE  |  highlight_mode = gb_mode_nothing
) |   |  const
Description: Draw gumball. Parameters: dp - [in] highlight_mode - [in] indicates which gumball element to draw highlighted
◆ GetPopUpMenuPoint()
 bool CRhinoGumball::GetPopUpMenuPoint  |  ( |  const CRhinoViewport &  |  vp,
|  ON_2iPoint &  |  popup_menu_point
) |   |  const
Description: Get the location of a gumball menu ball in window coordinates. Useful when calling CRhinoGumballPopUpMenu::ShowMenu(). Parameters: vp - [in] Typically CRhinoView.Viewport().VP() popup_menu_point - [out] Returns: true if popup_menu_point was set.
◆ IsValid()
 bool CRhinoGumball::IsValid  |  ( |   | ) |   const
◆ operator=() [1/2]
 const CRhinoGumball& CRhinoGumball::operator=  |  ( |  const CRhinoGumball &  |   | )
◆ operator=() [2/2]
 CRhinoGumball& CRhinoGumball::operator=  |  ( |  CRhinoGumball &&  |   | )
◆ Pick()
 bool CRhinoGumball::Pick  |  ( |  const CRhinoPickContext &  |  pick_context,
|  CRhinoGumballPickResult &  |  pick_result
) |   |  const
◆ Read()
 bool CRhinoGumball::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
◆ SetActiveSpace()
 void CRhinoGumball::SetActiveSpace  |  ( |  ON::active_space  |   | )
◆ SetCenter()
 bool CRhinoGumball::SetCenter  |  ( |  const ON_3dPoint &  |  center | )
◆ SetFromArc()
 bool CRhinoGumball::SetFromArc  |  ( |  const ON_Arc &  |  arc | )
◆ SetFromBoundingBox() [1/2]
 bool CRhinoGumball::SetFromBoundingBox  |  ( |  ON_BoundingBox  |  bbox | )
◆ SetFromBoundingBox() [2/2]
 bool CRhinoGumball::SetFromBoundingBox  |  ( |  ON_Plane  |  frame,
|  ON_BoundingBox  |  bbox
)
◆ SetFromBrepObject()
 bool CRhinoGumball::SetFromBrepObject  |  ( |  const CRhinoBrepObject &  |  brep,
|  double  |  dTol = ON_ZERO_TOLERANCE
)
◆ SetFromCircle()
 bool CRhinoGumball::SetFromCircle  |  ( |  const ON_Circle &  |  circle | )
◆ SetFromClippingPlane()
 bool CRhinoGumball::SetFromClippingPlane  |  ( |  const ON_PlaneSurface &  |  clipping_plane | )
◆ SetFromCurve()
 bool CRhinoGumball::SetFromCurve  |  ( |  const ON_Curve &  |  curve | )
◆ SetFromEllipse()
 bool CRhinoGumball::SetFromEllipse  |  ( |  const ON_Ellipse &  |  ellipse | )
◆ SetFromExtrusion()
 bool CRhinoGumball::SetFromExtrusion  |  ( |  const ON_Extrusion &  |  extrusion | )
◆ SetFromExtrusionObject()
 bool CRhinoGumball::SetFromExtrusionObject  |  ( |  const CRhinoExtrusionObject &  |  ext,
|  double  |  dTol = ON_ZERO_TOLERANCE
)
◆ SetFromHatch()
 bool CRhinoGumball::SetFromHatch  |  ( |  const ON_Hatch &  |  hatch | )
◆ SetFromLight()
 bool CRhinoGumball::SetFromLight  |  ( |  const ON_Light &  |  light | )
◆ SetFromLine()
 bool CRhinoGumball::SetFromLine  |  ( |  const ON_Line &  |  line | )
◆ SetFromMeshObject()
 bool CRhinoGumball::SetFromMeshObject  |  ( |  const CRhinoMeshObject &  |  ext,
|  double  |  dTol = ON_ZERO_TOLERANCE
)
◆ SetFromMorphControlObject()
 bool CRhinoGumball::SetFromMorphControlObject  |  ( |  const CRhinoMorphControl &  |  mc,
|  double  |  dTol = ON_ZERO_TOLERANCE
)
◆ SetFromPlane()
 bool CRhinoGumball::SetFromPlane  |  ( |  const ON_Plane &  |  plane | )
◆ SetFromSubDObject()
 bool CRhinoGumball::SetFromSubDObject  |  ( |  const CRhinoSubDObject &  |  ext,
|  double  |  dTol = ON_ZERO_TOLERANCE
)
◆ SetToDefaultGumball()
 void CRhinoGumball::SetToDefaultGumball  |  ( |   | )
◆ Transform()
 bool CRhinoGumball::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool CRhinoGumball::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
Member Data Documentation
◆ m_appearance
 CRhinoGumballAppearance CRhinoGumball::m_appearance
◆ m_frame
 CRhinoGumballFrame CRhinoGumball::m_frame