Public Member Functions | Static Public Attributes | List of all members
CRhinoSoftTransformSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoSoftTransformSettings ()
CRhinoSoftTransformSettings (const CRhinoSoftTransformSettings &)
CRhinoSoftTransformSettings (CRhinoSoftTransformSettings &&)
~CRhinoSoftTransformSettings ()
int  | CvCountU () const
int  | CvCountV () const
void  | Defaults ()
bool  | Enabled () const
ON_Color  | FalloffColor () const
void  | LoadProfile (CRhinoProfileContext &)
bool  | MeasureDistanceAlong () const
bool  | operator!= (const CRhinoSoftTransformSettings &) const
CRhinoSoftTransformSettings &  | operator= (const CRhinoSoftTransformSettings &)
CRhinoSoftTransformSettings &  | operator= (CRhinoSoftTransformSettings &&)
bool  | operator== (const CRhinoSoftTransformSettings &) const
double  | Radius () const
void  | SaveProfile (CRhinoProfileContext &) const
void  | SetCvCountU (int iCvCountU)
void  | SetCvCountV (int iCvCountV)
void  | SetEnabled (bool bEnable)
void  | SetFalloffColor (ON_Color color)
void  | SetMeasureDistanceAlong (bool bAlong)
void  | SetRadius (double dRadius)
void  | SetShape (int iShape)
void  | SetShowSurfaceConstraintWidgets (bool bShow)
int  | Shape () const
0 = smooth, 1 = linear, 2 = round, 3 = sharp More...
bool  | ShowSurfaceConstraintWidgets () const
 Static Public Attributes
static const CRhinoSoftTransformSettings  | Default
Constructor & Destructor Documentation
◆ CRhinoSoftTransformSettings() [1/3]
 CRhinoSoftTransformSettings::CRhinoSoftTransformSettings  |  ( |   | )
◆ ~CRhinoSoftTransformSettings()
 CRhinoSoftTransformSettings::~CRhinoSoftTransformSettings  |  ( |   | )
◆ CRhinoSoftTransformSettings() [2/3]
 CRhinoSoftTransformSettings::CRhinoSoftTransformSettings  |  ( |  const CRhinoSoftTransformSettings &  |   | )
◆ CRhinoSoftTransformSettings() [3/3]
 CRhinoSoftTransformSettings::CRhinoSoftTransformSettings  |  ( |  CRhinoSoftTransformSettings &&  |   | )
Member Function Documentation
◆ CvCountU()
 int CRhinoSoftTransformSettings::CvCountU  |  ( |   | ) |   const
◆ CvCountV()
 int CRhinoSoftTransformSettings::CvCountV  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoSoftTransformSettings::Defaults  |  ( |   | )
◆ Enabled()
 bool CRhinoSoftTransformSettings::Enabled  |  ( |   | ) |   const
◆ FalloffColor()
 ON_Color CRhinoSoftTransformSettings::FalloffColor  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoSoftTransformSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |   | )
◆ MeasureDistanceAlong()
 bool CRhinoSoftTransformSettings::MeasureDistanceAlong  |  ( |   | ) |   const
◆ operator!=()
 bool CRhinoSoftTransformSettings::operator!=  |  ( |  const CRhinoSoftTransformSettings &  |   | ) |   const
◆ operator=() [1/2]
 CRhinoSoftTransformSettings& CRhinoSoftTransformSettings::operator=  |  ( |  const CRhinoSoftTransformSettings &  |   | )
◆ operator=() [2/2]
 CRhinoSoftTransformSettings& CRhinoSoftTransformSettings::operator=  |  ( |  CRhinoSoftTransformSettings &&  |   | )
◆ operator==()
 bool CRhinoSoftTransformSettings::operator==  |  ( |  const CRhinoSoftTransformSettings &  |   | ) |   const
◆ Radius()
 double CRhinoSoftTransformSettings::Radius  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoSoftTransformSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ SetCvCountU()
 void CRhinoSoftTransformSettings::SetCvCountU  |  ( |  int  |  iCvCountU | )
◆ SetCvCountV()
 void CRhinoSoftTransformSettings::SetCvCountV  |  ( |  int  |  iCvCountV | )
◆ SetEnabled()
 void CRhinoSoftTransformSettings::SetEnabled  |  ( |  bool  |  bEnable | )
◆ SetFalloffColor()
 void CRhinoSoftTransformSettings::SetFalloffColor  |  ( |  ON_Color  |  color | )
◆ SetMeasureDistanceAlong()
 void CRhinoSoftTransformSettings::SetMeasureDistanceAlong  |  ( |  bool  |  bAlong | )
◆ SetRadius()
 void CRhinoSoftTransformSettings::SetRadius  |  ( |  double  |  dRadius | )
◆ SetShape()
 void CRhinoSoftTransformSettings::SetShape  |  ( |  int  |  iShape | )
◆ SetShowSurfaceConstraintWidgets()
 void CRhinoSoftTransformSettings::SetShowSurfaceConstraintWidgets  |  ( |  bool  |  bShow | )
◆ Shape()
 int CRhinoSoftTransformSettings::Shape  |  ( |   | ) |   const
0 = smooth, 1 = linear, 2 = round, 3 = sharp
◆ ShowSurfaceConstraintWidgets()
 bool CRhinoSoftTransformSettings::ShowSurfaceConstraintWidgets  |  ( |   | ) |   const
Member Data Documentation
◆ Default
 const CRhinoSoftTransformSettings CRhinoSoftTransformSettings::Default
static