Public Attributes | List of all members
CRhinoObjRef::CNestedIRef Class Reference
#include <rhinoSdkObject.h>
 Public Attributes
const class CRhinoInstanceObject *  | m_iref
instance reference More...
ON_Xform  | m_xform
Transformation. More...
Member Data Documentation
◆ m_iref
 const class CRhinoInstanceObject* CRhinoObjRef::CNestedIRef::m_iref
instance reference
◆ m_xform
 ON_Xform CRhinoObjRef::CNestedIRef::m_xform
Transformation.