Public Member Functions | Friends | List of all members
CRhinoPolyEdgeSegment Class Reference
Rhino
#include <rhinoSdkPolyEdge.h>
 Inheritance diagram for CRhinoPolyEdgeSegment:
 Public Member Functions
CRhinoPolyEdgeSegment ()
construction More...
CRhinoPolyEdgeSegment (const CRhinoPolyEdgeSegment &)
~CRhinoPolyEdgeSegment ()
void  | AddSegmentObjRef (const CRhinoObjRef &ref)
const ON_Brep *  | Brep () const
ON_COMPONENT_INDEX  | ComponentIndex () const override
virtual ON_Geometry::ComponentIndex override More...
bool  | Create (const CRhinoObjRef &ref)
bool  | Create (const ON_BrepTrim *trim, const CRhinoObject *rhino_object=0)
bool  | Create (const ON_Curve *curve, const CRhinoObject *rhino_object=0)
bool  | Create (const ON_Curve *curve, const ON_COMPONENT_INDEX &component_index, const CRhinoObject *rhino_object=0)
bool  | Create (CRhinoDoc &doc, const ON_CurveProxyHistory &curveproxy_history)
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
const ON_BrepEdge *  | Edge () const
ON_Interval  | EdgeDomain () const
double  | EdgeParameter (double t) const
const ON_BrepFace *  | Face () const
bool  | GetHistoryValue (CRhinoDoc &doc, ON_CurveProxyHistory &curveproxy_history) const
void  | Highlight (bool bHighlight=true) const
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
bool  | IsHighlighted () const
ON_Surface::ISO  | IsoType () const
bool  | IsSelected () const
CRhinoPolyEdgeSegment &  | operator= (const CRhinoPolyEdgeSegment &)
bool  | ReversedEdgeDir () const
bool  | ReversedTrimDir () const
const CRhinoObject *  | RhinoObject () const
const CRhinoObjRef *  | SegmentObjRef (int segment_objref_index) const
int  | SegmentObjRefCount () const
void  | Select (bool bSelect=true, bool bSynchHighlight=true) const
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
override of virtual ON_Curve::Split More...
const ON_Surface *  | Surface () const
ON_2dPoint  | SurfaceParameter (double t) const
const ON_BrepTrim *  | Trim () const
bool  | Trim (const ON_Interval &domain) override
override of virtual ON_Curve::Trim More...
ON_Interval  | TrimDomain () const
double  | TrimParameter (double t) const
 Public Member Functions inherited from ON_CurveProxy
ON_CurveProxy () ON_NOEXCEPT
ON_CurveProxy (const ON_Curve *)
ON_CurveProxy (const ON_Curve *, ON_Interval)
ON_CurveProxy (const ON_CurveProxy &)
virtual  | ~ON_CurveProxy ()
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
ON_Curve overrides. More...
void  | Dump (ON_TextLog &) const override
for debugging More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
Domain changes from [a,b] to [-b,-a]. More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override
 More...
bool  | GetClosestPoint (const ON_3dPoint &, double *, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetLength (double *, double=1.0e-8, const ON_Interval *=nullptr) const override
bool  | GetLocalClosestPoint (const ON_3dPoint &, double, double *, const ON_Interval *=nullptr) const override
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | GetNormalizedArcLengthPoint (double s, double *t, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
bool  | GetNormalizedArcLengthPoints (int count, const double *s, double *t, double absolute_tolerance=0.0, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetParameterTolerance (double, double *, double *) const override
(optional - override if curve is piecewise smooth) More...
bool  | GetSpanVector (double *) const override
int  | HasNurbForm () const override
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
virtual override of ON_Curve::IsPolyline More...
bool  | IsShort (double tolerance, const ON_Interval *sub_domain=0, double *length_estimate=0) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_CurveProxy &  | operator= (const ON_CurveProxy &)
const ON_Curve *  | ProxyCurve () const
ON_Interval  | ProxyCurveDomain () const
bool  | ProxyCurveIsReversed () const
bool  | Read (ON_BinaryArchive &) override
double  | RealCurveParameter (double t) const
bool  | Reverse () override
bool  | SetDomain (double t0, double t1) override
bool  | SetDomain (ON_Interval domain)
void  | SetProxyCurve (const ON_Curve *real_curve)
void  | SetProxyCurve (const ON_Curve *real_curve, ON_Interval real_curve_subdomain)
bool  | SetProxyCurveDomain (ON_Interval proxy_curve_subdomain)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
number of smooth spans in curve More...
double  | ThisCurveParameter (double real_curve_parameter) const
bool  | Transform (const ON_Xform &) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
bool  | AreaMassProperties (ON_3dPoint base_point, ON_3dVector plane_normal, ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
virtual bool  | ChangeClosedCurveSeam (double t)
bool  | ChangeClosedCurveSeam (double t, double min_dist)
virtual bool  | ChangeDimension (int desired_dimension)
virtual class ON_CurveTree *  | CreateCurveTree () const
ON_3dVector  | CurvatureAt (double t) const
const class ON_CurveTree *  | CurveTree () const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvSignedCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, double &kappa, const ON_3dVector *normal=nullptr, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
virtual bool  | Extend (const ON_Interval &domain)
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override
 More...
int  | IntersectCurve (const ON_Curve *curveB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *curveB_domain=0) const
int  | IntersectPlane (ON_PlaneEquation plane_equation, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curve_domain=0) const
virtual int  | IntersectSelf (ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, const ON_Interval *curve_domain=0) const
int  | IntersectSurface (const ON_Surface *surfaceB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *surfaceB_udomain=0, const ON_Interval *surfaceB_vdomain=0) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsLong (double min_length, const ON_Interval *sub_domain=0) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | LengthMassProperties (class ON_MassProperties &mp, bool bLength=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
class ON_PolylineCurve *  | MeshCurve (ON_MeshCurveParameters &mp, ON_PolylineCurve *polyline, bool bSkipFirstPoint, const ON_Interval *domain) const
double  | NextCurveKink (ON_Interval search_domain, const class ON_CurveKinkDefinition &kink_definition) const
Find the next curve kink in the search domain. More...
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
class ON_NurbsCurve *  | NurbsCurveFit (ON_Interval domain, const class ON_NurbsCurveFitParameters &fit_parameters, class ON_NurbsCurve *destination_nurbs_cuve, class ON_Line &maximum_separation, double &this_separation_parameter, double &nurbs_separation_parameter) const
Get a uniform NURBS curve fit to this curve.. This function is useful when you want to fit this curve a single time. If you are in a situation where you are repeatedly adjusting fit_parameters, it is much more efficient to use the ON_NurbsCurveFitBuilder class because the steps involved in sampling points and other information from this input curve are expensive and can be reused as fit_parameters.Degree(), fit_parameters.PointCount(), and other fitting parmeters are changed. More...
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
class ON_NurbsCurve *  | RebuildToMatchTemplateCurve (const ON_Curve &template_curve, bool bFlipSourceDirection, bool bPreserveEndTangents, bool bMakeSubDFriendly, class ON_NurbsCurve *destination_nurbs_curve, class ON_Line *maximum_deviation) const
Rebuild this curve (the "source" curve) so it takes on the degree, knot vector, and control point count of a template curve. When rebuilding many curves against the same template, use the ON_TemplatedCurveRebuilder class so the template is analyzed only once. More...
virtual bool  | RemoveShortSegments (double tolerance, bool bRemoveShortSegments=true)
bool  | SetDomain (ON_Interval domain)
virtual bool  | SetEndPoint (ON_3dPoint end_point)
virtual bool  | SetStartPoint (ON_3dPoint start_point)
double  | SignedCurvatureAt (double t, const ON_3dVector *plane_normal=nullptr) const
const ON_SimpleArray< double >  | SpanVector () const
The curve's span vector is a stricltly monotone increasing list of doubles that are the intervals on which the curve is C-infinity. More...
ON_3dVector  | TangentAt (double t) const
ON_3dVector  | TangentAt (double t, int side) const
Evaluate the unit tangent vector with the option to specify the direction of the limit. This is useful when evaluating tangent vectors at a tangent discontinuity. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
virtual bool  | IsMorphable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | MakeDeformable ()
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Friends
class  | CRhinoPolyEdge
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from ON_Curve
static class ON_NurbsCurve *  | CreateCubicLoft (int point_count, int point_dim, int point_stride, const double *point_list, double k, int is_closed=0, ON::cubic_loft_end_condition start_shape=ON::cubic_loft_ec_quadratic, ON::cubic_loft_end_condition end_shape=ON::cubic_loft_ec_quadratic, class ON_NurbsCurve *nurbs_curve=0)
static bool  | GetCurveSeparation (const ON_Curve &curveA, ON_Interval domainA, const ON_Curve &curveB, ON_Interval domainB, ON_Line &minimum_separation, double *min_parameter_A, double *min_parameter_B, ON_Line &maximum_separation, double *max_parameter_A, double *max_parameter_B)
Find the locations of the minimimum and maximum separation between two curves. When the separation points are distinct, the line connecting the separation points is perpindicular to the curves. This calculates the distances and locations shown in the Rhino CrvDeviation command. More...
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
 Protected Member Functions inherited from ON_CurveProxy
void  | SetProxyCurveIsReversed (bool bReversed)
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ CRhinoPolyEdgeSegment() [1/2]
 CRhinoPolyEdgeSegment::CRhinoPolyEdgeSegment  |  ( |   | )
construction
◆ ~CRhinoPolyEdgeSegment()
 CRhinoPolyEdgeSegment::~CRhinoPolyEdgeSegment  |  ( |   | )
◆ CRhinoPolyEdgeSegment() [2/2]
 CRhinoPolyEdgeSegment::CRhinoPolyEdgeSegment  |  ( |  const CRhinoPolyEdgeSegment &  |   | )
The custom copy constructor and operator= are required to manage m_or_copy.
Member Function Documentation
◆ AddSegmentObjRef()
 void CRhinoPolyEdgeSegment::AddSegmentObjRef  |  ( |  const CRhinoObjRef &  |  ref | )
Description: Store a copy of a CRhinoObjRef on this polysegment class. The copy will be deleted when this polysegment is deleted. Parameters: ref - [in] Returns: True if it was possible to save a copy of ref. False if it was not possible to save a copy of ref because the internal storage facility was full.
◆ Brep()
 const ON_Brep* CRhinoPolyEdgeSegment::Brep  |  ( |   | ) |   const
◆ ComponentIndex()
 ON_COMPONENT_INDEX CRhinoPolyEdgeSegment::ComponentIndex  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::ComponentIndex override
Reimplemented from ON_Geometry.
◆ Create() [1/5]
 bool CRhinoPolyEdgeSegment::Create  |  ( |  const CRhinoObjRef &  |  ref | )
Description: Creates a polyedge segment that uses the entire curve and has the same domain as the curve. Parameters: ref - [in] ref.Curve() and ref.Object() are used to create a segment. This function does NOT store a copy of the ref on the segment. Use SetSegmentObjRef() if you need to save a copy of a particular CRhinoObjRef. Remarks: Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ Create() [2/5]
 bool CRhinoPolyEdgeSegment::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const CRhinoObject *  |  rhino_object = 0
)
Description: Creates a polyedge segment that uses the entire edge and has the same domain as the edge. Parameters: trim - [in] Returns: true if successful (edge was valid and trim_index was valid) Remarks: Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ Create() [3/5]
 bool CRhinoPolyEdgeSegment::Create  |  ( |  const ON_Curve *  |  curve,
|  const CRhinoObject *  |  rhino_object = 0
)
Description: Creates a polyedge segment that uses the entire curve and has the same domain as the curve. Parameters: curve - [in] Remarks: Use ON_Curve::SetDomain, ON_Curve::Trim, ON_Curve::Reverse, etc., to tweak the domain, support, direction etc.
◆ Create() [4/5]
 bool CRhinoPolyEdgeSegment::Create  |  ( |  const ON_Curve *  |  curve,
|  const ON_COMPONENT_INDEX &  |  component_index,
|  const CRhinoObject *  |  rhino_object = 0
)
Description: Creates a polyedge segment from a curve and component index. This is needed for mesh objects, because the curve is a proxy and does not carry the component index of the mesh edge. Parameters: curve - [in] component_index - [in]
◆ Create() [5/5]
 bool CRhinoPolyEdgeSegment::Create  |  ( |  CRhinoDoc &  |  doc,
|  const ON_CurveProxyHistory &  |  curveproxy_history
)
◆ DestroyRuntimeCache()
 void CRhinoPolyEdgeSegment::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_CurveProxy.
◆ DuplicateCurve()
 ON_Curve* CRhinoPolyEdgeSegment::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override This insures that the duplicate is a CRhinoPolyEdgeSegment class rather than a duplicate of the "real" curve the ON_CurveProxy base class referse to.
Reimplemented from ON_CurveProxy.
◆ Edge()
 const ON_BrepEdge* CRhinoPolyEdgeSegment::Edge  |  ( |   | ) |   const
◆ EdgeDomain()
 ON_Interval CRhinoPolyEdgeSegment::EdgeDomain  |  ( |   | ) |   const
Returns: subdomain of the edge that this segment uses. This can be different than the domain returned by this->Domain().
◆ EdgeParameter()
 double CRhinoPolyEdgeSegment::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ Face()
 const ON_BrepFace* CRhinoPolyEdgeSegment::Face  |  ( |   | ) |   const
◆ GetHistoryValue()
 bool CRhinoPolyEdgeSegment::GetHistoryValue  |  ( |  CRhinoDoc &  |  doc,
|  ON_CurveProxyHistory &  |  curveproxy_history
) |   |  const
◆ Highlight()
 void CRhinoPolyEdgeSegment::Highlight  |  ( |  bool  |  bHighlight = true | ) |   const
◆ IsClosed()
 bool CRhinoPolyEdgeSegment::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_CurveProxy.
◆ IsHighlighted()
 bool CRhinoPolyEdgeSegment::IsHighlighted  |  ( |   | ) |   const
◆ IsoType()
 ON_Surface::ISO CRhinoPolyEdgeSegment::IsoType  |  ( |   | ) |   const
◆ IsSelected()
 bool CRhinoPolyEdgeSegment::IsSelected  |  ( |   | ) |   const
◆ operator=()
 CRhinoPolyEdgeSegment& CRhinoPolyEdgeSegment::operator=  |  ( |  const CRhinoPolyEdgeSegment &  |   | )
◆ ReversedEdgeDir()
 bool CRhinoPolyEdgeSegment::ReversedEdgeDir  |  ( |   | ) |   const
Returns: True if this segment has an ON_BrepEdge and the direction of the ON_BrepEdge is the reverse of the direction of the segment.
◆ ReversedTrimDir()
 bool CRhinoPolyEdgeSegment::ReversedTrimDir  |  ( |   | ) |   const
Returns: True if this segment has an ON_BrepTrim and the direction of the ON_BrepTrime is the reverse of the direction of the segment.
◆ RhinoObject()
 const CRhinoObject* CRhinoPolyEdgeSegment::RhinoObject  |  ( |   | ) |   const
◆ SegmentObjRef()
 const CRhinoObjRef* CRhinoPolyEdgeSegment::SegmentObjRef  |  ( |  int  |  segment_objref_index | ) |   const
Returns: A pointer to any objref being stored by SetSegmentObjRef().
◆ SegmentObjRefCount()
 int CRhinoPolyEdgeSegment::SegmentObjRefCount  |  ( |   | ) |   const
Returns: Number of segment obj refs added by AddSegmentObjRef().
◆ Select()
 void CRhinoPolyEdgeSegment::Select  |  ( |  bool  |  bSelect = true,
|  bool  |  bSynchHighlight = true
) |   |  const
◆ Split()
 bool CRhinoPolyEdgeSegment::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
overridevirtual
override of virtual ON_Curve::Split
Reimplemented from ON_CurveProxy.
◆ Surface()
 const ON_Surface* CRhinoPolyEdgeSegment::Surface  |  ( |   | ) |   const
◆ SurfaceParameter()
 ON_2dPoint CRhinoPolyEdgeSegment::SurfaceParameter  |  ( |  double  |  t | ) |   const
◆ Trim() [1/2]
 const ON_BrepTrim* CRhinoPolyEdgeSegment::Trim  |  ( |   | ) |   const
◆ Trim() [2/2]
 bool CRhinoPolyEdgeSegment::Trim  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
override of virtual ON_Curve::Trim
Reimplemented from ON_CurveProxy.
◆ TrimDomain()
 ON_Interval CRhinoPolyEdgeSegment::TrimDomain  |  ( |   | ) |   const
Returns: subdomain of the trim that this segment uses. This can be different than the domain returned by this->Domain().
◆ TrimParameter()
 double CRhinoPolyEdgeSegment::TrimParameter  |  ( |  double  |  t | ) |   const
Friends And Related Function Documentation
◆ CRhinoPolyEdge
 friend class CRhinoPolyEdge
friend