Public Attributes | List of all members
CRhinoOnTransformObject::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
bool  | m_bCopy
True if objects will be copied. More...
int  | m_grip_count
number of grips that will be transformed. More...
const CRhinoGripObject *const *  | m_grip_list
int  | m_grip_owner_count
const CRhinoObject *const *  | m_grip_owner_list
int  | m_object_count
number of objects that will be transformed More...
const CRhinoObject *const *  | m_object_list
unsigned int  | m_transform_event_id
ON_Xform  | m_xform
Transformation that will be applied. More...
Member Data Documentation
◆ m_bCopy
 bool CRhinoOnTransformObject::CParameters::m_bCopy
True if objects will be copied.
◆ m_grip_count
 int CRhinoOnTransformObject::CParameters::m_grip_count
number of grips that will be transformed.
◆ m_grip_list
 const CRhinoGripObject* const* CRhinoOnTransformObject::CParameters::m_grip_list
list of grips that will be transformed. WARNING: These grips may be deleted at any time after Notify is called. Do not save these pointers and dereference them later. Use the runtime object serial number to safely save a reference to these objects that can be used at a later time.
◆ m_grip_owner_count
 int CRhinoOnTransformObject::CParameters::m_grip_owner_count
number of grip owners that will be changed when the grips move.
◆ m_grip_owner_list
 const CRhinoObject* const* CRhinoOnTransformObject::CParameters::m_grip_owner_list
list of grip owners that will be changed when the grips move. WARNING: These grip owners may be deleted at any time after Notify is called. Do not save these pointers and dereference them later. Use the runtime object serial number to safely save a reference to these objects that can be used at a later time.
◆ m_object_count
 int CRhinoOnTransformObject::CParameters::m_object_count
number of objects that will be transformed
◆ m_object_list
 const CRhinoObject* const* CRhinoOnTransformObject::CParameters::m_object_list
list of objects that will be transformed. WARNING: These objects may be deleted at any time after Notify is called. Do not save these pointers and dereference them later. Use the runtime object serial number to safely save a reference to these objects that can be used at a later time.
◆ m_transform_event_id
 unsigned int CRhinoOnTransformObject::CParameters::m_transform_event_id
This serial number identifies the transform objects event and will be passed to the AfterTransformObjects event that marks the end of the transformation.
◆ m_xform
 ON_Xform CRhinoOnTransformObject::CParameters::m_xform
Transformation that will be applied.