Public Member Functions | List of all members
CRhRdkContentAdded Class Referencefinal
RDK
#include <RhRdkEventSink.h>
 Public Member Functions
CRhRdkContentAdded (const CRhRdkContent &c, int, bool, void *)
const CRhRdkContent &  | Content (void) const
RDK_DEPRECATED bool  | CookedUp (void) const
RDK_DEPRECATED int  | EditingLevel (void) const
Detailed Description
Deprecated:
OBSOLETE
See also
CRhRdkEventWatcher::OnContentAttached()
Constructor & Destructor Documentation
◆ CRhRdkContentAdded()
 CRhRdkContentAdded::CRhRdkContentAdded  |  ( |  const CRhRdkContent &  |  c,
|  int  |  ,
|  bool  |  ,
|  void *
)
Member Function Documentation
◆ Content()
 const CRhRdkContent& CRhRdkContentAdded::Content  |  ( |  void  |   | ) |   const
inline
◆ CookedUp()
 RDK_DEPRECATED bool CRhRdkContentAdded::CookedUp  |  ( |  void  |   | ) |   const
inline
◆ EditingLevel()
 RDK_DEPRECATED int CRhRdkContentAdded::EditingLevel  |  ( |  void  |   | ) |   const
inline