Public Types | Public Member Functions | Public Attributes | Protected Attributes | Friends | List of all members
ON_HatchLoop Class Reference
OpenNURBS
#include <opennurbs_hatch.h>
 Public Types
enum  | eLoopType { ltOuter = 0, ltInner = 1 }
 Public Member Functions
ON_HatchLoop ()
ON_HatchLoop (const ON_HatchLoop &src)
ON_HatchLoop (ON_Curve *pCurve2d, eLoopType type=ltOuter)
~ON_HatchLoop ()
const ON_Curve *  | Curve () const
Interface. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Dump (ON_TextLog &) const
for debugging More...
bool  | IsValid (ON_TextLog *text_log=nullptr) const
ON_HatchLoop &  | operator= (const ON_HatchLoop &src)
bool  | Read (ON_BinaryArchive &)
bool  | SetCurve (const ON_Curve &curve)
void  | SetType (eLoopType type)
eLoopType  | Type () const
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_ComponentStatus  | m_status = ON_ComponentStatus::NoneSet
 Protected Attributes
ON_Curve *  | m_p2dCurve
char  | m_reserved0 = 0
char  | m_reserved1 = 0
eLoopType  | m_type
loop type flag - inner or outer More...
 Friends
class  | ON_Hatch
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. class ON_HatchLoop /////////////////////////////////////////////////////////////// Represents a 3d boundary loop curve
Member Enumeration Documentation
◆ eLoopType
 enum ON_HatchLoop::eLoopType
Enumerator
ltOuter
ltInner
Constructor & Destructor Documentation
◆ ON_HatchLoop() [1/3]
 ON_HatchLoop::ON_HatchLoop  |  ( |   | )
◆ ON_HatchLoop() [2/3]
 ON_HatchLoop::ON_HatchLoop  |  ( |  ON_Curve *  |  pCurve2d,
|  eLoopType  |  type = ltOuter
)
◆ ON_HatchLoop() [3/3]
 ON_HatchLoop::ON_HatchLoop  |  ( |  const ON_HatchLoop &  |  src | )
◆ ~ON_HatchLoop()
 ON_HatchLoop::~ON_HatchLoop  |  ( |   | )
Member Function Documentation
◆ Curve()
 const ON_Curve* ON_HatchLoop::Curve  |  ( |   | ) |   const
Interface.
Description: Get a closed 2d curve boundary loop Parameters: Return: Pointer to loop's 2d curve
◆ DataCRC()
 ON__UINT32 ON_HatchLoop::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
◆ Dump()
 void ON_HatchLoop::Dump  |  ( |  ON_TextLog &  |   | ) |   const
for debugging
◆ IsValid()
 bool ON_HatchLoop::IsValid  |  ( |  ON_TextLog *  |  text_log = nullptr | ) |   const
◆ operator=()
 ON_HatchLoop& ON_HatchLoop::operator=  |  ( |  const ON_HatchLoop &  |  src | )
◆ Read()
 bool ON_HatchLoop::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SetCurve()
 bool ON_HatchLoop::SetCurve  |  ( |  const ON_Curve &  |  curve | )
Description: Specify the 2d loop curve in the hatch's plane coordinates Parameters: curve - [in] 2d input curve Return: true: success, false, curve couldn't be duplicated Remarks: The curve is copied
◆ SetType()
 void ON_HatchLoop::SetType  |  ( |  eLoopType  |  type | )
Description: Specify the type flag of the loop Parameters: type - [in] ltInner or ltOuter
◆ Type()
 eLoopType ON_HatchLoop::Type  |  ( |   | ) |   const
Description: Get the type flag of the loop Returns: eLoopType::ltInner or eLoopType::ltOuter
◆ Write()
 bool ON_HatchLoop::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Friends And Related Function Documentation
◆ ON_Hatch
 friend class ON_Hatch
friend
Member Data Documentation
◆ m_p2dCurve
 ON_Curve* ON_HatchLoop::m_p2dCurve
protected
2d closed curve bounding the hatch This is really a 3d curve with z coordinates = 0
◆ m_reserved0
 char ON_HatchLoop::m_reserved0 = 0
protected
◆ m_reserved1
 char ON_HatchLoop::m_reserved1 = 0
protected
◆ m_status
 ON_ComponentStatus ON_HatchLoop::m_status = ON_ComponentStatus::NoneSet
mutable
◆ m_type
 eLoopType ON_HatchLoop::m_type
protected
loop type flag - inner or outer