Public Attributes | List of all members
CRhinoOnBeforePostReadViewUpdate::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
const CRhinoFileReadOptions *  | m_fro
File reading information. More...
Member Data Documentation
◆ m_fro
 const CRhinoFileReadOptions* CRhinoOnBeforePostReadViewUpdate::CParameters::m_fro
File reading information.