Public Member Functions | Public Attributes | Friends | List of all members
CRhinoPlugInInfo Class Reference
Rhino
#include <RhinoSdkPlugInManager.h>
 Public Member Functions
CRhinoPlugInInfo ()=default
CRhinoPlugInInfo (const CRhinoPlugInInfo &src)=default
CRhinoPlugInInfo (const wchar_t *organization, const wchar_t *address, const wchar_t *country, const wchar_t *phone, const wchar_t *email, const wchar_t *website, const wchar_t *update_url, unsigned int sdk_version, unsigned int sdk_service_release, const wchar_t *fax, const wchar_t *plugin_path)
~CRhinoPlugInInfo ()=default
const ON_wString  | Address () const
const ON_wString  | Country () const
const ON_wString  | EMail () const
const ON_wString  | Fax () const
bool  | GetPlugInId (ON_UUID &plugin_id) const
bool  | HasRequiredFields () const
CRhinoPlugInInfo &  | operator= (const CRhinoPlugInInfo &)=default
const ON_wString  | Organization () const
const ON_wString  | Phone () const
const ON_wString  | PlugInDescription () const
unsigned int  | PlugInIconResourceId () const
const ON_wString  | PlugInIconResourceName () const
const ON_wString  | PlugInPath () const
const ON_wString  | PlugInShortName () const
const ON_wString  | PlugInVersion () const
const ON_wString  | RuiFile () const
const ON_wString  | RuiLibraryFile () const
unsigned int  | SDKServiceRelease () const
unsigned int  | SDKVersion () const
void  | SetPlugInDescription (const wchar_t *plugin_description)
void  | SetPlugInIconResourceName (const wchar_t *plugin_icon_resource_name)
void  | SetPlugInId (ON_UUID plugin_id)
void  | SetPlugInShortName (const wchar_t *plugin_short_name)
void  | SetPlugInVersion (const wchar_t *plugin_version)
const ON_wString  | UpdateURL () const
const ON_wString  | WebSite () const
 Public Attributes
unsigned int  | m_nSDKServiceRelease = 0
unsigned int  | m_nSDKVersion = 0
ON_wString  | m_wAddress
ON_wString  | m_wCountry
ON_wString  | m_wEMail
ON_wString  | m_wFax
Optional fields. More...
ON_wString  | m_wOrganization
Required fields. More...
ON_wString  | m_wPhone
ON_wString  | m_wPlugInPath
ON_wString  | m_wUpdateURL
ON_wString  | m_wWebSite
 Friends
class  | CRhPlugInManager
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Stores information extracted from plug-in, or RHP, file.
Constructor & Destructor Documentation
◆ CRhinoPlugInInfo() [1/3]
 CRhinoPlugInInfo::CRhinoPlugInInfo  |  ( |   | )
default
◆ ~CRhinoPlugInInfo()
 CRhinoPlugInInfo::~CRhinoPlugInInfo  |  ( |   | )
default
◆ CRhinoPlugInInfo() [2/3]
 CRhinoPlugInInfo::CRhinoPlugInInfo  |  ( |  const CRhinoPlugInInfo &  |  src | )
default
◆ CRhinoPlugInInfo() [3/3]
 CRhinoPlugInInfo::CRhinoPlugInInfo  |  ( |  const wchar_t *  |  organization,
|  const wchar_t *  |  address,
|  const wchar_t *  |  country,
|  const wchar_t *  |  phone,
|  const wchar_t *  |  email,
|  const wchar_t *  |  website,
|  const wchar_t *  |  update_url,
|  unsigned int  |  sdk_version,
|  unsigned int  |  sdk_service_release,
|  const wchar_t *  |  fax,
|  const wchar_t *  |  plugin_path
)
Member Function Documentation
◆ Address()
 const ON_wString CRhinoPlugInInfo::Address  |  ( |   | ) |   const
Description: The address of the organization which created this plug-in.
◆ Country()
 const ON_wString CRhinoPlugInInfo::Country  |  ( |   | ) |   const
Description: The country of the organization which created this plug-in.
◆ EMail()
 const ON_wString CRhinoPlugInInfo::EMail  |  ( |   | ) |   const
Description: The support e-mail address of the organization which created this plug-in.
◆ Fax()
 const ON_wString CRhinoPlugInInfo::Fax  |  ( |   | ) |   const
Description: The fax number of the organization which created this plug-in.
◆ GetPlugInId()
 bool CRhinoPlugInInfo::GetPlugInId  |  ( |  ON_UUID &  |  plugin_id | ) |   const
Description: Plug-ins have an extern "C" function that returns the plug-in id. If the plug-in has that function, then GetPlugInId() will return true and set plugin_id to the value of the id. If the plug-in does not export this function, then GetPlugInId() will return false and set plugin_id to ON_nil_uuid.
◆ HasRequiredFields()
 bool CRhinoPlugInInfo::HasRequiredFields  |  ( |   | ) |   const
Description: Function used to validate information extracted from a plug-in. Returns: Return true if plug-in contains information required to load and register.
◆ operator=()
 CRhinoPlugInInfo& CRhinoPlugInInfo::operator=  |  ( |  const CRhinoPlugInInfo &  |   | )
default
◆ Organization()
 const ON_wString CRhinoPlugInInfo::Organization  |  ( |   | ) |   const
Description: The organization which created this plug-in.
◆ Phone()
 const ON_wString CRhinoPlugInInfo::Phone  |  ( |   | ) |   const
Description: The phone number of the organization which created this plug-in.
◆ PlugInDescription()
 const ON_wString CRhinoPlugInInfo::PlugInDescription  |  ( |   | ) |   const
Description: Plug-ins have an extern "C" function that returns the plug-in's description that is displayed in the user interface. If the plug-in has this function, then PlugInDescription() will return a that string. If the plug-in is does not export this function, then PlugInDescription() will return an empty string.
◆ PlugInIconResourceId()
 unsigned int CRhinoPlugInInfo::PlugInIconResourceId  |  ( |   | ) |   const
Description: Plug-ins have an extern "C" function that returns the resource id of the plug-in's icon that is displayed in the user interface. If the plug-in has this function, then PlugInIconResourceId() will return that resource id. If the plug-in is does not export this function, then PlugInIconResourceId() will return 0.
◆ PlugInIconResourceName()
 const ON_wString CRhinoPlugInInfo::PlugInIconResourceName  |  ( |   | ) |   const
Description: .NET plug-ins can have a custom assembly attribute, PlugInDescriptionAttribute.Icon, that returns the resource name of the icon. If the plug-in has this attribute, then PlugInIconResourceName() will return that resource name. If the plug-in is does not have this attribute, then PlugInIconResourceName() will return an empty string.
◆ PlugInPath()
 const ON_wString CRhinoPlugInInfo::PlugInPath  |  ( |   | ) |   const
Description: The full path to plug-in assembly, DLL, or RHP file.
◆ PlugInShortName()
 const ON_wString CRhinoPlugInInfo::PlugInShortName  |  ( |   | ) |   const
Description: Plug-ins have an extern "C" function that returns the plug-in's short name that is displayed in the user interface. If the plug-in has this function, then PlugInShortName() will return that string. If the plug-in does not export this function, then PlugInShortName() will return an empty string.
◆ PlugInVersion()
 const ON_wString CRhinoPlugInInfo::PlugInVersion  |  ( |   | ) |   const
Description: Plug-ins have an extern "C" function that returns the plug-in's version that is displayed in the user interface. If the plug-in has this function, then PlugInVersion() will return a that string. If the plug-in is does not export this function, then PlugInVersion() will return an empty string.
◆ RuiFile()
 const ON_wString CRhinoPlugInInfo::RuiFile  |  ( |   | ) |   const
Description: Plug-ins can have a user interface, or RUI, file which contains custom toolbar and menus. If this is the case, then an entry in the plug-in's registry key will exist and it points to an existing RUI file that will be loaded when Rhino starts. If a user closes the file at some point it will not get loaded unless the user runs the ToolbarReset command.
◆ RuiLibraryFile()
 const ON_wString CRhinoPlugInInfo::RuiLibraryFile  |  ( |   | ) |   const
Description: Plug-ins can have a user interface, or RUI, file which contains custom toolbar and menus. If this is the case, then an entry in the plug-in's registry key may exist that poinst to a file will be loaded as a macro library.
◆ SDKServiceRelease()
 unsigned int CRhinoPlugInInfo::SDKServiceRelease  |  ( |   | ) |   const
Description: The minimum service release version the plug-in requires. The SDK service release must be <= CRhinoApp::SdkServiceRelease() or the plug-in will not load. Remarks: Use ON_VersionNumberParse() to get major, minor, year, month, day of month and branch information from this version number.
◆ SDKVersion()
 unsigned int CRhinoPlugInInfo::SDKVersion  |  ( |   | ) |   const
Description: The version of the SDK that the plug-in requires. The SDK version must exactly match CRhinoApp::SdkVersion() or the plug-in will not load. Remarks: Use ON_VersionNumberParse() to get major, minor, year, month, day of month and branch information from this version number.
◆ SetPlugInDescription()
 void CRhinoPlugInInfo::SetPlugInDescription  |  ( |  const wchar_t *  |  plugin_description | )
◆ SetPlugInIconResourceName()
 void CRhinoPlugInInfo::SetPlugInIconResourceName  |  ( |  const wchar_t *  |  plugin_icon_resource_name | )
◆ SetPlugInId()
 void CRhinoPlugInInfo::SetPlugInId  |  ( |  ON_UUID  |  plugin_id | )
◆ SetPlugInShortName()
 void CRhinoPlugInInfo::SetPlugInShortName  |  ( |  const wchar_t *  |  plugin_short_name | )
◆ SetPlugInVersion()
 void CRhinoPlugInInfo::SetPlugInVersion  |  ( |  const wchar_t *  |  plugin_version | )
◆ UpdateURL()
 const ON_wString CRhinoPlugInInfo::UpdateURL  |  ( |   | ) |   const
Description: The web address, or URL, that can be used to update the plug-in.
◆ WebSite()
 const ON_wString CRhinoPlugInInfo::WebSite  |  ( |   | ) |   const
Description: The web address, or URL, of the organization which created this plug-in.
Friends And Related Function Documentation
◆ CRhPlugInManager
 friend class CRhPlugInManager
friend
Member Data Documentation
◆ m_nSDKServiceRelease
 unsigned int CRhinoPlugInInfo::m_nSDKServiceRelease = 0
◆ m_nSDKVersion
 unsigned int CRhinoPlugInInfo::m_nSDKVersion = 0
◆ m_wAddress
 ON_wString CRhinoPlugInInfo::m_wAddress
◆ m_wCountry
 ON_wString CRhinoPlugInInfo::m_wCountry
◆ m_wEMail
 ON_wString CRhinoPlugInInfo::m_wEMail
◆ m_wFax
 ON_wString CRhinoPlugInInfo::m_wFax
Optional fields.
◆ m_wOrganization
 ON_wString CRhinoPlugInInfo::m_wOrganization
Required fields.
◆ m_wPhone
 ON_wString CRhinoPlugInInfo::m_wPhone
◆ m_wPlugInPath
 ON_wString CRhinoPlugInInfo::m_wPlugInPath
◆ m_wUpdateURL
 ON_wString CRhinoPlugInInfo::m_wUpdateURL
◆ m_wWebSite
 ON_wString CRhinoPlugInInfo::m_wWebSite