Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoPropertiesPanelPageHost Class Referenceabstract
Rhino
#include <RhinoSdkPages.h>
 Inheritance diagram for IRhinoPropertiesPanelPageHost:
 Public Member Functions
virtual void  | ModifyPage ()=0
virtual void  | PostUpdatePageCall () const =0
virtual const ON_UUID &  | RuntimeId () const =0
 Public Member Functions inherited from IRhinoPageHost
virtual  | ~IRhinoPageHost ()=default
virtual void  | ChangeDefaultSize (ON_2iSize newSize)=0
virtual void  | Created ()=0
virtual unsigned int  | DocumentRuntimeSerialNumber () const =0
virtual IRhinoPage *  | Page () const =0
virtual LPARAM  | PageHostProc (unsigned int message, WPARAM wParam, LPARAM lParam)
virtual void  | SizedChanged (ON_2iSize size)=0
virtual void  | VisibleChanged (bool visible)=0
virtual RHINO_WINDOW_HANDLE  | Window () const =0
 Static Public Member Functions
static void  | GetViewPages (ON_SimpleArray< IRhinoPropertiesPanelPageHost * > &viewPages)
 Protected Member Functions
IRhinoPropertiesPanelPageHost ()=default
IRhinoPropertiesPanelPageHost (const IRhinoPropertiesPanelPageHost &)=delete
~IRhinoPropertiesPanelPageHost ()=default
IRhinoPropertiesPanelPageHost &  | operator= (const IRhinoPropertiesPanelPageHost &)=delete
 Protected Member Functions inherited from IRhinoPageHost
IRhinoPageHost ()=default
IRhinoPageHost (const IRhinoPageHost &)=delete
IRhinoPageHost &  | operator= (const IRhinoPageHost &)=delete
Detailed Description
class IRhinoPropertiesPanelPageHost
Description: Provides access the object properties panel page host.
Constructor & Destructor Documentation
◆ IRhinoPropertiesPanelPageHost() [1/2]
 IRhinoPropertiesPanelPageHost::IRhinoPropertiesPanelPageHost  |  ( |   | )
protecteddefault
 Description: Default constructor.
◆ ~IRhinoPropertiesPanelPageHost()
 IRhinoPropertiesPanelPageHost::~IRhinoPropertiesPanelPageHost  |  ( |   | )
protecteddefault
 Description: Default destructor.
◆ IRhinoPropertiesPanelPageHost() [2/2]
 IRhinoPropertiesPanelPageHost::IRhinoPropertiesPanelPageHost  |  ( |  const IRhinoPropertiesPanelPageHost &  |   | )
protecteddelete
 Description: Delete the default copy constructor
Member Function Documentation
◆ GetViewPages()
 static void IRhinoPropertiesPanelPageHost::GetViewPages  |  ( |  ON_SimpleArray< IRhinoPropertiesPanelPageHost * > &  |  viewPages | )
static
 Description: Call this to get a list of all view pages that can appear on the properties panel.
◆ ModifyPage()
 virtual void IRhinoPropertiesPanelPageHost::ModifyPage  |  ( |   | )
pure virtual
 Description: Call this method to modify objects or views associated with this page. Rhino will put the properties page manager in edit mode and call your OnModifypge with a IRhinoPropertiesPanelPageEventArgs when it is safe to modify objects or views.
◆ operator=()
 IRhinoPropertiesPanelPageHost& IRhinoPropertiesPanelPageHost::operator=  |  ( |  const IRhinoPropertiesPanelPageHost &  |   | )
protecteddelete
 Description: Delete the default operator=
◆ PostUpdatePageCall()
 virtual void IRhinoPropertiesPanelPageHost::PostUpdatePageCall  |  ( |   | ) |   const
pure virtual
 Description: Call this method to post a UpdatePage call which will occur on a on idle event when this page is visible.
◆ RuntimeId()
 virtual const ON_UUID& IRhinoPropertiesPanelPageHost::RuntimeId  |  ( |   | ) |   const
pure virtual
 Description: The unique runtime Id for this page.