Public Member Functions | List of all members
CRhinoDetailViewIterator Class Reference
Rhino
#include <rhinoSdkDetailObject.h>
 Public Member Functions
CRhinoDetailViewIterator (unsigned int rhino_page_view_serial_number)
~CRhinoDetailViewIterator ()
CRhinoDetailViewObject *  | First ()
CRhinoDetailViewObject *  | Next ()
Detailed Description
Description: Tool to go through the CRhinoDetailViewObject on a specified page.
Constructor & Destructor Documentation
◆ CRhinoDetailViewIterator()
 CRhinoDetailViewIterator::CRhinoDetailViewIterator  |  ( |  unsigned int  |  rhino_page_view_serial_number | )
◆ ~CRhinoDetailViewIterator()
 CRhinoDetailViewIterator::~CRhinoDetailViewIterator  |  ( |   | )
Member Function Documentation
◆ First()
 CRhinoDetailViewObject* CRhinoDetailViewIterator::First  |  ( |   | )
◆ Next()
 CRhinoDetailViewObject* CRhinoDetailViewIterator::Next  |  ( |   | )