Public Member Functions | List of all members
CRhinoSpaceMorph Class Reference
Rhino
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoSpaceMorph:
 Public Member Functions
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
virtual bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
virtual ON_3dPoint  | MorphPoint (ON_3dPoint point) const =0
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoSpaceMorph()
 CRhinoSpaceMorph::CRhinoSpaceMorph  |  ( |   | )
Description: The default constructor sets the morph tolerance to 0.001. You should adjust this to something that makes sense in your context.
◆ ~CRhinoSpaceMorph()
 virtual CRhinoSpaceMorph::~CRhinoSpaceMorph  |  ( |   | )
virtual