Public Member Functions | Public Attributes | List of all members
CRhinoCopyGripsHelper Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
CRhinoCopyGripsHelper ()
void  | GetNurbsCageMap (const CRhinoObject *object)
void  | GetNurbsCurveMap (const CRhinoObject *object)
void  | GetNurbsSurfaceMap (const CRhinoObject *object)
void  | RestoreGripStatus (CRhinoObject *object)
void  | RestoreNurbsCageGripStatus (CRhinoObject *object)
void  | RestoreNurbsCurveGripStatus (CRhinoObject *object)
void  | RestoreNurbsSurfaceGripStatus (CRhinoObject *object)
void  | SaveGripStatus (const CRhinoObject *object)
 Public Attributes
ON_UuidList  | m_captive_object_id
int  | m_cv_count [3]
ON_SimpleArray< int >  | m_cv_grip_index
int  | m_grip_count
ON_SimpleArray< CRhinoGripStatus >  | m_grip_status
CRhinoGripObject::GRIP_TYPE  | m_grip_type
const CRhinoGripsEnabler *  | m_grips_enabler
CRhinoObject *  | m_saved_object
Detailed Description
Description: This class is useful when grip information needs to be duplicated on objects are copied or replaced.
Constructor & Destructor Documentation
◆ CRhinoCopyGripsHelper()
 CRhinoCopyGripsHelper::CRhinoCopyGripsHelper  |  ( |   | )
Member Function Documentation
◆ GetNurbsCageMap()
 void CRhinoCopyGripsHelper::GetNurbsCageMap  |  ( |  const CRhinoObject *  |  object | )
◆ GetNurbsCurveMap()
 void CRhinoCopyGripsHelper::GetNurbsCurveMap  |  ( |  const CRhinoObject *  |  object | )
◆ GetNurbsSurfaceMap()
 void CRhinoCopyGripsHelper::GetNurbsSurfaceMap  |  ( |  const CRhinoObject *  |  object | )
◆ RestoreGripStatus()
 void CRhinoCopyGripsHelper::RestoreGripStatus  |  ( |  CRhinoObject *  |  object | )
Description: Call this function turn on the grips on the copy or replacement object. Parameters: object - [in] This object should be in the document and not have its grips on.
◆ RestoreNurbsCageGripStatus()
 void CRhinoCopyGripsHelper::RestoreNurbsCageGripStatus  |  ( |  CRhinoObject *  |  object | )
◆ RestoreNurbsCurveGripStatus()
 void CRhinoCopyGripsHelper::RestoreNurbsCurveGripStatus  |  ( |  CRhinoObject *  |  object | )
◆ RestoreNurbsSurfaceGripStatus()
 void CRhinoCopyGripsHelper::RestoreNurbsSurfaceGripStatus  |  ( |  CRhinoObject *  |  object | )
◆ SaveGripStatus()
 void CRhinoCopyGripsHelper::SaveGripStatus  |  ( |  const CRhinoObject *  |  object | )
Description: Call this function to save the current grip information. Parameters: object - [in] Object currently in the document with its grips on.
Member Data Documentation
◆ m_captive_object_id
 ON_UuidList CRhinoCopyGripsHelper::m_captive_object_id
◆ m_cv_count
 int CRhinoCopyGripsHelper::m_cv_count[3]
If the old and new object are NURBS curves/surface/cages with the same cv counts, m_cv_grip_index[] is used to transmit grips status when there are fewer grips than control points. number of cvs
◆ m_cv_grip_index
 ON_SimpleArray<int> CRhinoCopyGripsHelper::m_cv_grip_index
The grip status for cv (i,j,k) is in m_grip_status[n], where n = m_cv_map[ i + m_cv_count[0]*(j+m_cv_count[1]*k)]
◆ m_grip_count
 int CRhinoCopyGripsHelper::m_grip_count
◆ m_grip_status
 ON_SimpleArray<CRhinoGripStatus> CRhinoCopyGripsHelper::m_grip_status
◆ m_grip_type
 CRhinoGripObject::GRIP_TYPE CRhinoCopyGripsHelper::m_grip_type
◆ m_grips_enabler
 const CRhinoGripsEnabler* CRhinoCopyGripsHelper::m_grips_enabler
◆ m_saved_object
 CRhinoObject* CRhinoCopyGripsHelper::m_saved_object
Implementation This pointer is for expert user's to keep track of objects. Neither SaveGripStatus() nor RestoreGripStatus() sets or references this pointer.