Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoDraftAngleAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoDraftAngleAnalysisSettings ()
const ON_Interval  | AngleRangeDegrees () const
const ON_Interval  | AngleRangeRadians () const
ON__UINT32  | ColorMappingCRC () const
void  | Defaults ()
const ON_SurfaceDraftAngleColorMapping  | DraftAngleColors () const
const ON_Interval  | HueRangeRadians () const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const ON_MappingTag  | MappingTag () const
The draft angle vertex color mapping tag is used to mark vertex colors when they are set by draft angle color analysis. More...
bool  | operator!= (const CRhinoDraftAngleAnalysisSettings &other) const
bool  | operator== (const CRhinoDraftAngleAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetAngleRangeDegrees (double a0_degrees, double a1_degrees)
void  | SetAngleRangeDegrees (ON_Interval angle_range_degrees)
void  | SetAngleRangeRadians (double a0_radians, double a1_radians)
void  | SetAngleRangeRadians (ON_Interval angle_range_radians)
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
ON_Interval  | m_angle_range
angles in degrees More...
bool  | m_show_isoparms
ON_3dVector  | m_up
 Static Public Attributes
static const CRhinoDraftAngleAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoDraftAngleAnalysisSettings()
 CRhinoDraftAngleAnalysisSettings::CRhinoDraftAngleAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ AngleRangeDegrees()
 const ON_Interval CRhinoDraftAngleAnalysisSettings::AngleRangeDegrees  |  ( |   | ) |   const
◆ AngleRangeRadians()
 const ON_Interval CRhinoDraftAngleAnalysisSettings::AngleRangeRadians  |  ( |   | ) |   const
◆ ColorMappingCRC()
 ON__UINT32 CRhinoDraftAngleAnalysisSettings::ColorMappingCRC  |  ( |   | ) |   const
Returns
The 32 bit CRC of these draft angle analysis settings.
◆ Defaults()
 void CRhinoDraftAngleAnalysisSettings::Defaults  |  ( |   | )
◆ DraftAngleColors()
 const ON_SurfaceDraftAngleColorMapping CRhinoDraftAngleAnalysisSettings::DraftAngleColors  |  ( |   | ) |   const
◆ HueRangeRadians()
 const ON_Interval CRhinoDraftAngleAnalysisSettings::HueRangeRadians  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoDraftAngleAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ MappingTag()
 const ON_MappingTag CRhinoDraftAngleAnalysisSettings::MappingTag  |  ( |   | ) |   const
The draft angle vertex color mapping tag is used to mark vertex colors when they are set by draft angle color analysis.
Returns
The vertex color mapping tag for these draft angle analysis settings.
◆ operator!=()
 bool CRhinoDraftAngleAnalysisSettings::operator!=  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoDraftAngleAnalysisSettings::operator==  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoDraftAngleAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoDraftAngleAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetAngleRangeDegrees() [1/2]
 void CRhinoDraftAngleAnalysisSettings::SetAngleRangeDegrees  |  ( |  double  |  a0_degrees,
|  double  |  a1_degrees
)
◆ SetAngleRangeDegrees() [2/2]
 void CRhinoDraftAngleAnalysisSettings::SetAngleRangeDegrees  |  ( |  ON_Interval  |  angle_range_degrees | )
◆ SetAngleRangeRadians() [1/2]
 void CRhinoDraftAngleAnalysisSettings::SetAngleRangeRadians  |  ( |  double  |  a0_radians,
|  double  |  a1_radians
)
◆ SetAngleRangeRadians() [2/2]
 void CRhinoDraftAngleAnalysisSettings::SetAngleRangeRadians  |  ( |  ON_Interval  |  angle_range_radians | )
◆ Validate()
 void CRhinoDraftAngleAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoDraftAngleAnalysisSettings CRhinoDraftAngleAnalysisSettings::Default
static
◆ m_angle_range
 ON_Interval CRhinoDraftAngleAnalysisSettings::m_angle_range
angles in degrees
◆ m_show_isoparms
 bool CRhinoDraftAngleAnalysisSettings::m_show_isoparms
◆ m_up
 ON_3dVector CRhinoDraftAngleAnalysisSettings::m_up