Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_ClashEvent Class Reference
OpenNURBS
#include <opennurbs_plus.h>
 Public Member Functions
ON_ClashEvent ()
Default value is ON_ClashEvent::UnsetEvent. More...
 Public Attributes
ON__INT_PTR  | m_i [2]
ON_3dPoint  | m_P
 Static Public Attributes
static const ON_ClashEvent  | UnsetEvent
Detailed Description
The ON_ClashEvent class is used by ON_MeshClashSearch() and ON_MeshFaceClashSearch() to return the location mesh clash events.
Constructor & Destructor Documentation
◆ ON_ClashEvent()
 ON_ClashEvent::ON_ClashEvent  |  ( |   | )
Default value is ON_ClashEvent::UnsetEvent.
Member Data Documentation
◆ m_i
 ON__INT_PTR ON_ClashEvent::m_i[2]
m_i[] values are used to identify clashing elements. The interpretation of the value varies and is described in the ON_...ClashSearch() documentation.
◆ m_P
 ON_3dPoint ON_ClashEvent::m_P
If m_P is valid, then the sphere centered at P of radius distance intersects the clashing elements.
◆ UnsetEvent
 const ON_ClashEvent ON_ClashEvent::UnsetEvent
static
ON_ClashEvent::UnsetEvent is used as the uninitialized clash event value. m_i[0] = -1 m_i[1] = -1 m_P = ON_3dPoint::UnsetPoint