Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ModelComponentContentMark Class Reference
OpenNURBS
#include <opennurbs_model_component.h>
 Public Member Functions
ON_ModelComponentContentMark ()=default
ON_ModelComponentContentMark (const class ON_ModelComponent &model_component)
ON_ModelComponentContentMark (const class ON_ModelComponent *model_component)
ON_ModelComponentContentMark (const ON_ModelComponentContentMark &)=default
~ON_ModelComponentContentMark ()=default
ON__UINT64  | ComponentContentVersionNumber () const
ON_UUID  | ComponentId () const
ON__UINT64  | ComponentRuntimeSerialNumber () const
ON_ModelComponent::Type  | ComponentType () const
bool  | EqualContent (const class ON_ModelComponent &model_component) const
bool  | EqualContent (const class ON_ModelComponent *model_component) const
bool  | IsSet () const
bool  | IsUnset () const
ON_ModelComponentContentMark &  | operator= (const ON_ModelComponentContentMark &)=default
void  | Set (const class ON_ModelComponent &model_component)
void  | Set (const class ON_ModelComponent *model_component)
 Static Public Member Functions
static bool  | EqualContent (const ON_ModelComponentContentMark &lhs, const ON_ModelComponentContentMark &rhs)
 Static Public Attributes
static const ON_ModelComponentContentMark  | Unset
Constructor & Destructor Documentation
◆ ON_ModelComponentContentMark() [1/4]
 ON_ModelComponentContentMark::ON_ModelComponentContentMark  |  ( |   | )
default
◆ ~ON_ModelComponentContentMark()
 ON_ModelComponentContentMark::~ON_ModelComponentContentMark  |  ( |   | )
default
◆ ON_ModelComponentContentMark() [2/4]
 ON_ModelComponentContentMark::ON_ModelComponentContentMark  |  ( |  const ON_ModelComponentContentMark &  |   | )
default
◆ ON_ModelComponentContentMark() [3/4]
 ON_ModelComponentContentMark::ON_ModelComponentContentMark  |  ( |  const class ON_ModelComponent &  |  model_component | )
Description: Save the current content state of model_component. Parameters: model_component - [in]
◆ ON_ModelComponentContentMark() [4/4]
 ON_ModelComponentContentMark::ON_ModelComponentContentMark  |  ( |  const class ON_ModelComponent *  |  model_component | )
Description: Save the current content state of model_component. Parameters: model_component - [in]
Member Function Documentation
◆ ComponentContentVersionNumber()
 ON__UINT64 ON_ModelComponentContentMark::ComponentContentVersionNumber  |  ( |   | ) |   const
Returns: Saved model component content version number.
◆ ComponentId()
 ON_UUID ON_ModelComponentContentMark::ComponentId  |  ( |   | ) |   const
Returns: Saved model component id.
◆ ComponentRuntimeSerialNumber()
 ON__UINT64 ON_ModelComponentContentMark::ComponentRuntimeSerialNumber  |  ( |   | ) |   const
Returns: Saved model component runtime serial number.
◆ ComponentType()
 ON_ModelComponent::Type ON_ModelComponentContentMark::ComponentType  |  ( |   | ) |   const
Returns: Saved model component type.
◆ EqualContent() [1/3]
 bool ON_ModelComponentContentMark::EqualContent  |  ( |  const class ON_ModelComponent &  |  model_component | ) |   const
Parameters: model_component - [in] Returns: true if the content of model_component is identical to the content state saved in this ON_ModelComponentContentMark. false otherwise.
◆ EqualContent() [2/3]
 bool ON_ModelComponentContentMark::EqualContent  |  ( |  const class ON_ModelComponent *  |  model_component | ) |   const
Parameters: model_component - [in] Returns: true if the content of model_component is identical to the content state saved in this ON_ModelComponentContentMark. false otherwise.
◆ EqualContent() [3/3]
 static bool ON_ModelComponentContentMark::EqualContent  |  ( |  const ON_ModelComponentContentMark &  |  lhs,
|  const ON_ModelComponentContentMark &  |  rhs
)
static
Parameters: lhs - [in] rhs - [in] Returns: true if lhs and rhs are identical. false otherwise.
◆ IsSet()
 bool ON_ModelComponentContentMark::IsSet  |  ( |   | ) |   const
Returns: True if a model component content state is saved in this ON_ModelComponentContentMark. False otherwise.
◆ IsUnset()
 bool ON_ModelComponentContentMark::IsUnset  |  ( |   | ) |   const
Returns: True if a model component content state is saved in this ON_ModelComponentContentMark. False otherwise.
◆ operator=()
 ON_ModelComponentContentMark& ON_ModelComponentContentMark::operator=  |  ( |  const ON_ModelComponentContentMark &  |   | )
default
◆ Set() [1/2]
 void ON_ModelComponentContentMark::Set  |  ( |  const class ON_ModelComponent &  |  model_component | )
Description: Save the current content state of model_component. Parameters: model_component - [in]
◆ Set() [2/2]
 void ON_ModelComponentContentMark::Set  |  ( |  const class ON_ModelComponent *  |  model_component | )
Description: Save the current content state of model_component. Parameters: model_component - [in]
Member Data Documentation
◆ Unset
 const ON_ModelComponentContentMark ON_ModelComponentContentMark::Unset
static