Public Types | Public Member Functions | Public Attributes | Static Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoEmapAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | { max_mru_count = 20 }
 Public Member Functions
CRhinoEmapAnalysisSettings ()
void  | Defaults ()
const wchar_t *  | FileName () const
Return file name to be mapped to objects. More...
ON_ClassArray< ON_wString >  | GetDefaultMruFileNames (void) const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const wchar_t *  | MruFileName (int index) const
int  | MruFileNameCount () const
void  | MruRemoveFileName (int index)
bool  | operator!= (const CRhinoEmapAnalysisSettings &other) const
bool  | operator== (const CRhinoEmapAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
bool  | SetFileName (const wchar_t *name)
 Public Attributes
bool  | m_bBlendWithObjectColor = false
bool  | m_show_isoparms = false
 Static Public Attributes
static const CRhinoEmapAnalysisSettings  | Default
 Protected Member Functions
void  | FormatEntryName (int i, ON_wString &s) const
 Protected Attributes
ON_ClassArray< ON_wString >  | m_mru_emap_files
Detailed Description
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
max_mru_count
Constructor & Destructor Documentation
◆ CRhinoEmapAnalysisSettings()
 CRhinoEmapAnalysisSettings::CRhinoEmapAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoEmapAnalysisSettings::Defaults  |  ( |   | )
◆ FileName()
 const wchar_t* CRhinoEmapAnalysisSettings::FileName  |  ( |   | ) |   const
Return file name to be mapped to objects.
◆ FormatEntryName()
 void CRhinoEmapAnalysisSettings::FormatEntryName  |  ( |  int  |  i,
|  ON_wString &  |  s
) |   |  const
protected
◆ GetDefaultMruFileNames()
 ON_ClassArray<ON_wString> CRhinoEmapAnalysisSettings::GetDefaultMruFileNames  |  ( |  void  |   | ) |   const
Description: Get the "factory default" list of MRU file names. Arguments: None Returns: List of default MRU file names.
◆ LoadProfile()
 void CRhinoEmapAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ MruFileName()
 const wchar_t* CRhinoEmapAnalysisSettings::MruFileName  |  ( |  int  |  index | ) |   const
Description: Get MRU file name at specified index. Arguments: index [in] - Index of name to return, 0 for oldest, MruFleNameCount()-1 for current. Returns: If index is valid then a pointer to the name is returned otherwise NULL.
◆ MruFileNameCount()
 int CRhinoEmapAnalysisSettings::MruFileNameCount  |  ( |   | ) |   const
Description: Get number of items in most recently used(MRU) file name list.
◆ MruRemoveFileName()
 void CRhinoEmapAnalysisSettings::MruRemoveFileName  |  ( |  int  |  index | )
Description: Remove MRU file name at specified index. Arguments: index [in] - Index of name to remove from list.
◆ operator!=()
 bool CRhinoEmapAnalysisSettings::operator!=  |  ( |  const CRhinoEmapAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoEmapAnalysisSettings::operator==  |  ( |  const CRhinoEmapAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoEmapAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoEmapAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetFileName()
 bool CRhinoEmapAnalysisSettings::SetFileName  |  ( |  const wchar_t *  |  name | )
Description: Set file name. Arguments: name [in] - Name to make current. The previous name will get moved down the MRU file name list. Returns: If name added successfully true is returned otherwise false.
Member Data Documentation
◆ Default
 const CRhinoEmapAnalysisSettings CRhinoEmapAnalysisSettings::Default
static
◆ m_bBlendWithObjectColor
 bool CRhinoEmapAnalysisSettings::m_bBlendWithObjectColor = false
◆ m_mru_emap_files
 ON_ClassArray<ON_wString> CRhinoEmapAnalysisSettings::m_mru_emap_files
protected
◆ m_show_isoparms
 bool CRhinoEmapAnalysisSettings::m_show_isoparms = false