Public Member Functions | Public Attributes | List of all members
ON_Rectangle Class Reference
OpenNURBS
#include <opennurbs_convex_poly.h>
 Public Member Functions
ON_Rectangle ()
 Public Attributes
double  | area
double  | extents [2]
ON_Plane  | p
Constructor & Destructor Documentation
◆ ON_Rectangle()
 ON_Rectangle::ON_Rectangle  |  ( |   | )
inline
Member Data Documentation
◆ area
 double ON_Rectangle::area
◆ extents
 double ON_Rectangle::extents[2]
◆ p
 ON_Plane ON_Rectangle::p