Public Member Functions | Public Attributes | Friends | List of all members
ON_BrepFaceSide Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepFaceSide:
 Public Member Functions
ON_BrepFaceSide ()
~ON_BrepFaceSide ()
const class ON_Brep *  | Brep () const
const class ON_BrepFace *  | Face () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_BrepFaceSide &  | operator= (const ON_BrepFaceSide &)
bool  | Read (ON_BinaryArchive &binary_archive) override
const class ON_BrepRegion *  | Region () const
const class ON_BrepRegionTopology *  | RegionTopology () const
int  | SurfaceNormalDirection () const
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
virtual unsigned int  | SizeOf () const
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
int  | m_faceside_index
index of face side in ON_BrepRegionTopology.m_FS[] array More...
ON_U  | m_faceside_user
int  | m_fi
face index More...
int  | m_ri
int  | m_srf_dir
 Friends
class  | ON_Brep
class  | ON_BrepRegionTopology
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Constructor & Destructor Documentation
◆ ON_BrepFaceSide()
 ON_BrepFaceSide::ON_BrepFaceSide  |  ( |   | )
◆ ~ON_BrepFaceSide()
 ON_BrepFaceSide::~ON_BrepFaceSide  |  ( |   | )
Member Function Documentation
◆ Brep()
 const class ON_Brep* ON_BrepFaceSide::Brep  |  ( |   | ) |   const
Returns: Brep this face side belongs to.
◆ Face()
 const class ON_BrepFace* ON_BrepFaceSide::Face  |  ( |   | ) |   const
Returns: Face this side belongs to.
◆ IsValid()
 bool ON_BrepFaceSide::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ operator=()
 ON_BrepFaceSide& ON_BrepFaceSide::operator=  |  ( |  const ON_BrepFaceSide &  |   | )
◆ Read()
 bool ON_BrepFaceSide::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Region()
 const class ON_BrepRegion* ON_BrepFaceSide::Region  |  ( |   | ) |   const
Returns: Region the face side belongs to.
◆ RegionTopology()
 const class ON_BrepRegionTopology* ON_BrepFaceSide::RegionTopology  |  ( |   | ) |   const
Returns: Region topology this face side belongs to.
◆ SurfaceNormalDirection()
 int ON_BrepFaceSide::SurfaceNormalDirection  |  ( |   | ) |   const
Returns: +1: underlying geometric surface normal points into region. -1: underlying geometric surface normal points out of region.
◆ Write()
 bool ON_BrepFaceSide::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Friends And Related Function Documentation
◆ ON_Brep
 friend class ON_Brep
friend
◆ ON_BrepRegionTopology
 friend class ON_BrepRegionTopology
friend
Member Data Documentation
◆ m_faceside_index
 int ON_BrepFaceSide::m_faceside_index
index of face side in ON_BrepRegionTopology.m_FS[] array
◆ m_faceside_user
 ON_U ON_BrepFaceSide::m_faceside_user
mutable
Union available for application use. The constructor zeros m_faceside_user. The value is of m_faceside_user is not saved in 3DM archives and may be changed by some computations.
◆ m_fi
 int ON_BrepFaceSide::m_fi
face index
◆ m_ri
 int ON_BrepFaceSide::m_ri
region index m_ri = -1 indicates this face side overlaps another face side. Generally this is a flaw in an ON_Brep.
◆ m_srf_dir
 int ON_BrepFaceSide::m_srf_dir
1 ON_BrepFace's surface normal points into region -1 ON_BrepFace's surface normal points out of region