Public Member Functions | Public Attributes | List of all members
CRhRdkRenderWindowClonedInfo Class Reference
RDK
#include <RhRdkDeprecated.h>
 Public Member Functions
CRhRdkRenderWindowClonedInfo ()
 Public Attributes
UINT_PTR  | m_Reserved
UUID  | m_uuidRenderSessionNew
UUID  | m_uuidRenderSessionOld
Constructor & Destructor Documentation
◆ CRhRdkRenderWindowClonedInfo()
 CRhRdkRenderWindowClonedInfo::CRhRdkRenderWindowClonedInfo  |  ( |   | )
Member Data Documentation
◆ m_Reserved
 UINT_PTR CRhRdkRenderWindowClonedInfo::m_Reserved
◆ m_uuidRenderSessionNew
 UUID CRhRdkRenderWindowClonedInfo::m_uuidRenderSessionNew
◆ m_uuidRenderSessionOld
 UUID CRhRdkRenderWindowClonedInfo::m_uuidRenderSessionOld