Public Member Functions | Public Attributes | List of all members
ON_3dmConstructionPlane Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmConstructionPlane ()
ON_3dmConstructionPlane (const ON_Plane &plane)
~ON_3dmConstructionPlane ()
void  | Default ()
void  | Dump (ON_TextLog &text_log) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bDepthBuffer
int  | m_grid_line_count
number of grid lines in each direction More...
double  | m_grid_spacing
construction grid appearance More...
int  | m_grid_thick_frequency
ON_wString  | m_name
ON_Plane  | m_plane
double  | m_snap_spacing
Detailed Description
ON_3dmConstructionPlane
Constructor & Destructor Documentation
◆ ON_3dmConstructionPlane() [1/2]
 ON_3dmConstructionPlane::ON_3dmConstructionPlane  |  ( |   | )
◆ ~ON_3dmConstructionPlane()
 ON_3dmConstructionPlane::~ON_3dmConstructionPlane  |  ( |   | )
◆ ON_3dmConstructionPlane() [2/2]
 ON_3dmConstructionPlane::ON_3dmConstructionPlane  |  ( |  const ON_Plane &  |  plane | )
Member Function Documentation
◆ Default()
 void ON_3dmConstructionPlane::Default  |  ( |   | )
default copy constructor and operator= work fine ON_3dmConstructionPlane(const ON_3dmConstructionPlane&); ON_3dmConstructionPlane& operator=(const ON_3dmConstructionPlane&);
◆ Dump()
 void ON_3dmConstructionPlane::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Read()
 bool ON_3dmConstructionPlane::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmConstructionPlane::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bDepthBuffer
 bool ON_3dmConstructionPlane::m_bDepthBuffer
0: none, 1: all lines are thick, 2: every other is thick, ... false=grid is always drawn behind 3d geometry true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.
◆ m_grid_line_count
 int ON_3dmConstructionPlane::m_grid_line_count
number of grid lines in each direction
◆ m_grid_spacing
 double ON_3dmConstructionPlane::m_grid_spacing
construction grid appearance
distance between grid lines
◆ m_grid_thick_frequency
 int ON_3dmConstructionPlane::m_grid_thick_frequency
thick line frequency
◆ m_name
 ON_wString ON_3dmConstructionPlane::m_name
◆ m_plane
 ON_Plane ON_3dmConstructionPlane::m_plane
◆ m_snap_spacing
 double ON_3dmConstructionPlane::m_snap_spacing
when "grid snap" is enabled, the distance between snap points. Typically this is the same distance as grid spacing.