Public Member Functions | Public Attributes | List of all members
ON_BumpFunction Class Reference
OpenNURBS
#include <opennurbs_offsetsurface.h>
 Public Member Functions
ON_BumpFunction ()
ON_BumpFunction (const ON_BumpFunction &)=default
~ON_BumpFunction ()=default
void  | Evaluate (double s, double t, int der_count, double *value) const
ON_BumpFunction &  | operator= (const ON_BumpFunction &)=default
double  | ValueAt (double s, double t) const
 Public Attributes
double  | m_a = 0.0
evaluation coefficient More...
ON_2dPoint  | m_point = ON_2dPoint::NanPoint
center of bump More...
double  | m_sx [2]
= {0.0, 0.0} ///< 1/(support radius) More...
double  | m_sy [2]
= {0.0, 0.0} ///< 1/(support radius) More...
int  | m_type [2]
// = {0,0} ///< 1 = linear, 5 = quintic, else linear; More...
double  | m_x0 = 0.0
numbers used in evaluation More...
double  | m_y0 = 0.0
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_BumpFunction() [1/2]
 ON_BumpFunction::ON_BumpFunction  |  ( |   | )
◆ ~ON_BumpFunction()
 ON_BumpFunction::~ON_BumpFunction  |  ( |   | )
default
◆ ON_BumpFunction() [2/2]
 ON_BumpFunction::ON_BumpFunction  |  ( |  const ON_BumpFunction &  |   | )
default
Member Function Documentation
◆ Evaluate()
 void ON_BumpFunction::Evaluate  |  ( |  double  |  s,
|  double  |  t,
|  int  |  der_count,
|  double *  |  value
) |   |  const
◆ operator=()
 ON_BumpFunction& ON_BumpFunction::operator=  |  ( |  const ON_BumpFunction &  |   | )
default
◆ ValueAt()
 double ON_BumpFunction::ValueAt  |  ( |  double  |  s,
|  double  |  t
) |   |  const
Member Data Documentation
◆ m_a
 double ON_BumpFunction::m_a = 0.0
evaluation coefficient
◆ m_point
 ON_2dPoint ON_BumpFunction::m_point = ON_2dPoint::NanPoint
center of bump
◆ m_sx
 double ON_BumpFunction::m_sx[2]
= {0.0, 0.0} ///< 1/(support radius)
◆ m_sy
 double ON_BumpFunction::m_sy[2]
= {0.0, 0.0} ///< 1/(support radius)
◆ m_type
 int ON_BumpFunction::m_type[2]
// = {0,0} ///< 1 = linear, 5 = quintic, else linear;
◆ m_x0
 double ON_BumpFunction::m_x0 = 0.0
numbers used in evaluation
◆ m_y0
 double ON_BumpFunction::m_y0 = 0.0