Public Member Functions | Protected Attributes | List of all members
CRhinoUiOptionsListCtrlSeparator Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlSeparator:
 Public Member Functions
CRhinoUiOptionsListCtrlSeparator (LPCTSTR lpsLabel=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlSeparator ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
bool  | DrawSeparatorLine () const
int  | ItemHeight () const
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
virtual void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
bool  | SetDrawSeparatorLine (bool b)
void  | SetText (LPCTSTR lps)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Protected Attributes
bool  | m_bDrawSeparatorLine
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
 Additional Inherited Members
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
Detailed Description
CRhinoUiOptionsListCtrlSeparator
Description: Static text options list control item
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlSeparator()
 CRhinoUiOptionsListCtrlSeparator::CRhinoUiOptionsListCtrlSeparator  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  int  |  iIndentLevel = 0
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
See Also: CRhinoUiOptionsListCtrlItem::CRhinoUiOptionsListCtrlItem()
◆ ~CRhinoUiOptionsListCtrlSeparator()
 virtual CRhinoUiOptionsListCtrlSeparator::~CRhinoUiOptionsListCtrlSeparator  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlSeparator::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description: This method is called when a options list control item is selected. The method should create the control window used to change the items value.
Parameters: list_ctrl [in] The options list control calling this method. rEdit [in] The options list control item value bounding rectangle.
Returns: Should return true if the control has been successfully created; otherwise false.
Implements CRhinoUiOptionsListCtrlItem.
◆ DrawSeparatorLine()
 bool CRhinoUiOptionsListCtrlSeparator::DrawSeparatorLine  |  ( |   | ) |   const
◆ ItemHeight()
 int CRhinoUiOptionsListCtrlSeparator::ItemHeight  |  ( |   | ) |   const
virtual
Description: This method is called to determine height for this options list control item. Override this method if you want to increase the height of this item.
Returns: Returns height for this item.
See Also: CRhinoUiOptionsListCtrl::LabelItemHeight()
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ MoveItemWindow()
 void CRhinoUiOptionsListCtrlSeparator::MoveItemWindow  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit
)
virtual
Description: This method is called when a column or options list control has been resized while a item control is visible.
Parameters: list_ctrl [in] The list control this item is inserted in. rEdit [in] The options list control item value bounding rectangle.
See Also: CRhinoUiOptionsListCtrlItem::BeginEditItem()
Implements CRhinoUiOptionsListCtrlItem.
◆ OnDrawItem()
 virtual void CRhinoUiOptionsListCtrlSeparator::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description: This method is overridden to display separator line if enabled
Parameters: See: CRhinoUiOptionsListCtrlItem::OnDrawItem()
See Also: CRhinoUiOptionsListCtrlItem::OnDrawItem()
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ SetDrawSeparatorLine()
 bool CRhinoUiOptionsListCtrlSeparator::SetDrawSeparatorLine  |  ( |  bool  |  b | )
◆ SetText()
 void CRhinoUiOptionsListCtrlSeparator::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: This method is used to set text value for this item. This value is displayed in the right column of the options list control.
Parameters: lps [in] New display text for this item.
See Also: CRhinoUiOptionsListCtrl::Text() CRhinoUiOptionsListCtrl::DrawItemText()
Reimplemented from CRhinoUiOptionsListCtrlItem.
Member Data Documentation
◆ m_bDrawSeparatorLine
 bool CRhinoUiOptionsListCtrlSeparator::m_bDrawSeparatorLine
protected