Public Types | Public Member Functions | Friends | List of all members
CRhinoAppSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | osnap_command {
 osc_none = 0x00000000, osc_between = 0x00000010, osc_from_point = 0x00000100, osc_perpendicular_from = 0x00000200,
 osc_tangent_from = 0x00000400, osc_along_line = 0x00001000, osc_along_parallel = 0x00002000, osc_on_curve = 0x00010000,
 osc_on_surface = 0x00020000, osc_on_polysurface = 0x00040000
 }
enum  | osnap_mode {
 os_none = ON::os_none, os_near = ON::os_near, os_focus = ON::os_focus, os_center = ON::os_center,
 os_vertex = ON::os_vertex, os_knot = ON::os_knot, os_quadrant = ON::os_quadrant, os_midpoint = ON::os_midpoint,
 os_intersection = ON::os_intersection, os_end = ON::os_end, os_perpendicular = ON::os_perpendicular, os_tangent = ON::os_tangent,
 os_point = ON::os_point
 }
 Public Member Functions
ON_Color  | ActiveLayerColor () const
const CRhinoAppAliasList &  | Aliases () const
ON_Color  | AmbientLightColor (const CRhinoDoc *) const
const CRhinoAppAppearanceSettings &  | AppearanceSettings (bool synch_with_ui=false) const
bool  | AskOnLoadProtection () const
bool  | AutoAlignCPlane () const
bool  | AutocompleteCommands () const
If true, commands are in-line autocompleted and exact matches are shown in a popup menu. More...
int  | AutoCPlaneAlignment () const
0 = object, 1 = world, 2 = view More...
int  | AutoGumballAlignment () const
For the sake of not breaking the SDK, you will have to cast back and forward from int to CRhinoView::drag_plane. More...
bool  | AutoGumballExtrudeMergeFaces () const
bool  | AutoHideGuides () const
ON_Color  | BackgroundColor (const CRhinoDoc *) const
const CRhinoAppChooseOneObjectSettings &  | ChooseOneObjectSettings () const
bool  | CommandPromptIsVisible () const
command prompt visibility and position More...
CRhinoAppAppearanceSettings::command_prompt_position  | CommandPromptPosition () const
const CRhinoAppContextMenuSettings &  | ContextMenuSettings () const
bool  | ControlClickSubObjectDeselect () const
const CRhinoAppCursorToolTipSettings &  | CursorToolTipSettings () const
const CRhinoCurvatureAnalysisSettings &  | CurvatureAnalysisSettings () const
const CRhinoCurvatureGraphSettings &  | CurvatureGraphSettings () const
bool  | DefaultAutocompleteCommands () const
const ON_Font &  | DefaultFont ()
void  | DefaultFontFaceName (ON_wString &font) const
bool  | DefaultFuzzyAutocomplete () const
const ON_Light &  | DefaultLight () const
const class CRhinoMaterial &  | DefaultMaterial () const
ON_Color  | DefaultObjectColor () const
default properties and light More...
void  | Defaults ()
bool  | DefaultWorldCoordIconMoveLabels () const
bool  | DemoteRealtimeViewsToRenderedOnLoad () const
double  | DigitizerOsnapPickboxRadius () const
3D digitizer object snap pick box size More...
const CRhinoDirectionAnalysisSettings &  | DirectionAnalysisSettings () const
int  | DirectionArrowIconHeadSize () const
Length of direction arrow icon head in pixels. More...
int  | DirectionArrowIconShaftSize () const
Length of direction arrow icon shaft in pixels. More...
bool  | DisableRightClickAsEnter () const
bool  | DisplayCurvesAndIsocurvesInRenderedViews (const CRhinoDoc *) const
const CRhinoDisplaySettings &  | DisplaySettings () const
bool  | DisplayTextAndDimensionsInRenderedViews (const CRhinoDoc *) const
bool  | DisplayViewportTitles () const
viewport options More...
bool  | DominantOrtho () const
const CRhinoAppDontRepeatCommandSettings &  | DontRepeatCommands () const
const CRhinoDraftAngleAnalysisSettings &  | DraftAngleAnalysisSettings () const
bool  | DragStartsWindowSelection () const
bool  | EchoCommandsToHistory () const
bool  | EchoPromptsToHistory () const
const CRhinoEdgeAnalysisSettings &  | EdgeAnalysisSettings () const
const CRhinoEdgeContinuitySettings &  | EdgeContinuitySettings () const
const CRhinoEmapAnalysisSettings &  | EmapAnalysisSettings () const
void  | EnableGridSnap (bool=true)
void  | EnableOrtho (bool=true)
bool  | EnableOsnapHighlight () const
bool  | EnableOsnaps () const
void  | EnablePlanar (bool=true)
const CRhinoEndAnalysisSettings &  | EndAnalysisSettings () const
ON_Color  | FeedbackColor () const
const CRhinoAppFileSettings &  | FileSettings () const
ON_Color  | FrameBackgroundColor () const
bool  | FuzzyAutocomplete () const
If true, in-line auto-complete uses popularity sorting, and pop-up menu includes closest inexact matches. More...
const CRhinoAppGeneralSettings &  | GeneralSettings () const
ON_wString  | GetPackageManagerSources () const
bool  | GetRenderedViewSettingsFromDoc () const
rendered views options More...
int  | GridAxisLineWidth () const
const CRhinoAppGridSettings &  | GridSettings () const
bool  | GridSnap () const
Grid snap setting. More...
ON_Color  | GridThickLineColor () const
int  | GridThickLineWidth () const
construction plane grid line properties More...
ON_Color  | GridThinLineColor () const
construction plane grid colors More...
ON_Color  | GridXAxisColor () const
ON_Color  | GridYAxisColor () const
ON_Color  | GridZAxisColor () const
bool  | GumballAutoReset () const
ON_Color  | HiddenLineColor (void) const
float  | HiddenLineColorMixingFactor (void) const
bool  | HiddenLineEnabled (void) const
int  | HiddenLineMode (void) const
float  | HiddenLineThicknessScale (void) const
unsigned int  | ImportFileLayerMatchingOption () const
bool  | IncludeDisplayModesInGripMenu (void) const
bool  | IncludeDisplayModesInObjectMenu (void) const
bool  | IncludeDisplayModesInViewMenu (void) const
void  | LoadProfile (CRhinoProfileContext &context)
void  | LoadRepeatCommandSettings (CRhinoProfileContext &context)
ON_Color  | LockedObjectColor (bool bIsReferenceObject=false) const
const class CRhinoMaterial &  | LockedObjectMaterial () const
for RenderPreview More...
const CRhinoAppModelAidSettings &  | ModelAidSettings () const
bool  | MouseOverHighlight () const
If true, objects are highlighted with mouse over. More...
bool  | MouseOverHighlightSubObjects () const
If true, sub-objects are highlighted with mouse over. More...
int  | MousePickboxRadius () const
mouse pick box size More...
const CRhinoAppMouseSettings &  | MouseSettings () const
const ON_ClassArray< CRhinoNamedColor > &  | NamedColorList ()
UINT  | NudgeAutoUpdateDelay () const
bool  | NudgeAutoUpdateMesh () const
bool  | NumericKeypadDecimalKeyPeriod () const
const CRhinoOpenGLSettings &  | OpenGLSettings () const
bool  | OrientAutoCPlaneToView () const
bool  | Ortho () const
Ortho setting. More...
bool  | OrthoUseZ () const
bool  | OsnapDialogVisible ()
bool  | OsnapEnabled () const
Returns: true if any osnaps are enabled. More...
unsigned int  | OsnapMode () const
bool  | OsnapMode (osnap_mode) const
Persistent Osnaps. More...
int  | OsnapPickboxRadius () const
object snap pick box size More...
bool  | PickingIgnoresGrouping () const
bool  | PickOccluded () const
bool  | Planar () const
Planar setting. More...
CRhinoAppModelAidSettings::point_display_mode  | PointDisplayMode () const
bool  | PointPicksHaveToBeOsnapped () const
class CRhAppSettingsData *  | Private () const
For internal use only. More...
bool  | ProjectOsnaps () const
bool  | ProjectOsnapsInPlanParallelViews () const
void  | RemapMouse (int, int &, UINT &) const
void  | SaveProfile (CRhinoProfileContext &context) const
bool  | SaveViewChanges () const
true if changing a view should mark a document as modified More...
ON_Color  | SelectedGripColor () const
ON_Color  | SelectedObjectColor (bool bIsReferenceObject=false) const
object state colors More...
ON_Color  | SelectedObjectCornerColor (void) const
float  | SelectedObjectCornerLength (void) const
int  | SelectedObjectCornerThickness (void) const
const CRhinoAppSelectionFilterSettings &  | SelectionFilterSettings () const
void  | SetAliases (const CRhinoAppAliasList &settings)
void  | SetAppearanceSettings (const CRhinoAppAppearanceSettings &settings)
void  | SetAskOnLoadProtection (bool bAsk)
void  | SetAutoAlignCPlane (bool bAutoCPlane)
void  | SetAutocompleteCommands (bool bEnable)
void  | SetAutoCPlaneAlignment (int iAlignment)
void  | SetAutoGumballAlignment (int)
void  | SetAutoGumballExtrudeMergeFaces (bool bMerge)
void  | SetAutoHideGuides (bool bEnable)
void  | SetChooseOneObjectSettings (const CRhinoAppChooseOneObjectSettings &settings)
void  | SetContextMenuSettings (const CRhinoAppContextMenuSettings &settings)
void  | SetControlClickSubObjectDeselect (bool bEnable)
void  | SetCursorToolTipSettings (const CRhinoAppCursorToolTipSettings &settings)
void  | SetCurvatureAnalysisSettings (const CRhinoCurvatureAnalysisSettings &settings)
void  | SetCurvatureGraphSettings (const CRhinoCurvatureGraphSettings &settings)
void  | SetDemoteRealtimeViewsToRenderedOnLoad (bool enable)
void  | SetDirectionAnalysisSettings (const CRhinoDirectionAnalysisSettings &settings)
void  | SetDisableRightClickAsEnter (bool)
void  | SetDisplaySettings (const CRhinoDisplaySettings &settings)
void  | SetDominantOrtho (bool bEnable)
void  | SetDontRepeatCommands (const CRhinoAppDontRepeatCommandSettings &settings)
void  | SetDraftAngleAnalysisSettings (const CRhinoDraftAngleAnalysisSettings &settings)
void  | SetDragStartsWindowSelection (bool bEnable)
void  | SetEdgeAnalysisSettings (const CRhinoEdgeAnalysisSettings &settings)
void  | SetEdgeContinuitySettings (const CRhinoEdgeContinuitySettings &settings)
void  | SetEmapAnalysisSettings (const CRhinoEmapAnalysisSettings &settings)
void  | SetEnableOsnapHighlight (bool bEnable)
bool  | SetEnableOsnaps (bool bEnable=true)
void  | SetEndAnalysisSettings (const CRhinoEndAnalysisSettings &settings)
void  | SetFileSettings (const CRhinoAppFileSettings &settings)
void  | SetFuzzyAutocomplete (bool bEnable)
void  | SetGeneralSettings (const CRhinoAppGeneralSettings &settings)
bool  | SetGetRenderedViewSettingsFromDoc (bool b)
void  | SetGridSettings (const CRhinoAppGridSettings &settings)
void  | SetGumballAutoReset (bool bAutoReset)
void  | SetGumballColors (CRhinoGumballColors gumball_colors)
void  | SetGumballSizes (CRhinoGumballSizes gumball_sizes)
void  | SetHiddenLineColor (ON_Color)
void  | SetHiddenLineColorMixingFactor (float)
void  | SetHiddenLineEnabled (bool)
void  | SetHiddenLineMode (int)
void  | SetHiddenLineThicknessScale (float)
void  | SetImportFileLayerMatchingOption (unsigned int import_file_layer_matching_option)
void  | SetIncludeDisplayModesInGripMenu (bool)
void  | SetIncludeDisplayModesInObjectMenu (bool)
void  | SetIncludeDisplayModesInViewMenu (bool)
void  | SetModelAidSettings (const CRhinoAppModelAidSettings &settings)
void  | SetMouseOverHighlight (bool bEnable)
void  | SetMouseOverHighlightSubObjects (bool bEnable)
void  | SetMouseSettings (const CRhinoAppMouseSettings &settings)
void  | SetNudgeAutoUpdateDelay (UINT delay)
void  | SetNudgeAutoUpdateMesh (bool bEnable)
void  | SetNumericKeypadDecimalKeyPeriod (bool bEnable)
void  | SetOpenGLSettings (const CRhinoOpenGLSettings &)
void  | SetOrientAutoCPlaneToView (bool bAlign)
void  | SetOrthoUseZ (bool bUse)
void  | SetOsnapMode (osnap_mode mode, bool b)
void  | SetPackageManagerSources (const wchar_t *s)
void  | SetPickingIgnoresGrouping (bool bEnable)
void  | SetPickOccluded (bool bEnable)
void  | SetPointPicksHaveToBeOsnapped (bool bEnable)
bool  | SetProjectOsnaps (bool bEnable=true)
bool  | SetProjectOsnapsInPlanParallelViews (bool bEnable=true)
void  | SetSelectedObjectCornerColor (ON_Color)
void  | SetSelectedObjectCornerLength (float)
void  | SetSelectedObjectCornerThickness (bool)
void  | SetSelectionFilterSettings (const CRhinoAppSelectionFilterSettings &)
void  | SetShortCutKeys (const CRhinoAppShortcutKeys &settings)
void  | SetShowAutoGumball (bool bShowAutoGumball)
void  | SetShowHiddenLines (bool)
void  | SetShowOrthoHashMarks (bool bShow)
void  | SetShowSelectedObjectCorners ()
void  | SetShowViewportXEdges (bool)
void  | SetSilhouetteHighlighting (bool bEnable)
void  | SetSilhouetteHighlightInnerColorScale (float)
void  | SetSilhouetteHighlightInnerFactor ()
void  | SetSilhouetteHighlightOuterScale (int)
void  | SetSilhouetteMethod (int)
void  | SetSilhouetteThickness (int)
void  | SetSmartTrackSettings (const CRhinoAppSmartTrackSettings &settings)
void  | SetSnappyGumball (bool bSnappyGumball)
void  | SetSoftTransformSettings (const CRhinoSoftTransformSettings &)
void  | SetSpaceBallSettings (const CRhinoAppSpaceBallSettings &settings)
void  | SetStatusBarLayerPaneWidth (int value)
void  | SetStickyAutoCPlane (bool bSticky)
void  | SetThicknessAnalysisSettings (const CRhinoThicknessAnalysisSettings &settings)
void  | SetTransparentOccluders (bool bEnable)
void  | SetUiPaintColorSettings (const CRhinoUiPaintColorSettings &settings)
void  | SetUseSubMenuForDisplayModes (bool)
void  | SetViewportXEdgeLength (float)
void  | SetViewportXEdgeSensitivity (float)
void  | SetViewportXEdgeStyle ()
void  | SetViewportXEdgeThickness (int)
void  | SetViewSettings (const CRhinoAppViewSettings &settings)
void  | SetWidgetColorSettings (const CRhinoWidgetColorSettings &settings)
void  | SetZebraAnalysisSettings (const CRhinoZebraAnalysisSettings &settings)
const CRhinoAppShortcutKeys &  | ShortCutKeys () const
bool  | ShowAutoGumball () const
ON_Color  | ShowEdgeColor () const
bool  | ShowHiddenLines (void) const
bool  | ShowOrthoHashMarks () const
void  | ShowOsnapDialog (bool=true)
Show and Hide the Osnap dialog. More...
bool  | ShowSelectedObjectCorners (void) const
bool  | ShowStatusBar (bool bShow=true)
bool  | ShowViewportXEdges (void) const
bool  | ShowZAxis (void) const
bool  | SilhouetteHighlighting (void) const
float  | SilhouetteHighlightInnerColorScale (void) const
float  | SilhouetteHighlightInnerFactor (void) const
int  | SilhouetteHighlightOuterScale (void) const
int  | SilhouetteMethod (void) const
int  | SilhouetteThickness (void) const
const CRhinoAppSmartTrackSettings &  | SmartTrackSettings () const
bool  | SnappyGumball () const
const CRhinoSoftTransformSettings &  | SoftTransformSettings () const
const CRhinoAppSpaceBallSettings &  | SpaceBallSettings () const
bool  | StatusBarIsVisisble () const
status bar state More...
int  | StatusBarLayerPaneWidth () const
bool  | StickyAutoCPlane () const
const CRhinoThicknessAnalysisSettings &  | ThicknessAnalysisSettings () const
ON_Color  | TrackingColor () const
bool  | TransparentOccluders () const
const CRhinoUiPaintColorSettings &  | UiPaintColorSettings () const
bool  | UseDontRepeatList () const
bool  | UseHiddenLightsInRenderedViews (const CRhinoDoc *) const
bool  | UseSubMenuForDisplayModes (void) const
ON_Color  | ViewportBackgroundColor () const
viewport colors More...
float  | ViewportXEdgeLength (void) const
float  | ViewportXEdgeSensitivity (void) const
int  | ViewportXEdgeStyle (int) const
int  | ViewportXEdgeThickness (void) const
const CRhinoAppViewSettings &  | ViewSettings () const
const CRhinoWidgetColorSettings &  | WidgetColorSettings () const
int  | WorldCoordIconAxisSize () const
length of the axes lines in pixels More...
int  | WorldCoordIconLabelSize () const
radius of the axes labels in pixels More...
bool  | WorldCoordIconMoveLabels () const
ON_Color  | WorldCoordIconXAxisColor () const
world coordinate icon axes colors More...
ON_Color  | WorldCoordIconYAxisColor () const
ON_Color  | WorldCoordIconZAxisColor () const
const CRhinoZebraAnalysisSettings &  | ZebraAnalysisSettings () const
 Friends
class  | CRhCrossApp
class  | CRhinoApp
class  | CRhLinuxApp
Detailed Description
CRhinoAppSettings class - Rhino application settings
Member Enumeration Documentation
◆ osnap_command
 enum CRhinoAppSettings::osnap_command
Enumerator
osc_none
osc_between
osc_from_point
osc_perpendicular_from
osc_tangent_from
osc_along_line
osc_along_parallel
osc_on_curve
osc_on_surface
osc_on_polysurface
◆ osnap_mode
 enum CRhinoAppSettings::osnap_mode
The CRhinoAppSettings::osnap_mode enum is OBSOLETE. Use the ON::osnap_mode values. The reason for the change is that history records are saving these values in ON_ObjRefs.
Currently lots of files are checked out and I can't convert Rhino's use CRhinoAppSettings::osnap_mode to ON::osnap_mode.
Enumerator
os_none
os_near
os_focus
os_center
os_vertex
os_knot
os_quadrant
os_midpoint
os_intersection
os_end
os_perpendicular
os_tangent
os_point
Member Function Documentation
◆ ActiveLayerColor()
 ON_Color CRhinoAppSettings::ActiveLayerColor  |  ( |   | ) |   const
◆ Aliases()
 const CRhinoAppAliasList& CRhinoAppSettings::Aliases  |  ( |   | ) |   const
◆ AmbientLightColor()
 ON_Color CRhinoAppSettings::AmbientLightColor  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ AppearanceSettings()
 const CRhinoAppAppearanceSettings& CRhinoAppSettings::AppearanceSettings  |  ( |  bool  |  synch_with_ui = false | ) |   const
◆ AskOnLoadProtection()
 bool CRhinoAppSettings::AskOnLoadProtection  |  ( |   | ) |   const
If true, a dialog will be shown when load protected plug-ins are being loaded. If false, load protected plug-ins will silently not load
◆ AutoAlignCPlane()
 bool CRhinoAppSettings::AutoAlignCPlane  |  ( |   | ) |   const
END Gumball settings
◆ AutocompleteCommands()
 bool CRhinoAppSettings::AutocompleteCommands  |  ( |   | ) |   const
If true, commands are in-line autocompleted and exact matches are shown in a popup menu.
◆ AutoCPlaneAlignment()
 int CRhinoAppSettings::AutoCPlaneAlignment  |  ( |   | ) |   const
0 = object, 1 = world, 2 = view
◆ AutoGumballAlignment()
 int CRhinoAppSettings::AutoGumballAlignment  |  ( |   | ) |   const
For the sake of not breaking the SDK, you will have to cast back and forward from int to CRhinoView::drag_plane.
◆ AutoGumballExtrudeMergeFaces()
 bool CRhinoAppSettings::AutoGumballExtrudeMergeFaces  |  ( |   | ) |   const
When the gumball extrudes a face it will merge faces along the extrusion if possible
◆ AutoHideGuides()
 bool CRhinoAppSettings::AutoHideGuides  |  ( |   | ) |   const
◆ BackgroundColor()
 ON_Color CRhinoAppSettings::BackgroundColor  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ ChooseOneObjectSettings()
 const CRhinoAppChooseOneObjectSettings& CRhinoAppSettings::ChooseOneObjectSettings  |  ( |   | ) |   const
◆ CommandPromptIsVisible()
 bool CRhinoAppSettings::CommandPromptIsVisible  |  ( |   | ) |   const
command prompt visibility and position
◆ CommandPromptPosition()
 CRhinoAppAppearanceSettings::command_prompt_position CRhinoAppSettings::CommandPromptPosition  |  ( |   | ) |   const
Deprecated:
Obsolete method, no longer used and does not reflect the actual command control state
◆ ContextMenuSettings()
 const CRhinoAppContextMenuSettings& CRhinoAppSettings::ContextMenuSettings  |  ( |   | ) |   const
◆ ControlClickSubObjectDeselect()
 bool CRhinoAppSettings::ControlClickSubObjectDeselect  |  ( |   | ) |   const
◆ CursorToolTipSettings()
 const CRhinoAppCursorToolTipSettings& CRhinoAppSettings::CursorToolTipSettings  |  ( |   | ) |   const
◆ CurvatureAnalysisSettings()
 const CRhinoCurvatureAnalysisSettings& CRhinoAppSettings::CurvatureAnalysisSettings  |  ( |   | ) |   const
◆ CurvatureGraphSettings()
 const CRhinoCurvatureGraphSettings& CRhinoAppSettings::CurvatureGraphSettings  |  ( |   | ) |   const
◆ DefaultAutocompleteCommands()
 bool CRhinoAppSettings::DefaultAutocompleteCommands  |  ( |   | ) |   const
◆ DefaultFont()
 const ON_Font& CRhinoAppSettings::DefaultFont  |  ( |   | )
Returns: A managed font with facename = DefaultFontFaceName().
◆ DefaultFontFaceName()
 void CRhinoAppSettings::DefaultFontFaceName  |  ( |  ON_wString &  |  font | ) |   const
◆ DefaultFuzzyAutocomplete()
 bool CRhinoAppSettings::DefaultFuzzyAutocomplete  |  ( |   | ) |   const
◆ DefaultLight()
 const ON_Light& CRhinoAppSettings::DefaultLight  |  ( |   | ) |   const
◆ DefaultMaterial()
 const class CRhinoMaterial& CRhinoAppSettings::DefaultMaterial  |  ( |   | ) |   const
Deprecated:
use CRhinoMaterialTable::DefaultMaterial
◆ DefaultObjectColor()
 ON_Color CRhinoAppSettings::DefaultObjectColor  |  ( |   | ) |   const
default properties and light
◆ Defaults()
 void CRhinoAppSettings::Defaults  |  ( |   | )
◆ DefaultWorldCoordIconMoveLabels()
 bool CRhinoAppSettings::DefaultWorldCoordIconMoveLabels  |  ( |   | ) |   const
◆ DemoteRealtimeViewsToRenderedOnLoad()
 bool CRhinoAppSettings::DemoteRealtimeViewsToRenderedOnLoad  |  ( |   | ) |   const
◆ DigitizerOsnapPickboxRadius()
 double CRhinoAppSettings::DigitizerOsnapPickboxRadius  |  ( |   | ) |   const
3D digitizer object snap pick box size
◆ DirectionAnalysisSettings()
 const CRhinoDirectionAnalysisSettings& CRhinoAppSettings::DirectionAnalysisSettings  |  ( |   | ) |   const
◆ DirectionArrowIconHeadSize()
 int CRhinoAppSettings::DirectionArrowIconHeadSize  |  ( |   | ) |   const
Length of direction arrow icon head in pixels.
◆ DirectionArrowIconShaftSize()
 int CRhinoAppSettings::DirectionArrowIconShaftSize  |  ( |   | ) |   const
Length of direction arrow icon shaft in pixels.
◆ DisableRightClickAsEnter()
 bool CRhinoAppSettings::DisableRightClickAsEnter  |  ( |   | ) |   const
◆ DisplayCurvesAndIsocurvesInRenderedViews()
 bool CRhinoAppSettings::DisplayCurvesAndIsocurvesInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
If GetRenderedViewSettingsFromDoc() returns true then values for the following are returned from CRhinoDoc::Properties().RenderSettings() otherwise they are returned from CRhinoDisplaySettings
◆ DisplaySettings()
 const CRhinoDisplaySettings& CRhinoAppSettings::DisplaySettings  |  ( |   | ) |   const
◆ DisplayTextAndDimensionsInRenderedViews()
 bool CRhinoAppSettings::DisplayTextAndDimensionsInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ DisplayViewportTitles()
 bool CRhinoAppSettings::DisplayViewportTitles  |  ( |   | ) |   const
viewport options
◆ DominantOrtho()
 bool CRhinoAppSettings::DominantOrtho  |  ( |   | ) |   const
◆ DontRepeatCommands()
 const CRhinoAppDontRepeatCommandSettings& CRhinoAppSettings::DontRepeatCommands  |  ( |   | ) |   const
◆ DraftAngleAnalysisSettings()
 const CRhinoDraftAngleAnalysisSettings& CRhinoAppSettings::DraftAngleAnalysisSettings  |  ( |   | ) |   const
◆ DragStartsWindowSelection()
 bool CRhinoAppSettings::DragStartsWindowSelection  |  ( |   | ) |   const
Description: When enabled, a click and drag that starts on top of an object starts a window/crossing selection instead of dragging the object, the same as holding down the Alt key. Grip dragging and gumball dragging are not affected, and a click that does not drag still selects normally.
◆ EchoCommandsToHistory()
 bool CRhinoAppSettings::EchoCommandsToHistory  |  ( |   | ) |   const
◆ EchoPromptsToHistory()
 bool CRhinoAppSettings::EchoPromptsToHistory  |  ( |   | ) |   const
◆ EdgeAnalysisSettings()
 const CRhinoEdgeAnalysisSettings& CRhinoAppSettings::EdgeAnalysisSettings  |  ( |   | ) |   const
◆ EdgeContinuitySettings()
 const CRhinoEdgeContinuitySettings& CRhinoAppSettings::EdgeContinuitySettings  |  ( |   | ) |   const
◆ EmapAnalysisSettings()
 const CRhinoEmapAnalysisSettings& CRhinoAppSettings::EmapAnalysisSettings  |  ( |   | ) |   const
◆ EnableGridSnap()
 void CRhinoAppSettings::EnableGridSnap  |  ( |  bool  |   = true | )
◆ EnableOrtho()
 void CRhinoAppSettings::EnableOrtho  |  ( |  bool  |   = true | )
◆ EnableOsnapHighlight()
 bool CRhinoAppSettings::EnableOsnapHighlight  |  ( |   | ) |   const
By default active osnap is indicated by thickening the wireframe of the osnapped object. Disable osnap highlight to remove the effect.
◆ EnableOsnaps()
 bool CRhinoAppSettings::EnableOsnaps  |  ( |   | ) |   const
◆ EnablePlanar()
 void CRhinoAppSettings::EnablePlanar  |  ( |  bool  |   = true | )
◆ EndAnalysisSettings()
 const CRhinoEndAnalysisSettings& CRhinoAppSettings::EndAnalysisSettings  |  ( |   | ) |   const
◆ FeedbackColor()
 ON_Color CRhinoAppSettings::FeedbackColor  |  ( |   | ) |   const
◆ FileSettings()
 const CRhinoAppFileSettings& CRhinoAppSettings::FileSettings  |  ( |   | ) |   const
◆ FrameBackgroundColor()
 ON_Color CRhinoAppSettings::FrameBackgroundColor  |  ( |   | ) |   const
◆ FuzzyAutocomplete()
 bool CRhinoAppSettings::FuzzyAutocomplete  |  ( |   | ) |   const
If true, in-line auto-complete uses popularity sorting, and pop-up menu includes closest inexact matches.
◆ GeneralSettings()
 const CRhinoAppGeneralSettings& CRhinoAppSettings::GeneralSettings  |  ( |   | ) |   const
◆ GetPackageManagerSources()
 ON_wString CRhinoAppSettings::GetPackageManagerSources  |  ( |   | ) |   const
◆ GetRenderedViewSettingsFromDoc()
 bool CRhinoAppSettings::GetRenderedViewSettingsFromDoc  |  ( |   | ) |   const
rendered views options
◆ GridAxisLineWidth()
 int CRhinoAppSettings::GridAxisLineWidth  |  ( |   | ) |   const
◆ GridSettings()
 const CRhinoAppGridSettings& CRhinoAppSettings::GridSettings  |  ( |   | ) |   const
◆ GridSnap()
 bool CRhinoAppSettings::GridSnap  |  ( |   | ) |   const
Grid snap setting.
◆ GridThickLineColor()
 ON_Color CRhinoAppSettings::GridThickLineColor  |  ( |   | ) |   const
◆ GridThickLineWidth()
 int CRhinoAppSettings::GridThickLineWidth  |  ( |   | ) |   const
construction plane grid line properties
◆ GridThinLineColor()
 ON_Color CRhinoAppSettings::GridThinLineColor  |  ( |   | ) |   const
construction plane grid colors
◆ GridXAxisColor()
 ON_Color CRhinoAppSettings::GridXAxisColor  |  ( |   | ) |   const
◆ GridYAxisColor()
 ON_Color CRhinoAppSettings::GridYAxisColor  |  ( |   | ) |   const
◆ GridZAxisColor()
 ON_Color CRhinoAppSettings::GridZAxisColor  |  ( |   | ) |   const
◆ GumballAutoReset()
 bool CRhinoAppSettings::GumballAutoReset  |  ( |   | ) |   const
◆ HiddenLineColor()
 ON_Color CRhinoAppSettings::HiddenLineColor  |  ( |  void  |   | ) |   const
◆ HiddenLineColorMixingFactor()
 float CRhinoAppSettings::HiddenLineColorMixingFactor  |  ( |  void  |   | ) |   const
◆ HiddenLineEnabled()
 bool CRhinoAppSettings::HiddenLineEnabled  |  ( |  void  |   | ) |   const
◆ HiddenLineMode()
 int CRhinoAppSettings::HiddenLineMode  |  ( |  void  |   | ) |   const
◆ HiddenLineThicknessScale()
 float CRhinoAppSettings::HiddenLineThicknessScale  |  ( |  void  |   | ) |   const
◆ ImportFileLayerMatchingOption()
 unsigned int CRhinoAppSettings::ImportFileLayerMatchingOption  |  ( |   | ) |   const
The import file layer matching setting belongs on CRhinoAppFileSettings but that class cannot be modified without breaking the SDK. This setting controls what happens to layers when the contents of an external source file are imported into an existing model.
 The Import, Paste and Insert commands are a few of the ways a file can be imported into an existing model. 0 = import layer names using the full path found in the source file. 1 = if the source file has a layer with named "source_file_parent_layer_path/X" and the current model has a layer named "current_model_parent_layer_path/X", then change all references from "source_file_parent_layer_path/X" to "current_model_parent_layer_path/X" when importing items from the source file. This mimics Rhino 4.0 behavior, where all short layer names had to be unique and the parent path was ignored.
◆ IncludeDisplayModesInGripMenu()
 bool CRhinoAppSettings::IncludeDisplayModesInGripMenu  |  ( |  void  |   | ) |   const
◆ IncludeDisplayModesInObjectMenu()
 bool CRhinoAppSettings::IncludeDisplayModesInObjectMenu  |  ( |  void  |   | ) |   const
◆ IncludeDisplayModesInViewMenu()
 bool CRhinoAppSettings::IncludeDisplayModesInViewMenu  |  ( |  void  |   | ) |   const
◆ LoadProfile()
 void CRhinoAppSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  context | )
This function WILL call OnAppSettingsChanged event watchers if any settings change.
◆ LoadRepeatCommandSettings()
 void CRhinoAppSettings::LoadRepeatCommandSettings  |  ( |  CRhinoProfileContext &  |  context | )
◆ LockedObjectColor()
 ON_Color CRhinoAppSettings::LockedObjectColor  |  ( |  bool  |  bIsReferenceObject = false | ) |   const
◆ LockedObjectMaterial()
 const class CRhinoMaterial& CRhinoAppSettings::LockedObjectMaterial  |  ( |   | ) |   const
for RenderPreview
Deprecated:
use CRhinoMaterialTable::DefaultLockedMaterial
◆ ModelAidSettings()
 const CRhinoAppModelAidSettings& CRhinoAppSettings::ModelAidSettings  |  ( |   | ) |   const
◆ MouseOverHighlight()
 bool CRhinoAppSettings::MouseOverHighlight  |  ( |   | ) |   const
If true, objects are highlighted with mouse over.
◆ MouseOverHighlightSubObjects()
 bool CRhinoAppSettings::MouseOverHighlightSubObjects  |  ( |   | ) |   const
If true, sub-objects are highlighted with mouse over.
◆ MousePickboxRadius()
 int CRhinoAppSettings::MousePickboxRadius  |  ( |   | ) |   const
mouse pick box size
◆ MouseSettings()
 const CRhinoAppMouseSettings& CRhinoAppSettings::MouseSettings  |  ( |   | ) |   const
◆ NamedColorList()
 const ON_ClassArray<CRhinoNamedColor>& CRhinoAppSettings::NamedColorList  |  ( |   | )
◆ NudgeAutoUpdateDelay()
 UINT CRhinoAppSettings::NudgeAutoUpdateDelay  |  ( |   | ) |   const
◆ NudgeAutoUpdateMesh()
 bool CRhinoAppSettings::NudgeAutoUpdateMesh  |  ( |   | ) |   const
◆ NumericKeypadDecimalKeyPeriod()
 bool CRhinoAppSettings::NumericKeypadDecimalKeyPeriod  |  ( |   | ) |   const
◆ OpenGLSettings()
 const CRhinoOpenGLSettings& CRhinoAppSettings::OpenGLSettings  |  ( |   | ) |   const
◆ OrientAutoCPlaneToView()
 bool CRhinoAppSettings::OrientAutoCPlaneToView  |  ( |   | ) |   const
◆ Ortho()
 bool CRhinoAppSettings::Ortho  |  ( |   | ) |   const
Ortho setting.
◆ OrthoUseZ()
 bool CRhinoAppSettings::OrthoUseZ  |  ( |   | ) |   const
◆ OsnapDialogVisible()
 bool CRhinoAppSettings::OsnapDialogVisible  |  ( |   | )
◆ OsnapEnabled()
 bool CRhinoAppSettings::OsnapEnabled  |  ( |   | ) |   const
Returns: true if any osnaps are enabled.
◆ OsnapMode() [1/2]
 unsigned int CRhinoAppSettings::OsnapMode  |  ( |   | ) |   const
Returns: An unsigned int with CRhinoAppSettings::osnap_mode bits set if an osnap is enabled.
◆ OsnapMode() [2/2]
 bool CRhinoAppSettings::OsnapMode  |  ( |  osnap_mode  |   | ) |   const
Persistent Osnaps.
◆ OsnapPickboxRadius()
 int CRhinoAppSettings::OsnapPickboxRadius  |  ( |   | ) |   const
object snap pick box size
◆ PickingIgnoresGrouping()
 bool CRhinoAppSettings::PickingIgnoresGrouping  |  ( |   | ) |   const
◆ PickOccluded()
 bool CRhinoAppSettings::PickOccluded  |  ( |   | ) |   const
◆ Planar()
 bool CRhinoAppSettings::Planar  |  ( |   | ) |   const
Planar setting.
◆ PointDisplayMode()
 CRhinoAppModelAidSettings::point_display_mode CRhinoAppSettings::PointDisplayMode  |  ( |   | ) |   const
◆ PointPicksHaveToBeOsnapped()
 bool CRhinoAppSettings::PointPicksHaveToBeOsnapped  |  ( |   | ) |   const
◆ Private()
 class CRhAppSettingsData* CRhinoAppSettings::Private  |  ( |   | ) |   const
For internal use only.
◆ ProjectOsnaps()
 bool CRhinoAppSettings::ProjectOsnaps  |  ( |   | ) |   const
◆ ProjectOsnapsInPlanParallelViews()
 bool CRhinoAppSettings::ProjectOsnapsInPlanParallelViews  |  ( |   | ) |   const
◆ RemapMouse()
 void CRhinoAppSettings::RemapMouse  |  ( |  int  |  ,
|  int &  |  ,
|  UINT &
) |   |  const
The "original" mouse event is passed in and can be modified by users who want to change one action to another.
◆ SaveProfile()
 void CRhinoAppSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |  context | ) |   const
◆ SaveViewChanges()
 bool CRhinoAppSettings::SaveViewChanges  |  ( |   | ) |   const
true if changing a view should mark a document as modified
◆ SelectedGripColor()
 ON_Color CRhinoAppSettings::SelectedGripColor  |  ( |   | ) |   const
◆ SelectedObjectColor()
 ON_Color CRhinoAppSettings::SelectedObjectColor  |  ( |  bool  |  bIsReferenceObject = false | ) |   const
object state colors
◆ SelectedObjectCornerColor()
 ON_Color CRhinoAppSettings::SelectedObjectCornerColor  |  ( |  void  |   | ) |   const
◆ SelectedObjectCornerLength()
 float CRhinoAppSettings::SelectedObjectCornerLength  |  ( |  void  |   | ) |   const
◆ SelectedObjectCornerThickness()
 int CRhinoAppSettings::SelectedObjectCornerThickness  |  ( |  void  |   | ) |   const
◆ SelectionFilterSettings()
 const CRhinoAppSelectionFilterSettings& CRhinoAppSettings::SelectionFilterSettings  |  ( |   | ) |   const
◆ SetAliases()
 void CRhinoAppSettings::SetAliases  |  ( |  const CRhinoAppAliasList &  |  settings | )
◆ SetAppearanceSettings()
 void CRhinoAppSettings::SetAppearanceSettings  |  ( |  const CRhinoAppAppearanceSettings &  |  settings | )
◆ SetAskOnLoadProtection()
 void CRhinoAppSettings::SetAskOnLoadProtection  |  ( |  bool  |  bAsk | )
◆ SetAutoAlignCPlane()
 void CRhinoAppSettings::SetAutoAlignCPlane  |  ( |  bool  |  bAutoCPlane | )
◆ SetAutocompleteCommands()
 void CRhinoAppSettings::SetAutocompleteCommands  |  ( |  bool  |  bEnable | )
◆ SetAutoCPlaneAlignment()
 void CRhinoAppSettings::SetAutoCPlaneAlignment  |  ( |  int  |  iAlignment | )
◆ SetAutoGumballAlignment()
 void CRhinoAppSettings::SetAutoGumballAlignment  |  ( |  int  |   | )
◆ SetAutoGumballExtrudeMergeFaces()
 void CRhinoAppSettings::SetAutoGumballExtrudeMergeFaces  |  ( |  bool  |  bMerge | )
◆ SetAutoHideGuides()
 void CRhinoAppSettings::SetAutoHideGuides  |  ( |  bool  |  bEnable | )
◆ SetChooseOneObjectSettings()
 void CRhinoAppSettings::SetChooseOneObjectSettings  |  ( |  const CRhinoAppChooseOneObjectSettings &  |  settings | )
◆ SetContextMenuSettings()
 void CRhinoAppSettings::SetContextMenuSettings  |  ( |  const CRhinoAppContextMenuSettings &  |  settings | )
◆ SetControlClickSubObjectDeselect()
 void CRhinoAppSettings::SetControlClickSubObjectDeselect  |  ( |  bool  |  bEnable | )
◆ SetCursorToolTipSettings()
 void CRhinoAppSettings::SetCursorToolTipSettings  |  ( |  const CRhinoAppCursorToolTipSettings &  |  settings | )
◆ SetCurvatureAnalysisSettings()
 void CRhinoAppSettings::SetCurvatureAnalysisSettings  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  settings | )
◆ SetCurvatureGraphSettings()
 void CRhinoAppSettings::SetCurvatureGraphSettings  |  ( |  const CRhinoCurvatureGraphSettings &  |  settings | )
◆ SetDemoteRealtimeViewsToRenderedOnLoad()
 void CRhinoAppSettings::SetDemoteRealtimeViewsToRenderedOnLoad  |  ( |  bool  |  enable | )
◆ SetDirectionAnalysisSettings()
 void CRhinoAppSettings::SetDirectionAnalysisSettings  |  ( |  const CRhinoDirectionAnalysisSettings &  |  settings | )
◆ SetDisableRightClickAsEnter()
 void CRhinoAppSettings::SetDisableRightClickAsEnter  |  ( |  bool  |   | )
◆ SetDisplaySettings()
 void CRhinoAppSettings::SetDisplaySettings  |  ( |  const CRhinoDisplaySettings &  |  settings | )
◆ SetDominantOrtho()
 void CRhinoAppSettings::SetDominantOrtho  |  ( |  bool  |  bEnable | )
◆ SetDontRepeatCommands()
 void CRhinoAppSettings::SetDontRepeatCommands  |  ( |  const CRhinoAppDontRepeatCommandSettings &  |  settings | )
◆ SetDraftAngleAnalysisSettings()
 void CRhinoAppSettings::SetDraftAngleAnalysisSettings  |  ( |  const CRhinoDraftAngleAnalysisSettings &  |  settings | )
◆ SetDragStartsWindowSelection()
 void CRhinoAppSettings::SetDragStartsWindowSelection  |  ( |  bool  |  bEnable | )
◆ SetEdgeAnalysisSettings()
 void CRhinoAppSettings::SetEdgeAnalysisSettings  |  ( |  const CRhinoEdgeAnalysisSettings &  |  settings | )
◆ SetEdgeContinuitySettings()
 void CRhinoAppSettings::SetEdgeContinuitySettings  |  ( |  const CRhinoEdgeContinuitySettings &  |  settings | )
◆ SetEmapAnalysisSettings()
 void CRhinoAppSettings::SetEmapAnalysisSettings  |  ( |  const CRhinoEmapAnalysisSettings &  |  settings | )
◆ SetEnableOsnapHighlight()
 void CRhinoAppSettings::SetEnableOsnapHighlight  |  ( |  bool  |  bEnable | )
◆ SetEnableOsnaps()
 bool CRhinoAppSettings::SetEnableOsnaps  |  ( |  bool  |  bEnable = true | )
◆ SetEndAnalysisSettings()
 void CRhinoAppSettings::SetEndAnalysisSettings  |  ( |  const CRhinoEndAnalysisSettings &  |  settings | )
◆ SetFileSettings()
 void CRhinoAppSettings::SetFileSettings  |  ( |  const CRhinoAppFileSettings &  |  settings | )
◆ SetFuzzyAutocomplete()
 void CRhinoAppSettings::SetFuzzyAutocomplete  |  ( |  bool  |  bEnable | )
◆ SetGeneralSettings()
 void CRhinoAppSettings::SetGeneralSettings  |  ( |  const CRhinoAppGeneralSettings &  |  settings | )
◆ SetGetRenderedViewSettingsFromDoc()
 bool CRhinoAppSettings::SetGetRenderedViewSettingsFromDoc  |  ( |  bool  |  b | )
◆ SetGridSettings()
 void CRhinoAppSettings::SetGridSettings  |  ( |  const CRhinoAppGridSettings &  |  settings | )
◆ SetGumballAutoReset()
 void CRhinoAppSettings::SetGumballAutoReset  |  ( |  bool  |  bAutoReset | )
◆ SetGumballColors()
 void CRhinoAppSettings::SetGumballColors  |  ( |  CRhinoGumballColors  |  gumball_colors | )
BEGIN Gumball settings NOTE: When we are closer to shipping a finished gumball, There will be a CRhinoGumballSettings class that can be used to set/get all gumball related settings. While we are still testing the look and feel of the gumball, individual settings will be added here. Rhino default gumball colors The CRhinoGumballColors() constructor uses these values.
◆ SetGumballSizes()
 void CRhinoAppSettings::SetGumballSizes  |  ( |  CRhinoGumballSizes  |  gumball_sizes | )
Set Rhino gumball sizes. The CRhinoGumballSizes() constructor uses these values.
◆ SetHiddenLineColor()
 void CRhinoAppSettings::SetHiddenLineColor  |  ( |  ON_Color  |   | )
◆ SetHiddenLineColorMixingFactor()
 void CRhinoAppSettings::SetHiddenLineColorMixingFactor  |  ( |  float  |   | )
◆ SetHiddenLineEnabled()
 void CRhinoAppSettings::SetHiddenLineEnabled  |  ( |  bool  |   | )
◆ SetHiddenLineMode()
 void CRhinoAppSettings::SetHiddenLineMode  |  ( |  int  |   | )
◆ SetHiddenLineThicknessScale()
 void CRhinoAppSettings::SetHiddenLineThicknessScale  |  ( |  float  |   | )
◆ SetImportFileLayerMatchingOption()
 void CRhinoAppSettings::SetImportFileLayerMatchingOption  |  ( |  unsigned int  |  import_file_layer_matching_option | )
See the comment above the declaration of CRhinoApp::ImportFileLayerMatchingOption() for a description of the values import_file_layer_matching_option can have.
◆ SetIncludeDisplayModesInGripMenu()
 void CRhinoAppSettings::SetIncludeDisplayModesInGripMenu  |  ( |  bool  |   | )
◆ SetIncludeDisplayModesInObjectMenu()
 void CRhinoAppSettings::SetIncludeDisplayModesInObjectMenu  |  ( |  bool  |   | )
◆ SetIncludeDisplayModesInViewMenu()
 void CRhinoAppSettings::SetIncludeDisplayModesInViewMenu  |  ( |  bool  |   | )
◆ SetModelAidSettings()
 void CRhinoAppSettings::SetModelAidSettings  |  ( |  const CRhinoAppModelAidSettings &  |  settings | )
◆ SetMouseOverHighlight()
 void CRhinoAppSettings::SetMouseOverHighlight  |  ( |  bool  |  bEnable | )
◆ SetMouseOverHighlightSubObjects()
 void CRhinoAppSettings::SetMouseOverHighlightSubObjects  |  ( |  bool  |  bEnable | )
◆ SetMouseSettings()
 void CRhinoAppSettings::SetMouseSettings  |  ( |  const CRhinoAppMouseSettings &  |  settings | )
◆ SetNudgeAutoUpdateDelay()
 void CRhinoAppSettings::SetNudgeAutoUpdateDelay  |  ( |  UINT  |  delay | )
◆ SetNudgeAutoUpdateMesh()
 void CRhinoAppSettings::SetNudgeAutoUpdateMesh  |  ( |  bool  |  bEnable | )
◆ SetNumericKeypadDecimalKeyPeriod()
 void CRhinoAppSettings::SetNumericKeypadDecimalKeyPeriod  |  ( |  bool  |  bEnable | )
◆ SetOpenGLSettings()
 void CRhinoAppSettings::SetOpenGLSettings  |  ( |  const CRhinoOpenGLSettings &  |   | )
◆ SetOrientAutoCPlaneToView()
 void CRhinoAppSettings::SetOrientAutoCPlaneToView  |  ( |  bool  |  bAlign | )
◆ SetOrthoUseZ()
 void CRhinoAppSettings::SetOrthoUseZ  |  ( |  bool  |  bUse | )
◆ SetOsnapMode()
 void CRhinoAppSettings::SetOsnapMode  |  ( |  osnap_mode  |  mode,
|  bool  |  b
)
◆ SetPackageManagerSources()
 void CRhinoAppSettings::SetPackageManagerSources  |  ( |  const wchar_t *  |  s | )
◆ SetPickingIgnoresGrouping()
 void CRhinoAppSettings::SetPickingIgnoresGrouping  |  ( |  bool  |  bEnable | )
◆ SetPickOccluded()
 void CRhinoAppSettings::SetPickOccluded  |  ( |  bool  |  bEnable | )
◆ SetPointPicksHaveToBeOsnapped()
 void CRhinoAppSettings::SetPointPicksHaveToBeOsnapped  |  ( |  bool  |  bEnable | )
◆ SetProjectOsnaps()
 bool CRhinoAppSettings::SetProjectOsnaps  |  ( |  bool  |  bEnable = true | )
◆ SetProjectOsnapsInPlanParallelViews()
 bool CRhinoAppSettings::SetProjectOsnapsInPlanParallelViews  |  ( |  bool  |  bEnable = true | )
◆ SetSelectedObjectCornerColor()
 void CRhinoAppSettings::SetSelectedObjectCornerColor  |  ( |  ON_Color  |   | )
◆ SetSelectedObjectCornerLength()
 void CRhinoAppSettings::SetSelectedObjectCornerLength  |  ( |  float  |   | )
◆ SetSelectedObjectCornerThickness()
 void CRhinoAppSettings::SetSelectedObjectCornerThickness  |  ( |  bool  |   | )
◆ SetSelectionFilterSettings()
 void CRhinoAppSettings::SetSelectionFilterSettings  |  ( |  const CRhinoAppSelectionFilterSettings &  |   | )
◆ SetShortCutKeys()
 void CRhinoAppSettings::SetShortCutKeys  |  ( |  const CRhinoAppShortcutKeys &  |  settings | )
◆ SetShowAutoGumball()
 void CRhinoAppSettings::SetShowAutoGumball  |  ( |  bool  |  bShowAutoGumball | )
◆ SetShowHiddenLines()
 void CRhinoAppSettings::SetShowHiddenLines  |  ( |  bool  |   | )
◆ SetShowOrthoHashMarks()
 void CRhinoAppSettings::SetShowOrthoHashMarks  |  ( |  bool  |  bShow | )
◆ SetShowSelectedObjectCorners()
 void CRhinoAppSettings::SetShowSelectedObjectCorners  |  ( |   | )
◆ SetShowViewportXEdges()
 void CRhinoAppSettings::SetShowViewportXEdges  |  ( |  bool  |   | )
◆ SetSilhouetteHighlighting()
 void CRhinoAppSettings::SetSilhouetteHighlighting  |  ( |  bool  |  bEnable | )
◆ SetSilhouetteHighlightInnerColorScale()
 void CRhinoAppSettings::SetSilhouetteHighlightInnerColorScale  |  ( |  float  |   | )
◆ SetSilhouetteHighlightInnerFactor()
 void CRhinoAppSettings::SetSilhouetteHighlightInnerFactor  |  ( |   | )
◆ SetSilhouetteHighlightOuterScale()
 void CRhinoAppSettings::SetSilhouetteHighlightOuterScale  |  ( |  int  |   | )
◆ SetSilhouetteMethod()
 void CRhinoAppSettings::SetSilhouetteMethod  |  ( |  int  |   | )
◆ SetSilhouetteThickness()
 void CRhinoAppSettings::SetSilhouetteThickness  |  ( |  int  |   | )
◆ SetSmartTrackSettings()
 void CRhinoAppSettings::SetSmartTrackSettings  |  ( |  const CRhinoAppSmartTrackSettings &  |  settings | )
◆ SetSnappyGumball()
 void CRhinoAppSettings::SetSnappyGumball  |  ( |  bool  |  bSnappyGumball | )
◆ SetSoftTransformSettings()
 void CRhinoAppSettings::SetSoftTransformSettings  |  ( |  const CRhinoSoftTransformSettings &  |   | )
◆ SetSpaceBallSettings()
 void CRhinoAppSettings::SetSpaceBallSettings  |  ( |  const CRhinoAppSpaceBallSettings &  |  settings | )
◆ SetStatusBarLayerPaneWidth()
 void CRhinoAppSettings::SetStatusBarLayerPaneWidth  |  ( |  int  |  value | )
◆ SetStickyAutoCPlane()
 void CRhinoAppSettings::SetStickyAutoCPlane  |  ( |  bool  |  bSticky | )
◆ SetThicknessAnalysisSettings()
 void CRhinoAppSettings::SetThicknessAnalysisSettings  |  ( |  const CRhinoThicknessAnalysisSettings &  |  settings | )
◆ SetTransparentOccluders()
 void CRhinoAppSettings::SetTransparentOccluders  |  ( |  bool  |  bEnable | )
◆ SetUiPaintColorSettings()
 void CRhinoAppSettings::SetUiPaintColorSettings  |  ( |  const CRhinoUiPaintColorSettings &  |  settings | )
◆ SetUseSubMenuForDisplayModes()
 void CRhinoAppSettings::SetUseSubMenuForDisplayModes  |  ( |  bool  |   | )
◆ SetViewportXEdgeLength()
 void CRhinoAppSettings::SetViewportXEdgeLength  |  ( |  float  |   | )
◆ SetViewportXEdgeSensitivity()
 void CRhinoAppSettings::SetViewportXEdgeSensitivity  |  ( |  float  |   | )
◆ SetViewportXEdgeStyle()
 void CRhinoAppSettings::SetViewportXEdgeStyle  |  ( |   | )
◆ SetViewportXEdgeThickness()
 void CRhinoAppSettings::SetViewportXEdgeThickness  |  ( |  int  |   | )
◆ SetViewSettings()
 void CRhinoAppSettings::SetViewSettings  |  ( |  const CRhinoAppViewSettings &  |  settings | )
◆ SetWidgetColorSettings()
 void CRhinoAppSettings::SetWidgetColorSettings  |  ( |  const CRhinoWidgetColorSettings &  |  settings | )
◆ SetZebraAnalysisSettings()
 void CRhinoAppSettings::SetZebraAnalysisSettings  |  ( |  const CRhinoZebraAnalysisSettings &  |  settings | )
◆ ShortCutKeys()
 const CRhinoAppShortcutKeys& CRhinoAppSettings::ShortCutKeys  |  ( |   | ) |   const
◆ ShowAutoGumball()
 bool CRhinoAppSettings::ShowAutoGumball  |  ( |   | ) |   const
When AutoGumball is on, a gumball automatically appears when objects are prepicked.
◆ ShowEdgeColor()
 ON_Color CRhinoAppSettings::ShowEdgeColor  |  ( |   | ) |   const
◆ ShowHiddenLines()
 bool CRhinoAppSettings::ShowHiddenLines  |  ( |  void  |   | ) |   const
◆ ShowOrthoHashMarks()
 bool CRhinoAppSettings::ShowOrthoHashMarks  |  ( |   | ) |   const
◆ ShowOsnapDialog()
 void CRhinoAppSettings::ShowOsnapDialog  |  ( |  bool  |   = true | )
Show and Hide the Osnap dialog.
◆ ShowSelectedObjectCorners()
 bool CRhinoAppSettings::ShowSelectedObjectCorners  |  ( |  void  |   | ) |   const
◆ ShowStatusBar()
 bool CRhinoAppSettings::ShowStatusBar  |  ( |  bool  |  bShow = true | )
◆ ShowViewportXEdges()
 bool CRhinoAppSettings::ShowViewportXEdges  |  ( |  void  |   | ) |   const
◆ ShowZAxis()
 bool CRhinoAppSettings::ShowZAxis  |  ( |  void  |   | ) |   const
◆ SilhouetteHighlighting()
 bool CRhinoAppSettings::SilhouetteHighlighting  |  ( |  void  |   | ) |   const
◆ SilhouetteHighlightInnerColorScale()
 float CRhinoAppSettings::SilhouetteHighlightInnerColorScale  |  ( |  void  |   | ) |   const
◆ SilhouetteHighlightInnerFactor()
 float CRhinoAppSettings::SilhouetteHighlightInnerFactor  |  ( |  void  |   | ) |   const
◆ SilhouetteHighlightOuterScale()
 int CRhinoAppSettings::SilhouetteHighlightOuterScale  |  ( |  void  |   | ) |   const
◆ SilhouetteMethod()
 int CRhinoAppSettings::SilhouetteMethod  |  ( |  void  |   | ) |   const
◆ SilhouetteThickness()
 int CRhinoAppSettings::SilhouetteThickness  |  ( |  void  |   | ) |   const
◆ SmartTrackSettings()
 const CRhinoAppSmartTrackSettings& CRhinoAppSettings::SmartTrackSettings  |  ( |   | ) |   const
◆ SnappyGumball()
 bool CRhinoAppSettings::SnappyGumball  |  ( |   | ) |   const
When SnappyGumball is on, a dragging a gumball moves the center point. When snappy gumball is off, dragging a gumball moves the mouse down point.
◆ SoftTransformSettings()
 const CRhinoSoftTransformSettings& CRhinoAppSettings::SoftTransformSettings  |  ( |   | ) |   const
◆ SpaceBallSettings()
 const CRhinoAppSpaceBallSettings& CRhinoAppSettings::SpaceBallSettings  |  ( |   | ) |   const
◆ StatusBarIsVisisble()
 bool CRhinoAppSettings::StatusBarIsVisisble  |  ( |   | ) |   const
status bar state
◆ StatusBarLayerPaneWidth()
 int CRhinoAppSettings::StatusBarLayerPaneWidth  |  ( |   | ) |   const
Relative width of the status bar layer pane. The default has been 2 in the past, and will be changed to 3 from V8 onwards
◆ StickyAutoCPlane()
 bool CRhinoAppSettings::StickyAutoCPlane  |  ( |   | ) |   const
◆ ThicknessAnalysisSettings()
 const CRhinoThicknessAnalysisSettings& CRhinoAppSettings::ThicknessAnalysisSettings  |  ( |   | ) |   const
◆ TrackingColor()
 ON_Color CRhinoAppSettings::TrackingColor  |  ( |   | ) |   const
◆ TransparentOccluders()
 bool CRhinoAppSettings::TransparentOccluders  |  ( |   | ) |   const
◆ UiPaintColorSettings()
 const CRhinoUiPaintColorSettings& CRhinoAppSettings::UiPaintColorSettings  |  ( |   | ) |   const
◆ UseDontRepeatList()
 bool CRhinoAppSettings::UseDontRepeatList  |  ( |   | ) |   const
◆ UseHiddenLightsInRenderedViews()
 bool CRhinoAppSettings::UseHiddenLightsInRenderedViews  |  ( |  const CRhinoDoc *  |   | ) |   const
◆ UseSubMenuForDisplayModes()
 bool CRhinoAppSettings::UseSubMenuForDisplayModes  |  ( |  void  |   | ) |   const
◆ ViewportBackgroundColor()
 ON_Color CRhinoAppSettings::ViewportBackgroundColor  |  ( |   | ) |   const
viewport colors
◆ ViewportXEdgeLength()
 float CRhinoAppSettings::ViewportXEdgeLength  |  ( |  void  |   | ) |   const
◆ ViewportXEdgeSensitivity()
 float CRhinoAppSettings::ViewportXEdgeSensitivity  |  ( |  void  |   | ) |   const
◆ ViewportXEdgeStyle()
 int CRhinoAppSettings::ViewportXEdgeStyle  |  ( |  int  |   | ) |   const
◆ ViewportXEdgeThickness()
 int CRhinoAppSettings::ViewportXEdgeThickness  |  ( |  void  |   | ) |   const
◆ ViewSettings()
 const CRhinoAppViewSettings& CRhinoAppSettings::ViewSettings  |  ( |   | ) |   const
◆ WidgetColorSettings()
 const CRhinoWidgetColorSettings& CRhinoAppSettings::WidgetColorSettings  |  ( |   | ) |   const
◆ WorldCoordIconAxisSize()
 int CRhinoAppSettings::WorldCoordIconAxisSize  |  ( |   | ) |   const
length of the axes lines in pixels
◆ WorldCoordIconLabelSize()
 int CRhinoAppSettings::WorldCoordIconLabelSize  |  ( |   | ) |   const
radius of the axes labels in pixels
◆ WorldCoordIconMoveLabels()
 bool CRhinoAppSettings::WorldCoordIconMoveLabels  |  ( |   | ) |   const
If WorldCoordIconMoveLabels() returns true, the world axes icon labels position themselves so that the axes lines are not drawn on top of the axes labels. If false, the labels are always drawn to the right of the ends of the axes.
◆ WorldCoordIconXAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconXAxisColor  |  ( |   | ) |   const
world coordinate icon axes colors
◆ WorldCoordIconYAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconYAxisColor  |  ( |   | ) |   const
◆ WorldCoordIconZAxisColor()
 ON_Color CRhinoAppSettings::WorldCoordIconZAxisColor  |  ( |   | ) |   const
◆ ZebraAnalysisSettings()
 const CRhinoZebraAnalysisSettings& CRhinoAppSettings::ZebraAnalysisSettings  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhCrossApp
 friend class CRhCrossApp
friend
◆ CRhinoApp
 friend class CRhinoApp
friend
◆ CRhLinuxApp
 friend class CRhLinuxApp
friend