Public Types | Public Member Functions | List of all members
CRhinoUiMessagePump Class Referenceabstract
RhinoUI
#include <RhinoSdkUiMessagePump.h>
 Public Types
enum  | modal_result { continue_modal = 0, continue_modal_msg, continue_modal_wm_quit, force_32bit_modal_result = 0xFFFFFFFF }
 Public Member Functions
CRhinoUiMessagePump (CWinApp &win_app)
virtual  | ~CRhinoUiMessagePump ()
virtual BOOL32  | ContinueModal ()=0
virtual BOOL32  | ContinueModal (const MSG &msg)=0
modal_result  | DoModal ()
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ modal_result
 enum CRhinoUiMessagePump::modal_result
Enumerator
continue_modal
continue_modal_msg
continue_modal_wm_quit
force_32bit_modal_result
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiMessagePump()
 CRhinoUiMessagePump::CRhinoUiMessagePump  |  ( |  CWinApp &  |  win_app | )
◆ ~CRhinoUiMessagePump()
 virtual CRhinoUiMessagePump::~CRhinoUiMessagePump  |  ( |   | )
virtual
Member Function Documentation
◆ ContinueModal() [1/2]
 virtual BOOL32 CRhinoUiMessagePump::ContinueModal  |  ( |   | )
pure virtual
◆ ContinueModal() [2/2]
 virtual BOOL32 CRhinoUiMessagePump::ContinueModal  |  ( |  const MSG &  |  msg | )
pure virtual
◆ DoModal()
 modal_result CRhinoUiMessagePump::DoModal  |  ( |   | )