Public Member Functions | List of all members
CRhRdkPostEffectPlugInFactory Class Referenceabstract
RDK
#include <RhRdkPostEffectPlugInFactory.h>
 Inheritance diagram for CRhRdkPostEffectPlugInFactory:
 Public Member Functions
virtual UUID  | InterfaceId (void) const final override
virtual CRhRdkPostEffectPlugIn *  | NewPlugIn (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class is deprecated in favor of CRhRdkPostEffectFactory. It is not implemented.
Member Function Documentation
◆ InterfaceId()
 virtual UUID CRhRdkPostEffectPlugInFactory::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ NewPlugIn()
 virtual CRhRdkPostEffectPlugIn* CRhRdkPostEffectPlugInFactory::NewPlugIn  |  ( |  void  |   | ) |   const
pure virtual