Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_DepthImageDefaultShaderContext Class Reference
OpenNURBS
#include <opennurbs_plus_idimage.h>
 Public Member Functions
ON_DepthImageDefaultShaderContext ()
 Public Attributes
bool  | m_bTestDepth
default = true More...
bool  | m_bWriteDepth
default = true More...
bool  | m_bWriteId
id buffer controls More...
ON_DepthImage::DEPTH_TEST  | m_depth_test
depth buffer controls More...
unsigned int  | m_test_triangle_status
test triangle status controls More...
 Static Public Attributes
static const ON_DepthImageDefaultShaderContext  | Default
Constructor & Destructor Documentation
◆ ON_DepthImageDefaultShaderContext()
 ON_DepthImageDefaultShaderContext::ON_DepthImageDefaultShaderContext  |  ( |   | )
Member Data Documentation
◆ Default
 const ON_DepthImageDefaultShaderContext ON_DepthImageDefaultShaderContext::Default
static
◆ m_bTestDepth
 bool ON_DepthImageDefaultShaderContext::m_bTestDepth
default = true
◆ m_bWriteDepth
 bool ON_DepthImageDefaultShaderContext::m_bWriteDepth
default = true
◆ m_bWriteId
 bool ON_DepthImageDefaultShaderContext::m_bWriteId
id buffer controls
default = true
◆ m_depth_test
 ON_DepthImage::DEPTH_TEST ON_DepthImageDefaultShaderContext::m_depth_test
depth buffer controls
default = ON_DepthImage::DEPTH_TEST::less_passes
◆ m_test_triangle_status
 unsigned int ON_DepthImageDefaultShaderContext::m_test_triangle_status
test triangle status controls
default = 0