Static Public Member Functions | List of all members
ON_EdgeSoftening::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static bool  | Chamfer (void)
static double  | EdgeAngleThreshold (void)
static bool  | Faceted (void)
static bool  | ForceSoftening (void)
static double  | Softening (void)
Member Function Documentation
◆ Chamfer()
 static bool ON_EdgeSoftening::Defaults::Chamfer  |  ( |  void  |   | )
static
◆ EdgeAngleThreshold()
 static double ON_EdgeSoftening::Defaults::EdgeAngleThreshold  |  ( |  void  |   | )
static
◆ Faceted()
 static bool ON_EdgeSoftening::Defaults::Faceted  |  ( |  void  |   | )
static
◆ ForceSoftening()
 static bool ON_EdgeSoftening::Defaults::ForceSoftening  |  ( |  void  |   | )
static
◆ Softening()
 static double ON_EdgeSoftening::Defaults::Softening  |  ( |  void  |   | )
static