Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiExpandableTabCtrl_New Class Reference
RhinoUI
#include <RhinoSdkUiExpandableTabCtrl.h>
 Public Member Functions
CRhinoUiExpandableTabCtrl_New ()
virtual  | ~CRhinoUiExpandableTabCtrl_New ()
bool  | AddPage (LPCTSTR lpszItem, int nImage, UINT nIDTemplate, UINT nHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
bool  | CreateExpandableTabCtrl (CDialog *pParentDlg, UINT nID, LPRECT lpRect)
bool  | ExpandItem (int nItem, bool bExpand=true)
const CRhinoUiExpandableTabCtrlItem_New *  | GetActiveItem (void) const
const CRhinoUiExpandableTabCtrlItem_New *  | GetItem (int nItem) const
int  | GetItemCount (void) const
int  | GetScrollPos (int nBar) const
bool  | HideTab (int iIndex, bool bHide=true)
bool  | IsCreated (void) const
void  | Move (const CRect &rect)
bool  | ReplaceDlgItem (CDialog *pParentDlg, UINT nID)
bool  | SetBorders (int cx, int cy)
int  | SetScrollPos (int nBar, int nPos, BOOL32 bRedraw=TRUE)
int  | Width (void) const
 Protected Member Functions
CDialog *  | GetDialogPage (int index) const
bool  | ItemState (int index, CRhinoUiExpandableTabCtrlItem::item_states flag) const
 Friends
class  | CRhinoUiExpandableTabCtrlItem_New
Detailed Description
CRhinoUiExpandableTabCtrl_New
Description: This is a drop-in replacement for CRhinoUiExpandableTabCtrl which uses the RDK's holder containing one or more collapsible sections.
Constructor & Destructor Documentation
◆ CRhinoUiExpandableTabCtrl_New()
 CRhinoUiExpandableTabCtrl_New::CRhinoUiExpandableTabCtrl_New  |  ( |   | )
◆ ~CRhinoUiExpandableTabCtrl_New()
 virtual CRhinoUiExpandableTabCtrl_New::~CRhinoUiExpandableTabCtrl_New  |  ( |   | )
virtual
Member Function Documentation
◆ AddPage()
 bool CRhinoUiExpandableTabCtrl_New::AddPage  |  ( |  LPCTSTR  |  lpszItem,
|  int  |  nImage,
|  UINT  |  nIDTemplate,
|  UINT  |  nHtmlResID,
|  CRuntimeClass *  |  pRC,
|  AFX_MODULE_STATE *  |  pMS
)
◆ CreateExpandableTabCtrl()
 bool CRhinoUiExpandableTabCtrl_New::CreateExpandableTabCtrl  |  ( |  CDialog *  |  pParentDlg,
|  UINT  |  nID,
|  LPRECT  |  lpRect
)
◆ ExpandItem()
 bool CRhinoUiExpandableTabCtrl_New::ExpandItem  |  ( |  int  |  nItem,
|  bool  |  bExpand = true
)
◆ GetActiveItem()
 const CRhinoUiExpandableTabCtrlItem_New* CRhinoUiExpandableTabCtrl_New::GetActiveItem  |  ( |  void  |   | ) |   const
◆ GetDialogPage()
 CDialog* CRhinoUiExpandableTabCtrl_New::GetDialogPage  |  ( |  int  |  index | ) |   const
protected
◆ GetItem()
 const CRhinoUiExpandableTabCtrlItem_New* CRhinoUiExpandableTabCtrl_New::GetItem  |  ( |  int  |  nItem | ) |   const
◆ GetItemCount()
 int CRhinoUiExpandableTabCtrl_New::GetItemCount  |  ( |  void  |   | ) |   const
◆ GetScrollPos()
 int CRhinoUiExpandableTabCtrl_New::GetScrollPos  |  ( |  int  |  nBar | ) |   const
◆ HideTab()
 bool CRhinoUiExpandableTabCtrl_New::HideTab  |  ( |  int  |  iIndex,
|  bool  |  bHide = true
)
◆ IsCreated()
 bool CRhinoUiExpandableTabCtrl_New::IsCreated  |  ( |  void  |   | ) |   const
◆ ItemState()
 bool CRhinoUiExpandableTabCtrl_New::ItemState  |  ( |  int  |  index,
|  CRhinoUiExpandableTabCtrlItem::item_states  |  flag
) |   |  const
protected
◆ Move()
 void CRhinoUiExpandableTabCtrl_New::Move  |  ( |  const CRect &  |  rect | )
◆ ReplaceDlgItem()
 bool CRhinoUiExpandableTabCtrl_New::ReplaceDlgItem  |  ( |  CDialog *  |  pParentDlg,
|  UINT  |  nID
)
◆ SetBorders()
 bool CRhinoUiExpandableTabCtrl_New::SetBorders  |  ( |  int  |  cx,
|  int  |  cy
)
◆ SetScrollPos()
 int CRhinoUiExpandableTabCtrl_New::SetScrollPos  |  ( |  int  |  nBar,
|  int  |  nPos,
|  BOOL32  |  bRedraw = TRUE
)
◆ Width()
 int CRhinoUiExpandableTabCtrl_New::Width  |  ( |  void  |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoUiExpandableTabCtrlItem_New
 friend class CRhinoUiExpandableTabCtrlItem_New
friend