Public Member Functions | List of all members
CRhinoAnnotation::TextFieldUpdater Class Referenceabstract
#include <RhinoSdkRichText.h>
 Public Member Functions
TextFieldUpdater ()
virtual void  | UpdateFields (void *args=nullptr)=0
Constructor & Destructor Documentation
◆ TextFieldUpdater()
 CRhinoAnnotation::TextFieldUpdater::TextFieldUpdater  |  ( |   | )
inline
Member Function Documentation
◆ UpdateFields()
 virtual void CRhinoAnnotation::TextFieldUpdater::UpdateFields  |  ( |  void *  |  args = nullptr | )
pure virtual