Static Public Member Functions | List of all members
ON_Displacement::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static double  | AbsoluteTolerance (void)
static double  | BlackPoint (void)
static int  | ChannelNumber (void)
static int  | FaceLimit (void)
static bool  | Fair (void)
static int  | FairingAmount (void)
static bool  | LimitFaces (void)
static int  | MeshMemoryLimit (void)
static double  | PostWeldAngle (void)
static double  | RefineSensitivity (void)
static int  | RefineStepCount (void)
static double  | SweepPitch (void)
static SweepResolutionFormulas  | SweepResolutionFormula (void)
static double  | WhitePoint (void)
Member Function Documentation
◆ AbsoluteTolerance()
 static double ON_Displacement::Defaults::AbsoluteTolerance  |  ( |  void  |   | )
static
◆ BlackPoint()
 static double ON_Displacement::Defaults::BlackPoint  |  ( |  void  |   | )
static
◆ ChannelNumber()
 static int ON_Displacement::Defaults::ChannelNumber  |  ( |  void  |   | )
static
◆ FaceLimit()
 static int ON_Displacement::Defaults::FaceLimit  |  ( |  void  |   | )
static
◆ Fair()
 static bool ON_Displacement::Defaults::Fair  |  ( |  void  |   | )
static
◆ FairingAmount()
 static int ON_Displacement::Defaults::FairingAmount  |  ( |  void  |   | )
static
◆ LimitFaces()
 static bool ON_Displacement::Defaults::LimitFaces  |  ( |  void  |   | )
static
◆ MeshMemoryLimit()
 static int ON_Displacement::Defaults::MeshMemoryLimit  |  ( |  void  |   | )
static
◆ PostWeldAngle()
 static double ON_Displacement::Defaults::PostWeldAngle  |  ( |  void  |   | )
static
◆ RefineSensitivity()
 static double ON_Displacement::Defaults::RefineSensitivity  |  ( |  void  |   | )
static
◆ RefineStepCount()
 static int ON_Displacement::Defaults::RefineStepCount  |  ( |  void  |   | )
static
◆ SweepPitch()
 static double ON_Displacement::Defaults::SweepPitch  |  ( |  void  |   | )
static
◆ SweepResolutionFormula()
 static SweepResolutionFormulas ON_Displacement::Defaults::SweepResolutionFormula  |  ( |  void  |   | )
static
◆ WhitePoint()
 static double ON_Displacement::Defaults::WhitePoint  |  ( |  void  |   | )
static