Public Member Functions | List of all members
ON_RenderMaterial Class Reference
OpenNURBS
#include <opennurbs_render_content.h>
 Inheritance diagram for ON_RenderMaterial:
 Public Member Functions
ON_RenderMaterial ()
ON_RenderMaterial (const ON_RenderMaterial &m)
virtual  | ~ON_RenderMaterial ()
virtual ON_RenderContent *  | NewRenderContent (void) const override
virtual const ON_RenderContent &  | operator= (const ON_RenderContent &) override
virtual const ON_RenderMaterial &  | operator= (const ON_RenderMaterial &)
virtual ON_Material  | ToOnMaterial (void) const
 Public Member Functions inherited from ON_RenderContent
ON_RenderContent (const ON_RenderContent &)
ON_RenderContent (const wchar_t *kind)
virtual  | ~ON_RenderContent ()
virtual bool  | AutoDelete (void) const
Returns: True if the content is automatically deleted when not in use. More...
virtual double  | ChildSlotAmount (const wchar_t *child_slot_name, double default_value=ON_UNSET_VALUE) const
virtual ON_wString  | ChildSlotName (void) const
Returns: The content's child-slot name. More...
virtual bool  | ChildSlotOn (const wchar_t *child_slot_name) const
virtual bool  | DeleteChild (const wchar_t *child_slot_name)
virtual ON_RenderContent *  | FindChild (const wchar_t *child_slot_name)
Returns: The child with the specified child slot name, or null if no such child exists. More...
virtual const ON_RenderContent *  | FindChild (const wchar_t *child_slot_name) const
virtual ON_RenderContent *  | FirstChild (void)
Returns: The first child of this content or null if none. More...
virtual const ON_RenderContent *  | FirstChild (void) const
virtual ChildIterator  | GetChildIterator (void) const
Returns: An iterator for iterating over the content's children. More...
virtual ON_XMLVariant  | GetParameter (const wchar_t *name) const
virtual ON_UUID  | GroupId (void) const
Returns: The content's group id. More...
virtual bool  | Hidden (void) const
Returns: True if the content is hidden. More...
virtual bool  | IsChild (void) const
Returns: True if this is a child content (i.e., has a parent; is not top-level). More...
virtual bool  | IsTopLevel (void) const
Returns: True if this is a top-level content (i.e., has no parent; is not a child). More...
virtual ON_wString  | Kind (void) const
Returns the kind of render content as a string. More...
virtual ON_RenderContent *  | NextSibling (void)
Returns: The first sibling of this content or null if none. More...
virtual const ON_RenderContent *  | NextSibling (void) const
virtual ON_wString  | Notes (void) const
Returns: The content's notes. More...
virtual ON_RenderContent *  | Parent (void)
Returns: The parent content or null if this is the top level object. More...
virtual const ON_RenderContent *  | Parent (void) const
virtual ON_UUID  | PlugInId (void) const
Returns: The content's plug-in id. More...
virtual bool  | Reference (void) const
Returns: True if the content is a reference content. More...
virtual ON_UUID  | RenderEngineId (void) const
Returns: The content's render-engine id. More...
virtual void  | SetAutoDelete (bool autodel)
Sets whether or not the content is automatically deleted when not in use. More...
virtual bool  | SetChild (const ON_RenderContent &child, const wchar_t *child_slot_name)
virtual bool  | SetChildSlotAmount (double amount, const wchar_t *child_slot_name)
virtual void  | SetChildSlotName (const wchar_t *child_slot_name)
Sets the content's child-slot name. More...
virtual bool  | SetChildSlotOn (bool on, const wchar_t *child_slot_name)
virtual void  | SetGroupId (const ON_UUID &group)
Sets the content's group id. More...
virtual void  | SetHidden (bool hidden)
Sets whether or not the content is hidden. More...
virtual void  | SetNotes (const wchar_t *notes)
Sets the content's notes. More...
virtual bool  | SetParameter (const wchar_t *name, const ON_XMLVariant &value)
virtual void  | SetPlugInId (const ON_UUID &uuid)
Set the content's plug-in id. More...
virtual void  | SetReference (bool ref)
Sets whether or not the content is a reference content. More...
virtual void  | SetRenderEngineId (const ON_UUID &uuid)
Set the content's render-engine id. More...
virtual void  | SetTags (const wchar_t *tags)
Sets the content's tags. More...
virtual void  | SetTypeId (const ON_UUID &uuid)
Set the content's type id. More...
virtual void  | SetTypeName (const wchar_t *name)
Set the content's type name. More...
virtual bool  | SetXML (const wchar_t *xml)
Set the render content's state from an XML string. More...
virtual ON_wString  | Tags (void) const
Returns: The content's tags. More...
virtual ON_RenderContent &  | TopLevel (void)
Returns: The top level parent of this content. More...
virtual const ON_RenderContent &  | TopLevel (void) const
virtual ON_UUID  | TypeId (void) const
Returns: The unique id of the content type. More...
virtual ON_wString  | TypeName (void) const
Returns: The internal name of the content type. More...
virtual ON_wString  | XML (bool recursive) const
Get the render content's state as an XML string. More...
virtual const ON_XMLNode &  | XMLNode (void) const
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
void  | Dump (ON_TextLog &) const override
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Additional Inherited Members
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from ON_RenderContent
static const ON_RenderContent *  | FromModelComponentRef (const ON_ModelComponentReference &ref, const ON_RenderContent *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Protected Member Functions inherited from ON_RenderContent
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
 Protected Attributes inherited from ON_RenderContent
class ON_RenderContentPrivate *  | _private
Constructor & Destructor Documentation
◆ ON_RenderMaterial() [1/2]
 ON_RenderMaterial::ON_RenderMaterial  |  ( |   | )
◆ ON_RenderMaterial() [2/2]
 ON_RenderMaterial::ON_RenderMaterial  |  ( |  const ON_RenderMaterial &  |  m | )
◆ ~ON_RenderMaterial()
 virtual ON_RenderMaterial::~ON_RenderMaterial  |  ( |   | )
virtual
Member Function Documentation
◆ NewRenderContent()
 virtual ON_RenderContent* ON_RenderMaterial::NewRenderContent  |  ( |  void  |   | ) |   const
overridevirtual
Implements ON_RenderContent.
◆ operator=() [1/2]
 virtual const ON_RenderContent& ON_RenderMaterial::operator=  |  ( |  const ON_RenderContent &  |   | )
overridevirtual
Reimplemented from ON_RenderContent.
◆ operator=() [2/2]
 virtual const ON_RenderMaterial& ON_RenderMaterial::operator=  |  ( |  const ON_RenderMaterial &  |   | )
virtual
◆ ToOnMaterial()
 virtual ON_Material ON_RenderMaterial::ToOnMaterial  |  ( |  void  |   | ) |   const
virtual