Public Member Functions | Public Attributes | List of all members
CRhinoObjectMesh Class Reference
Rhino
#include <rhinoSdkMeshObject.h>
 Public Member Functions
CRhinoObjectMesh ()
~CRhinoObjectMesh ()
deletes m_mesh if it is not NULL More...
 Public Attributes
const ON_Brep *  | m_brep
const CRhinoBrepObject *  | m_brep_object
const CRhinoInstanceObject *  | m_iref_object
ON_Mesh *  | m_mesh
ON_3dmObjectAttributes  | m_mesh_attributes
object attributes associated with this mesh More...
const CRhinoMeshObject *  | m_mesh_object
const CRhinoObject *  | m_parent_object
object that was meshed to create m_mesh More...
Detailed Description
Description: Used to return meshes created by RhinoMeshObjects.
Constructor & Destructor Documentation
◆ CRhinoObjectMesh()
 CRhinoObjectMesh::CRhinoObjectMesh  |  ( |   | )
◆ ~CRhinoObjectMesh()
 CRhinoObjectMesh::~CRhinoObjectMesh  |  ( |   | )
deletes m_mesh if it is not NULL
Member Data Documentation
◆ m_brep
 const ON_Brep* CRhinoObjectMesh::m_brep
If m_brep_object is not NULL, then m_brep is the object that was meshed
◆ m_brep_object
 const CRhinoBrepObject* CRhinoObjectMesh::m_brep_object
◆ m_iref_object
 const CRhinoInstanceObject* CRhinoObjectMesh::m_iref_object
If m_iref_object is not NULL when the top level object was an instance reference. Otherwise, m_iref_object is NULL and the m_brep_object or m_mesh_object is the top level object.
◆ m_mesh
 ON_Mesh* CRhinoObjectMesh::m_mesh
mesh is returned here. If you want to keep the mesh, then set m_mesh to NULL. Otherwise ~CRhinoObjectMesh will delete m_mesh.
◆ m_mesh_attributes
 ON_3dmObjectAttributes CRhinoObjectMesh::m_mesh_attributes
object attributes associated with this mesh
◆ m_mesh_object
 const CRhinoMeshObject* CRhinoObjectMesh::m_mesh_object
At most one of m_mesh_object or m_brep_object is not NULL. If both are null, then inspect m_parent_object to determine what object was meshed, often a CRhinoExtrusionObject. If m_iref_object is NULL, then m_brep_object or m_mesh_object is an object in the doc's geometry or reference geometry tables. If m_iref_object is not NULL, then m_brep_object or m_mesh_object is in the doc's instance definition geometry list.
◆ m_parent_object
 const CRhinoObject* CRhinoObjectMesh::m_parent_object
object that was meshed to create m_mesh