Public Member Functions | Protected Member Functions | List of all members
IRhinoUiControllerEventWatcher Class Referenceabstract
RDK
#include <RhRdkDataSource.h>
 Inheritance diagram for IRhinoUiControllerEventWatcher:
 Public Member Functions
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | OnControllerActivatedEvent (IRhinoUiController &con)=0
virtual void  | OnEvent (IRhinoUiController &con, const UUID &uuidData, IRhinoUiController::EventPriority ep, const IRhinoUiEventInfo *pInfo)=0
 Protected Member Functions
virtual  | ~IRhinoUiControllerEventWatcher ()
Detailed Description
Any object that has access to a IRhinoUiController can register itself to receive events from that controller by implementing this interface and calling IRhinoUiController::RegisterEventWatcher()
Constructor & Destructor Documentation
◆ ~IRhinoUiControllerEventWatcher()
 virtual IRhinoUiControllerEventWatcher::~IRhinoUiControllerEventWatcher  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ EVF()
 virtual void* IRhinoUiControllerEventWatcher::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
pure virtual
Emergency virtual function for future expansion.
◆ OnControllerActivatedEvent()
 virtual void IRhinoUiControllerEventWatcher::OnControllerActivatedEvent  |  ( |  IRhinoUiController &  |  con | )
pure virtual
Implement this method to handle an event when the controller is first activated.
◆ OnEvent()
 virtual void IRhinoUiControllerEventWatcher::OnEvent  |  ( |  IRhinoUiController &  |  con,
|  const UUID &  |  uuidData,
|  IRhinoUiController::EventPriority  |  ep,
|  const IRhinoUiEventInfo *  |  pInfo
)
pure virtual
Implement this method to handle an event when the data of a certain type changes. Your handler will typically transfer data of that type to elements of your user interface.
Parameters
con | is the controller sending the event.
uuidData | is the identifier of the data.
ep | is the event priority.
pInfo | is an optional pointer to extra event-specific information. This is often null.
See also
IRhinoUiDataSource::RegisterEventWatcher().