Public Member Functions | List of all members
CRhRdkPostEffectPlugInEx Class Referenceabstract
RDK
#include <RhRdkPostEffectPlugIn.h>
 Inheritance diagram for CRhRdkPostEffectPlugInEx:
 Public Member Functions
virtual CRhRdkVariant  | GetParameter (const wchar_t *wszName) const =0
virtual bool  | SetParameter (const wchar_t *wszName, const CRhRdkVariant &vValue)=0
 Public Member Functions inherited from CRhRdkPostEffectPlugIn
CRhRdkPostEffectPlugIn ()
virtual  | ~CRhRdkPostEffectPlugIn ()
virtual BYTE *  | Bits (void) const
virtual DWORD  | BitsPerPixel (void) const
virtual eRhRdkPepByteOrder  | ByteOrder (void) const
virtual_su bool  | CanDisplayOptions (void) const
virtual bool  | ChannelInformationAvailable (const UUID &uuidChannel) const
virtual bool  | ColorPickerUI (CRhRdkColor &colInOut, HWND pParent) const
virtual bool  | DisplayOptions (HWND hWndParent)=0
virtual bool  | DisplayPreview (const class IRhRdkPEPDlg &)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual bool  | FormatNumber (double dNumber, wchar_t *wszNumber, DWORD dwSize) const
virtual bool  | GetChannelValue (const UUID &uuidChannel, int x, int y, float &fValueOut) const
virtual bool  | GetChannelValue (const UUID &uuidChannel, int x, int y, ON__UINT32 &iValueOut) const
void  | GetChannelValue (IRhRdkRenderWindow::IChannel &channel, int x, int y, float &fValueOut) const
void  | GetChannelValue (IRhRdkRenderWindow::IChannel &channel, int x, int y, ON__UINT32 &iValueOut) const
virtual bool  | GetChannelValues (const UUID *aUuidChannels, int x, int y, float *aValuesOut, int iNumberOfValues) const
virtual bool  | GetDIBPixel (int x, int y, float &fRedOut, float &fGreenOut, float &fBlueOut) const
virtual int  | GetHostLocale (void) const
virtual bool  | GetLocalizedString (wchar_t *wszBuffer, DWORD dwNumChars, UINT uStringId=-1) const
virtual double  | GetMaxLuminance (void) const
virtual bool  | GetMinMaxValuesFromChannel (const UUID &uuidChannel, float &fMinOut, float &fMaxOut) const
virtual void  | GetRGBAOffset (int &iR, int &iG, int &iB, int &iA) const
virtual void  | GetRGBOffset (int &iR, int &iG, int &iB) const
virtual DWORD  | Height (void) const
virtual HICON  | Icon (bool bOn) const
virtual bool  | Inverted (void) const
virtual bool  | IsColorPickerImplemented (void) const
virtual bool  | IsPickPointOnImageImplemented (void) const
virtual bool  | IsPickRectangleOnImageImplemented (void) const
virtual DWORD  | LineLength (void) const
virtual IRhRdkRenderWindow::IChannel *  | NewChannel (const UUID &uuidChannel) const
virtual bool  | On (void) const
virtual bool  | OnLoadPlugIn (void)=0
virtual double  | ParseNumber (const wchar_t *wszNumber) const
virtual bool  | PickPointOnImage (int &x, int &y, HCURSOR hCursor) const
virtual bool  | PickRectangleOnImage (ON_4iRect &rectOut, HCURSOR hCursor) const
virtual UUID  | PlugInID (void) const =0
virtual ON_wString  | PlugInName (void) const =0
virtual bool  | PostProcessImage (void)
virtual bool  | PreProcessImage (void)
virtual bool  | ProcessImage (void)=0
virtual bool  | ProvideHelp (const wchar_t *wszTopic)
virtual bool  | ReadFromDocumentDefaults (const CRhinoDoc &doc)
bool  | ReadFromNode (const CLBP_XMLNode &node)
virtual bool  | ReadState (const void *pBuffer, size_t size)=0
virtual void  | SetManager (Manager *pManager)
virtual void  | SetOn (bool bOn=true)
virtual void  | SetToDefault (void)=0
virtual bool  | UpdateImage (void)
virtual DWORD  | Width (void) const
virtual bool  | WorksWithCurrentImage (void) const =0
virtual bool  | WriteState (void *pBuffer, size_t &size) const =0
virtual bool  | WriteToDocumentDefaults (CRhinoDoc &doc) const
bool  | WriteToNode (CLBP_XMLNode &node) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkPostEffectPlugIn
virtual bool  | IsProcessInterrupted (void) const
virtual void  | OnProcessImageProgress (float fProgress) const
Member Function Documentation
◆ GetParameter()
 virtual CRhRdkVariant CRhRdkPostEffectPlugInEx::GetParameter  |  ( |  const wchar_t *  |  wszName | ) |   const
pure virtual
◆ SetParameter()
 virtual bool CRhRdkPostEffectPlugInEx::SetParameter  |  ( |  const wchar_t *  |  wszName,
|  const CRhRdkVariant &  |  vValue
)
pure virtual