Public Member Functions | List of all members
CRhRdkPreviewBackground Class Referenceabstract
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkPreviewBackground:
 Public Member Functions
virtual const wchar_t *  | ElementKind (void) const final override
virtual UUID  | EnvironmentInstanceId (void) const
virtual void  | SetEnvironmentInstanceId (const UUID &uuidInstance)
virtual void  | SetUpPreview (class IRhRdkPreviewSceneServerEx &ss, const UUID uuidRdkDoc) const =0
 Public Member Functions inherited from CRhRdkPreviewSceneElement
CRhRdkPreviewSceneElement ()
virtual  | ~CRhRdkPreviewSceneElement ()
virtual CRhRdkPreviewSceneElement *  | Duplicate (void) const =0
virtual UUID  | TypeId (void) const =0
virtual const wchar_t *  | XmlTag (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Member Function Documentation
◆ ElementKind()
 virtual const wchar_t* CRhRdkPreviewBackground::ElementKind  |  ( |  void  |   | ) |   const
finaloverridevirtual
Implements CRhRdkPreviewSceneElement.
◆ EnvironmentInstanceId()
 virtual UUID CRhRdkPreviewBackground::EnvironmentInstanceId  |  ( |  void  |   | ) |   const
virtual
If the background uses an environment, return the instance id of the environment. The default implementation returns ON_nil_uuid.
◆ SetEnvironmentInstanceId()
 virtual void CRhRdkPreviewBackground::SetEnvironmentInstanceId  |  ( |  const UUID &  |  uuidInstance | )
virtual
If the background uses an environment, set the instance id of the environment.
◆ SetUpPreview()
 virtual void CRhRdkPreviewBackground::SetUpPreview  |  ( |  class IRhRdkPreviewSceneServerEx &  |  ss,
|  const UUID  |  uuidRdkDoc
) |   |  const
pure virtual