Public Attributes | List of all members
CRhinoOnViewEnableDrawingChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
bool  | m_drawing_enabled
The view drawing enabled state. More...
unsigned int  | m_rhino_doc_sn
The document runtime serial number. More...
Member Data Documentation
◆ m_drawing_enabled
 bool CRhinoOnViewEnableDrawingChanged::CParameters::m_drawing_enabled
The view drawing enabled state.
◆ m_rhino_doc_sn
 unsigned int CRhinoOnViewEnableDrawingChanged::CParameters::m_rhino_doc_sn
The document runtime serial number.