Public Member Functions | List of all members
CRhRdkImageFileDialogFilter Class Reference
RDK
#include <RhRdkFileDialogFilter.h>
 Inheritance diagram for CRhRdkImageFileDialogFilter:
 Public Member Functions
CRhRdkImageFileDialogFilter (unsigned int uFlags, CRhRdkRenderPlugIn *pPlugIn=nullptr)
virtual  | ~CRhRdkImageFileDialogFilter ()
int  | PositionOfType (const wchar_t *wszType) const
ON_wString  | TypeAtPosition (int) const
 Public Member Functions inherited from CRhRdkFileDialogFilter
CRhRdkFileDialogFilter ()
virtual  | ~CRhRdkFileDialogFilter ()
virtual void  | Add (const ON_wString &sName, const ON_wString &sFriendlyPattern, const wchar_t *wszPattern=nullptr)
virtual const wchar_t *  | Buffer (bool bConvertBars=true) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkImageFileDialogFilter()
 CRhRdkImageFileDialogFilter::CRhRdkImageFileDialogFilter  |  ( |  unsigned int  |  uFlags,
|  CRhRdkRenderPlugIn *  |  pPlugIn = nullptr
)
◆ ~CRhRdkImageFileDialogFilter()
 virtual CRhRdkImageFileDialogFilter::~CRhRdkImageFileDialogFilter  |  ( |   | )
virtual
Member Function Documentation
◆ PositionOfType()
 int CRhRdkImageFileDialogFilter::PositionOfType  |  ( |  const wchar_t *  |  wszType | ) |   const
◆ TypeAtPosition()
 ON_wString CRhRdkImageFileDialogFilter::TypeAtPosition  |  ( |  int  |   | ) |   const