Public Member Functions | List of all members
CRhRdkContentMultipleSelection Class Reference
RDK
#include <RhRdkDeprecated.h>
 Public Member Functions
CRhRdkContentMultipleSelection (const CRhRdkContentArray &aContentSel, const CRhRdkContentArray &aContentEdit, int el, const UUID &e, void *p)
const CRhRdkContentArray &  | ContentEdit (void) const
const CRhRdkContentArray &  | ContentSel (void) const
int  | EditingLevel (void) const
UUID  | EditorId (void) const
Detailed Description
Deprecated:
OBSOLETE
See also
CRhRdkEventWatcher::OnContentSelection()
Constructor & Destructor Documentation
◆ CRhRdkContentMultipleSelection()
 CRhRdkContentMultipleSelection::CRhRdkContentMultipleSelection  |  ( |  const CRhRdkContentArray &  |  aContentSel,
|  const CRhRdkContentArray &  |  aContentEdit,
|  int  |  el,
|  const UUID &  |  e,
|  void *  |  p
)
Member Function Documentation
◆ ContentEdit()
 const CRhRdkContentArray& CRhRdkContentMultipleSelection::ContentEdit  |  ( |  void  |   | ) |   const
inline
◆ ContentSel()
 const CRhRdkContentArray& CRhRdkContentMultipleSelection::ContentSel  |  ( |  void  |   | ) |   const
inline
◆ EditingLevel()
 int CRhRdkContentMultipleSelection::EditingLevel  |  ( |  void  |   | ) |   const
inline
◆ EditorId()
 UUID CRhRdkContentMultipleSelection::EditorId  |  ( |  void  |   | ) |   const
inline