Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ManifestMapItem Class Reference
OpenNURBS
#include <opennurbs_archive.h>
 Public Member Functions
ON_ManifestMapItem ()=default
ON_ManifestMapItem (const ON_ManifestMapItem &)=default
~ON_ManifestMapItem ()=default
bool  | ClearDestinationIdentification ()
bool  | ClearSourceIdentification ()
ON_ModelComponent::Type  | ComponentType () const
const ON_UUID &  | DestinationId () const
int  | DestinationIndex () const
bool  | DestinationInManifest (const ON_ComponentManifest &destination_manifest) const
bool  | DestinationIsSet () const
bool  | DestinationIsUnset () const
ON_ManifestMapItem &  | operator= (const ON_ManifestMapItem &)=default
bool  | SetDestinationIdentification (const class ON_ComponentManifestItem *manifest_item)
bool  | SetDestinationIdentification (const class ON_ManifestMapItem *map_item)
bool  | SetDestinationIdentification (const class ON_ModelComponent *model_component)
bool  | SetDestinationIdentification (ON_ModelComponent::Type component_type, ON_UUID destination_id, int destination_index)
bool  | SetSourceIdentification (const class ON_ComponentManifestItem *manifest_item)
bool  | SetSourceIdentification (const class ON_ManifestMapItem *map_item)
bool  | SetSourceIdentification (const class ON_ModelComponent *model_component)
bool  | SetSourceIdentification (ON_ModelComponent::Type component_type, ON_UUID source_id, int source_index)
bool  | SourceAndDestinationAreSet () const
const ON_UUID &  | SourceId () const
int  | SourceIndex () const
bool  | SourceInManifest (const ON_ComponentManifest &source_manifest) const
bool  | SourceIsSet () const
bool  | SourceIsUnset () const
bool  | SourceOrDestinationIsUnset () const
ON_ManifestMapItem  | SwapSourceAndDestiation () const
 Static Public Member Functions
static int  | Compare (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndDestinationId (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndDestinationIdAndIndex (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndDestinationIndex (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndSourceId (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndSourceIdAndIndex (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static int  | CompareTypeAndSourceIndex (const ON_ManifestMapItem &a, const ON_ManifestMapItem &b)
static ON__UINT32  | SourceIdHash32 (const ON_UUID &source_component_id)
static ON__UINT32  | SourceIndexHash32 (ON_ModelComponent::Type component_type, int source_component_index)
 Static Public Attributes
static const ON_ManifestMapItem  | Unset
Constructor & Destructor Documentation
◆ ON_ManifestMapItem() [1/2]
 ON_ManifestMapItem::ON_ManifestMapItem  |  ( |   | )
default
◆ ~ON_ManifestMapItem()
 ON_ManifestMapItem::~ON_ManifestMapItem  |  ( |   | )
default
◆ ON_ManifestMapItem() [2/2]
 ON_ManifestMapItem::ON_ManifestMapItem  |  ( |  const ON_ManifestMapItem &  |   | )
default
Member Function Documentation
◆ ClearDestinationIdentification()
 bool ON_ManifestMapItem::ClearDestinationIdentification  |  ( |   | )
◆ ClearSourceIdentification()
 bool ON_ManifestMapItem::ClearSourceIdentification  |  ( |   | )
◆ Compare()
 static int ON_ManifestMapItem::Compare  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
Description: Compares type, indices and ids.
◆ CompareTypeAndDestinationId()
 static int ON_ManifestMapItem::CompareTypeAndDestinationId  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ CompareTypeAndDestinationIdAndIndex()
 static int ON_ManifestMapItem::CompareTypeAndDestinationIdAndIndex  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ CompareTypeAndDestinationIndex()
 static int ON_ManifestMapItem::CompareTypeAndDestinationIndex  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ CompareTypeAndSourceId()
 static int ON_ManifestMapItem::CompareTypeAndSourceId  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ CompareTypeAndSourceIdAndIndex()
 static int ON_ManifestMapItem::CompareTypeAndSourceIdAndIndex  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ CompareTypeAndSourceIndex()
 static int ON_ManifestMapItem::CompareTypeAndSourceIndex  |  ( |  const ON_ManifestMapItem &  |  a,
|  const ON_ManifestMapItem &  |  b
)
static
◆ ComponentType()
 ON_ModelComponent::Type ON_ManifestMapItem::ComponentType  |  ( |   | ) |   const
◆ DestinationId()
 const ON_UUID& ON_ManifestMapItem::DestinationId  |  ( |   | ) |   const
◆ DestinationIndex()
 int ON_ManifestMapItem::DestinationIndex  |  ( |   | ) |   const
◆ DestinationInManifest()
 bool ON_ManifestMapItem::DestinationInManifest  |  ( |  const ON_ComponentManifest &  |  destination_manifest | ) |   const
Returns: True if destination_manifest contains a manifest item that matches m_component_type, m_destination_component_id, and m_destination_component_index.
◆ DestinationIsSet()
 bool ON_ManifestMapItem::DestinationIsSet  |  ( |   | ) |   const
Returns: True if m_component_type is not ON_ModelComponent::Type::Unset and m_destination_component_id is not nil and no index is required or m_destination_component_index is not ON_UNSET_INT_INDEX.
◆ DestinationIsUnset()
 bool ON_ManifestMapItem::DestinationIsUnset  |  ( |   | ) |   const
◆ operator=()
 ON_ManifestMapItem& ON_ManifestMapItem::operator=  |  ( |  const ON_ManifestMapItem &  |   | )
default
◆ SetDestinationIdentification() [1/4]
 bool ON_ManifestMapItem::SetDestinationIdentification  |  ( |  const class ON_ComponentManifestItem *  |  manifest_item | )
Description: Set type and destination identification to manifest_item identification. Parameters: manifest_item - [in] Returns: True if set. False source type is set and different from manifest_item->ComponentType().
◆ SetDestinationIdentification() [2/4]
 bool ON_ManifestMapItem::SetDestinationIdentification  |  ( |  const class ON_ManifestMapItem *  |  map_item | )
Description: Copy type and destination identification from map_item. Parameters: map_item - [in] Returns: True if set. False source type is set and different from map_item->ComponentType().
◆ SetDestinationIdentification() [3/4]
 bool ON_ManifestMapItem::SetDestinationIdentification  |  ( |  const class ON_ModelComponent *  |  model_component | )
Description: Set type and destination identification to model_component identification. Parameters: model_component - [in] Returns: True if set. False source type is set and different from model_component->ComponentType().
◆ SetDestinationIdentification() [4/4]
 bool ON_ManifestMapItem::SetDestinationIdentification  |  ( |  ON_ModelComponent::Type  |  component_type,
|  ON_UUID  |  destination_id,
|  int  |  destination_index
)
Description: Set type and destination identification. Parameters: component_type - [in] source_id - [in] source_index - [in] Returns: True if set. False destination type is set and different from component_type.
◆ SetSourceIdentification() [1/4]
 bool ON_ManifestMapItem::SetSourceIdentification  |  ( |  const class ON_ComponentManifestItem *  |  manifest_item | )
Description: Set type and source identification to manifest_item identification. Parameters: manifest_item - [in] Returns: True if set. False destination type is set and different from manifest_item->ComponentType().
◆ SetSourceIdentification() [2/4]
 bool ON_ManifestMapItem::SetSourceIdentification  |  ( |  const class ON_ManifestMapItem *  |  map_item | )
Description: Copy type and source identification from map_item. Parameters: map_item - [in] Returns: True if set. False destination type is set and different from map_item->ComponentType().
◆ SetSourceIdentification() [3/4]
 bool ON_ManifestMapItem::SetSourceIdentification  |  ( |  const class ON_ModelComponent *  |  model_component | )
Description: Set type and source identification to model_component identification. Parameters: model_component - [in] Returns: True if set. False destination type is set and different from model_component->ComponentType().
◆ SetSourceIdentification() [4/4]
 bool ON_ManifestMapItem::SetSourceIdentification  |  ( |  ON_ModelComponent::Type  |  component_type,
|  ON_UUID  |  source_id,
|  int  |  source_index
)
Description: Set type and source identification. Parameters: component_type - [in] source_id - [in] source_index - [in] Returns: True if set. False destination type is set and different from component_type.
◆ SourceAndDestinationAreSet()
 bool ON_ManifestMapItem::SourceAndDestinationAreSet  |  ( |   | ) |   const
Returns: True if m_component_type is not ON_ModelComponent::Type::Unset and m_source_component_id is not nil and m_destination_component_id is not nil and no index is required or m_source_component_index and m_destination_component_index are not ON_UNSET_INT_INDEX.
◆ SourceId()
 const ON_UUID& ON_ManifestMapItem::SourceId  |  ( |   | ) |   const
◆ SourceIdHash32()
 static ON__UINT32 ON_ManifestMapItem::SourceIdHash32  |  ( |  const ON_UUID &  |  source_component_id | )
static
Description: 32-bit hash for use in source id hash tables
◆ SourceIndex()
 int ON_ManifestMapItem::SourceIndex  |  ( |   | ) |   const
◆ SourceIndexHash32()
 static ON__UINT32 ON_ManifestMapItem::SourceIndexHash32  |  ( |  ON_ModelComponent::Type  |  component_type,
|  int  |  source_component_index
)
static
Description: 32-bit hash for use in source index hash tables
◆ SourceInManifest()
 bool ON_ManifestMapItem::SourceInManifest  |  ( |  const ON_ComponentManifest &  |  source_manifest | ) |   const
Returns: True if destination_manifest contains a manifest item that matches m_component_type, m_source_component_id, and m_source_component_index.
◆ SourceIsSet()
 bool ON_ManifestMapItem::SourceIsSet  |  ( |   | ) |   const
Returns: True if m_component_type is not ON_ModelComponent::Type::Unset and m_source_component_id is not nil and no index is required or m_source_component_index is not ON_UNSET_INT_INDEX.
◆ SourceIsUnset()
 bool ON_ManifestMapItem::SourceIsUnset  |  ( |   | ) |   const
◆ SourceOrDestinationIsUnset()
 bool ON_ManifestMapItem::SourceOrDestinationIsUnset  |  ( |   | ) |   const
◆ SwapSourceAndDestiation()
 ON_ManifestMapItem ON_ManifestMapItem::SwapSourceAndDestiation  |  ( |   | ) |   const
Member Data Documentation
◆ Unset
 const ON_ManifestMapItem ON_ManifestMapItem::Unset
static