Public Member Functions | Public Attributes | List of all members
CRhinoDrawCommonAttributes Class Reference
Rhino
Location for new V6 public SDK display. More...
#include <rhinoSdkDraw.h>
 Public Member Functions
CRhinoDrawCommonAttributes () RHINO_NOEXCEPT
 Public Attributes
ON_Color  | m_color
no friends /void ClearHelper() RHINO_NOEXCEPT; /void DestroyHelper() RHINO_NOEXCEPT; /void CopyHelper(const CRhinoDrawCommonAttributes&) RHINO_NOEXCEPT; /void CloneHelper(CRhinoDrawCommonAttributes&) RHINO_NOEXCEPT; More...
Detailed Description
Location for new V6 public SDK display.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. When things are ready, include this file, rhinoSdkDraw.h, in rhinoSdk.h. Until then, include this file directly in the few cpp files that use it. Have Dale Lear put #include <memory> in a core SDK header if we end up using shared_ptr in this code or someplace else.
Constructor & Destructor Documentation
◆ CRhinoDrawCommonAttributes()
 CRhinoDrawCommonAttributes::CRhinoDrawCommonAttributes  |  ( |   | )
If the data members are all "simple", like ON_Color, then let C++ handle everything for maximum efficiency. If a "managed" data member is added, like a pointer to something on the heap, then see CRhinoDrawFancyAttributes for an example of the best way to manage that member.
Member Data Documentation
◆ m_color
 ON_Color CRhinoDrawCommonAttributes::m_color
no friends /void ClearHelper() RHINO_NOEXCEPT; /void DestroyHelper() RHINO_NOEXCEPT; /void CopyHelper(const CRhinoDrawCommonAttributes&) RHINO_NOEXCEPT; /void CloneHelper(CRhinoDrawCommonAttributes&) RHINO_NOEXCEPT;
Simple data member