Public Member Functions | Static Public Attributes | List of all members
CRhinoOpenDocumentOptions Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Public Member Functions
CRhinoOpenDocumentOptions ()
CRhinoOpenDocumentOptions (const CRhinoOpenDocumentOptions &src)
~CRhinoOpenDocumentOptions ()
bool  | AddToMRU () const
bool  | CreateHeadless () const
bool  | CreateStealthWorksession () const
const ON_ArchivableDictionary *  | FileReadingOptions () const
int  | FileReadingPlugInFileTypeIndex () const
ON_UUID  | FileReadingPlugInId () const
bool  | MakeVisible () const
bool  | NameDocument () const
CRhinoOpenDocumentOptions &  | operator= (const CRhinoOpenDocumentOptions &src)
void  | SetAddToMRU (bool bAddToMRU)
void  | SetCreateHeadless (bool bCreateHeadless)
void  | SetCreateStealthWorksession (bool bCreateStealthWorksession)
void  | SetFileReadingOptions (const ON_ArchivableDictionary *options)
void  | SetFileReadingPlugInId (ON_UUID file_read_plug_in_id, int file_type_index)
void  | SetMakeVisible (bool bMakeVisible)
void  | SetNameDocument (bool bNameDocument)
void  | SetUpdateDefaultDirectory (bool bUpdateDefaultDirectory)
void  | SetUserQueriesPermitted (bool bUserQueriesPermitted)
void  | SetWorksessionInitialViews (const ON_ClassArray< ON_3dmView > &views)
bool  | UpdateDefaultDirectory () const
bool  | UserQueriesPermitted () const
const ON_ClassArray< ON_3dmView > &  | WorksessionInitialViews (void) const
 Static Public Attributes
static const CRhinoOpenDocumentOptions  | Defaults
Constructor & Destructor Documentation
◆ CRhinoOpenDocumentOptions() [1/2]
 CRhinoOpenDocumentOptions::CRhinoOpenDocumentOptions  |  ( |   | )
The CRhinoOpenDocumentOptions class is used to pass options to the static CRhinoDoc::OpenDocument() function.
◆ ~CRhinoOpenDocumentOptions()
 CRhinoOpenDocumentOptions::~CRhinoOpenDocumentOptions  |  ( |   | )
◆ CRhinoOpenDocumentOptions() [2/2]
 CRhinoOpenDocumentOptions::CRhinoOpenDocumentOptions  |  ( |  const CRhinoOpenDocumentOptions &  |  src | )
Member Function Documentation
◆ AddToMRU()
 bool CRhinoOpenDocumentOptions::AddToMRU  |  ( |   | ) |   const
Returns: true if the model file name should be added to the MRU list after the file is successfully read. Remarks: Default value is true.
◆ CreateHeadless()
 bool CRhinoOpenDocumentOptions::CreateHeadless  |  ( |   | ) |   const
Returns: true if a "headless" document should be created Remarks: This function is a work in progress and may change during the development of V7
◆ CreateStealthWorksession()
 bool CRhinoOpenDocumentOptions::CreateStealthWorksession  |  ( |   | ) |   const
Returns: true if a "stealth" worksession should be created. Remarks: Default value is true. Ideally, this function will vanish in the near future!
◆ FileReadingOptions()
 const ON_ArchivableDictionary* CRhinoOpenDocumentOptions::FileReadingOptions  |  ( |   | ) |   const
Returns: The options by the file reading plug-in to read the file. Remarks: Default value is null_ptr.
◆ FileReadingPlugInFileTypeIndex()
 int CRhinoOpenDocumentOptions::FileReadingPlugInFileTypeIndex  |  ( |   | ) |   const
◆ FileReadingPlugInId()
 ON_UUID CRhinoOpenDocumentOptions::FileReadingPlugInId  |  ( |   | ) |   const
Returns: non nil The id of a file reading plug-in to read the file. ON_nil_uuid The model file will be read as a native rhino .3dm file. Remarks: Default value is nil.
◆ MakeVisible()
 bool CRhinoOpenDocumentOptions::MakeVisible  |  ( |   | ) |   const
Returns: true if the model should be visible after the file is successfully read. Remarks: Default value is true.
◆ NameDocument()
 bool CRhinoOpenDocumentOptions::NameDocument  |  ( |   | ) |   const
Returns: true if the document name should be set from the file name. false if the model is not named (reading a backup or auto-save file). Remarks: Default value is true.
◆ operator=()
 CRhinoOpenDocumentOptions& CRhinoOpenDocumentOptions::operator=  |  ( |  const CRhinoOpenDocumentOptions &  |  src | )
◆ SetAddToMRU()
 void CRhinoOpenDocumentOptions::SetAddToMRU  |  ( |  bool  |  bAddToMRU | )
◆ SetCreateHeadless()
 void CRhinoOpenDocumentOptions::SetCreateHeadless  |  ( |  bool  |  bCreateHeadless | )
◆ SetCreateStealthWorksession()
 void CRhinoOpenDocumentOptions::SetCreateStealthWorksession  |  ( |  bool  |  bCreateStealthWorksession | )
◆ SetFileReadingOptions()
 void CRhinoOpenDocumentOptions::SetFileReadingOptions  |  ( |  const ON_ArchivableDictionary *  |  options | )
◆ SetFileReadingPlugInId()
 void CRhinoOpenDocumentOptions::SetFileReadingPlugInId  |  ( |  ON_UUID  |  file_read_plug_in_id,
|  int  |  file_type_index
)
◆ SetMakeVisible()
 void CRhinoOpenDocumentOptions::SetMakeVisible  |  ( |  bool  |  bMakeVisible | )
◆ SetNameDocument()
 void CRhinoOpenDocumentOptions::SetNameDocument  |  ( |  bool  |  bNameDocument | )
◆ SetUpdateDefaultDirectory()
 void CRhinoOpenDocumentOptions::SetUpdateDefaultDirectory  |  ( |  bool  |  bUpdateDefaultDirectory | )
◆ SetUserQueriesPermitted()
 void CRhinoOpenDocumentOptions::SetUserQueriesPermitted  |  ( |  bool  |  bUserQueriesPermitted | )
◆ SetWorksessionInitialViews()
 void CRhinoOpenDocumentOptions::SetWorksessionInitialViews  |  ( |  const ON_ClassArray< ON_3dmView > &  |  views | )
◆ UpdateDefaultDirectory()
 bool CRhinoOpenDocumentOptions::UpdateDefaultDirectory  |  ( |   | ) |   const
Returns: true if the Rhino application default directory should be updated. Remarks: Default value is true.
◆ UserQueriesPermitted()
 bool CRhinoOpenDocumentOptions::UserQueriesPermitted  |  ( |   | ) |   const
Returns: true if the user interface queries or dialogs are permitted. Remarks: Default value is true.
◆ WorksessionInitialViews()
 const ON_ClassArray<ON_3dmView>& CRhinoOpenDocumentOptions::WorksessionInitialViews  |  ( |  void  |   | ) |   const
Member Data Documentation
◆ Defaults
 const CRhinoOpenDocumentOptions CRhinoOpenDocumentOptions::Defaults
static
Not needed until implementation changes ~CRhinoOpenDocumentOptions(); CRhinoOpenDocumentOptions(const CRhinoOpenDocumentOptions& src); CRhinoOpenDocumentOptions& operator=(const CRhinoOpenDocumentOptions& src);