Public Member Functions | Public Attributes | List of all members
CRhinoContextMenuContext Class Reference
Rhino
#include <RhinoSdkContextMenu.h>
 Public Member Functions
CRhinoContextMenuContext ()
~CRhinoContextMenuContext ()=default
 Public Attributes
CRhinoDoc *  | m_doc = nullptr
If not NULL, the document which contains m_objects objects. More...
void *  | m_param = nullptr
Custom data pointer. More...
ON_UUID  | m_uuid
ON_SimpleArray< UUID >  | m_uuids
to determine which table these IDs reference. More...
Detailed Description
Description: Context of a context menu. Used by extensions to decide which items to add to a context menu.
Constructor & Destructor Documentation
◆ CRhinoContextMenuContext()
 CRhinoContextMenuContext::CRhinoContextMenuContext  |  ( |   | )
◆ ~CRhinoContextMenuContext()
 CRhinoContextMenuContext::~CRhinoContextMenuContext  |  ( |   | )
default
Member Data Documentation
◆ m_doc
 CRhinoDoc* CRhinoContextMenuContext::m_doc = nullptr
If not NULL, the document which contains m_objects objects.
Description:
◆ m_param
 void* CRhinoContextMenuContext::m_param = nullptr
Custom data pointer.
Description:
◆ m_uuid
 ON_UUID CRhinoContextMenuContext::m_uuid
Description: ID for the context menu being displayed, CRhinoContextMenuExtension for standard Rhino IDs
◆ m_uuids
 ON_SimpleArray<UUID> CRhinoContextMenuContext::m_uuids
to determine which table these IDs reference.
Description: Selected objects affected by the context menu. You must look at m_uuid