Public Member Functions | List of all members
CRhRdkUuidCollection Class Reference
RDK
#include <RhRdkUuidCollection.h>
 Inheritance diagram for CRhRdkUuidCollection:
 Public Member Functions
CRhRdkUuidCollection ()
CRhRdkUuidCollection (const CRhRdkUuidCollection &c)
virtual  | ~CRhRdkUuidCollection ()
virtual void  | Add (const UUID &uuid)
virtual void  | Clear (void)
virtual bool  | Contains (const UUID &uuid) const
virtual int  | Count (void) const
virtual void  | DebugDump (void)
virtual ON_wString  | GetSemicolonDelimitedString (void) const
virtual bool  | IsEmpty (void) const
virtual bool  | Next (UUID &uuidOut) const
const CRhRdkUuidCollection &  | operator= (const CRhRdkUuidCollection &c)
virtual void  | Remove (const UUID &uuid)
virtual void  | ResetIterator (void)
virtual bool  | SetSemicolonDelimitedString (const ON_wString &sUuidList)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class provides a collection of UUIDs. It can be used for collecting Rhino objects, Render Contents or anything else that is identified by a UUID.
Constructor & Destructor Documentation
◆ CRhRdkUuidCollection() [1/2]
 CRhRdkUuidCollection::CRhRdkUuidCollection  |  ( |   | )
◆ CRhRdkUuidCollection() [2/2]
 CRhRdkUuidCollection::CRhRdkUuidCollection  |  ( |  const CRhRdkUuidCollection &  |  c | )
◆ ~CRhRdkUuidCollection()
 virtual CRhRdkUuidCollection::~CRhRdkUuidCollection  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 virtual void CRhRdkUuidCollection::Add  |  ( |  const UUID &  |  uuid | )
virtual
Add a UUID to the collection.
◆ Clear()
 virtual void CRhRdkUuidCollection::Clear  |  ( |  void  |   | )
virtual
Clear the collection.
◆ Contains()
 virtual bool CRhRdkUuidCollection::Contains  |  ( |  const UUID &  |  uuid | ) |   const
virtual
Returns
true if the UUID is present in the collection, else false.
◆ Count()
 virtual int CRhRdkUuidCollection::Count  |  ( |  void  |   | ) |   const
virtual
Returns
The number of items in the collection.
◆ DebugDump()
 virtual void CRhRdkUuidCollection::DebugDump  |  ( |  void  |   | )
virtual
◆ GetSemicolonDelimitedString()
 virtual ON_wString CRhRdkUuidCollection::GetSemicolonDelimitedString  |  ( |  void  |   | ) |   const
virtual
Get the collection as a semicolon-delimited string of UUIDs.
◆ IsEmpty()
 virtual bool CRhRdkUuidCollection::IsEmpty  |  ( |  void  |   | ) |   const
virtual
Returns
true if the collection is empty, else false.
◆ Next()
 virtual bool CRhRdkUuidCollection::Next  |  ( |  UUID &  |  uuidOut | ) |   const
virtual
Get the next UUID from the collection.
Note
The UUIDs are returned in a random order, not in the order they were added.
 The const on this method is incorrect.
Returns
true if a UUID was retrieved, false if there are no more uuids.
◆ operator=()
 const CRhRdkUuidCollection& CRhRdkUuidCollection::operator=  |  ( |  const CRhRdkUuidCollection &  |  c | )
Copy the collection.
◆ Remove()
 virtual void CRhRdkUuidCollection::Remove  |  ( |  const UUID &  |  uuid | )
virtual
Remove a UUID from the collection.
◆ ResetIterator()
 virtual void CRhRdkUuidCollection::ResetIterator  |  ( |  void  |   | )
virtual
Reset the iterator for use with Next().
◆ SetSemicolonDelimitedString()
 virtual bool CRhRdkUuidCollection::SetSemicolonDelimitedString  |  ( |  const ON_wString &  |  sUuidList | )
virtual
Build the collection from a semicolon-delimited string of UUIDs.
Returns
true if successful, false if string is invalid.