Public Member Functions | List of all members
CRhRdkNewUndoableEvent Class Reference
RDK
#include <RhRdkDocument.h>
 Inheritance diagram for CRhRdkNewUndoableEvent:
 Public Member Functions
CRhRdkNewUndoableEvent (const CRhRdkCustomContentUI &ccui, const wchar_t *undo_string)
CRhRdkNewUndoableEvent (const IRhinoUiDataSource &h, const wchar_t *undo_string)
CRhRdkNewUndoableEvent (const IRhinoUiDataSourceHost &h, const wchar_t *undo_string)
CRhRdkNewUndoableEvent (const IRhinoUiDataSourceHost *pHost, const wchar_t *undo_string)
virtual  | ~CRhRdkNewUndoableEvent ()
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
The new version of the undoable event was intended for use with the data source system which in the end did not belong in the public SDK. We still use it internally, and the use by the custom content UI could still be useful for 3rd-party plug-ins.
Note for RDK developers: this is not actually used by the RDK Eto UI. Instead, the UI uses the underlying data source directly via IRhRdkUndo.
Constructor & Destructor Documentation
◆ CRhRdkNewUndoableEvent() [1/4]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSource &  |  h,
|  const wchar_t *  |  undo_string
)
◆ CRhRdkNewUndoableEvent() [2/4]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSourceHost &  |  h,
|  const wchar_t *  |  undo_string
)
◆ CRhRdkNewUndoableEvent() [3/4]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const CRhRdkCustomContentUI &  |  ccui,
|  const wchar_t *  |  undo_string
)
Construct using a custom content UI.
◆ CRhRdkNewUndoableEvent() [4/4]
 CRhRdkNewUndoableEvent::CRhRdkNewUndoableEvent  |  ( |  const IRhinoUiDataSourceHost *  |  pHost,
|  const wchar_t *  |  undo_string
)
◆ ~CRhRdkNewUndoableEvent()
 virtual CRhRdkNewUndoableEvent::~CRhRdkNewUndoableEvent  |  ( |   | )
virtual