Public Member Functions | Protected Member Functions | List of all members
IRhinoUiWithController Class Referenceabstract
RDK
#include <IRhRdkSectionHolder.h>
 Inheritance diagram for IRhinoUiWithController:
 Public Member Functions
virtual std::shared_ptr< IRhinoUiController >  | Controller (void) const =0
virtual ON_UUID  | ControllerId (void) const =0
virtual void  | SetController (std::shared_ptr< IRhinoUiController > con)=0
 Public Member Functions inherited from IRhinoUiWindow
virtual ON_wString  | Caption (bool bAlwaysEnglish=false) const =0
virtual void  | Delete (void)=0
virtual void  | Enable (bool bEnable)=0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual HWND  | GetWindow (void)=0
virtual bool  | IsCreated (void) const =0
virtual bool  | IsEnabled (void) const =0
virtual bool  | IsShown (void) const =0
virtual void  | Move (const ON_4iRect &rect, bool bRepaint=false, bool bRepaintBorder=false)=0
virtual HWND  | Parent (void) const =0
virtual void  | Refresh (bool bImmediate=false)=0
virtual void  | SetFocus (void)=0
virtual void  | SetParent (HWND parent)=0
virtual void  | Show (bool bShow)=0
 Public Member Functions inherited from IRhinoUiControllerEventWatcher
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | OnControllerActivatedEvent (IRhinoUiController &con)=0
virtual void  | OnEvent (IRhinoUiController &con, const UUID &uuidData, IRhinoUiController::EventPriority ep, const IRhinoUiEventInfo *pInfo)=0
 Protected Member Functions
virtual  | ~IRhinoUiWithController ()
 Protected Member Functions inherited from IRhinoUiWindow
virtual  | ~IRhinoUiWindow ()
 Protected Member Functions inherited from IRhinoUiControllerEventWatcher
virtual  | ~IRhinoUiControllerEventWatcher ()
Constructor & Destructor Documentation
◆ ~IRhinoUiWithController()
 virtual IRhinoUiWithController::~IRhinoUiWithController  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ Controller()
 virtual std::shared_ptr<IRhinoUiController> IRhinoUiWithController::Controller  |  ( |  void  |   | ) |   const
pure virtual
Get the controller associated with this window.
◆ ControllerId()
 virtual ON_UUID IRhinoUiWithController::ControllerId  |  ( |  void  |   | ) |   const
pure virtual
If your UI requires a specific registered controller, return its ID here - otherwise return ON_nil_uuid.
◆ SetController()
 virtual void IRhinoUiWithController::SetController  |  ( |  std::shared_ptr< IRhinoUiController >  |  con | )
pure virtual
Set the controller associated with this window.