Public Member Functions | Protected Attributes | List of all members
CRhRdkContent::CChildIterator Class Referencefinal
#include <RhRdkContent.h>
 Public Member Functions
CChildIterator (const CRhRdkContent *pParent)
const CRhRdkContent *  | GetNextChild (void)
 Protected Attributes
const CRhRdkContent *  | m_pCurrent
void *  | m_pReserved
Constructor & Destructor Documentation
◆ CChildIterator()
 CRhRdkContent::CChildIterator::CChildIterator  |  ( |  const CRhRdkContent *  |  pParent | )
Member Function Documentation
◆ GetNextChild()
 const CRhRdkContent* CRhRdkContent::CChildIterator::GetNextChild  |  ( |  void  |   | )
Gets children in the order they were added to the content.
Member Data Documentation
◆ m_pCurrent
 const CRhRdkContent* CRhRdkContent::CChildIterator::m_pCurrent
protected
◆ m_pReserved
 void* CRhRdkContent::CChildIterator::m_pReserved
protected