Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCreatorNewFileTexture Class Reference
RDK
#include <RhRdkContentCreator.h>
 Inheritance diagram for CRhRdkContentCreatorNewFileTexture:
 Public Types
enum  | : unsigned int { kAcceptBitmap = 0x0001, kAcceptSimpleBitmap = 0x0002, kAcceptHDR = 0x0004, kAcceptAll = 0xFFFF }
 Public Member Functions
CRhRdkContentCreatorNewFileTexture (const CRhRdkDocument &rdkDoc, const wchar_t *wszFilename, unsigned int uAcceptable=kAcceptAll)
virtual  | ~CRhRdkContentCreatorNewFileTexture ()
virtual bool  | SetUpDefaults (CRhRdkContent *pContent, const CRhRdkContent *pOldContent) const override
 Public Member Functions inherited from CRhRdkContentCreatorNew
CRhRdkContentCreatorNew (const CRhRdkDocument &rdkDoc, const ON_SimpleArray< UUID > &aUuidNewType, bool bHarvest)
CRhRdkContentCreatorNew (const CRhRdkDocument &rdkDoc, const UUID &uuidNewType, bool bHarvest)
virtual  | ~CRhRdkContentCreatorNew ()
 Public Member Functions inherited from CRhRdkContentCreator
CRhRdkContentCreator (const CRhRdkDocument &rdkDoc)
virtual  | ~CRhRdkContentCreator ()
const CRhRdkContent *  | AddContent (const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
bool  | AddContent (OUT CRhRdkContentArray &aContent, const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
virtual_su bool  | AutoEditChild (void) const
const CRhRdkContent *  | ChangeContentType (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
const CRhRdkContent *  | ChangeContentTypeEx (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild, unsigned int ic_flags) const
const wchar_t *  | ErrorString (void) const
const CRhRdkContent *  | FindChildAddOrChange (const CRhRdkContent &parentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
UUID  | TypeIdFromFilename (const wchar_t *wszFilename, unsigned int uAcceptable) const
 Protected Member Functions inherited from CRhRdkContentCreatorNew
void  | AppendCreator (const class CCreator &c)
void  | AppendType (const UUID uuidType)
virtual bool  | CreateNewContent (CRhRdkContentArrayNC &aContentOut, const CRhRdkContent *pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName) const override
bool  | Harvest (void) const
virtual bool  | IsCopy (void) const override
virtual const CRhRdkContentArray *  | OriginalContent (void) const override
 Protected Member Functions inherited from CRhRdkContentCreator
virtual void *  | EVF (const wchar_t *, void *) override
const CRhRdkDocument *  | RdkDocument (void) const
void  | SetErrorString (const wchar_t *wsz) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
kAcceptBitmap
kAcceptSimpleBitmap
kAcceptHDR
kAcceptAll
Constructor & Destructor Documentation
◆ CRhRdkContentCreatorNewFileTexture()
 CRhRdkContentCreatorNewFileTexture::CRhRdkContentCreatorNewFileTexture  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  const wchar_t *  |  wszFilename,
|  unsigned int  |  uAcceptable = kAcceptAll
)
◆ ~CRhRdkContentCreatorNewFileTexture()
 virtual CRhRdkContentCreatorNewFileTexture::~CRhRdkContentCreatorNewFileTexture  |  ( |   | )
virtual
Member Function Documentation
◆ SetUpDefaults()
 virtual bool CRhRdkContentCreatorNewFileTexture::SetUpDefaults  |  ( |  CRhRdkContent *  |  pContent,
|  const CRhRdkContent *  |  pOldContent
) |   |  const
overridevirtual
Reimplemented from CRhRdkContentCreatorNew.
◆ TypeIdFromFilename()
 UUID CRhRdkContentCreatorNewFileTexture::TypeIdFromFilename  |  ( |  const wchar_t *  |  wszFilename,
|  unsigned int  |  uAcceptable
) |   |  const
protected