Public Types | List of all members
CRhinoExtend Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Types
enum  | Type { Line, Arc, Smooth, Natural }
Member Enumeration Documentation
◆ Type
 enum CRhinoExtend::Type
Enumerator
Line
Arc
Smooth
Natural
Line for linear curves, Arc for arcs, and Smooth for others.