Static Public Member Functions | Static Public Attributes | List of all members
ON_NumberFormatter Class Reference
OpenNURBS
ON_Table class. More...
#include <opennurbs_dimensionformat.h>
 Static Public Member Functions
static bool  | FormatAngleStringDecimal (double angle_radians, int resolution, double roundoff, ON_DimStyle::suppress_zero zero_suppression, ON_wString &formatted_string)
static bool  | FormatAngleStringDMS (double angle_degrees, ON_wString &formatted_string)
static bool  | FormatAngleStringDMS (double angle_radians, int resolution, ON_wString &formatted_string)
static bool  | FormatLength (double distance, ON_DimStyle::LengthDisplay output_lengthdisplay, double round_off, int resolution, ON_DimStyle::suppress_zero zero_suppress, bool bracket_fractions, ON_wString &output)
static bool  | FormatNumber (double distance, ON_DimStyle::OBSOLETE_length_format output_lengthformat, double round_off, int resolution, ON_DimStyle::suppress_zero zero_suppress, bool bracket_fractions, ON_wString &output)
static void  | Fraction (double value, int &wholenumber, int &numerator, int &denominator, int precision)
static double  | RoundOff (double number, double round_off)
static void  | SuppressZeros (ON_wString &dist, ON_DimStyle::suppress_zero sz)
 Static Public Attributes
static bool  | bFormatIsAccurate
Detailed Description
ON_Table class.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Function Documentation
◆ FormatAngleStringDecimal()
 static bool ON_NumberFormatter::FormatAngleStringDecimal  |  ( |  double  |  angle_radians,
|  int  |  resolution,
|  double  |  roundoff,
|  ON_DimStyle::suppress_zero  |  zero_suppression,
|  ON_wString &  |  formatted_string
)
static
◆ FormatAngleStringDMS() [1/2]
 static bool ON_NumberFormatter::FormatAngleStringDMS  |  ( |  double  |  angle_degrees,
|  ON_wString &  |  formatted_string
)
static
◆ FormatAngleStringDMS() [2/2]
 static bool ON_NumberFormatter::FormatAngleStringDMS  |  ( |  double  |  angle_radians,
|  int  |  resolution,
|  ON_wString &  |  formatted_string
)
static
◆ FormatLength()
 static bool ON_NumberFormatter::FormatLength  |  ( |  double  |  distance,
|  ON_DimStyle::LengthDisplay  |  output_lengthdisplay,
|  double  |  round_off,
|  int  |  resolution,
|  ON_DimStyle::suppress_zero  |  zero_suppress,
|  bool  |  bracket_fractions,
|  ON_wString &  |  output
)
static
When FormatNumber() or FormatLength() is called with output_lengthformat == ON_DimStyle::LengthDisplay::FeetAndInches distance must be in decimal feet units to get the right answer.
◆ FormatNumber()
 static bool ON_NumberFormatter::FormatNumber  |  ( |  double  |  distance,
|  ON_DimStyle::OBSOLETE_length_format  |  output_lengthformat,
|  double  |  round_off,
|  int  |  resolution,
|  ON_DimStyle::suppress_zero  |  zero_suppress,
|  bool  |  bracket_fractions,
|  ON_wString &  |  output
)
static
When FormatNumber() or FormatLength() is called with output_lengthformat == ON_DimStyle::OBSOLETE_length_format::FeetInches distance must be in decimal feet units to get the right answer.
Parameters
output_lengthformat | dec, frac, ft-in
◆ Fraction()
 static void ON_NumberFormatter::Fraction  |  ( |  double  |  value,
|  int &  |  wholenumber,
|  int &  |  numerator,
|  int &  |  denominator,
|  int  |  precision
)
static
◆ RoundOff()
 static double ON_NumberFormatter::RoundOff  |  ( |  double  |  number,
|  double  |  round_off
)
static
◆ SuppressZeros()
 static void ON_NumberFormatter::SuppressZeros  |  ( |  ON_wString &  |  dist,
|  ON_DimStyle::suppress_zero  |  sz
)
static
Member Data Documentation
◆ bFormatIsAccurate
 bool ON_NumberFormatter::bFormatIsAccurate
static