Public Member Functions | Protected Attributes | List of all members
CRhinoUiStatic Class Reference
RhinoUI
CRhinoUiStatic. More...
#include <RhinoSdkUiStatic.h>
 Inheritance diagram for CRhinoUiStatic:
 Public Member Functions
CRhinoUiStatic ()
virtual  | ~CRhinoUiStatic ()
CString  | GetText ()
Returns the static window text. More...
afx_msg void  | OnPaint ()
void  | SetText (const char *lpsText)
Sets the static window text. More...
void  | SetText (const wchar_t *lpsText)
void  | SetTextIsFilePath (bool)
bool  | TextIsFilePath ()
 Protected Attributes
bool  | m_bIsFilePath
Detailed Description
CRhinoUiStatic.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiStatic()
 CRhinoUiStatic::CRhinoUiStatic  |  ( |   | )
◆ ~CRhinoUiStatic()
 virtual CRhinoUiStatic::~CRhinoUiStatic  |  ( |   | )
virtual
Member Function Documentation
◆ GetText()
 CString CRhinoUiStatic::GetText  |  ( |   | )
Returns the static window text.
◆ OnPaint()
 afx_msg void CRhinoUiStatic::OnPaint  |  ( |   | )
◆ SetText() [1/2]
 void CRhinoUiStatic::SetText  |  ( |  const char *  |  lpsText | )
Sets the static window text.
◆ SetText() [2/2]
 void CRhinoUiStatic::SetText  |  ( |  const wchar_t *  |  lpsText | )
◆ SetTextIsFilePath()
 void CRhinoUiStatic::SetTextIsFilePath  |  ( |  bool  |   | )
◆ TextIsFilePath()
 bool CRhinoUiStatic::TextIsFilePath  |  ( |   | )
Member Data Documentation
◆ m_bIsFilePath
 bool CRhinoUiStatic::m_bIsFilePath
protected