Public Member Functions | Protected Member Functions | List of all members
CRhRdkTextureFactory Class Referenceabstract
RDK
#include <RhRdkTextureFactory.h>
 Inheritance diagram for CRhRdkTextureFactory:
 Public Member Functions
CRhRdkTextureFactory ()
virtual  | ~CRhRdkTextureFactory ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual CRhRdkContent::Kinds  | Kind (void) const override
virtual CRhRdkContent *  | NewContent (void) const override
 Public Member Functions inherited from CRhRdkContentFactory
CRhRdkContentFactory ()
virtual  | ~CRhRdkContentFactory ()
virtual ON_wString  | ContentInternalName (void) const
virtual UUID  | ContentTypeId (void) const
virtual IRhRdkContentUIAgent *  | ContentUIAgent (void) const
virtual bool  | Initialize (void)
virtual UUID  | InterfaceId (void) const final override
virtual bool  | IsBuiltIn (void) const
virtual bool  | IsElevated (void) const
virtual bool  | IsKind (CRhRdkContent::Kinds kind) const
virtual_su CRhRdkContent *  | NewContent (bool bAutoGlobalRegister) const
virtual UUID  | PlugInId (void) const override
virtual void  | RebuildCache (void)
virtual UUID  | RenderEngineId (void) const
virtual void  | SetContentUIAgent (IRhRdkContentUIAgent *pAgent)
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual class CRhRdkTexture *  | NewTexture (void) const =0
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkTextureFactory()
 CRhRdkTextureFactory::CRhRdkTextureFactory  |  ( |   | )
◆ ~CRhRdkTextureFactory()
 virtual CRhRdkTextureFactory::~CRhRdkTextureFactory  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkTextureFactory::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkContentFactory.
◆ Kind()
 virtual CRhRdkContent::Kinds CRhRdkTextureFactory::Kind  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The kind of content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewContent()
 virtual CRhRdkContent* CRhRdkTextureFactory::NewContent  |  ( |  void  |   | ) |   const
overridevirtual
Create a new content.
Note
This should be implemented simply as
return new CMyContent(...);
 No further initialization or operations should be performed on the new content.
Returns
A pointer to a new instance of the content that this factory produces.
Implements CRhRdkContentFactory.
◆ NewTexture()
 virtual class CRhRdkTexture* CRhRdkTextureFactory::NewTexture  |  ( |  void  |   | ) |   const
protectedpure virtual