Public Member Functions | Public Attributes | List of all members
CRhRdkDocument::CTypeBrowserParams Class Referencefinal
#include <RhRdkDocument.h>
 Public Member Functions
CTypeBrowserParams ()
~CTypeBrowserParams ()
 Public Attributes
ON_ClassArray< ON_wString >  | m_aListCategories
ON_SimpleArray< ON_UUID >  | m_aListTypes
CRhRdkContentKindList  | m_AllowedKinds
unsigned int  | m_ccbuFlags
void *  | m_pReserved
ON_wString  | m_sPresetCategory
ON_UUID  | m_uuidDefaultInstance
ON_UUID  | m_uuidDefaultType
Detailed Description
Parameters for ShowContentNewExistingBrowser()
Constructor & Destructor Documentation
◆ CTypeBrowserParams()
 CRhRdkDocument::CTypeBrowserParams::CTypeBrowserParams  |  ( |   | )
◆ ~CTypeBrowserParams()
 CRhRdkDocument::CTypeBrowserParams::~CTypeBrowserParams  |  ( |   | )
Member Data Documentation
◆ m_aListCategories
 ON_ClassArray<ON_wString> CRhRdkDocument::CTypeBrowserParams::m_aListCategories
◆ m_aListTypes
 ON_SimpleArray<ON_UUID> CRhRdkDocument::CTypeBrowserParams::m_aListTypes
◆ m_AllowedKinds
 CRhRdkContentKindList CRhRdkDocument::CTypeBrowserParams::m_AllowedKinds
◆ m_ccbuFlags
 unsigned int CRhRdkDocument::CTypeBrowserParams::m_ccbuFlags
◆ m_pReserved
 void* CRhRdkDocument::CTypeBrowserParams::m_pReserved
◆ m_sPresetCategory
 ON_wString CRhRdkDocument::CTypeBrowserParams::m_sPresetCategory
◆ m_uuidDefaultInstance
 ON_UUID CRhRdkDocument::CTypeBrowserParams::m_uuidDefaultInstance
◆ m_uuidDefaultType
 ON_UUID CRhRdkDocument::CTypeBrowserParams::m_uuidDefaultType