Public Member Functions | List of all members
CRhWidgetThickerDottedDrawAttr Class Reference
Rhino
#include <rhinoSdkWidget.h>
 Inheritance diagram for CRhWidgetThickerDottedDrawAttr:
 Public Member Functions
CRhWidgetThickerDottedDrawAttr ()
 Public Member Functions inherited from CRhWidgetDrawAttr
CRhWidgetDrawAttr ()
 Additional Inherited Members
 Public Attributes inherited from CRhWidgetDrawAttr
ON_Color  | m_col
UINT  | m_pattern
int  | m_thickness
UUID  | m_uuid_object
Constructor & Destructor Documentation
◆ CRhWidgetThickerDottedDrawAttr()
 CRhWidgetThickerDottedDrawAttr::CRhWidgetThickerDottedDrawAttr  |  ( |   | )
inline