Public Member Functions | Protected Attributes | List of all members
CRhRdkContent::CChildSlotIterator Class Referenceabstract
#include <RhRdkContent.h>
 Inheritance diagram for CRhRdkContent::CChildSlotIterator:
 Public Member Functions
CChildSlotIterator (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CChildSlotIterator ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | NextChildSlot (ON_wString &sParamNameOut, ON_wString &sChildSlotNameOut, ON_wString &sDisplayNameOut)=0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Attributes
CRhRdkContent::CSIContext  | m_Context
const CRhRdkContent *  | m_pContent
ON__UINT_PTR  | m_reserved
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CChildSlotIterator()
 CRhRdkContent::CChildSlotIterator::CChildSlotIterator  |  ( |  const CRhRdkContent *  |  pContent,
|  CRhRdkContent::CSIContext  |  context
)
◆ ~CChildSlotIterator()
 virtual CRhRdkContent::CChildSlotIterator::~CChildSlotIterator  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkContent::CChildSlotIterator::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
◆ NextChildSlot()
 virtual bool CRhRdkContent::CChildSlotIterator::NextChildSlot  |  ( |  ON_wString &  |  sParamNameOut,
|  ON_wString &  |  sChildSlotNameOut,
|  ON_wString &  |  sDisplayNameOut
)
pure virtual
Retrieve information about the next child slot.
Parameters
sParamNameOut | Receives the internal name of the parameter that is associated with the child slot.
sChildSlotNameOut | Receives the name of the child slot.
sDisplayNameOut | Receives the display name of the child slot/parameter.
Returns
true if information was retrieved, false if no more child slots.
Implemented in CRhRdkTwoColorTextureBaseCSI, and CRhRdkOneColorTextureBaseCSI.
Member Data Documentation
◆ m_Context
 CRhRdkContent::CSIContext CRhRdkContent::CChildSlotIterator::m_Context
protected
◆ m_pContent
 const CRhRdkContent* CRhRdkContent::CChildSlotIterator::m_pContent
protected
◆ m_reserved
 ON__UINT_PTR CRhRdkContent::CChildSlotIterator::m_reserved
protected