Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_DepthImagePointShader Class Reference
OpenNURBS
#include <opennurbs_plus_idimage.h>
 Public Member Functions
ON_DepthImagePointShader ()
 Static Public Member Functions
static bool  | DefaultShadePixel (void *context, ON__UINT_PTR id, double depth, const class ON_DepthImagePixel *pixel)
 Public Attributes
void *  | m_context
first parameter passed to m_function More...
bool(*  | m_shade_pixel_function )(void *, ON__UINT_PTR, double, const class ON_DepthImagePixel *)
 Static Public Attributes
static const ON_DepthImagePointShader  | Default
Detailed Description
Description: ON_DepthImageShader is used to pass a shader function and context to ON_DepthImage drawing tools.
Constructor & Destructor Documentation
◆ ON_DepthImagePointShader()
 ON_DepthImagePointShader::ON_DepthImagePointShader  |  ( |   | )
Member Function Documentation
◆ DefaultShadePixel()
 static bool ON_DepthImagePointShader::DefaultShadePixel  |  ( |  void *  |  context,
|  ON__UINT_PTR  |  id,
|  double  |  depth,
|  const class ON_DepthImagePixel *  |  pixel
)
static
Description: When m_context points to a ON_DepthImageDefaultShaderContext class, the DefaultShadePixel function can be used as the m_shade_pixel_function.
Member Data Documentation
◆ Default
 const ON_DepthImagePointShader ON_DepthImagePointShader::Default
static
◆ m_context
 void* ON_DepthImagePointShader::m_context
first parameter passed to m_function
◆ m_shade_pixel_function
 bool(* ON_DepthImagePointShader::m_shade_pixel_function) (void *, ON__UINT_PTR, double, const class ON_DepthImagePixel *)