Public Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiRegistryEnumValue Class Reference
RhinoUI
#include <RhinoSdkUiRegistry.h>
 Public Member Functions
CRhinoUiRegistryEnumValue ()
CRhinoUiRegistryEnumValue (const CRhinoUiRegistryEnumValue &)
~CRhinoUiRegistryEnumValue ()
operator DWORD () const
operator LPCTSTR () const
CRhinoUiRegistryEnumValue &  | operator= (const CRhinoUiRegistryEnumValue &)
const LPBYTE  | Value () const
const DWORD  | ValueLength () const
LPCTSTR  | ValueName () const
DWORD  | ValueType () const
 Protected Attributes
DWORD  | m_nDataLen
DWORD  | m_nValueType
LPBYTE  | m_pData
CString  | m_sValueName
 Friends
class  | CRhinoUiRegistry
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// class CRhinoUiRegistry
Constructor & Destructor Documentation
◆ CRhinoUiRegistryEnumValue() [1/2]
 CRhinoUiRegistryEnumValue::CRhinoUiRegistryEnumValue  |  ( |   | )
◆ CRhinoUiRegistryEnumValue() [2/2]
 CRhinoUiRegistryEnumValue::CRhinoUiRegistryEnumValue  |  ( |  const CRhinoUiRegistryEnumValue &  |   | )
◆ ~CRhinoUiRegistryEnumValue()
 CRhinoUiRegistryEnumValue::~CRhinoUiRegistryEnumValue  |  ( |   | )
Member Function Documentation
◆ operator DWORD()
 CRhinoUiRegistryEnumValue::operator DWORD  |  ( |   | ) |   const
◆ operator LPCTSTR()
 CRhinoUiRegistryEnumValue::operator LPCTSTR  |  ( |   | ) |   const
◆ operator=()
 CRhinoUiRegistryEnumValue& CRhinoUiRegistryEnumValue::operator=  |  ( |  const CRhinoUiRegistryEnumValue &  |   | )
◆ Value()
 const LPBYTE CRhinoUiRegistryEnumValue::Value  |  ( |   | ) |   const
◆ ValueLength()
 const DWORD CRhinoUiRegistryEnumValue::ValueLength  |  ( |   | ) |   const
◆ ValueName()
 LPCTSTR CRhinoUiRegistryEnumValue::ValueName  |  ( |   | ) |   const
◆ ValueType()
 DWORD CRhinoUiRegistryEnumValue::ValueType  |  ( |   | ) |   const
Extractected from MSDN Platform SDK: Windows System Information
Registry Value Types
Value Meaning
REG_BINARY Binary data in any form.
REG_DWORD A 32-bit number.
REG_DWORD_LITTLE_ENDIAN A 32-bit number in little-endian format. Microsoft® Windows® is designed to run on little-endian computer architectures. Therefore, this value is defined as REG_DWORD in
the Windows header files.
REG_DWORD_BIG_ENDIAN A 32-bit number in big-endian format.
Some UNIX systems support big-endian architectures.
REG_EXPAND_SZ Null-terminated string that contains unexpanded references to environment variables (for example, "%PATH%"). It will be a Unicode or ANSI string depending on whether you use the Unicode or ANSI functions. To expand the environment variable references, use the
ExpandEnvironmentStrings function.
REG_LINK Reserved for system use.
REG_MULTI_SZ Array of null-terminated strings, terminated by two null characters.
REG_NONE No defined value type.
REG_QWORD A 64-bit number.
REG_QWORD_LITTLE_ENDIAN A 64-bit number in little-endian format. Windows is designed to run on little-endian computer architectures. Therefore, this value is defined as REG_QWORD in the Windows header
files.
REG_SZ Null-terminated string. It will be a Unicode or ANSI string, depending
on whether you use the Unicode or ANSI functions.
Friends And Related Function Documentation
◆ CRhinoUiRegistry
 friend class CRhinoUiRegistry
friend
Member Data Documentation
◆ m_nDataLen
 DWORD CRhinoUiRegistryEnumValue::m_nDataLen
protected
◆ m_nValueType
 DWORD CRhinoUiRegistryEnumValue::m_nValueType
protected
◆ m_pData
 LPBYTE CRhinoUiRegistryEnumValue::m_pData
protected
◆ m_sValueName
 CString CRhinoUiRegistryEnumValue::m_sValueName
protected