Public Attributes | List of all members
CRhinoObjectAnalysisModeChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
bool  | m_analysis_mode_enabled
ON_UUID  | m_analysis_mode_id
The id of the analysis mode. More...
unsigned int  | m_rhino_doc_sn
The document runtime serial number. More...
ON_UUID  | m_rhino_object_id
The id of the Rhino object that changed. More...
Member Data Documentation
◆ m_analysis_mode_enabled
 bool CRhinoObjectAnalysisModeChanged::CParameters::m_analysis_mode_enabled
True if the analysis mode was enabled, or false if the analysis mode was disabled.
◆ m_analysis_mode_id
 ON_UUID CRhinoObjectAnalysisModeChanged::CParameters::m_analysis_mode_id
The id of the analysis mode.
◆ m_rhino_doc_sn
 unsigned int CRhinoObjectAnalysisModeChanged::CParameters::m_rhino_doc_sn
The document runtime serial number.
◆ m_rhino_object_id
 ON_UUID CRhinoObjectAnalysisModeChanged::CParameters::m_rhino_object_id
The id of the Rhino object that changed.