Public Member Functions | Public Attributes | List of all members
ON_PolynomialSurface Class Reference
OpenNURBS
#include <opennurbs_bezier.h>
 Public Member Functions
ON_PolynomialSurface ()
ON_PolynomialSurface (const ON_BezierSurface &)
ON_PolynomialSurface (const ON_PolynomialSurface &)
ON_PolynomialSurface (int, bool, int, int)
~ON_PolynomialSurface ()
bool  | Create (int, bool, int, int)
void  | Destroy ()
bool  | Evaluate (double s, double t, int der_count, int v_stride, double *v) const
ON_PolynomialSurface &  | operator= (const ON_BezierSurface &)
ON_PolynomialSurface &  | operator= (const ON_PolynomialSurface &)
 Public Attributes
ON_4dPointArray  | m_cv
int  | m_dim
1,2, or 3 More...
ON_Interval  | m_domain [2]
int  | m_is_rat
1 if rational, 0 if not rational More...
int  | m_order [2]
Constructor & Destructor Documentation
◆ ON_PolynomialSurface() [1/4]
 ON_PolynomialSurface::ON_PolynomialSurface  |  ( |   | )
◆ ON_PolynomialSurface() [2/4]
 ON_PolynomialSurface::ON_PolynomialSurface  |  ( |  int  |  ,
|  bool  |  ,
|  int  |  ,
|  int
)
◆ ~ON_PolynomialSurface()
 ON_PolynomialSurface::~ON_PolynomialSurface  |  ( |   | )
◆ ON_PolynomialSurface() [3/4]
 ON_PolynomialSurface::ON_PolynomialSurface  |  ( |  const ON_PolynomialSurface &  |   | )
◆ ON_PolynomialSurface() [4/4]
 ON_PolynomialSurface::ON_PolynomialSurface  |  ( |  const ON_BezierSurface &  |   | )
Member Function Documentation
◆ Create()
 bool ON_PolynomialSurface::Create  |  ( |  int  |  ,
|  bool  |  ,
|  int  |  ,
|  int
)
◆ Destroy()
 void ON_PolynomialSurface::Destroy  |  ( |   | )
◆ Evaluate()
 bool ON_PolynomialSurface::Evaluate  |  ( |  double  |  s,
|  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v
) |   |  const
Parameters
s | returns false if unable to evaluate
t | evaluation parameter
der_count | number of derivatives (>=0)
v_stride | array stride (>=Dimension())
v | array of length stride*(ndir+1)*(ndir+2)/2
◆ operator=() [1/2]
 ON_PolynomialSurface& ON_PolynomialSurface::operator=  |  ( |  const ON_BezierSurface &  |   | )
◆ operator=() [2/2]
 ON_PolynomialSurface& ON_PolynomialSurface::operator=  |  ( |  const ON_PolynomialSurface &  |   | )
Member Data Documentation
◆ m_cv
 ON_4dPointArray ON_PolynomialSurface::m_cv
coefficients ( m_C.Length() = m_order[0]*m_order[1] coefficient of s^m*t^n = m_cv[m_order[1]*m+n]
◆ m_dim
 int ON_PolynomialSurface::m_dim
1,2, or 3
◆ m_domain
 ON_Interval ON_PolynomialSurface::m_domain[2]
◆ m_is_rat
 int ON_PolynomialSurface::m_is_rat
1 if rational, 0 if not rational
◆ m_order
 int ON_PolynomialSurface::m_order[2]