Classes | Public Member Functions | Public Attributes | List of all members
CRhinoWidgetGeometry::CSweep Class Reference
< Sweep info for ellipsoid and cylindrical drawing. More...
#include <rhinoSdkWidget.h>
 Classes
struct  | CAngles
< In radians. More...
 Public Member Functions
CSweep ()
 Public Attributes
struct CRhinoWidgetGeometry::CSweep::CAngles  | angles
int  | iHighlightLatMod
Modulus for highlighting lines of latitude (e.g., 'off'=0, 'every'=1, 'every other'=2). More...
int  | iHighlightLonMod
Modulus for highlighting lines of longitude (e.g., 'off'=0, 'every'=1, 'every other'=2). More...
int  | iNumLat
Number of lines of latitude. More...
int  | iNumLon
Number of lines of longitude. More...
Detailed Description
< Sweep info for ellipsoid and cylindrical drawing.
Constructor & Destructor Documentation
◆ CSweep()
 CRhinoWidgetGeometry::CSweep::CSweep  |  ( |   | )
Member Data Documentation
◆ angles
 struct CRhinoWidgetGeometry::CSweep::CAngles CRhinoWidgetGeometry::CSweep::angles
◆ iHighlightLatMod
 int CRhinoWidgetGeometry::CSweep::iHighlightLatMod
Modulus for highlighting lines of latitude (e.g., 'off'=0, 'every'=1, 'every other'=2).
◆ iHighlightLonMod
 int CRhinoWidgetGeometry::CSweep::iHighlightLonMod
Modulus for highlighting lines of longitude (e.g., 'off'=0, 'every'=1, 'every other'=2).
◆ iNumLat
 int CRhinoWidgetGeometry::CSweep::iNumLat
Number of lines of latitude.
◆ iNumLon
 int CRhinoWidgetGeometry::CSweep::iNumLon
Number of lines of longitude.