Public Attributes | List of all members
CRhRdkInternalCurveGraphEvaluatorData Class Reference
RDK
#include <RhRdkCurveGraph.h>
 Public Attributes
ON_ClassArray< ON_SimpleArray< ON_2fPoint > >  | m_points
ON_ClassArray< ON_SimpleArray< ON_4fPoint > >  | m_segments
Member Data Documentation
◆ m_points
 ON_ClassArray<ON_SimpleArray<ON_2fPoint> > CRhRdkInternalCurveGraphEvaluatorData::m_points
◆ m_segments
 ON_ClassArray<ON_SimpleArray<ON_4fPoint> > CRhRdkInternalCurveGraphEvaluatorData::m_segments