Public Attributes | List of all members
ON_SquishConstraints Class Reference
OpenNURBS
#include <opennurbs_plus_squish.h>
 Public Attributes
ON_SimpleArray< ON_2dex >  | m_constrained_vertices
ON_SimpleArray< ON_SquishConstraint >  | m_constraints
Member Data Documentation
◆ m_constrained_vertices
 ON_SimpleArray<ON_2dex> ON_SquishConstraints::m_constrained_vertices
m_constrained_vertices[] is a list that specifies mesh vertices and the constraint. The ON_2dex.i value is a mesh.m_V[] index and the ON_2dex.j value m_constraints[] index.
◆ m_constraints
 ON_SimpleArray<ON_SquishConstraint> ON_SquishConstraints::m_constraints
m_constraints[] is a list of various constraints you want to apply to some of the mesh's vertices.