Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_ComponentIndexAndNumber Class Reference
OpenNURBS
#include <opennurbs_defines.h>
 Public Member Functions
ON_ComponentIndexAndNumber ()=default
ON_ComponentIndexAndNumber (const ON_ComponentIndexAndNumber &)=default
~ON_ComponentIndexAndNumber ()=default
const ON_COMPONENT_INDEX  | Component () const
double  | Number () const
ON_ComponentIndexAndNumber &  | operator= (const ON_ComponentIndexAndNumber &)=default
void  | SetComponent (ON_COMPONENT_INDEX ci)
void  | SetNumber (double x)
 Static Public Member Functions
static int  | CompareComponent (const ON_ComponentIndexAndNumber *a, const ON_ComponentIndexAndNumber *b)
static int  | CompareComponentAndNumber (const ON_ComponentIndexAndNumber *a, const ON_ComponentIndexAndNumber *b)
static int  | CompareNumber (const ON_ComponentIndexAndNumber *a, const ON_ComponentIndexAndNumber *b)
static const ON_ComponentIndexAndNumber  | Create (ON_COMPONENT_INDEX ci, double x)
 Public Attributes
ON_COMPONENT_INDEX  | m_ci = ON_COMPONENT_INDEX::UnsetComponentIndex
double  | m_x = ON_DBL_QNAN
 Static Public Attributes
static const ON_ComponentIndexAndNumber  | UnsetAndNan
static const ON_ComponentIndexAndNumber  | UnsetAndZero
Constructor & Destructor Documentation
◆ ON_ComponentIndexAndNumber() [1/2]
 ON_ComponentIndexAndNumber::ON_ComponentIndexAndNumber  |  ( |   | )
default
◆ ~ON_ComponentIndexAndNumber()
 ON_ComponentIndexAndNumber::~ON_ComponentIndexAndNumber  |  ( |   | )
default
◆ ON_ComponentIndexAndNumber() [2/2]
 ON_ComponentIndexAndNumber::ON_ComponentIndexAndNumber  |  ( |  const ON_ComponentIndexAndNumber &  |   | )
default
Member Function Documentation
◆ CompareComponent()
 static int ON_ComponentIndexAndNumber::CompareComponent  |  ( |  const ON_ComponentIndexAndNumber *  |  a,
|  const ON_ComponentIndexAndNumber *  |  b
)
static
Description: Compare Component() using ON_COMPONENT_INDEX::Compare().
◆ CompareComponentAndNumber()
 static int ON_ComponentIndexAndNumber::CompareComponentAndNumber  |  ( |  const ON_ComponentIndexAndNumber *  |  a,
|  const ON_ComponentIndexAndNumber *  |  b
)
static
Description: Dictionary compare Component() 1st and Number() 2nd.
◆ CompareNumber()
 static int ON_ComponentIndexAndNumber::CompareNumber  |  ( |  const ON_ComponentIndexAndNumber *  |  a,
|  const ON_ComponentIndexAndNumber *  |  b
)
static
Description: Compare Number() nans are treated as equal and sort last.
◆ Component()
 const ON_COMPONENT_INDEX ON_ComponentIndexAndNumber::Component  |  ( |   | ) |   const
◆ Create()
 static const ON_ComponentIndexAndNumber ON_ComponentIndexAndNumber::Create  |  ( |  ON_COMPONENT_INDEX  |  ci,
|  double  |  x
)
static
◆ Number()
 double ON_ComponentIndexAndNumber::Number  |  ( |   | ) |   const
◆ operator=()
 ON_ComponentIndexAndNumber& ON_ComponentIndexAndNumber::operator=  |  ( |  const ON_ComponentIndexAndNumber &  |   | )
default
◆ SetComponent()
 void ON_ComponentIndexAndNumber::SetComponent  |  ( |  ON_COMPONENT_INDEX  |  ci | )
◆ SetNumber()
 void ON_ComponentIndexAndNumber::SetNumber  |  ( |  double  |  x | )
Member Data Documentation
◆ m_ci
 ON_COMPONENT_INDEX ON_ComponentIndexAndNumber::m_ci = ON_COMPONENT_INDEX::UnsetComponentIndex
◆ m_x
 double ON_ComponentIndexAndNumber::m_x = ON_DBL_QNAN
◆ UnsetAndNan
 const ON_ComponentIndexAndNumber ON_ComponentIndexAndNumber::UnsetAndNan
static
◆ UnsetAndZero
 const ON_ComponentIndexAndNumber ON_ComponentIndexAndNumber::UnsetAndZero
static