Public Member Functions | Protected Member Functions | List of all members
CRhinoOnDocUserStringChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Member Functions
CParameters (class CRhinoOnDocUserStringChangedPrivate *privatePrarmeters)
~CParameters ()
CRhinoDoc *  | Document () const
const wchar_t *  | Key () const
 Protected Member Functions
CParameters (const CParameters &)=delete
CParameters &  | operator= (const CParameters &)=delete
Constructor & Destructor Documentation
◆ CParameters() [1/2]
 CRhinoOnDocUserStringChanged::CParameters::CParameters  |  ( |  class CRhinoOnDocUserStringChangedPrivate *  |  privatePrarmeters | )
◆ ~CParameters()
 CRhinoOnDocUserStringChanged::CParameters::~CParameters  |  ( |   | )
◆ CParameters() [2/2]
 CRhinoOnDocUserStringChanged::CParameters::CParameters  |  ( |  const CParameters &  |   | )
protecteddelete
Member Function Documentation
◆ Document()
 CRhinoDoc* CRhinoOnDocUserStringChanged::CParameters::Document  |  ( |   | ) |   const
◆ Key()
 const wchar_t* CRhinoOnDocUserStringChanged::CParameters::Key  |  ( |   | ) |   const
◆ operator=()
 CParameters& CRhinoOnDocUserStringChanged::CParameters::operator=  |  ( |  const CParameters &  |   | )
protecteddelete