Public Member Functions | List of all members
CArgsRhinoGetTubeExtra Class Reference
RhinoGet
#include <rhinoSdkGetCylinder.h>
 Inheritance diagram for CArgsRhinoGetTubeExtra:
 Public Member Functions
CArgsRhinoGetTubeExtra ()
CArgsRhinoGetTubeExtra (const CArgsRhinoGetTube &)
CArgsRhinoGetTubeExtra (const CArgsRhinoGetTubeExtra &)
~CArgsRhinoGetTubeExtra ()
CArgsRhinoGetTubeExtra &  | operator= (const CArgsRhinoGetTubeExtra &)
const bool  | PromptForThickness () const
Get the m_bPromptForThickness value. More...
const double  | SecondRadius () const
Get the m_dSecondRadius value. More...
const wchar_t *  | SecondRadiusPrompt () const
Get the SecondRadius prompt. More...
void  | SetPromptForThickness (bool)
Set the m_bPromptForThickness value. More...
void  | SetSecondRadius (double)
Set the m_dSecondRadius value. More...
void  | SetSecondRadiusPrompt (const wchar_t *)
Set the SecondRadius prompt. More...
void  | SetTConeDefaultPrompts ()
void  | SetThickness (double)
Set the m_Thickness value. More...
void  | SetThicknessPrompt (const wchar_t *)
Set the Thickness prompt. More...
const double  | Thickness () const
Get the m_Thickness value. More...
const wchar_t *  | ThicknessPrompt () const
Get the Thickness prompt. More...
 Public Member Functions inherited from CArgsRhinoGetCylinderExtra
CArgsRhinoGetCylinderExtra ()
CArgsRhinoGetCylinderExtra (const CArgsRhinoGetCylinder &)
CArgsRhinoGetCylinderExtra (const CArgsRhinoGetCylinderExtra &)
~CArgsRhinoGetCylinderExtra ()
const bool  | BothSides () const
Get the m_bBothSides value. More...
const CRhinoCommandOptionName &  | BothSidesPrompt () const
Get the BothSides prompt. More...
unsigned int  | CapFaceStyle ()
std::function< void(const ON_Cylinder &)>  | DynamicCylinderCallback () const
const double  | Height () const
Get the m_Height value. More...
CArgsRhinoGetCylinderExtra &  | operator= (const CArgsRhinoGetCylinder &)
CArgsRhinoGetCylinderExtra &  | operator= (const CArgsRhinoGetCylinderExtra &)
void  | SetBothSides (bool)
Set the m_bBothSides value. More...
void  | SetBothSidesPrompt (const CRhinoCommandOptionName &prompt)
Set the BothSides prompt. More...
void  | SetCapFaceStyle (unsigned int)
0 means do not prompt, 3 for triangle, 4 for quads More...
void  | SetDynamicCylinderCallback (std::function< void(const ON_Cylinder &)> callback)
void  | SetHeight (double)
Set the m_Height value. More...
const bool  | ShowHeight () const
Get the ShowHeight value. More...
 Public Member Functions inherited from CArgsRhinoGetCylinder
CArgsRhinoGetCylinder ()
CArgsRhinoGetCylinder (const CArgsRhinoGetCylinder &)
~CArgsRhinoGetCylinder ()
const wchar_t *  | HeightPrompt () const
CArgsRhinoGetCylinder &  | operator= (const CArgsRhinoGetCylinder &)
void  | SetHeightPrompt (const wchar_t *prompt)
 Public Member Functions inherited from CArgsRhinoGetCircle
CArgsRhinoGetCircle ()
CArgsRhinoGetCircle (const CArgsRhinoGetCircle &)
~CArgsRhinoGetCircle ()
BOOL32  | AllowDeformable () const
int  | ArgsType () const
return type of args class circle, cone, cylinder, sphere More...
int  | AroundDirectionCount () const
number of faces in the around direction More...
int  | AroundDirectionMinCount () const
const CRhinoCommandOptionName &  | AroundMeshDensityDirectionPrompt () const
prompt for number of faces in the around direction More...
int  | ConeCylConstraint () const
bool  | ConeCylOptionAvailable () const
double  | DefaultSize () const
BOOL32  | Deformable () const
int  | Degree () const
const ON_wString &  | DiameterPrompt () const
std::function< void(const ON_Circle &)>  | DynamicCircleCallback () const
BOOL32  | DynamicDrawSphere () const
void  | EnableConeCylOption (bool bAvailable=true)
void  | EnableDynamicDrawSphere (BOOL32 bDrawSphere=TRUE)
void  | EnableVerticalCircleOption (BOOL32 bAvailable=TRUE)
bool  | GetCap () const
eCircleResult  | GetCircleType ()
CArgsRhinoGetCircle &  | operator= (const CArgsRhinoGetCircle &)
const ON_Plane &  | Plane () const
const ON_3dPoint &  | Point0 () const
const ON_3dPoint &  | Point1 () const
const ON_3dPoint &  | Point2 () const
int  | PointCount () const
const ON_wString &  | Prompt0 () const
const ON_wString &  | Prompt1 () const
const ON_wString &  | Prompt2 () const
bool  | PromptForMeshDensity () const
const ON_wString &  | RadiusPrompt () const
void  | SetAllowDeformable (BOOL32 b=TRUE)
void  | SetAroundDirectionCount (int count)
void  | SetAroundDirectionMinCount (int count)
void  | SetAroundMeshDensityDirectionPrompt (const CRhinoCommandOptionName &prompt)
void  | SetCap (bool bCap=true)
void  | SetCircleType (eCircleResult mode)
void  | SetConeCylConstraint (int i=0)
void  | SetDefaultSize (double)
Set the default size to use - diameter or radius depending on m_bUseDiameter. More...
void  | SetDeformable (BOOL32 bDeformable=TRUE)
void  | SetDegree (int degree)
void  | SetDiameterPrompt (const wchar_t *)
Set a custom prompt to use for getting the diameter. More...
void  | SetDynamicCircleCallback (std::function< void(const ON_Circle &)> callback)
void  | SetPlane (const ON_Plane &)
Set a plane. More...
void  | SetPoint0 (const ON_3dPoint &)
Set the first point to use instead of asking for one. More...
void  | SetPoint1 (const ON_3dPoint &)
Set the second point to use instead of asking for one. More...
void  | SetPoint2 (const ON_3dPoint &point)
Set the third point to use instead of asking for one. More...
void  | SetPointCount (int count)
void  | SetPrompt0 (const wchar_t *)
Set a custom prompt to use for getting the first (center) point. More...
void  | SetPrompt1 (const wchar_t *)
Set a custom prompt to use for getting the second point. More...
void  | SetPrompt2 (const wchar_t *)
Set a custom prompt to use for getting third point. More...
void  | SetPromptForMeshDensity (bool bMeshDensity=true)
void  | SetRadiusPrompt (const wchar_t *)
Set a custom prompt to use for getting the radius. More...
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseDefaultSize (BOOL32=TRUE)
Use the default size when getting diameter/radius. More...
void  | SetUseDiameterMode (BOOL32=TRUE)
void  | SetUsePlane (BOOL32=TRUE)
Constrain the circle to a plane - Center/radius, 2point, 3point only. More...
void  | SetUsePoint0 (BOOL32=TRUE)
Use the first point and don't ask for one. More...
void  | SetUsePoint1 (BOOL32=TRUE)
Use the second point and don't ask for one. More...
void  | SetVerticalCircle (BOOL32 bSelected=TRUE)
void  | SetVerticalDirectionCount (int count)
void  | SetVerticalDirectionMinCount (int count)
void  | SetVerticalMeshDensityDirectionPrompt (const CRhinoCommandOptionName &prompt)
bool  | UseActiveLayerLinetype () const
BOOL32  | UseDefaultSize () const
BOOL32  | UseDiameterMode () const
BOOL32  | UsePlane () const
BOOL32  | UsePoint0 () const
BOOL32  | UsePoint1 () const
BOOL32  | VerticalCircle () const
BOOL32  | VerticalCircleOptionAvailable () const
int  | VerticalDirectionCount () const
number of faces in the vertical direction More...
int  | VerticalDirectionMinCount () const
const CRhinoCommandOptionName &  | VerticalMeshDensityDirectionPrompt () const
prompt for number of faces in the vertical direction More...
 Additional Inherited Members
 Public Types inherited from CArgsRhinoGetCircle
enum  | {
 circle_type, cylinder_type, cone_type, sphere_type,
 torus_type, sphere_type_ex, cylinder_type_ex, arc_type,
 mesh_sphere_type, cone_type_ex
 }
enum  | eCircleResult {
 nothing, center, twopt, threept,
 ttr, ttt, fitpoints, around,
 cancel, error
 }
Results of main Circle Command function. More...
 Protected Attributes inherited from CArgsRhinoGetCircle
BOOL32  | m_allow_deformable
display deformable prompt or not More...
int  | m_ArgsType
bool  | m_bCap = false
[io] Used when RhinoGetCircle is called by a primitive solid command like cylinder or cone More...
bool  | m_bConeCylAvailable
[i] TRUE if "Vertical" option is available and applies to VerticalConeCyl More...
BOOL32  | m_bDynamicDrawSphere
[i] More...
BOOL32  | m_bUseDefaultSize
[i] Defaultsize is valid More...
BOOL32  | m_bUseDiameterMode
[io] Get size in diameter mode instead of radius More...
BOOL32  | m_bUsePlane
[i] Constrain the circle to a plane More...
BOOL32  | m_bUsePoint0
[i] Use first (center) instead of asking for point More...
BOOL32  | m_bUsePoint1
[i] Use second instead of asking for point More...
BOOL32  | m_bVerticalCircle
[io] Make the circle axis parallel to the current construction plane More...
BOOL32  | m_bVerticalCircleAvailable
[i] TRUE if "Vertical" option is available and applies to VerticalCircle More...
int  | m_ConeCylConstraint
[io] 0 = none, 1 = vertical, 2 = aroundcurve More...
double  | m_defaultsize
[i] if( m_bUseDefaultSize) radius or diameter (center/radius, ttr, AroundCurve only) More...
BOOL32  | m_deformable
make circle deformable or not More...
int  | m_degree
deformable degree More...
std::function< void(const ON_Circle &)>  | m_dynamicCircleCallback
CRhinoCommandOptionName  | m_mesh_density_around_direction_prompt
int  | m_mesh_density_AroundDirection
int  | m_mesh_density_MinAroundDirection
int  | m_mesh_density_MinVerticalDirection
CRhinoCommandOptionName  | m_mesh_density_vertical_direction_prompt
int  | m_mesh_density_VerticalDirection
ON_Plane  | m_plane
[i] if( m_bUsePlane) constrain to this plane More...
ON_3dPoint  | m_point0
[i] if( m_bHavePoint0) first point specified here (center/radius, 2pt, 3pt only) More...
ON_3dPoint  | m_point1
[i] if( m_bHavePoint1) second point specified here (3pt only) More...
ON_3dPoint  | m_point2
[i] if( m_bHavePoint2) second point specified here (3pt only) More...
int  | m_point_count
deformable cv count More...
ON_wString  | m_prompt0
[i] Prompt for first or center point More...
ON_wString  | m_prompt1
[i] Prompt for second point More...
ON_wString  | m_prompt2
[i] Prompt for third point More...
ON_wString  | m_promptdiameter
[i] Prompt when getting size in diameter mode More...
bool  | m_PromptForMeshDensity
ON_wString  | m_promptradius
[i] Prompt when getting size in radius mode More...
eCircleResult  | m_result
[o] What mode was used More...
Constructor & Destructor Documentation
◆ CArgsRhinoGetTubeExtra() [1/3]
 CArgsRhinoGetTubeExtra::CArgsRhinoGetTubeExtra  |  ( |   | )
◆ ~CArgsRhinoGetTubeExtra()
 CArgsRhinoGetTubeExtra::~CArgsRhinoGetTubeExtra  |  ( |   | )
◆ CArgsRhinoGetTubeExtra() [2/3]
 CArgsRhinoGetTubeExtra::CArgsRhinoGetTubeExtra  |  ( |  const CArgsRhinoGetTubeExtra &  |   | )
◆ CArgsRhinoGetTubeExtra() [3/3]
 CArgsRhinoGetTubeExtra::CArgsRhinoGetTubeExtra  |  ( |  const CArgsRhinoGetTube &  |   | )
Member Function Documentation
◆ operator=()
 CArgsRhinoGetTubeExtra& CArgsRhinoGetTubeExtra::operator=  |  ( |  const CArgsRhinoGetTubeExtra &  |   | )
◆ PromptForThickness()
 const bool CArgsRhinoGetTubeExtra::PromptForThickness  |  ( |   | ) |   const
Get the m_bPromptForThickness value.
◆ SecondRadius()
 const double CArgsRhinoGetTubeExtra::SecondRadius  |  ( |   | ) |   const
Get the m_dSecondRadius value.
◆ SecondRadiusPrompt()
 const wchar_t* CArgsRhinoGetTubeExtra::SecondRadiusPrompt  |  ( |   | ) |   const
Get the SecondRadius prompt.
◆ SetPromptForThickness()
 void CArgsRhinoGetTubeExtra::SetPromptForThickness  |  ( |  bool  |   | )
Set the m_bPromptForThickness value.
◆ SetSecondRadius()
 void CArgsRhinoGetTubeExtra::SetSecondRadius  |  ( |  double  |   | )
Set the m_dSecondRadius value.
◆ SetSecondRadiusPrompt()
 void CArgsRhinoGetTubeExtra::SetSecondRadiusPrompt  |  ( |  const wchar_t *  |   | )
Set the SecondRadius prompt.
◆ SetTConeDefaultPrompts()
 void CArgsRhinoGetTubeExtra::SetTConeDefaultPrompts  |  ( |   | )
◆ SetThickness()
 void CArgsRhinoGetTubeExtra::SetThickness  |  ( |  double  |   | )
Set the m_Thickness value.
◆ SetThicknessPrompt()
 void CArgsRhinoGetTubeExtra::SetThicknessPrompt  |  ( |  const wchar_t *  |   | )
Set the Thickness prompt.
◆ Thickness()
 const double CArgsRhinoGetTubeExtra::Thickness  |  ( |   | ) |   const
Get the m_Thickness value.
◆ ThicknessPrompt()
 const wchar_t* CArgsRhinoGetTubeExtra::ThicknessPrompt  |  ( |   | ) |   const
Get the Thickness prompt.