Public Member Functions | Public Attributes | List of all members
CRhinoCommandOptionName Class Reference
Rhino
#include <rhinoSdkCommandOptionName.h>
 Public Member Functions
CRhinoCommandOptionName ()
Sets both string pointers to NULL. More...
CRhinoCommandOptionName (const wchar_t *english_option_name, const wchar_t *local_option_name)
 Public Attributes
const wchar_t *  | m_english_option_name
The default copy constructor, destructor, and operator= are sufficient. More...
const wchar_t *  | m_local_option_name
localized command option name (can be NULL if m_english_string is set) More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: CRhinoCommandOptionName classes are used to pass command option names, list option values, and toggle option values to CRhinoGet::AddCommandOption...(). Use the RHCMDOPTNAME() macro to quickly create these.
Constructor & Destructor Documentation
◆ CRhinoCommandOptionName() [1/2]
 CRhinoCommandOptionName::CRhinoCommandOptionName  |  ( |   | )
Sets both string pointers to NULL.
◆ CRhinoCommandOptionName() [2/2]
 CRhinoCommandOptionName::CRhinoCommandOptionName  |  ( |  const wchar_t *  |  english_option_name,
|  const wchar_t *  |  local_option_name
)
Sets m_english_option_name = english_option_name and m_local_option_name = local_option_name.
Member Data Documentation
◆ m_english_option_name
 const wchar_t* CRhinoCommandOptionName::m_english_option_name
The default copy constructor, destructor, and operator= are sufficient.
english command option name (can be NULL if m_local_string is set)
◆ m_local_option_name
 const wchar_t* CRhinoCommandOptionName::m_local_option_name
localized command option name (can be NULL if m_english_string is set)