Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoUiListBoxExBuddy Class Reference
RhinoUI
#include <RhinoSdkUiListBoxEx.h>
 Inheritance diagram for CRhinoUiListBoxExBuddy:
 Public Types
enum  | {
 bmp_width = 88, bmp_height = 20, bmp_btnwidth = 22, btn_new = 0,
 btn_del = 1, btn_up = 2, btn_down = 3, bmp_numbtn = 4,
 force_32bit_list_box_ex_buddy = 0xFFFFFFFF
 }
 Public Member Functions
CRhinoUiListBoxExBuddy (UINT nBitmapID)
virtual  | ~CRhinoUiListBoxExBuddy ()
void  | SetListBox (CRhinoUiListBoxEx *pListBox)
 Protected Member Functions
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnNcMouseMove (UINT nHitTest, CPoint point)
virtual BOOL32  | OnNotify (WPARAM wParam, LPARAM lParam, LRESULT *pResult)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | PreSubclassWindow ()
Detailed Description
CRhinoUiListBoxExBuddy
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
bmp_width
bmp_height
bmp_btnwidth
btn_new
btn_del
btn_up
btn_down
bmp_numbtn
force_32bit_list_box_ex_buddy
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiListBoxExBuddy()
 CRhinoUiListBoxExBuddy::CRhinoUiListBoxExBuddy  |  ( |  UINT  |  nBitmapID | )
◆ ~CRhinoUiListBoxExBuddy()
 virtual CRhinoUiListBoxExBuddy::~CRhinoUiListBoxExBuddy  |  ( |   | )
virtual
Member Function Documentation
◆ OnCreate()
 afx_msg int CRhinoUiListBoxExBuddy::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
◆ OnLButtonDown()
 afx_msg void CRhinoUiListBoxExBuddy::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnLButtonUp()
 afx_msg void CRhinoUiListBoxExBuddy::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnMouseMove()
 afx_msg void CRhinoUiListBoxExBuddy::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnNcMouseMove()
 afx_msg void CRhinoUiListBoxExBuddy::OnNcMouseMove  |  ( |  UINT  |  nHitTest,
|  CPoint  |  point
)
protected
◆ OnNotify()
 virtual BOOL32 CRhinoUiListBoxExBuddy::OnNotify  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  LRESULT *  |  pResult
)
protectedvirtual
◆ OnPaint()
 afx_msg void CRhinoUiListBoxExBuddy::OnPaint  |  ( |   | )
protected
◆ OnSize()
 afx_msg void CRhinoUiListBoxExBuddy::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ PreSubclassWindow()
 virtual void CRhinoUiListBoxExBuddy::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ SetListBox()
 void CRhinoUiListBoxExBuddy::SetListBox  |  ( |  CRhinoUiListBoxEx *  |  pListBox | )
inline