Public Member Functions | Protected Member Functions | List of all members
CRhRdkAutoUIContext Class Reference
RDK
#include <RhRdkAutomaticUI.h>
 Inheritance diagram for CRhRdkAutoUIContext:
 Public Member Functions
CRhRdkAutoUIContext (IAutoUIExtraRequirements *pExtraReqs)
virtual  | ~CRhRdkAutoUIContext ()
virtual CRhRdkAutoUIContext *  | Duplicate (void) const
virtual bool  | GetValue (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, CRhRdkVariant &vValueOut) const
virtual bool  | OnButtonClicked (const wchar_t *wszParamName, const wchar_t *wszButtonName) const
virtual bool  | SetValue (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, const CRhRdkVariant &vValue) const
virtual UUID  | TypeId (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
IAutoUIExtraRequirements *  | ExtraRequirements (void) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkAutoUIContext()
 CRhRdkAutoUIContext::CRhRdkAutoUIContext  |  ( |  IAutoUIExtraRequirements *  |  pExtraReqs | )
◆ ~CRhRdkAutoUIContext()
 virtual CRhRdkAutoUIContext::~CRhRdkAutoUIContext  |  ( |   | )
virtual
Member Function Documentation
◆ Duplicate()
 virtual CRhRdkAutoUIContext* CRhRdkAutoUIContext::Duplicate  |  ( |  void  |   | ) |   const
virtual
Reimplemented in CRhRdkExcludeListAutoUIContext.
◆ ExtraRequirements()
 IAutoUIExtraRequirements* CRhRdkAutoUIContext::ExtraRequirements  |  ( |  void  |   | ) |   const
protected
◆ GetValue()
 virtual bool CRhRdkAutoUIContext::GetValue  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszExtraReqName,
|  CRhRdkVariant &  |  vValueOut
) |   |  const
virtual
◆ OnButtonClicked()
 virtual bool CRhRdkAutoUIContext::OnButtonClicked  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszButtonName
) |   |  const
virtual
Reimplemented in CRhRdkExcludeListAutoUIContext.
◆ SetValue()
 virtual bool CRhRdkAutoUIContext::SetValue  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszExtraReqName,
|  const CRhRdkVariant &  |  vValue
) |   |  const
virtual
◆ TypeId()
 virtual UUID CRhRdkAutoUIContext::TypeId  |  ( |  void  |   | ) |   const
virtual
Reimplemented in CRhRdkExcludeListAutoUIContext.