Public Member Functions | Static Public Member Functions | List of all members
CRhRdkObject Class Reference
RDK
#include <RhRdkObject.h>
 Inheritance diagram for CRhRdkObject:
 Public Member Functions
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Base class for objects which are created by RDK but deleted by the client (or vice-versa). Overrides of new and delete allow you to delete such objects from your client DLL without any complications.
Constructor & Destructor Documentation
◆ CRhRdkObject()
 CRhRdkObject::CRhRdkObject  |  ( |   | )
◆ ~CRhRdkObject()
 virtual CRhRdkObject::~CRhRdkObject  |  ( |   | )
virtual
Member Function Documentation
◆ CheckMemory()
 static void CRhRdkObject::CheckMemory  |  ( |  void  |   | )
static
◆ EVF()
 virtual void* CRhRdkObject::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented in CRhRdkRenderPlugIn, CRhRdkTexture, CRhRdkPlugIn, CRhRdkPostEffectPlugIn, CRhRdkPostEffect, CRhRdkRenderWindowMainSidePaneTabFactory, CRhRdkMaterial, CRhRdkCoreContent, CRhRdkEnvironment, CRhRdkContentFactory, CRhRdkTextureFactory, CRhRdkContent, CRhRdkContent::CChildSlotIterator, CRhRdkRenderMesh, CRhRdkBasicMaterialCCI, CRhRdkBasicEnvironmentCCI, CRhRdkCompoundContentImplementor, CRhRdkCustomRenderMeshProvider, CRhRdkTextureEvaluator, CRhRdkImageAdjust, CRhRdkContentCreatorExisting, CRhRdkLightManagerSupport, CRhRdkContentIOPlugIn, CRhRdkSunStorage, CRhRdkContentCreator, and CRhRdkOneColorEvaluator.
◆ operator delete()
 void CRhRdkObject::operator delete  |  ( |  void *  |  buf | )
◆ operator delete[]()
 void CRhRdkObject::operator delete[]  |  ( |  void *  |  buf | )
◆ operator new()
 void* CRhRdkObject::operator new  |  ( |  size_t  |  size | )
◆ operator new[]()
 void* CRhRdkObject::operator new[]  |  ( |  size_t  |  size | )
◆ PopulateDebuggingInfo()
 static void CRhRdkObject::PopulateDebuggingInfo  |  ( |  void  |   | )
static
◆ ReportLeaksSinceCheckpoint()
 static void CRhRdkObject::ReportLeaksSinceCheckpoint  |  ( |  void  |   | )
static
Reports RDK objects that were created after the last SetLeakCheckpoint() call and are still alive, grouped by the call stack that created them. Call SetLeakCheckpoint() before an operation and this afterwards to see what that operation leaked. Both are callable from the debugger.
◆ SetLeakCheckpoint()
 static void CRhRdkObject::SetLeakCheckpoint  |  ( |  void  |   | )
static
Debugging aid for hunting leaks of RDK objects. Records which RDK objects exist at the moment of the call. Only does anything in a debug build with CHECK_MEMORY_LEAKS commented in; see RhRdkObject.cpp.