Public Types | Public Member Functions | Public Attributes | List of all members
CArgsRhinoMatch Class Reference
Rhino
CArgsRhinoMatch is obsolete. More...
#include <RhinoSdkMatch.h>
 Public Types
enum  | eMatchJoin { mjNone = 0, mjJoin = 1, mjMerge = 2 }
enum  | eMatchMode { smPosition = 0, smTangency = 1, smCurvature = 2 }
 Public Member Functions
CArgsRhinoMatch ()
~CArgsRhinoMatch ()
 Public Attributes
bool  | m_bAverage
change both curves by 1/2 each More...
bool  | m_bFlipDirection
Match opposite target direction. More...
bool  | m_bMatchPickPoint
Matching to a point on a curve (m_curvesin[1]) at m_trim_param. More...
bool  | m_bOneCurve
true if both ends of one curve are being matched More...
bool  | m_bPerpToEdge
Match curve perpendicular to surface edge. More...
eMatchMode  | m_continuity
ON_NurbsCurve *  | m_curvesin [2]
Nurbs form duplicates of the input curves. More...
ON_NurbsCurve *  | m_curvesout [2]
Result curves after the match. More...
eMatchJoin  | m_join
No operator= – curve pointers copied in assignment. More...
int  | m_preserve
double  | m_target_param
parameter on the curve to match More...
const ON_BrepTrim *  | m_trim
A brep trim for matching to a surface edge. More...
Detailed Description
CArgsRhinoMatch is obsolete.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ eMatchJoin
 enum CArgsRhinoMatch::eMatchJoin
Enumerator
mjNone
mjJoin
mjMerge
◆ eMatchMode
 enum CArgsRhinoMatch::eMatchMode
Enumerator
smPosition
smTangency
smCurvature
Constructor & Destructor Documentation
◆ CArgsRhinoMatch()
 CArgsRhinoMatch::CArgsRhinoMatch  |  ( |   | )
◆ ~CArgsRhinoMatch()
 CArgsRhinoMatch::~CArgsRhinoMatch  |  ( |   | )
Member Data Documentation
◆ m_bAverage
 bool CArgsRhinoMatch::m_bAverage
change both curves by 1/2 each
◆ m_bFlipDirection
 bool CArgsRhinoMatch::m_bFlipDirection
Match opposite target direction.
◆ m_bMatchPickPoint
 bool CArgsRhinoMatch::m_bMatchPickPoint
Matching to a point on a curve (m_curvesin[1]) at m_trim_param.
◆ m_bOneCurve
 bool CArgsRhinoMatch::m_bOneCurve
true if both ends of one curve are being matched
◆ m_bPerpToEdge
 bool CArgsRhinoMatch::m_bPerpToEdge
Match curve perpendicular to surface edge.
◆ m_continuity
 eMatchMode CArgsRhinoMatch::m_continuity
what geometry characteristics to match 0:position, 1:tangency, 2:curvature
◆ m_curvesin
 ON_NurbsCurve* CArgsRhinoMatch::m_curvesin[2]
Nurbs form duplicates of the input curves.
◆ m_curvesout
 ON_NurbsCurve* CArgsRhinoMatch::m_curvesout[2]
Result curves after the match.
◆ m_join
 eMatchJoin CArgsRhinoMatch::m_join
No operator= – curve pointers copied in assignment.
none, join, merge
◆ m_preserve
 int CArgsRhinoMatch::m_preserve
maintain shape of the edge opposite the one being edited 0 : nothing 1 : position 2 : tangency 3 : curvature
◆ m_target_param
 double CArgsRhinoMatch::m_target_param
parameter on the curve to match
◆ m_trim
 const ON_BrepTrim* CArgsRhinoMatch::m_trim
A brep trim for matching to a surface edge.