Public Member Functions | Public Attributes | List of all members
ON_TextRunBuilder Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Inheritance diagram for ON_TextRunBuilder:
 Public Member Functions
ON_TextRunBuilder (ON_TextContent &text, ON_TextRunArray &runs, const ON_DimStyle *dimstyle, double height, ON_Color color)
virtual  | ~ON_TextRunBuilder ()
bool  | AppendCodePoint (ON__UINT32 codept) override
void  | AppendCurrentRun ()
void  | BeginColorTable () override
void  | BeginFontTable () override
void  | BeginHeader () override
void  | Bold (const wchar_t *value) override
void  | ColorBackground (const wchar_t *value) override
void  | ColorBlue (const wchar_t *value) override
void  | ColorForeground (const wchar_t *value) override
void  | ColorGreen (const wchar_t *value) override
void  | ColorRed (const wchar_t *value) override
const ON_Font *  | CurrentFont () const
void  | DefaultFont (const wchar_t *value) override
void  | FinishCurrentRun ()
void  | FinishFontDef () override
void  | FlushText (size_t count, ON__UINT32 *cp_array) override
void  | FontSize (const wchar_t *value) override
void  | FontTag (const wchar_t *value) override
void  | FormatChange () override
void  | GroupBegin () override
void  | GroupEnd () override
void  | InitBuilder (const ON_Font *default_font) override
void  | Italic (const wchar_t *value) override
void  | ListBegin (bool isOrdered)
superclasses doesn't contain the next 4 methods to avoid virtual methods that break the SDK More...
void  | ListEnd ()
void  | ListItemBegin (int depth)
void  | ListItemEnd ()
void  | Newline () override
void  | NoSuperSub () override
void  | Paragraph () override
void  | ParagraphDefaults () override
void  | RunBegin () override
void  | RunEnd () override
void  | Section () override
void  | SetCurrentFont (const ON_Font *font)
void  | SetStackScale (const wchar_t *value) override
void  | StackEnd () override
void  | StackFraction (const wchar_t *value) override
void  | Strikethrough (const wchar_t *value) override
void  | Subscript () override
void  | Superscript () override
void  | Tab () override
void  | TextField (const wchar_t *name) override
void  | UnderlineOff () override
void  | UnderlineOn () override
void  | UniDest (const wchar_t *value) override
void  | UniEmbeddedDest (const wchar_t *value) override
 Public Member Functions inherited from ON_TextBuilder
ON_TextBuilder ()
virtual  | ~ON_TextBuilder ()
virtual void  | Bullet ()
virtual void  | CharSet (const wchar_t *value)
unsigned int  | CharSetFromMap (int nval)
virtual void  | CodePage (const wchar_t *value)
unsigned int  | CodePageFromMap (int nval)
virtual void  | EmDash ()
virtual void  | EnDash ()
const ON_wString  | FaceNameFromMap (int nval)
virtual void  | LDblQuote ()
virtual void  | LQuote ()
virtual void  | RDblQuote ()
virtual bool  | ReadingFontDefinition ()
virtual bool  | ReadingFontTable ()
virtual void  | RQuote ()
ON__UINT32 *  | RunCodePoints (const ON_TextRun &run)
virtual void  | SetReadingFontDefinition (bool b)
virtual void  | UniCpCount (const wchar_t *value)
virtual void  | UniDecimal (const wchar_t *value)
 Public Attributes
ON_TextRun  | m_current_run
ON_SimpleArray< const ON_Font * >  | m_font_stack
ON_TextRunArray &  | m_runs
ON_TextContent &  | m_text
 Public Attributes inherited from ON_TextBuilder
ON_SimpleArray< ON__UINT32 >  | m_current_codepoints
TextProps  | m_current_props
ON__UINT16  | m_current_UTF16_buffer [2]
ON__INT32  | m_current_UTF16_buffer_count = 0
ON__INT32  | m_default_font_index = 0
ON_ClassArray< ON_FaceNameKey >  | m_facename_map
ON__INT32  | m_font_index = 0
ON__INT32  | m_font_table_level = 10000
ON__INT32  | m_in_run
ON__INT32  | m_level = 0
ON_ClassArray< TextProps >  | m_prop_stack
 Additional Inherited Members
 Public Types inherited from ON_TextBuilder
enum  | : ON__UINT16 { m_UFT16_waiting_mark = 0xEEEE, m_UFT16_unused_mark = 0xFFFF }
Constructor & Destructor Documentation
◆ ON_TextRunBuilder()
 ON_TextRunBuilder::ON_TextRunBuilder  |  ( |  ON_TextContent &  |  text,
|  ON_TextRunArray &  |  runs,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  height,
|  ON_Color  |  color
)
◆ ~ON_TextRunBuilder()
 virtual ON_TextRunBuilder::~ON_TextRunBuilder  |  ( |   | )
virtual
Member Function Documentation
◆ AppendCodePoint()
 bool ON_TextRunBuilder::AppendCodePoint  |  ( |  ON__UINT32  |  codept | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ AppendCurrentRun()
 void ON_TextRunBuilder::AppendCurrentRun  |  ( |   | )
◆ BeginColorTable()
 void ON_TextRunBuilder::BeginColorTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginFontTable()
 void ON_TextRunBuilder::BeginFontTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginHeader()
 void ON_TextRunBuilder::BeginHeader  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Bold()
 void ON_TextRunBuilder::Bold  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorBackground()
 void ON_TextRunBuilder::ColorBackground  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorBlue()
 void ON_TextRunBuilder::ColorBlue  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorForeground()
 void ON_TextRunBuilder::ColorForeground  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorGreen()
 void ON_TextRunBuilder::ColorGreen  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorRed()
 void ON_TextRunBuilder::ColorRed  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ CurrentFont()
 const ON_Font* ON_TextRunBuilder::CurrentFont  |  ( |   | ) |   const
inline
Keep this as a simple one-liner that unconditionally returns m_private_current_font.
◆ DefaultFont()
 void ON_TextRunBuilder::DefaultFont  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FinishCurrentRun()
 void ON_TextRunBuilder::FinishCurrentRun  |  ( |   | )
◆ FinishFontDef()
 void ON_TextRunBuilder::FinishFontDef  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FlushText()
 void ON_TextRunBuilder::FlushText  |  ( |  size_t  |  count,
|  ON__UINT32 *  |  cp_array
)
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FontSize()
 void ON_TextRunBuilder::FontSize  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FontTag()
 void ON_TextRunBuilder::FontTag  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FormatChange()
 void ON_TextRunBuilder::FormatChange  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ GroupBegin()
 void ON_TextRunBuilder::GroupBegin  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ GroupEnd()
 void ON_TextRunBuilder::GroupEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ InitBuilder()
 void ON_TextRunBuilder::InitBuilder  |  ( |  const ON_Font *  |  default_font | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Italic()
 void ON_TextRunBuilder::Italic  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ListBegin()
 void ON_TextRunBuilder::ListBegin  |  ( |  bool  |  isOrdered | )
superclasses doesn't contain the next 4 methods to avoid virtual methods that break the SDK
◆ ListEnd()
 void ON_TextRunBuilder::ListEnd  |  ( |   | )
◆ ListItemBegin()
 void ON_TextRunBuilder::ListItemBegin  |  ( |  int  |  depth | )
◆ ListItemEnd()
 void ON_TextRunBuilder::ListItemEnd  |  ( |   | )
◆ Newline()
 void ON_TextRunBuilder::Newline  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ NoSuperSub()
 void ON_TextRunBuilder::NoSuperSub  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Paragraph()
 void ON_TextRunBuilder::Paragraph  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ParagraphDefaults()
 void ON_TextRunBuilder::ParagraphDefaults  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ RunBegin()
 void ON_TextRunBuilder::RunBegin  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ RunEnd()
 void ON_TextRunBuilder::RunEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Section()
 void ON_TextRunBuilder::Section  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ SetCurrentFont()
 void ON_TextRunBuilder::SetCurrentFont  |  ( |  const ON_Font *  |  font | )
inline
Keep this as a simple one-liner that unconditionally sets m_private_current_font.
◆ SetStackScale()
 void ON_TextRunBuilder::SetStackScale  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ StackEnd()
 void ON_TextRunBuilder::StackEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ StackFraction()
 void ON_TextRunBuilder::StackFraction  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Strikethrough()
 void ON_TextRunBuilder::Strikethrough  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Subscript()
 void ON_TextRunBuilder::Subscript  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Superscript()
 void ON_TextRunBuilder::Superscript  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Tab()
 void ON_TextRunBuilder::Tab  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ TextField()
 void ON_TextRunBuilder::TextField  |  ( |  const wchar_t *  |  name | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOff()
 void ON_TextRunBuilder::UnderlineOff  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOn()
 void ON_TextRunBuilder::UnderlineOn  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UniDest()
 void ON_TextRunBuilder::UniDest  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UniEmbeddedDest()
 void ON_TextRunBuilder::UniEmbeddedDest  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
Member Data Documentation
◆ m_current_run
 ON_TextRun ON_TextRunBuilder::m_current_run
◆ m_font_stack
 ON_SimpleArray< const ON_Font* > ON_TextRunBuilder::m_font_stack
◆ m_runs
 ON_TextRunArray& ON_TextRunBuilder::m_runs
◆ m_text
 ON_TextContent& ON_TextRunBuilder::m_text