Public Member Functions | Friends | List of all members
CRhinoHatch Class Reference
Rhino
#include <rhinoSdkHatchObject.h>
 Inheritance diagram for CRhinoHatch:
 Public Member Functions
CRhinoHatch ()
Constructors. More...
CRhinoHatch (const CRhinoHatch &src)
copies source object UUID More...
CRhinoHatch (const ON_3dmObjectAttributes &src)
assigns a new object UUID More...
~CRhinoHatch ()
Destructor. More...
ON_BoundingBox  | BoundingBox () const override
void  | DeleteFromDocNotification () override
void  | Draw (CRhinoDisplayPipeline &dp) const override
void  | DrawHighlightedSubObjects (CRhinoDisplayPipeline &dp) const override
void  | DrawSubObject (CRhinoDisplayPipeline &dp, ON_COMPONENT_INDEX componentIndex) const override
Draws wireframe representation of a sub object. More...
void  | EnableGrips (bool bGripsOn) override
ON_HatchPattern::HatchFillType  | FillType () const
int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &componentIndices) const override
int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &componentIndices) const override
int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const CRhinoViewport *pViewport=nullptr) const override
virtual CRhinoObject::GetSubObjects override More...
bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox, const ON_Xform *xform) const override
const ON_Hatch *  | Hatch () const
bool  | HighlightRequiresRedraw () const override
bool  | HighlightSubObject (ON_COMPONENT_INDEX componentIndex, bool highlight=true) const override
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX componentIndex) const override
true if specified component is highlighted More...
bool  | IsSubObjectSelected (ON_COMPONENT_INDEX componentIndex) const override
ON::object_type  | ObjectType () const override
CRhinoHatch &  | operator= (const CRhinoHatch &src)
copies source object UUID More...
int  | PatternIndex () const
double  | PatternRotation () const
double  | PatternScale () const
double  | PatternScale (const CRhinoViewport *pVP) const
11 Nov, 2010 - Lowell - Added to support paper space scaling of hatches More...
int  | Pick (const CRhinoPickContext &, CRhinoObjRefArray &objref) const override
bool  | PickFilter (const CRhinoGetObject &go, bool bCheckSubObjects) const override
bool  | ReplaceLoops (ON_SimpleArray< const ON_Curve * > &loops)
bool  | ReplaceLoops (ON_SimpleArray< ON_Curve * > &loops)
int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const override
virtual More...
ON_Hatch *  | SetHatch (const ON_Hatch &hatch)
void  | SetHatch (ON_Hatch *hatch)
void  | SetPatternRotation (double rotation)
void  | SetPatternScale (double scale)
const wchar_t *  | ShortDescription (bool bPlural) const override
bool  | SnapTo (const CRhinoSnapContext &snap_context, CRhinoSnapEvent &snap_event) const override
int  | SubObjectsAreHighlighted () const override
returns number of highlighted subobjects More...
int  | SubObjectsAreSelected () const override
returns number of selected subobjects More...
int  | UnhighlightAllSubObjects () override
returns number of changed subobjects More...
int  | UnselectAllSubObjects () override
returns number of unselected subobjects More...
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
virtual void  | AddToDocNotification ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
virtual bool  | GetFrame (ON_Plane &plane) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh * > &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=NULL) const
virtual int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curve_list) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
virtual bool  | IsSolid () const
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
virtual ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Friends
class  | CRhHatchObjectPrivate
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Constructor & Destructor Documentation
◆ CRhinoHatch() [1/3]
 CRhinoHatch::CRhinoHatch  |  ( |   | )
Constructors.
assigns a new object UUID
◆ CRhinoHatch() [2/3]
 CRhinoHatch::CRhinoHatch  |  ( |  const ON_3dmObjectAttributes &  |  src | )
assigns a new object UUID
◆ ~CRhinoHatch()
 CRhinoHatch::~CRhinoHatch  |  ( |   | )
Destructor.
◆ CRhinoHatch() [3/3]
 CRhinoHatch::CRhinoHatch  |  ( |  const CRhinoHatch &  |  src | )
copies source object UUID
Member Function Documentation
◆ BoundingBox()
 ON_BoundingBox CRhinoHatch::BoundingBox  |  ( |   | ) |   const
overridevirtual
Description: Gets 3d axis aligned bounding box that contains the object.
Returns: 3d bounding box
Remarks: The default implementation uses m_geometry->BoundingBox(), lazy evaluation, and caches the result in m_bbox.
 If you override this function, then you must set m_bbox.
Reimplemented from CRhinoObject.
◆ DeleteFromDocNotification()
 void CRhinoHatch::DeleteFromDocNotification  |  ( |   | )
overridevirtual
Delete cached display information with this object is placed on the undo list virtual
Reimplemented from CRhinoObject.
◆ Draw()
 void CRhinoHatch::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | ) |   const
overridevirtual
Description: Draw the object in a viewport Parameters: [in] CRhinoViewport& vport - The viewport in which to draw Remarks: The viewport has projection information and tools for drawing primitive objects on the screen that are display mode independent
Reimplemented from CRhinoObject.
◆ DrawHighlightedSubObjects()
 void CRhinoHatch::DrawHighlightedSubObjects  |  ( |  CRhinoDisplayPipeline &  |   | ) |   const
overridevirtual
Draws wireframe representation of highlighted sub objects. objects that support subobject highlighting must override this function
Reimplemented from CRhinoObject.
◆ DrawSubObject()
 void CRhinoHatch::DrawSubObject  |  ( |  CRhinoDisplayPipeline &  |  ,
|  ON_COMPONENT_INDEX
) |   |  const
overridevirtual
Draws wireframe representation of a sub object.
Reimplemented from CRhinoObject.
◆ EnableGrips()
 void CRhinoHatch::EnableGrips  |  ( |  bool  |  bGripsOn | )
overridevirtual
Description: Turns on the object's default editing grips Parameters: bDefaultGripsOn - [in] True to turn on the object's default grips. False to turn off any grips. See Also: CRhinoObject::GripsOn CRhinoObject::GetGrips
Reimplemented from CRhinoObject.
◆ FillType()
 ON_HatchPattern::HatchFillType CRhinoHatch::FillType  |  ( |   | ) |   const
Description: Returns the fill type of the hatch's pattern Returns: The fill type
◆ GetHighlightedSubObjects()
 int CRhinoHatch::GetHighlightedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all highlighted sub-objects Parameters: component_indices - [out] component indices of highlighted sub-objects. Returns: number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ GetSelectedSubObjects()
 int CRhinoHatch::GetSelectedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all selected sub-objects Parameters: component_indices - [out] component indices of selected sub-objects. Returns: number of selected subobjects
Reimplemented from CRhinoObject.
◆ GetSubObjects()
 int CRhinoHatch::GetSubObjects  |  ( |  ON_SimpleArray< CRhinoObject * > &  |  subObjects,
|  const CRhinoViewport *  |  pViewport = nullptr
) |   |  const
override
virtual CRhinoObject::GetSubObjects override
◆ GetTightBoundingBox()
 bool CRhinoHatch::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox,
|  const ON_Xform *  |  xform
) |   |  const
overridevirtual
Description: Get tight bounding box of this Rhino object. Parameters: tight_bbox - [in/out] tight bounding box bGrowBox -[in] (default=false)
 If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of this Rhino object. xform -[in] (default=NULL) If not NULL, the tight bounding box of the transformed Rhino object is calculated. The Rhino object is not modified. Returns: True if the returned tight_bbox is set to a valid bounding box.
Reimplemented from CRhinoObject.
◆ Hatch()
 const ON_Hatch* CRhinoHatch::Hatch  |  ( |   | ) |   const
Description: Get a pointer to the hatch geometry Parameters:
◆ HighlightRequiresRedraw()
 bool CRhinoHatch::HighlightRequiresRedraw  |  ( |   | ) |   const
overridevirtual
true if pixels used by highlighted object differ from pixels used by highlighted object.
Reimplemented from CRhinoObject.
◆ HighlightSubObject()
 bool CRhinoHatch::HighlightSubObject  |  ( |  ON_COMPONENT_INDEX  |  componentIndex,
|  bool  |  highlight = true
) |   |  const
overridevirtual
Reimplemented from CRhinoObject.
◆ InitialObjectFrame()
 ON_Plane CRhinoHatch::InitialObjectFrame  |  ( |  const CRhinoDoc &  |   | ) |   const
◆ IsSubObjectHighlighted()
 bool CRhinoHatch::IsSubObjectHighlighted  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
true if specified component is highlighted
Reimplemented from CRhinoObject.
◆ IsSubObjectSelected()
 bool CRhinoHatch::IsSubObjectSelected  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
Description: Check sub-object selection state. Parameters: component_index - [in] index of subobject to check Remarks: subobject cannot be persistently selected Returns: @untitled table false sub-object is not selected true sub-object is selected
Reimplemented from CRhinoObject.
◆ ObjectType()
 ON::object_type CRhinoHatch::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: Returns a constant that determines the type of CRhinoObject. Returns: ON::hatch_object
Implements CRhinoObject.
◆ operator=()
 CRhinoHatch& CRhinoHatch::operator=  |  ( |  const CRhinoHatch &  |  src | )
copies source object UUID
◆ PatternIndex()
 int CRhinoHatch::PatternIndex  |  ( |   | ) |   const
Description: Returns the index of the hatch's fill pattern in the HatchPatternTable Returns: The index
◆ PatternRotation()
 double CRhinoHatch::PatternRotation  |  ( |   | ) |   const
Description: Gets the rotation applied to the hatch pattern when it is mapped to the hatch's plane Returns: The rotation in radians Remarks: The pattern is rotated counter-clockwise around the hatch's plane origin by this value
◆ PatternScale() [1/2]
 double CRhinoHatch::PatternScale  |  ( |   | ) |   const
Description: Gets the scale applied to the hatch pattern when it is mapped to the hatch's plane Returns: The scale Remarks: The pattern is scaled around the hatch's plane origin by this value
◆ PatternScale() [2/2]
 double CRhinoHatch::PatternScale  |  ( |  const CRhinoViewport *  |  pVP | ) |   const
11 Nov, 2010 - Lowell - Added to support paper space scaling of hatches
◆ Pick()
 int CRhinoHatch::Pick  |  ( |  const CRhinoPickContext &  |  ,
|  CRhinoObjRefArray &  |  objref
) |   |  const
overridevirtual
Description: Test if the object was hit by the pick event described in the PickContext and add it to the picklist if it was Parameters: [in] CRhinoPickContext& - Information about the current pick event [out] CRhinoObjRefArray& - Array for collecting objects that are picked Returns: @untitled table 1 Object was hit 2 Object was not hit
Reimplemented from CRhinoObject.
◆ PickFilter()
 bool CRhinoHatch::PickFilter  |  ( |  const CRhinoGetObject &  |  go,
|  bool  |  bCheckSubObjects
) |   |  const
override
◆ ReplaceLoops() [1/2]
 bool CRhinoHatch::ReplaceLoops  |  ( |  ON_SimpleArray< const ON_Curve * > &  |  loops | )
◆ ReplaceLoops() [2/2]
 bool CRhinoHatch::ReplaceLoops  |  ( |  ON_SimpleArray< ON_Curve * > &  |  loops | )
Description: Remove all of the loops on the hatch and add the curves in 'loops' as new loops Parameters: loops - [in] An array of pointers to 2d or 3d curves If the curves are 2d, add them to the hatch directly If they are 3d, project them to the hatch's plane first Returns: true - success false - no loops in input array or an error adding them
◆ SelectSubObject()
 int CRhinoHatch::SelectSubObject  |  ( |  ON_COMPONENT_INDEX  |  component_index,
|  bool  |  bSelect = true,
|  bool  |  bSynchHighlight = true,
|  bool  |  bPersistentSelect = false
) |   |  const
overridevirtual
virtual
Reimplemented from CRhinoObject.
◆ SetHatch() [1/2]
 ON_Hatch* CRhinoHatch::SetHatch  |  ( |  const ON_Hatch &  |  hatch | )
Description: Specify the ON_Hatch geometry to be used by the Rhino Object Parameters: hatch - [in] hatch geometry copied to object Returns: Pointer to hatch geometry on CRhinoHatchObject.
◆ SetHatch() [2/2]
 void CRhinoHatch::SetHatch  |  ( |  ON_Hatch *  |  hatch | )
Description: Specify the hatch geometry. Parameters: pHatch - [in] ~CRhinoHatchObject() will delete this hatch
◆ SetPatternRotation()
 void CRhinoHatch::SetPatternRotation  |  ( |  double  |  rotation | )
Description: Sets the rotation applied to the hatch pattern when it is mapped to the hatch's plane Parameters: rotation (I) - The rotation in radians Remarks: The pattern is rotated counter-clockwise around the hatch's plane origin by this value
◆ SetPatternScale()
 void CRhinoHatch::SetPatternScale  |  ( |  double  |  scale | )
Description: Sets the scale applied to the hatch pattern when it is mapped to the hatch's plane Parameters: scale (I) - The scale Remarks: The pattern is scaled around the hatch's plane origin by this value
◆ ShortDescription()
 const wchar_t* CRhinoHatch::ShortDescription  |  ( |  bool  |  bPlural | ) |   const
overridevirtual
Description: virtual CRhinoObject::ShortDescription override Returns: "hatch"
Implements CRhinoObject.
◆ SnapTo()
 bool CRhinoHatch::SnapTo  |  ( |  const CRhinoSnapContext &  |  snap_context,
|  CRhinoSnapEvent &  |  snap_event
) |   |  const
overridevirtual
Description: virtual CRhinoObject::SnapTo override Remarks: Returns false
Reimplemented from CRhinoObject.
◆ SubObjectsAreHighlighted()
 int CRhinoHatch::SubObjectsAreHighlighted  |  ( |   | ) |   const
overridevirtual
returns number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ SubObjectsAreSelected()
 int CRhinoHatch::SubObjectsAreSelected  |  ( |   | ) |   const
overridevirtual
returns number of selected subobjects
Reimplemented from CRhinoObject.
◆ UnhighlightAllSubObjects()
 int CRhinoHatch::UnhighlightAllSubObjects  |  ( |   | )
overridevirtual
returns number of changed subobjects
Reimplemented from CRhinoObject.
◆ UnselectAllSubObjects()
 int CRhinoHatch::UnselectAllSubObjects  |  ( |   | )
overridevirtual
returns number of unselected subobjects
Reimplemented from CRhinoObject.
Friends And Related Function Documentation
◆ CRhHatchObjectPrivate
 friend class CRhHatchObjectPrivate
friend