Public Member Functions | List of all members
ON_MeshModifiers Class Referencefinal
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Public Member Functions
ON_MeshModifiers ()
ON_MeshModifiers (const ON_MeshModifiers &)=delete
~ON_MeshModifiers ()
ON_DEPRECATED ON_CurvePiping *  | CurvePiping (bool allow_creation)
ON_CurvePiping &  | CurvePiping (void)
Get an object that provides access to curve piping information. More...
const ON_CurvePiping *  | CurvePiping (void) const
ON_DEPRECATED ON_Displacement *  | Displacement (bool allow_creation)
Use the const-friendly versions above. These are only here for backwards compatibility with the old API and should not be used in new code. More...
ON_Displacement &  | Displacement (void)
Get an object that provides access to displacement information. More...
const ON_Displacement *  | Displacement (void) const
ON_DEPRECATED ON_EdgeSoftening *  | EdgeSoftening (bool allow_creation)
ON_EdgeSoftening &  | EdgeSoftening (void)
Get an object that provides access to edge softening information. More...
const ON_EdgeSoftening *  | EdgeSoftening (void) const
void  | LoadFromXML (const ON_XMLRootNode &)
< For internal use only. More...
bool  | operator!= (const ON_MeshModifiers &) const =delete
const ON_MeshModifiers &  | operator= (const ON_MeshModifiers &mm)
bool  | operator== (const ON_MeshModifiers &) const =delete
ON_DEPRECATED ON_ShutLining *  | ShutLining (bool allow_creation)
ON_ShutLining &  | ShutLining (void)
Get an object that provides access to shut-lining information. More...
const ON_ShutLining *  | ShutLining (void) const
ON_DEPRECATED ON_Thickening *  | Thickening (bool allow_creation)
ON_Thickening &  | Thickening (void)
Get an object that provides access to thickening information. More...
const ON_Thickening *  | Thickening (void) const
Constructor & Destructor Documentation
◆ ON_MeshModifiers() [1/2]
 ON_MeshModifiers::ON_MeshModifiers  |  ( |   | )
◆ ON_MeshModifiers() [2/2]
 ON_MeshModifiers::ON_MeshModifiers  |  ( |  const ON_MeshModifiers &  |   | )
delete
◆ ~ON_MeshModifiers()
 ON_MeshModifiers::~ON_MeshModifiers  |  ( |   | )
Member Function Documentation
◆ CurvePiping() [1/3]
 ON_DEPRECATED ON_CurvePiping* ON_MeshModifiers::CurvePiping  |  ( |  bool  |  allow_creation | )
◆ CurvePiping() [2/3]
 ON_CurvePiping& ON_MeshModifiers::CurvePiping  |  ( |  void  |   | )
Get an object that provides access to curve piping information.
◆ CurvePiping() [3/3]
 const ON_CurvePiping* ON_MeshModifiers::CurvePiping  |  ( |  void  |   | ) |   const
◆ Displacement() [1/3]
 ON_DEPRECATED ON_Displacement* ON_MeshModifiers::Displacement  |  ( |  bool  |  allow_creation | )
Use the const-friendly versions above. These are only here for backwards compatibility with the old API and should not be used in new code.
◆ Displacement() [2/3]
 ON_Displacement& ON_MeshModifiers::Displacement  |  ( |  void  |   | )
Get an object that provides access to displacement information.
◆ Displacement() [3/3]
 const ON_Displacement* ON_MeshModifiers::Displacement  |  ( |  void  |   | ) |   const
◆ EdgeSoftening() [1/3]
 ON_DEPRECATED ON_EdgeSoftening* ON_MeshModifiers::EdgeSoftening  |  ( |  bool  |  allow_creation | )
◆ EdgeSoftening() [2/3]
 ON_EdgeSoftening& ON_MeshModifiers::EdgeSoftening  |  ( |  void  |   | )
Get an object that provides access to edge softening information.
◆ EdgeSoftening() [3/3]
 const ON_EdgeSoftening* ON_MeshModifiers::EdgeSoftening  |  ( |  void  |   | ) |   const
◆ LoadFromXML()
 void ON_MeshModifiers::LoadFromXML  |  ( |  const ON_XMLRootNode &  |   | )
< For internal use only.
◆ operator!=()
 bool ON_MeshModifiers::operator!=  |  ( |  const ON_MeshModifiers &  |   | ) |   const
delete
◆ operator=()
 const ON_MeshModifiers& ON_MeshModifiers::operator=  |  ( |  const ON_MeshModifiers &  |  mm | )
◆ operator==()
 bool ON_MeshModifiers::operator==  |  ( |  const ON_MeshModifiers &  |   | ) |   const
delete
◆ ShutLining() [1/3]
 ON_DEPRECATED ON_ShutLining* ON_MeshModifiers::ShutLining  |  ( |  bool  |  allow_creation | )
◆ ShutLining() [2/3]
 ON_ShutLining& ON_MeshModifiers::ShutLining  |  ( |  void  |   | )
Get an object that provides access to shut-lining information.
◆ ShutLining() [3/3]
 const ON_ShutLining* ON_MeshModifiers::ShutLining  |  ( |  void  |   | ) |   const
◆ Thickening() [1/3]
 ON_DEPRECATED ON_Thickening* ON_MeshModifiers::Thickening  |  ( |  bool  |  allow_creation | )
◆ Thickening() [2/3]
 ON_Thickening& ON_MeshModifiers::Thickening  |  ( |  void  |   | )
Get an object that provides access to thickening information.
◆ Thickening() [3/3]
 const ON_Thickening* ON_MeshModifiers::Thickening  |  ( |  void  |   | ) |   const