Public Member Functions | List of all members
ON_UuidPtrList2 Class Reference
OpenNURBS
#include <opennurbs_array.h>
 Public Member Functions
ON_UuidPtrList2 ()
ON_UuidPtrList2 (const ON_UuidPtrList2 &src)
~ON_UuidPtrList2 ()
bool  | AddUuidPtr (const ON_UUID &uuid, ON__UINT_PTR ptr)
unsigned int  | Count () const
bool  | FindUuid (const ON_UUID &uuid) const
bool  | FindUuid (const ON_UUID &uuid, ON__UINT_PTR *ptr) const
bool  | FindUuidPtr (const ON_UUID &uuid, ON__UINT_PTR index) const
unsigned int  | GetUuids (ON_SimpleArray< ON_UUID > &uuid_list) const
void  | ImproveSearchSpeed ()
ON_UuidPtrList2 &  | operator= (const ON_UuidPtrList2 &src)
void  | RemoveAll ()
bool  | RemoveUuid (const ON_UUID &uuid)
void  | Reserve (size_t capacity)
Constructor & Destructor Documentation
◆ ON_UuidPtrList2() [1/2]
 ON_UuidPtrList2::ON_UuidPtrList2  |  ( |   | )
◆ ~ON_UuidPtrList2()
 ON_UuidPtrList2::~ON_UuidPtrList2  |  ( |   | )
◆ ON_UuidPtrList2() [2/2]
 ON_UuidPtrList2::ON_UuidPtrList2  |  ( |  const ON_UuidPtrList2 &  |  src | )
Member Function Documentation
◆ AddUuidPtr()
 bool ON_UuidPtrList2::AddUuidPtr  |  ( |  const ON_UUID &  |  uuid,
|  ON__UINT_PTR  |  ptr
)
◆ Count()
 unsigned int ON_UuidPtrList2::Count  |  ( |   | ) |   const
◆ FindUuid() [1/2]
 bool ON_UuidPtrList2::FindUuid  |  ( |  const ON_UUID &  |  uuid | ) |   const
◆ FindUuid() [2/2]
 bool ON_UuidPtrList2::FindUuid  |  ( |  const ON_UUID &  |  uuid,
|  ON__UINT_PTR *  |  ptr
) |   |  const
◆ FindUuidPtr()
 bool ON_UuidPtrList2::FindUuidPtr  |  ( |  const ON_UUID &  |  uuid,
|  ON__UINT_PTR  |  index
) |   |  const
◆ GetUuids()
 unsigned int ON_UuidPtrList2::GetUuids  |  ( |  ON_SimpleArray< ON_UUID > &  |  uuid_list | ) |   const
◆ ImproveSearchSpeed()
 void ON_UuidPtrList2::ImproveSearchSpeed  |  ( |   | )
◆ operator=()
 ON_UuidPtrList2& ON_UuidPtrList2::operator=  |  ( |  const ON_UuidPtrList2 &  |  src | )
◆ RemoveAll()
 void ON_UuidPtrList2::RemoveAll  |  ( |   | )
◆ RemoveUuid()
 bool ON_UuidPtrList2::RemoveUuid  |  ( |  const ON_UUID &  |  uuid | )
◆ Reserve()
 void ON_UuidPtrList2::Reserve  |  ( |  size_t  |  capacity | )