Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ManagedFonts Class Reference
OpenNURBS
#include <opennurbs_internal_glyph.h>
 Public Member Functions
const ON_Font *  | GetFromFontCharacteristics (const ON_Font &font_characteristics, bool bCreateIfNotFound)
const ON_Font *  | GetFromSerialNumber (unsigned int managed_font_runtime_serial_number)
 Static Public Member Functions
static int  | CompareFontPointer (ON_Font const *const *lhs, ON_Font const *const *rhs)
sorts nulls to end of lists More...
static bool  | GetFontMetricsInFontDesignUnits (const ON_Font *font, ON_FontMetrics &font_metrics_in_font_design_units)
static unsigned int  | GetGlyphMetricsInFontDesignUnits (const class ON_Font *font, ON__UINT32 unicode_code_point, class ON_TextBox &glyph_metrics_in_font_design_units)
static const ON_FontList &  | InstalledFonts ()
static const ON_FontList &  | ManagedFonts ()
 Static Public Attributes
static ON_ManagedFonts  | List
List is the only instance of this class. More...
Member Function Documentation
◆ CompareFontPointer()
 static int ON_ManagedFonts::CompareFontPointer  |  ( |  ON_Font const *const *  |  lhs,
|  ON_Font const *const *  |  rhs
)
static
sorts nulls to end of lists
◆ GetFontMetricsInFontDesignUnits()
 static bool ON_ManagedFonts::GetFontMetricsInFontDesignUnits  |  ( |  const ON_Font *  |  font,
|  ON_FontMetrics &  |  font_metrics_in_font_design_units
)
static
Parameters: font - [in] font_metrics_in_font_design_units - [out] Returns: True: font_metrics_in_font_design_units set from a font installed on the current device. False: ON_FontMetrics::LastResortMetrics used or other corrections applied.
◆ GetFromFontCharacteristics()
 const ON_Font* ON_ManagedFonts::GetFromFontCharacteristics  |  ( |  const ON_Font &  |  font_characteristics,
|  bool  |  bCreateIfNotFound
)
◆ GetFromSerialNumber()
 const ON_Font* ON_ManagedFonts::GetFromSerialNumber  |  ( |  unsigned int  |  managed_font_runtime_serial_number | )
◆ GetGlyphMetricsInFontDesignUnits()
 static unsigned int ON_ManagedFonts::GetGlyphMetricsInFontDesignUnits  |  ( |  const class ON_Font *  |  font,
|  ON__UINT32  |  unicode_code_point,
|  class ON_TextBox &  |  glyph_metrics_in_font_design_units
)
static
Returns: 0: failure >0: success font glyph index
◆ InstalledFonts()
 static const ON_FontList& ON_ManagedFonts::InstalledFonts  |  ( |   | )
static
◆ ManagedFonts()
 static const ON_FontList& ON_ManagedFonts::ManagedFonts  |  ( |   | )
inlinestatic
Member Data Documentation
◆ List
 ON_ManagedFonts ON_ManagedFonts::List
static
List is the only instance of this class.