Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetCurve Class Reference
RhinoGet
#include <rhinoSdkGetCurve.h>
 Public Member Functions
CArgsRhinoGetCurve ()
CArgsRhinoGetCurve (const CArgsRhinoGetCurve &)
~CArgsRhinoGetCurve ()
int  | Degree () const
const ON_3dVector &  | EndTangent () const
const ON_wString &  | FirstPrompt () const
int  | KnotSpacing () const
CArgsRhinoGetCurve &  | operator= (const CArgsRhinoGetCurve &)
ON_3dPointArray &  | PointArray ()
Array of selected points. More...
ON_2dPointArray &  | PointArray2d ()
Array of selected parameter space points. More...
const ON_wString &  | SecondPrompt () const
void  | SetDegree (int)
degree of curve More...
void  | SetEndTangent (const ON_3dVector &)
interpolated curve end tangent, ON_3dVector(0,0,0) if not defined More...
void  | SetFirstPrompt (const wchar_t *)
void  | SetKnotSpacing (int)
void  | SetSecondPrompt (const wchar_t *)
void  | SetSharp (BOOL32)
///< FALSE = periodic when closed, TRUE = sharp when closed More...
void  | SetStartTangent (const ON_3dVector &)
interpolated curve start tangent, ON_3dVector(0,0,0) if not defined More...
bool  | SetSubDFriendly (bool bSubDFriendly)
void  | SetSurface (const ON_Surface *pS)
Surface for Interpolate curve on surface. More...
void  | SetThirdPrompt (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseEndTangent (BOOL32)
void  | SetUseStartTangent (BOOL32)
BOOL32  | Sharp () const
const ON_3dVector &  | StartTangent () const
bool  | SubDFriendly () const
const ON_Surface *  | Surface () const
const ON_wString &  | ThirdPrompt () const
bool  | UseActiveLayerLinetype () const
BOOL32  | UseEndTangent () const
BOOL32  | UseStartTangent () const
 Protected Attributes
int  | m_Degree = 3
ON_3dVector  | m_EndTangent = ON_3dVector::ZeroVector
ON_wString  | m_FirstPrompt
int  | m_KnotSpacing = 1
0=uniform, 1=chord, 2=sqrt(chord) More...
ON_3dPointArray  | m_PointArray
ON_2dPointArray  | m_PointArray2d
const ON_Surface *  | m_pS = nullptr
ON_wString  | m_SecondPrompt
BOOL32  | m_Sharp = false
ON_3dVector  | m_StartTangent = ON_3dVector::ZeroVector
ON_wString  | m_ThirdPrompt
BOOL32  | m_UseEndTangent = false
BOOL32  | m_UseStartTangent = false
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
 CLASS CArgsRhinoGetCurve
OVERVIEW TEXT Arguments for RhinoGetControlPointCurve, RhinoGetInterpolatedCurve and RhinoGetInterpolatedCurveOnSurface
KEYWORDS
RhinoGetControlPointCurve RhinoGetInterpolatedCurve Curve CVCurve CPCurve InterpCrv InterpCrvOnSrf
Constructor & Destructor Documentation
◆ CArgsRhinoGetCurve() [1/2]
 CArgsRhinoGetCurve::CArgsRhinoGetCurve  |  ( |   | )
◆ ~CArgsRhinoGetCurve()
 CArgsRhinoGetCurve::~CArgsRhinoGetCurve  |  ( |   | )
◆ CArgsRhinoGetCurve() [2/2]
 CArgsRhinoGetCurve::CArgsRhinoGetCurve  |  ( |  const CArgsRhinoGetCurve &  |   | )
Member Function Documentation
◆ Degree()
 int CArgsRhinoGetCurve::Degree  |  ( |   | ) |   const
◆ EndTangent()
 const ON_3dVector& CArgsRhinoGetCurve::EndTangent  |  ( |   | ) |   const
◆ FirstPrompt()
 const ON_wString& CArgsRhinoGetCurve::FirstPrompt  |  ( |   | ) |   const
◆ KnotSpacing()
 int CArgsRhinoGetCurve::KnotSpacing  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetCurve& CArgsRhinoGetCurve::operator=  |  ( |  const CArgsRhinoGetCurve &  |   | )
◆ PointArray()
 ON_3dPointArray& CArgsRhinoGetCurve::PointArray  |  ( |   | )
Array of selected points.
◆ PointArray2d()
 ON_2dPointArray& CArgsRhinoGetCurve::PointArray2d  |  ( |   | )
Array of selected parameter space points.
◆ SecondPrompt()
 const ON_wString& CArgsRhinoGetCurve::SecondPrompt  |  ( |   | ) |   const
◆ SetDegree()
 void CArgsRhinoGetCurve::SetDegree  |  ( |  int  |   | )
degree of curve
◆ SetEndTangent()
 void CArgsRhinoGetCurve::SetEndTangent  |  ( |  const ON_3dVector &  |   | )
interpolated curve end tangent, ON_3dVector(0,0,0) if not defined
◆ SetFirstPrompt()
 void CArgsRhinoGetCurve::SetFirstPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting first point Default = "Start of curve".
◆ SetKnotSpacing()
 void CArgsRhinoGetCurve::SetKnotSpacing  |  ( |  int  |   | )
Method of Knot Spacing for interpolated curve 0=uniform, 1=chord, 2=sqrt(chord)
◆ SetSecondPrompt()
 void CArgsRhinoGetCurve::SetSecondPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting second point Default = "Next point".
◆ SetSharp()
 void CArgsRhinoGetCurve::SetSharp  |  ( |  BOOL32  |   | )
///< FALSE = periodic when closed, TRUE = sharp when closed
◆ SetStartTangent()
 void CArgsRhinoGetCurve::SetStartTangent  |  ( |  const ON_3dVector &  |   | )
interpolated curve start tangent, ON_3dVector(0,0,0) if not defined
◆ SetSubDFriendly()
 bool CArgsRhinoGetCurve::SetSubDFriendly  |  ( |  bool  |  bSubDFriendly | )
Parameters: bSubDFriendly - [in] Returns: Resulting value of SubDFriendly(). Remarks: SubD friendly curves are cubic, nonrational, uniform NURBS that are either periodic or have zero 2nd derivatives at the start and end. If SubDFriendly() is true, then degree, knot spacing, and end condition parameters are ignored in curve creation commands that use CArgsRhinoGetCurve for input.
◆ SetSurface()
 void CArgsRhinoGetCurve::SetSurface  |  ( |  const ON_Surface *  |  pS | )
Surface for Interpolate curve on surface.
◆ SetThirdPrompt()
 void CArgsRhinoGetCurve::SetThirdPrompt  |  ( |  const wchar_t *  |   | )
prompt when getting third and following points Default = "Next point. Press Enter when done".
◆ SetUseActiveLayerLinetype()
 void CArgsRhinoGetCurve::SetUseActiveLayerLinetype  |  ( |  bool  |  on | )
When true the linetype of the active layer is used for dynamic drawing.
◆ SetUseEndTangent()
 void CArgsRhinoGetCurve::SetUseEndTangent  |  ( |  BOOL32  |   | )
◆ SetUseStartTangent()
 void CArgsRhinoGetCurve::SetUseStartTangent  |  ( |  BOOL32  |   | )
◆ Sharp()
 BOOL32 CArgsRhinoGetCurve::Sharp  |  ( |   | ) |   const
◆ StartTangent()
 const ON_3dVector& CArgsRhinoGetCurve::StartTangent  |  ( |   | ) |   const
◆ SubDFriendly()
 bool CArgsRhinoGetCurve::SubDFriendly  |  ( |   | ) |   const
Returns: True if the resulting curve will be a cubic, uniform, nonrational and either periodic or have zero 2nd deriviatives at the ends. Remarks: SubD friendly curves are cubic, nonrational, uniform NURBS that are either periodic or have zero 2nd derivatives at the start and end. If SubDFriendly() is true, then degree, knot spacing, and end condition parameters are ignored in curve creation commands that use CArgsRhinoGetCurve for input.
◆ Surface()
 const ON_Surface* CArgsRhinoGetCurve::Surface  |  ( |   | ) |   const
◆ ThirdPrompt()
 const ON_wString& CArgsRhinoGetCurve::ThirdPrompt  |  ( |   | ) |   const
◆ UseActiveLayerLinetype()
 bool CArgsRhinoGetCurve::UseActiveLayerLinetype  |  ( |   | ) |   const
◆ UseEndTangent()
 BOOL32 CArgsRhinoGetCurve::UseEndTangent  |  ( |   | ) |   const
◆ UseStartTangent()
 BOOL32 CArgsRhinoGetCurve::UseStartTangent  |  ( |   | ) |   const
Member Data Documentation
◆ m_Degree
 int CArgsRhinoGetCurve::m_Degree = 3
protected
◆ m_EndTangent
 ON_3dVector CArgsRhinoGetCurve::m_EndTangent = ON_3dVector::ZeroVector
protected
If 3 == m_Degree and m_bSubDFriendly is true, then m_EndTangent is ignored.
◆ m_FirstPrompt
 ON_wString CArgsRhinoGetCurve::m_FirstPrompt
protected
◆ m_KnotSpacing
 int CArgsRhinoGetCurve::m_KnotSpacing = 1
protected
0=uniform, 1=chord, 2=sqrt(chord)
If 3 == m_Degree and m_bSubDFriendly is true, then m_KnotSpacing is ignored.
◆ m_PointArray
 ON_3dPointArray CArgsRhinoGetCurve::m_PointArray
protected
◆ m_PointArray2d
 ON_2dPointArray CArgsRhinoGetCurve::m_PointArray2d
protected
◆ m_pS
 const ON_Surface* CArgsRhinoGetCurve::m_pS = nullptr
protected
◆ m_SecondPrompt
 ON_wString CArgsRhinoGetCurve::m_SecondPrompt
protected
◆ m_Sharp
 BOOL32 CArgsRhinoGetCurve::m_Sharp = false
protected
◆ m_StartTangent
 ON_3dVector CArgsRhinoGetCurve::m_StartTangent = ON_3dVector::ZeroVector
protected
If 3 == m_Degree and m_bSubDFriendly is true, then m_StartTangent is ignored.
◆ m_ThirdPrompt
 ON_wString CArgsRhinoGetCurve::m_ThirdPrompt
protected
◆ m_UseEndTangent
 BOOL32 CArgsRhinoGetCurve::m_UseEndTangent = false
protected
If 3 == m_Degree and m_bSubDFriendly is true, then m_UseEndTangent is ignored.
◆ m_UseStartTangent
 BOOL32 CArgsRhinoGetCurve::m_UseStartTangent = false
protected
If 3 == m_Degree and m_bSubDFriendly is true, then m_UseStartTangent is ignored.