Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiPanel Class Reference
RhinoUI
#include <RhinoSdkUiDockbarTab.h>
 Inheritance diagram for CRhinoUiPanel:
 Public Member Functions
CRhinoUiPanel (unsigned int doc_sn)
virtual CRhinoDoc *  | Document () const
Access functions. More...
virtual unsigned int  | DocumentRuntimeSerialNumber () const
Set by the constructor. More...
virtual bool  | HasDocumentContext () const
Set by the factory. More...
HWND  | PanelHost (void) const
virtual ON_UUID  | PreviousDockBarId (void) const
virtual void  | SetPreviousDockBarId (const ON_UUID &uuid)
 Public Member Functions inherited from CRhinoUiDockBarTab
CRhinoUiDockBarTab ()
virtual bool  | Create (void)
virtual bool  | Created (void) const
virtual ON_UUID  | CurrentDockBarId (void) const
virtual void  | Delete (void)
NVM. More...
virtual void  | Destroy (void)
virtual class CRhinoUiDockBar *  | DockBar (void)
virtual void  | Help (void) const
virtual UUID  | Id (void) const
virtual void  | Move (const ON_4iRect &rect)
virtual void  | SetCurrentDockBarId (const ON_UUID &uuid)
virtual void  | Show (UINT uState)
virtual void  | Switch (void)
virtual class ITabbedDockBarEventWatcher *  | TabbedDockBarEventWatcher (void) const =0
 Protected Member Functions
virtual  | ~CRhinoUiPanel ()
virtual ON_wString  | Caption (void) const
Implemented by searching for and calling the factory. More...
virtual HICON  | Icon (const ON_2iSize &sizeInPixels) const
 Protected Member Functions inherited from CRhinoUiDockBarTab
virtual  | ~CRhinoUiDockBarTab ()
virtual bool  | CreateWnd (void)=0
Call the implementation specific PanelHost function to find the parent. More...
virtual void  | DeleteThis (void)=0
Implement as delete this;. More...
virtual void  | DestroyWnd (void)=0
virtual void  | DoHelp (void) const =0
virtual bool  | IsCreated (void) const =0
virtual void  | MoveWnd (const ON_4iRect &rect)=0
virtual void  | ShowWnd (UINT uState)=0
virtual void  | SwitchDockBar (void)=0
Call the implementation specific PanelHost function to find the parent. More...
virtual UUID  | TabId (void) const =0
 Friends
class  | CRhinoUiPanelFactory
class  | Impl
Constructor & Destructor Documentation
◆ CRhinoUiPanel()
 CRhinoUiPanel::CRhinoUiPanel  |  ( |  unsigned int  |  doc_sn | )
◆ ~CRhinoUiPanel()
 virtual CRhinoUiPanel::~CRhinoUiPanel  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Caption()
 virtual ON_wString CRhinoUiPanel::Caption  |  ( |  void  |   | ) |   const
protectedvirtual
Implemented by searching for and calling the factory.
Implements CRhinoUiDockBarTab.
◆ Document()
 virtual CRhinoDoc* CRhinoUiPanel::Document  |  ( |   | ) |   const
virtual
Access functions.
Set by the constructor
◆ DocumentRuntimeSerialNumber()
 virtual unsigned int CRhinoUiPanel::DocumentRuntimeSerialNumber  |  ( |   | ) |   const
virtual
Set by the constructor.
◆ HasDocumentContext()
 virtual bool CRhinoUiPanel::HasDocumentContext  |  ( |   | ) |   const
virtual
Set by the factory.
◆ Icon()
 virtual HICON CRhinoUiPanel::Icon  |  ( |  const ON_2iSize &  |  sizeInPixels | ) |   const
protectedvirtual
Implements CRhinoUiDockBarTab.
◆ PanelHost()
 HWND CRhinoUiPanel::PanelHost  |  ( |  void  |   | ) |   const
◆ PreviousDockBarId()
 virtual ON_UUID CRhinoUiPanel::PreviousDockBarId  |  ( |  void  |   | ) |   const
virtual
◆ SetPreviousDockBarId()
 virtual void CRhinoUiPanel::SetPreviousDockBarId  |  ( |  const ON_UUID &  |  uuid | )
virtual
Friends And Related Function Documentation
◆ CRhinoUiPanelFactory
 friend class CRhinoUiPanelFactory
friend
◆ Impl
 friend class Impl
friend