Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDFaceRegionAndNurbs Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDFaceRegionAndNurbs ()=default
ON_SubDFaceRegionAndNurbs (const ON_SubDFaceRegionAndNurbs &)=default
~ON_SubDFaceRegionAndNurbs ()=default
ON_SubDFaceRegionAndNurbs &  | operator= (const ON_SubDFaceRegionAndNurbs &)=default
 Public Attributes
ON_SubDFaceRegion  | m_face_region
class ON_NurbsSurface *  | m_nurbs_surface = nullptr
This pointer is not managed by ON_SubDFaceRegionAndNurbs. More...
 Static Public Attributes
static const ON_SubDFaceRegionAndNurbs  | Empty
Constructor & Destructor Documentation
◆ ON_SubDFaceRegionAndNurbs() [1/2]
 ON_SubDFaceRegionAndNurbs::ON_SubDFaceRegionAndNurbs  |  ( |   | )
default
◆ ~ON_SubDFaceRegionAndNurbs()
 ON_SubDFaceRegionAndNurbs::~ON_SubDFaceRegionAndNurbs  |  ( |   | )
default
◆ ON_SubDFaceRegionAndNurbs() [2/2]
 ON_SubDFaceRegionAndNurbs::ON_SubDFaceRegionAndNurbs  |  ( |  const ON_SubDFaceRegionAndNurbs &  |   | )
default
Member Function Documentation
◆ operator=()
 ON_SubDFaceRegionAndNurbs& ON_SubDFaceRegionAndNurbs::operator=  |  ( |  const ON_SubDFaceRegionAndNurbs &  |   | )
default
Member Data Documentation
◆ Empty
 const ON_SubDFaceRegionAndNurbs ON_SubDFaceRegionAndNurbs::Empty
static
◆ m_face_region
 ON_SubDFaceRegion ON_SubDFaceRegionAndNurbs::m_face_region
◆ m_nurbs_surface
 class ON_NurbsSurface* ON_SubDFaceRegionAndNurbs::m_nurbs_surface = nullptr
This pointer is not managed by ON_SubDFaceRegionAndNurbs.