Public Member Functions | Static Public Attributes | List of all members
CRhinoCreateDocumentOptions Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Public Member Functions
CRhinoCreateDocumentOptions ()=default
CRhinoCreateDocumentOptions (const CRhinoCreateDocumentOptions &)=default
~CRhinoCreateDocumentOptions ()=default
bool  | CreateDefaultViews () const
bool  | CreateHeadless () const
bool  | CreateStealthWorksession () const
void  | SetCreateDefaultViews (bool bCreateDefaultViews)
void  | SetCreateHeadless (bool bCreateHeadless)
void  | SetCreateStealthWorksession (bool bCreateStealthWorksession)
 Static Public Attributes
static const CRhinoCreateDocumentOptions  | Defaults
Constructor & Destructor Documentation
◆ CRhinoCreateDocumentOptions() [1/2]
 CRhinoCreateDocumentOptions::CRhinoCreateDocumentOptions  |  ( |   | )
default
The CRhinoCreateDocumentOptions class is used to pass options to the static CRhinoDoc::CreateDocument() function.
◆ ~CRhinoCreateDocumentOptions()
 CRhinoCreateDocumentOptions::~CRhinoCreateDocumentOptions  |  ( |   | )
default
◆ CRhinoCreateDocumentOptions() [2/2]
 CRhinoCreateDocumentOptions::CRhinoCreateDocumentOptions  |  ( |  const CRhinoCreateDocumentOptions &  |   | )
default
Member Function Documentation
◆ CreateDefaultViews()
 bool CRhinoCreateDocumentOptions::CreateDefaultViews  |  ( |   | ) |   const
Returns: true If no template file is specified or the template file does not contain views, and this parameter is true, then the default Rhino views are created. Remarks: Default value is true.
◆ CreateHeadless()
 bool CRhinoCreateDocumentOptions::CreateHeadless  |  ( |   | ) |   const
Returns: true if a "headless" document should be created Remarks: This function is a work in progress and may change during the development of V7
◆ CreateStealthWorksession()
 bool CRhinoCreateDocumentOptions::CreateStealthWorksession  |  ( |   | ) |   const
Returns: true if a "stealth" worksession should be created. Remarks: Default value is true. Ideally, this function will vanish in the near future!
◆ SetCreateDefaultViews()
 void CRhinoCreateDocumentOptions::SetCreateDefaultViews  |  ( |  bool  |  bCreateDefaultViews | )
◆ SetCreateHeadless()
 void CRhinoCreateDocumentOptions::SetCreateHeadless  |  ( |  bool  |  bCreateHeadless | )
◆ SetCreateStealthWorksession()
 void CRhinoCreateDocumentOptions::SetCreateStealthWorksession  |  ( |  bool  |  bCreateStealthWorksession | )
Member Data Documentation
◆ Defaults
 const CRhinoCreateDocumentOptions CRhinoCreateDocumentOptions::Defaults
static
Compilers implicitly delete operator= due to const m_version field CRhinoCreateDocumentOptions& operator=(const CRhinoCreateDocumentOptions&) = default;