Public Member Functions | Public Attributes | List of all members
ON_3dmWallpaperImage Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmWallpaperImage ()
~ON_3dmWallpaperImage ()
void  | Default ()
bool  | operator!= (const ON_3dmWallpaperImage &) const
bool  | operator== (const ON_3dmWallpaperImage &) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bGrayScale
true if image should be black and white More...
bool  | m_bHidden
true if image is currently hidden from view More...
ON_FileReference  | m_image_file_reference
Detailed Description
ON_3dmViewTraceImage
Constructor & Destructor Documentation
◆ ON_3dmWallpaperImage()
 ON_3dmWallpaperImage::ON_3dmWallpaperImage  |  ( |   | )
◆ ~ON_3dmWallpaperImage()
 ON_3dmWallpaperImage::~ON_3dmWallpaperImage  |  ( |   | )
Member Function Documentation
◆ Default()
 void ON_3dmWallpaperImage::Default  |  ( |   | )
◆ operator!=()
 bool ON_3dmWallpaperImage::operator!=  |  ( |  const ON_3dmWallpaperImage &  |   | ) |   const
◆ operator==()
 bool ON_3dmWallpaperImage::operator==  |  ( |  const ON_3dmWallpaperImage &  |   | ) |   const
◆ Read()
 bool ON_3dmWallpaperImage::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmWallpaperImage::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bGrayScale
 bool ON_3dmWallpaperImage::m_bGrayScale
true if image should be black and white
◆ m_bHidden
 bool ON_3dmWallpaperImage::m_bHidden
true if image is currently hidden from view
◆ m_image_file_reference
 ON_FileReference ON_3dmWallpaperImage::m_image_file_reference