Public Member Functions | List of all members
CRhinoOptionsPageCollection Class Reference
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
CRhinoOptionsPageCollection (unsigned int documentRuntimeSerialNumber, HWND parent)
~CRhinoOptionsPageCollection ()
CRhinoOptionsPageCollectionItem *  | AddPage (IRhinoOptionsPage *pageToAdd)
int  | Count () const
CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
CRhinoOptionsPageCollectionItem *  | operator[] (int index) const
HWND  | Parent () const
Detailed Description
class IRhinoOptionsPageCollection
Description: A collection of IRhinoOptionsPage objects, used to add pages.
Constructor & Destructor Documentation
◆ CRhinoOptionsPageCollection()
 CRhinoOptionsPageCollection::CRhinoOptionsPageCollection  |  ( |  unsigned int  |  documentRuntimeSerialNumber,
|  HWND  |  parent
)
 Description: Default constructor.
◆ ~CRhinoOptionsPageCollection()
 CRhinoOptionsPageCollection::~CRhinoOptionsPageCollection  |  ( |   | )
 Description: Destructor
Member Function Documentation
◆ AddPage()
 CRhinoOptionsPageCollectionItem* CRhinoOptionsPageCollection::AddPage  |  ( |  IRhinoOptionsPage *  |  pageToAdd | )
 Description: Add top level page Parameters: pageToAdd[in] The page to add Returns: The new collection item for the page, use it to add child pages.
◆ Count()
 int CRhinoOptionsPageCollection::Count  |  ( |   | ) |   const
 Description: Number of top level pages in this collection Returns: Returns the top level pages in this collection
◆ Document()
 CRhinoDoc* CRhinoOptionsPageCollection::Document  |  ( |   | ) |   const
 Description: Document displaying the options dialog.
◆ DocumentRuntimeSerialNumber()
 unsigned int CRhinoOptionsPageCollection::DocumentRuntimeSerialNumber  |  ( |   | ) |   const
 Description: Runtime serial for document displaying the options dialog.
◆ operator[]()
 CRhinoOptionsPageCollectionItem* CRhinoOptionsPageCollection::operator[]  |  ( |  int  |  index | ) |   const
 Description: Top level page to add from index Parameters: index[in] = Zero based index of item to get Returns: Returns the top level item if the index is valid otherwise; returns null.
◆ Parent()
 HWND CRhinoOptionsPageCollection::Parent  |  ( |   | ) |   const
 Description: Document properties window handle.