Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCreator Class Referenceabstract
RDK
#include <RhRdkContentCreator.h>
 Inheritance diagram for CRhRdkContentCreator:
 Public Member Functions
CRhRdkContentCreator (const CRhRdkDocument &rdkDoc)
virtual  | ~CRhRdkContentCreator ()
const CRhRdkContent *  | AddContent (const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
bool  | AddContent (OUT CRhRdkContentArray &aContent, const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
virtual_su bool  | AutoEditChild (void) const
const CRhRdkContent *  | ChangeContentType (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
const CRhRdkContent *  | ChangeContentTypeEx (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild, unsigned int ic_flags) const
const wchar_t *  | ErrorString (void) const
const CRhRdkContent *  | FindChildAddOrChange (const CRhRdkContent &parentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual bool  | CreateNewContent (CRhRdkContentArrayNC &aContentOut, const CRhRdkContent *pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName) const =0
virtual void *  | EVF (const wchar_t *, void *) override
virtual bool  | IsCopy (void) const =0
virtual const CRhRdkContentArray *  | OriginalContent (void) const =0
const CRhRdkDocument *  | RdkDocument (void) const
void  | SetErrorString (const wchar_t *wsz) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkContentCreator()
 CRhRdkContentCreator::CRhRdkContentCreator  |  ( |  const CRhRdkDocument &  |  rdkDoc | )
◆ ~CRhRdkContentCreator()
 virtual CRhRdkContentCreator::~CRhRdkContentCreator  |  ( |   | )
virtual
Member Function Documentation
◆ AddContent() [1/2]
 const CRhRdkContent* CRhRdkContentCreator::AddContent  |  ( |  const CRhRdkContent *  |  pParentContent = nullptr,
|  const wchar_t *  |  wszChildSlotName = nullptr
) |   |  const
◆ AddContent() [2/2]
 bool CRhRdkContentCreator::AddContent  |  ( |  OUT CRhRdkContentArray &  |  aContent,
|  const CRhRdkContent *  |  pParentContent = nullptr,
|  const wchar_t *  |  wszChildSlotName = nullptr
) |   |  const
◆ AutoEditChild()
 virtual_su bool CRhRdkContentCreator::AutoEditChild  |  ( |  void  |   | ) |   const
◆ ChangeContentType()
 const CRhRdkContent* CRhRdkContentCreator::ChangeContentType  |  ( |  const CRhRdkContent *&  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName,
|  bool  |  bPreserveOldChild
) |   |  const
◆ ChangeContentTypeEx()
 const CRhRdkContent* CRhRdkContentCreator::ChangeContentTypeEx  |  ( |  const CRhRdkContent *&  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName,
|  bool  |  bPreserveOldChild,
|  unsigned int  |  ic_flags
) |   |  const
◆ CreateNewContent()
 virtual bool CRhRdkContentCreator::CreateNewContent  |  ( |  CRhRdkContentArrayNC &  |  aContentOut,
|  const CRhRdkContent *  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName
) |   |  const
protectedpure virtual
Implemented in CRhRdkContentCreatorExistingInstance, CRhRdkContentCreatorExistingCopy, CRhRdkContentCreatorNew, and CRhRdkContentCreatorLoad.
◆ ErrorString()
 const wchar_t* CRhRdkContentCreator::ErrorString  |  ( |  void  |   | ) |   const
◆ EVF()
 virtual void* CRhRdkContentCreator::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overrideprotectedvirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
Reimplemented in CRhRdkContentCreatorExisting.
◆ FindChildAddOrChange()
 const CRhRdkContent* CRhRdkContentCreator::FindChildAddOrChange  |  ( |  const CRhRdkContent &  |  parentContent,
|  const wchar_t *  |  wszChildSlotName,
|  bool  |  bPreserveOldChild
) |   |  const
◆ IsCopy()
 virtual bool CRhRdkContentCreator::IsCopy  |  ( |  void  |   | ) |   const
protectedpure virtual
Implemented in CRhRdkContentCreatorExisting, CRhRdkContentCreatorNew, and CRhRdkContentCreatorLoad.
◆ OriginalContent()
 virtual const CRhRdkContentArray* CRhRdkContentCreator::OriginalContent  |  ( |  void  |   | ) |   const
protectedpure virtual
Implemented in CRhRdkContentCreatorExisting, CRhRdkContentCreatorNew, and CRhRdkContentCreatorLoad.
◆ RdkDocument()
 const CRhRdkDocument* CRhRdkContentCreator::RdkDocument  |  ( |  void  |   | ) |   const
protected
◆ SetErrorString()
 void CRhRdkContentCreator::SetErrorString  |  ( |  const wchar_t *  |  wsz | ) |   const
protected