Public Member Functions | Public Attributes | List of all members
ON_ParticleSystem::ON_IntegrateContext Class Reference
#include <opennurbs_plus_particle.h>
 Public Member Functions
ON_IntegrateContext (const class ON_ParticleSystem &particle_system, double delta_time) ON_NOEXCEPT
ON_IntegrateContext (const ON_IntegrateContext &) ON_NOEXCEPT
 Public Attributes
const double  | m_current_time
const double  | m_delta_time
const double  | m_delta_time_squared
const double  | m_destination_time
= m_current_time + m_delta_time More...
const double  | m_half_delta_time_squared
ON__UINT_PTR  | m_integrate_context
const class ON_ParticleSystem::ON_Particle *  | m_particle
const class ON_ParticleSystem &  | m_particle_system
Input to particle system integration functions. More...
const double  | m_prev_time
ON_ParticleSystem::ON_ParticleState *  | m_state
Constructor & Destructor Documentation
◆ ON_IntegrateContext() [1/2]
 ON_ParticleSystem::ON_IntegrateContext::ON_IntegrateContext  |  ( |  const class ON_ParticleSystem &  |  particle_system,
|  double  |  delta_time
)
◆ ON_IntegrateContext() [2/2]
 ON_ParticleSystem::ON_IntegrateContext::ON_IntegrateContext  |  ( |  const ON_IntegrateContext &  |   | )
Member Data Documentation
◆ m_current_time
 const double ON_ParticleSystem::ON_IntegrateContext::m_current_time
◆ m_delta_time
 const double ON_ParticleSystem::ON_IntegrateContext::m_delta_time
◆ m_delta_time_squared
 const double ON_ParticleSystem::ON_IntegrateContext::m_delta_time_squared
◆ m_destination_time
 const double ON_ParticleSystem::ON_IntegrateContext::m_destination_time
= m_current_time + m_delta_time
◆ m_half_delta_time_squared
 const double ON_ParticleSystem::ON_IntegrateContext::m_half_delta_time_squared
◆ m_integrate_context
 ON__UINT_PTR ON_ParticleSystem::ON_IntegrateContext::m_integrate_context
◆ m_particle
 const class ON_ParticleSystem::ON_Particle* ON_ParticleSystem::ON_IntegrateContext::m_particle
◆ m_particle_system
 const class ON_ParticleSystem& ON_ParticleSystem::ON_IntegrateContext::m_particle_system
Input to particle system integration functions.
◆ m_prev_time
 const double ON_ParticleSystem::ON_IntegrateContext::m_prev_time
◆ m_state
 ON_ParticleSystem::ON_ParticleState* ON_ParticleSystem::ON_IntegrateContext::m_state
Integration functions receive m_state = m_particle->m_current_state and update position and any other values they care to modify.