Public Member Functions | Public Attributes | List of all members
ON_MeshNgonBuffer Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshNgonBuffer ()
const class ON_MeshNgon *  | CreateFromMeshFace (const class ON_MeshFace *mesh_face, unsigned int face_index)
const class ON_MeshNgon *  | CreateFromMeshFaceIndex (const class ON_Mesh *mesh, unsigned int face_index)
const class ON_MeshNgon *  | CreateFromQuad (const unsigned int quad_vertex_indices[4], unsigned int face_index)
const class ON_MeshNgon *  | CreateFromTriangle (const unsigned int triangle_vertex_indices[3], unsigned int face_index)
const class ON_MeshNgon *  | Ngon () const
 Public Attributes
ON__UINT_PTR  | m_ngon_buffer [10]
Constructor & Destructor Documentation
◆ ON_MeshNgonBuffer()
 ON_MeshNgonBuffer::ON_MeshNgonBuffer  |  ( |   | )
An ON_MeshNgonBuffer provides memory for creating an ON_MeshNgon that is a triangle or quad.
Member Function Documentation
◆ CreateFromMeshFace()
 const class ON_MeshNgon* ON_MeshNgonBuffer::CreateFromMeshFace  |  ( |  const class ON_MeshFace *  |  mesh_face,
|  unsigned int  |  face_index
)
◆ CreateFromMeshFaceIndex()
 const class ON_MeshNgon* ON_MeshNgonBuffer::CreateFromMeshFaceIndex  |  ( |  const class ON_Mesh *  |  mesh,
|  unsigned int  |  face_index
)
◆ CreateFromQuad()
 const class ON_MeshNgon* ON_MeshNgonBuffer::CreateFromQuad  |  ( |  const unsigned int  |  quad_vertex_indices[4],
|  unsigned int  |  face_index
)
◆ CreateFromTriangle()
 const class ON_MeshNgon* ON_MeshNgonBuffer::CreateFromTriangle  |  ( |  const unsigned int  |  triangle_vertex_indices[3],
|  unsigned int  |  face_index
)
◆ Ngon()
 const class ON_MeshNgon* ON_MeshNgonBuffer::Ngon  |  ( |   | ) |   const
Member Data Documentation
◆ m_ngon_buffer
 ON__UINT_PTR ON_MeshNgonBuffer::m_ngon_buffer[10]