Public Member Functions | Friends | List of all members
CRhinoPlugInSettingsChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Member Functions
ON_UUID  | PlugInId () const
CRhinoSettings &  | Settings () const
bool  | ThisRhinoIsSaving () const
 Friends
void  | RhCallWatcher_PlugInSettingsChanged (ON_UUID plugInId, unsigned int pointerId, bool thisRhinoIsSaving)
Member Function Documentation
◆ PlugInId()
 ON_UUID CRhinoPlugInSettingsChanged::CParameters::PlugInId  |  ( |   | ) |   const
Description: The plug-in associated with the CRhinoSettings being saved.
◆ Settings()
 CRhinoSettings& CRhinoPlugInSettingsChanged::CParameters::Settings  |  ( |   | ) |   const
Description: The CRhinoSettings read from the current settings file, compare these values to the CRinoPlugIn::Settings() values to see if anything you care about changed.
◆ ThisRhinoIsSaving()
 bool CRhinoPlugInSettingsChanged::CParameters::ThisRhinoIsSaving  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ RhCallWatcher_PlugInSettingsChanged
 void RhCallWatcher_PlugInSettingsChanged  |  ( |  ON_UUID  |  plugInId,
|  unsigned int  |  pointerId,
|  bool  |  thisRhinoIsSaving
)
friend