Public Member Functions | List of all members
ON_SubDFaceIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDFaceIterator ()=default
ON_SubDFaceIterator (const class ON_SubD &subd)
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDEdge &edge)
Construct and iterator that iterates over the faces of an edge. More...
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDFace &face)
Construct and iterator that iterates over the single face. More...
ON_SubDFaceIterator (const class ON_SubD &subd, const class ON_SubDVertex &vertex)
Construct and iterator that iterates over the faces of a vertex. More...
ON_SubDFaceIterator (const class ON_SubD &subd, unsigned level_index)
An expert tool to iteratate over existing faces on a specified level. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref)
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDEdge &edge)
Construct and iterator that iterates over the faces of an edge. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDFace &face)
Construct and iterator that iterates over the single face. More...
ON_SubDFaceIterator (const class ON_SubDRef &subd_ref, const class ON_SubDVertex &vertex)
Construct and iterator that iterates over the faces of a vertex. More...
ON_SubDFaceIterator (const ON_SubDFaceIterator &)=default
ON_SubDComponentPtr  | BaseComponentPtr () const
ON_SubDEdge *  | BaseEdge () const
ON_SubDVertex *  | BaseVertex () const
const class ON_SubDFace *  | CurrentFace () const
unsigned int  | CurrentFaceIndex () const
unsigned int  | FaceCount () const
const class ON_SubDFace *  | FirstFace ()
const class ON_SubDFace *  | LastFace ()
unsigned int  | MeshFragmentCount () const
const class ON_SubDFace *  | NextFace ()
const class ON_SubDFace *  | operator++ ()
const class ON_SubDFace *  | operator++ (int)
ON_SubDFaceIterator &  | operator= (const ON_SubDFaceIterator &)=default
const class ON_SubD &  | SubD () const
const class ON_SubDRef &  | SubDRef () const
Detailed Description
ON_SubDFaceIterator
Constructor & Destructor Documentation
◆ ON_SubDFaceIterator() [1/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd | )
The best way to get an ON_SubDFaceIterator is so use the ON_SubD member function ON_SubDFaceIterator fit = subd.FaceIterator();
◆ ON_SubDFaceIterator() [2/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  unsigned  |  level_index
)
An expert tool to iteratate over existing faces on a specified level.
Parameters
subd
level_index
◆ ON_SubDFaceIterator() [3/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref | )
The best way to get an ON_SubDFaceIterator is so use the ON_SubD member function ON_SubDFaceIterator fit = subd.FaceIterator();
◆ ON_SubDFaceIterator() [4/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDFace &  |  face
)
Construct and iterator that iterates over the single face.
◆ ON_SubDFaceIterator() [5/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDFace &  |  face
)
Construct and iterator that iterates over the single face.
◆ ON_SubDFaceIterator() [6/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDVertex &  |  vertex
)
Construct and iterator that iterates over the faces of a vertex.
◆ ON_SubDFaceIterator() [7/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDVertex &  |  vertex
)
Construct and iterator that iterates over the faces of a vertex.
◆ ON_SubDFaceIterator() [8/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubD &  |  subd,
|  const class ON_SubDEdge &  |  edge
)
Construct and iterator that iterates over the faces of an edge.
◆ ON_SubDFaceIterator() [9/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const class ON_SubDRef &  |  subd_ref,
|  const class ON_SubDEdge &  |  edge
)
Construct and iterator that iterates over the faces of an edge.
◆ ON_SubDFaceIterator() [10/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |   | )
default
◆ ON_SubDFaceIterator() [11/11]
 ON_SubDFaceIterator::ON_SubDFaceIterator  |  ( |  const ON_SubDFaceIterator &  |   | )
default
Member Function Documentation
◆ BaseComponentPtr()
 ON_SubDComponentPtr ON_SubDFaceIterator::BaseComponentPtr  |  ( |   | ) |   const
inline
Description: Get the iterator's base component in which we are iterating, if it exists. Returns: m_component_ptr if it exists, or ON_SubDComponentPtr::Null.
◆ BaseEdge()
 ON_SubDEdge* ON_SubDFaceIterator::BaseEdge  |  ( |   | ) |   const
inline
Description: Get the iterator's base edge in which we are iterating, if it exists. Returns: m_component_ptr.Edge() if it exists, or nullptr.
◆ BaseVertex()
 ON_SubDVertex* ON_SubDFaceIterator::BaseVertex  |  ( |   | ) |   const
inline
Description: Get the iterator's base vertex in which we are iterating, if it exists. Returns: m_component_ptr.Vertex() if it exists, or nullptr.
◆ CurrentFace()
 const class ON_SubDFace* ON_SubDFaceIterator::CurrentFace  |  ( |   | ) |   const
inline
Returns: Current face;
◆ CurrentFaceIndex()
 unsigned int ON_SubDFaceIterator::CurrentFaceIndex  |  ( |   | ) |   const
inline
Return: Iterator index of the current face.
◆ FaceCount()
 unsigned int ON_SubDFaceIterator::FaceCount  |  ( |   | ) |   const
inline
Return: Number of faces this iterator will iterate through.
◆ FirstFace()
 const class ON_SubDFace* ON_SubDFaceIterator::FirstFace  |  ( |   | )
inline
Description: Set the iterator to the beginning of the face list. Returns: First face in the list.
◆ LastFace()
 const class ON_SubDFace* ON_SubDFaceIterator::LastFace  |  ( |   | )
inline
Description: Set the iterator to the end of the face list. Returns: Last face in the list.
◆ MeshFragmentCount()
 unsigned int ON_SubDFaceIterator::MeshFragmentCount  |  ( |   | ) |   const
◆ NextFace()
 const class ON_SubDFace* ON_SubDFaceIterator::NextFace  |  ( |   | )
inline
Description: Pre-increment the iterator and return the new current face. Returns: Next face. Remarks: operator++(void) and NextFace() behave the same. operator++(int) and NextFace() behave differently.
◆ operator++() [1/2]
 const class ON_SubDFace* ON_SubDFaceIterator::operator++  |  ( |   | )
inline
Description: Prefix increment the iterator. Returns: Next face. Remarks: operator++(void) and NextFace() behave the same. In OpenNURBS 8.17 and earlier, this function was incorrectly implemented as a postfix increment (operator++(int)). This has been corrected in OpenNURBS 8.18. If you have a plugin compiled without inlining optimizations (e.g. in Debug mode), operator++(void) will be calling the version in opennurbs.dll distributed with Rhino that is used to run the plugin. If you have a plugin compiled with inlining optimizations (e.g. in Release mode), operator++(void) will behave like the version in opennurbs_subd.h distributed with the Rhino SDK that was used to compiled the plugin.
◆ operator++() [2/2]
 const class ON_SubDFace* ON_SubDFaceIterator::operator++  |  ( |  int  |   | )
inline
Description: Postfix increment the iterator. Returns: Current face. Remarks: operator++(int) and NextFace() behave differently.
◆ operator=()
 ON_SubDFaceIterator& ON_SubDFaceIterator::operator=  |  ( |  const ON_SubDFaceIterator &  |   | )
default
◆ SubD()
 const class ON_SubD& ON_SubDFaceIterator::SubD  |  ( |   | ) |   const
inline
Returns: The subD object for this iterator.
◆ SubDRef()
 const class ON_SubDRef& ON_SubDFaceIterator::SubDRef  |  ( |   | ) |   const
inline