Classes | Public Member Functions | List of all members
ON_ShutLining Class Reference
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_ShutLining:
 Classes
class  | Curve
class  | CurveIterator
class  | Defaults
 Public Member Functions
ON_ShutLining ()
ON_ShutLining (const ON_ShutLining &sl)
ON_ShutLining (const ON_XMLNode &node)
virtual  | ~ON_ShutLining ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const override
< For internal use only. More...
Curve &  | AddCurve (void)
bool  | AutoUpdate (void) const
Specifies whether the shut-lining automatically updates or not. More...
void  | DeleteAllCurves (void)
Deletes all the curves from the shut-lining. More...
bool  | Faceted (void) const
Specifies whether the shut-lining is faceted or not. More...
Curve *  | FindCurve (const ON_UUID &id) const
Finds a curve on the shut-lining by its id. Returns null if not found. More...
bool  | ForceUpdate (void) const
Specifies whether updating is forced or not. More...
CurveIterator  | GetCurveIterator (void) const
Gets an iterator for iterating over all the curves on the shut-lining. More...
bool  | On (void) const
Specifies whether the feature is enabled or not. More...
bool  | operator!= (const ON_ShutLining &sl) const
const ON_ShutLining &  | operator= (const ON_ShutLining &sl)
bool  | operator== (const ON_ShutLining &sl) const
void  | SetAutoUpdate (bool b)
void  | SetFaceted (bool b)
void  | SetForceUpdate (bool b)
void  | SetOn (bool b)
virtual ON_UUID  | Uuid (void) const override
Return the unique identifier of this mesh modifier. More...
 Public Member Functions inherited from ON_MeshModifier
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
 Additional Inherited Members
 Static Public Member Functions inherited from ON_MeshModifier
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes inherited from ON_MeshModifier
CImpl *  | m_impl
Constructor & Destructor Documentation
◆ ON_ShutLining() [1/3]
 ON_ShutLining::ON_ShutLining  |  ( |   | )
◆ ON_ShutLining() [2/3]
 ON_ShutLining::ON_ShutLining  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_ShutLining() [3/3]
 ON_ShutLining::ON_ShutLining  |  ( |  const ON_ShutLining &  |  sl | )
◆ ~ON_ShutLining()
 virtual ON_ShutLining::~ON_ShutLining  |  ( |   | )
virtual
Member Function Documentation
◆ AddChildXML()
 virtual ON_XMLNode* ON_ShutLining::AddChildXML  |  ( |  ON_XMLRootNode &  |  root | ) |   const
overridevirtual
< For internal use only.
Reimplemented from ON_MeshModifier.
◆ AddCurve()
 Curve& ON_ShutLining::AddCurve  |  ( |  void  |   | )
Adds a new curve to the shut-lining. The curve will have an id of ON_nil_uuid. After adding a curve, you should set the id to that of a curve in the model that will be used to calculate the shut-lining.
◆ AutoUpdate()
 bool ON_ShutLining::AutoUpdate  |  ( |  void  |   | ) |   const
Specifies whether the shut-lining automatically updates or not.
◆ DeleteAllCurves()
 void ON_ShutLining::DeleteAllCurves  |  ( |  void  |   | )
Deletes all the curves from the shut-lining.
◆ Faceted()
 bool ON_ShutLining::Faceted  |  ( |  void  |   | ) |   const
Specifies whether the shut-lining is faceted or not.
◆ FindCurve()
 Curve* ON_ShutLining::FindCurve  |  ( |  const ON_UUID &  |  id | ) |   const
Finds a curve on the shut-lining by its id. Returns null if not found.
◆ ForceUpdate()
 bool ON_ShutLining::ForceUpdate  |  ( |  void  |   | ) |   const
Specifies whether updating is forced or not.
◆ GetCurveIterator()
 CurveIterator ON_ShutLining::GetCurveIterator  |  ( |  void  |   | ) |   const
Gets an iterator for iterating over all the curves on the shut-lining.
◆ On()
 bool ON_ShutLining::On  |  ( |  void  |   | ) |   const
Specifies whether the feature is enabled or not.
◆ operator!=()
 bool ON_ShutLining::operator!=  |  ( |  const ON_ShutLining &  |  sl | ) |   const
◆ operator=()
 const ON_ShutLining& ON_ShutLining::operator=  |  ( |  const ON_ShutLining &  |  sl | )
◆ operator==()
 bool ON_ShutLining::operator==  |  ( |  const ON_ShutLining &  |  sl | ) |   const
◆ SetAutoUpdate()
 void ON_ShutLining::SetAutoUpdate  |  ( |  bool  |  b | )
◆ SetFaceted()
 void ON_ShutLining::SetFaceted  |  ( |  bool  |  b | )
◆ SetForceUpdate()
 void ON_ShutLining::SetForceUpdate  |  ( |  bool  |  b | )
◆ SetOn()
 void ON_ShutLining::SetOn  |  ( |  bool  |  b | )
◆ Uuid()
 virtual ON_UUID ON_ShutLining::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Return the unique identifier of this mesh modifier.
Implements ON_MeshModifier.