Public Member Functions | Public Attributes | List of all members
ON_DimStyle::DimstyleField Class Reference
#include <opennurbs_dimensionstyle.h>
 Public Member Functions
DimstyleField ()
~DimstyleField ()
 Public Attributes
ON_DimStyle::field  | m_field_id
DimstyleField *  | m_next
union {
 bool b_val
 unsigned int c_val
 double d_val
 int i_val
 const ON_wString * s_val
 unsigned char uc_val
}  | m_val
Detailed Description
Colors of Text ON_Color TextColor() const; void SetTextColor(ON_Color color);
Combines a field id and a field value Dimensions will have an array of DimstyleField's to record dimension style overrides for individual dimensions
Constructor & Destructor Documentation
◆ DimstyleField()
 ON_DimStyle::DimstyleField::DimstyleField  |  ( |   | )
inline
◆ ~DimstyleField()
 ON_DimStyle::DimstyleField::~DimstyleField  |  ( |   | )
inline
Member Data Documentation
◆ b_val
 bool ON_DimStyle::DimstyleField::b_val
◆ c_val
 unsigned int ON_DimStyle::DimstyleField::c_val
◆ d_val
 double ON_DimStyle::DimstyleField::d_val
◆ i_val
 int ON_DimStyle::DimstyleField::i_val
◆ m_field_id
 ON_DimStyle::field ON_DimStyle::DimstyleField::m_field_id
◆ m_next
 DimstyleField* ON_DimStyle::DimstyleField::m_next
◆ m_val
 union { ... } ON_DimStyle::DimstyleField::m_val
◆ s_val
 const ON_wString* ON_DimStyle::DimstyleField::s_val
◆ uc_val
 unsigned char ON_DimStyle::DimstyleField::uc_val