Public Member Functions | List of all members
CRhRdkContent::CCustomUserDataFactory Class Referenceabstract
#include <RhRdkContent.h>
 Inheritance diagram for CRhRdkContent::CCustomUserDataFactory:
 Public Member Functions
virtual UUID  | CustomUserDataId (void) const =0
virtual UUID  | InterfaceId (void) const final override
virtual CRhRdkContent::ICustomUserData *  | NewCustomUserData (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Member Function Documentation
◆ CustomUserDataId()
 virtual UUID CRhRdkContent::CCustomUserDataFactory::CustomUserDataId  |  ( |  void  |   | ) |   const
pure virtual
◆ InterfaceId()
 virtual UUID CRhRdkContent::CCustomUserDataFactory::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ NewCustomUserData()
 virtual CRhRdkContent::ICustomUserData* CRhRdkContent::CCustomUserDataFactory::NewCustomUserData  |  ( |  void  |   | ) |   const
pure virtual