Public Member Functions | List of all members
IRhinoUiHolder::IIterator Class Referenceabstract
#include <IRhRdkSectionHolder.h>
 Public Member Functions
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual IRhinoUiSection *  | FirstSection (void)=0
virtual IRhinoUiSection *  | NextSection (void)=0
Member Function Documentation
◆ EVF()
 virtual void* IRhinoUiHolder::IIterator::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
pure virtual
◆ FirstSection()
 virtual IRhinoUiSection* IRhinoUiHolder::IIterator::FirstSection  |  ( |  void  |   | )
pure virtual
◆ NextSection()
 virtual IRhinoUiSection* IRhinoUiHolder::IIterator::NextSection  |  ( |  void  |   | )
pure virtual