Public Member Functions | Friends | List of all members
ON_XMeshVertex Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Inheritance diagram for ON_XMeshVertex:
 Public Member Functions
ON_XMeshVertex (const ON_3dPoint &P)
~ON_XMeshVertex ()
void  | AddEdge (ON_XMeshEdge *pE)
bool IsValid() const; Use base More...
void  | CreateComponentString (ON_wString &S) const override
ON_XMeshEdge *  | Edge (int eid)
const ON_XMeshEdge *  | Edge (int eid) const
int  | EdgeCount () const
void  | Edges (ON_SimpleArray< const ON_XMeshEdge * > &E) const override
void  | Edges (ON_SimpleArray< ON_XMeshEdge * > &E) override
void  | Faces (ON_SimpleArray< const ON_XMeshFace * > &F) const override
Appends to array. More...
void  | Faces (ON_SimpleArray< ON_XMeshFace * > &F) override
Appends to array. More...
const ON_XMeshFace *  | FirstFace () const
ON_3dPoint &  | Point ()
I guess we should allow changes to the location. More...
const ON_3dPoint &  | Point () const
void  | Vertices (ON_SimpleArray< const ON_XMeshVertex * > &V) const override
void  | Vertices (ON_SimpleArray< ON_XMeshVertex * > &V) override
Whatever it is, what are the components that involve it? More...
 Public Member Functions inherited from ON_XMeshComponent
virtual  | ~ON_XMeshComponent ()
bool  | AddEvent (ON_XMeshEvent *pX)
ON_XMeshEdge *  | Edge ()
const ON_XMeshEdge *  | Edge () const
ON_XMeshEvent *  | Event (int xid)
const ON_XMeshEvent *  | Event (int xid) const
int  | EventCount () const
Look through the event list. More...
ON_XMeshFace *  | Face ()
const ON_XMeshFace *  | Face () const
const ON_XMeshEvent *  | FindEvent (const ON_XMeshComponent *pC) const
ON_XMeshEvent *  | FindEvent (ON_XMeshComponent *pC)
bool  | HasEvent (const ON_XMeshComponent *pC) const
Does m_X have a member with component? More...
bool  | IsEdge () const
bool  | IsFace () const
virtual bool  | IsValid () const
bool  | IsVertex () const
What is this thing? More...
void  | RemoveEvent (ON_XMeshEvent *pX)
ON_XMeshVertex *  | Vertex ()
Cast. More...
const ON_XMeshVertex *  | Vertex () const
 Friends
class  | ON_XMesh
class  | ON_XMeshIntersector
class  | ON_XMeshVertexIterator
class  | ON_XMeshVertexPool
 Additional Inherited Members
 Protected Member Functions inherited from ON_XMeshComponent
ON_XMeshComponent ()
ON_XMeshComponent (const ON_XMeshComponent &C)
Not implemented. More...
ON_XMeshComponent &  | operator= (const ON_XMeshComponent &src)
Not implemented. More...
 Protected Attributes inherited from ON_XMeshComponent
bool  | m_bIsValid
const ON_XMesh *  | m_pM
used by fixed pool stuff More...
eXMeshPoolStatus  | m_status
ON_XMeshEventList *  | m_X
events not managed here More...
Constructor & Destructor Documentation
◆ ON_XMeshVertex()
 ON_XMeshVertex::ON_XMeshVertex  |  ( |  const ON_3dPoint &  |  P | )
◆ ~ON_XMeshVertex()
 ON_XMeshVertex::~ON_XMeshVertex  |  ( |   | )
Member Function Documentation
◆ AddEdge()
 void ON_XMeshVertex::AddEdge  |  ( |  ON_XMeshEdge *  |  pE | )
bool IsValid() const; Use base
This does not change the edge's vertices.
◆ CreateComponentString()
 void ON_XMeshVertex::CreateComponentString  |  ( |  ON_wString &  |  S | ) |   const
overridevirtual
Reimplemented from ON_XMeshComponent.
◆ Edge() [1/2]
 ON_XMeshEdge* ON_XMeshVertex::Edge  |  ( |  int  |  eid | )
◆ Edge() [2/2]
 const ON_XMeshEdge* ON_XMeshVertex::Edge  |  ( |  int  |  eid | ) |   const
◆ EdgeCount()
 int ON_XMeshVertex::EdgeCount  |  ( |   | ) |   const
◆ Edges() [1/2]
 void ON_XMeshVertex::Edges  |  ( |  ON_SimpleArray< const ON_XMeshEdge * > &  |  E | ) |   const
overridevirtual
Implements ON_XMeshComponent.
◆ Edges() [2/2]
 void ON_XMeshVertex::Edges  |  ( |  ON_SimpleArray< ON_XMeshEdge * > &  |  E | )
overridevirtual
Implements ON_XMeshComponent.
◆ Faces() [1/2]
 void ON_XMeshVertex::Faces  |  ( |  ON_SimpleArray< const ON_XMeshFace * > &  |  Faces | ) |   const
overridevirtual
Appends to array.
Implements ON_XMeshComponent.
◆ Faces() [2/2]
 void ON_XMeshVertex::Faces  |  ( |  ON_SimpleArray< ON_XMeshFace * > &  |  Faces | )
overridevirtual
Appends to array.
Implements ON_XMeshComponent.
◆ FirstFace()
 const ON_XMeshFace* ON_XMeshVertex::FirstFace  |  ( |   | ) |   const
◆ Point() [1/2]
 ON_3dPoint& ON_XMeshVertex::Point  |  ( |   | )
I guess we should allow changes to the location.
◆ Point() [2/2]
 const ON_3dPoint& ON_XMeshVertex::Point  |  ( |   | ) |   const
◆ Vertices() [1/2]
 void ON_XMeshVertex::Vertices  |  ( |  ON_SimpleArray< const ON_XMeshVertex * > &  |  V | ) |   const
overridevirtual
Implements ON_XMeshComponent.
◆ Vertices() [2/2]
 void ON_XMeshVertex::Vertices  |  ( |  ON_SimpleArray< ON_XMeshVertex * > &  |  Vertices | )
overridevirtual
Whatever it is, what are the components that involve it?
Implements ON_XMeshComponent.
Friends And Related Function Documentation
◆ ON_XMesh
 friend class ON_XMesh
friend
◆ ON_XMeshIntersector
 friend class ON_XMeshIntersector
friend
◆ ON_XMeshVertexIterator
 friend class ON_XMeshVertexIterator
friend
◆ ON_XMeshVertexPool
 friend class ON_XMeshVertexPool
friend