Public Member Functions | List of all members
CRhRdkInternalSnapshotWorkaround Class Referencefinal
RDK
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkInternalSnapshotWorkaround (CRhinoDoc &doc)
~CRhRdkInternalSnapshotWorkaround ()
Constructor & Destructor Documentation
◆ CRhRdkInternalSnapshotWorkaround()
 CRhRdkInternalSnapshotWorkaround::CRhRdkInternalSnapshotWorkaround  |  ( |  CRhinoDoc &  |  doc | )
◆ ~CRhRdkInternalSnapshotWorkaround()
 CRhRdkInternalSnapshotWorkaround::~CRhRdkInternalSnapshotWorkaround  |  ( |   | )