Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoUiListBoxEx Class Reference
RhinoUI
#include <RhinoSdkUiListBoxEx.h>
 Inheritance diagram for CRhinoUiListBoxEx:
 Public Types
enum  | { LBEX_EDITBUTTON = 0x4000L, force_32bit_listbox_ex = 0xFFFFFFFF }
 Public Member Functions
CRhinoUiListBoxEx ()
virtual  | ~CRhinoUiListBoxEx ()
void  | AllowDrag (BOOL32 bAllowDrag=TRUE)
void  | AllowEditing (BOOL32 bAllowEditing=TRUE)
void  | BeginEditing (int iItem)
void  | EditNew ()
void  | EndEditing (BOOL32 fCancel)
HWND  | GetEditHandle () const
int  | MoveItemDown (int iItem)
int  | MoveItemUp (int iItem)
virtual BOOL32  | OnBeginEditing (int iItem)
virtual void  | OnBrowseButton (int iItem)
virtual BOOL32  | OnChildNotify (UINT message, WPARAM wParam, LPARAM lParam, LRESULT *pLResult)
virtual BOOL32  | OnEndEditing (int iItem, BOOL32 fCanceled)
void  | SetEditStyle (DWORD dwEditStyle)
void  | SetEditText (const CString &strNewText) const
void  | SetItem (int iItem, LPCTSTR szItemText, DWORD_PTR dwItemData)
void  | SetItemText (int iItem, LPCTSTR szItemText)
void  | SwapItems (int iFirstItem, int iSecondItem)
 Protected Member Functions
virtual void  | DrawInsert (int nIndex)
virtual void  | DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct)
void  | DrawSeparator (int nIndex)
virtual void  | MeasureItem (LPMEASUREITEMSTRUCT lpMeasureItemStruct)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg LRESULT  | OnEndEditMessage (WPARAM wParam, LPARAM lParam)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnSysKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
Detailed Description
CRhinoUiListBoxEx
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
LBEX_EDITBUTTON
Listbox editing mode If set, shows a "..." button near the edit box
force_32bit_listbox_ex
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiListBoxEx()
 CRhinoUiListBoxEx::CRhinoUiListBoxEx  |  ( |   | )
◆ ~CRhinoUiListBoxEx()
 virtual CRhinoUiListBoxEx::~CRhinoUiListBoxEx  |  ( |   | )
virtual
Member Function Documentation
◆ AllowDrag()
 void CRhinoUiListBoxEx::AllowDrag  |  ( |  BOOL32  |  bAllowDrag = TRUE | )
inline
◆ AllowEditing()
 void CRhinoUiListBoxEx::AllowEditing  |  ( |  BOOL32  |  bAllowEditing = TRUE | )
inline
◆ BeginEditing()
 void CRhinoUiListBoxEx::BeginEditing  |  ( |  int  |  iItem | )
◆ DrawInsert()
 virtual void CRhinoUiListBoxEx::DrawInsert  |  ( |  int  |  nIndex | )
protectedvirtual
◆ DrawItem()
 virtual void CRhinoUiListBoxEx::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |  lpDrawItemStruct | )
protectedvirtual
◆ DrawSeparator()
 void CRhinoUiListBoxEx::DrawSeparator  |  ( |  int  |  nIndex | )
protected
◆ EditNew()
 void CRhinoUiListBoxEx::EditNew  |  ( |   | )
◆ EndEditing()
 void CRhinoUiListBoxEx::EndEditing  |  ( |  BOOL32  |  fCancel | )
◆ GetEditHandle()
 HWND CRhinoUiListBoxEx::GetEditHandle  |  ( |   | ) |   const
◆ MeasureItem()
 virtual void CRhinoUiListBoxEx::MeasureItem  |  ( |  LPMEASUREITEMSTRUCT  |  lpMeasureItemStruct | )
protectedvirtual
◆ MoveItemDown()
 int CRhinoUiListBoxEx::MoveItemDown  |  ( |  int  |  iItem | )
◆ MoveItemUp()
 int CRhinoUiListBoxEx::MoveItemUp  |  ( |  int  |  iItem | )
◆ OnBeginEditing()
 virtual BOOL32 CRhinoUiListBoxEx::OnBeginEditing  |  ( |  int  |  iItem | )
virtual
◆ OnBrowseButton()
 virtual void CRhinoUiListBoxEx::OnBrowseButton  |  ( |  int  |  iItem | )
virtual
◆ OnChildNotify()
 virtual BOOL32 CRhinoUiListBoxEx::OnChildNotify  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  LRESULT *  |  pLResult
)
virtual
◆ OnCreate()
 afx_msg int CRhinoUiListBoxEx::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
◆ OnEndEditing()
 virtual BOOL32 CRhinoUiListBoxEx::OnEndEditing  |  ( |  int  |  iItem,
|  BOOL32  |  fCanceled
)
virtual
◆ OnEndEditMessage()
 afx_msg LRESULT CRhinoUiListBoxEx::OnEndEditMessage  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protected
◆ OnKeyDown()
 afx_msg void CRhinoUiListBoxEx::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
protected
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiListBoxEx::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnLButtonDown()
 afx_msg void CRhinoUiListBoxEx::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnLButtonUp()
 afx_msg void CRhinoUiListBoxEx::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnSysKeyDown()
 afx_msg void CRhinoUiListBoxEx::OnSysKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
protected
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiListBoxEx::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreSubclassWindow()
 virtual void CRhinoUiListBoxEx::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ SetEditStyle()
 void CRhinoUiListBoxEx::SetEditStyle  |  ( |  DWORD  |  dwEditStyle | )
◆ SetEditText()
 void CRhinoUiListBoxEx::SetEditText  |  ( |  const CString &  |  strNewText | ) |   const
◆ SetItem()
 void CRhinoUiListBoxEx::SetItem  |  ( |  int  |  iItem,
|  LPCTSTR  |  szItemText,
|  DWORD_PTR  |  dwItemData
)
◆ SetItemText()
 void CRhinoUiListBoxEx::SetItemText  |  ( |  int  |  iItem,
|  LPCTSTR  |  szItemText
)
◆ SwapItems()
 void CRhinoUiListBoxEx::SwapItems  |  ( |  int  |  iFirstItem,
|  int  |  iSecondItem
)