Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
CRhinoAppDontRepeatCommandSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppDontRepeatCommandSettings ()
bool  | CommandInDontRepeatList (const class CRhinoCommand *cmd) const
void  | Defaults ()
void  | GetDontRepeatList (ON_wString &list) const
void  | LoadProfile (CRhinoProfileContext &pc)
For internal use only. More...
bool  | operator!= (const CRhinoAppDontRepeatCommandSettings &other) const
bool  | operator== (const CRhinoAppDontRepeatCommandSettings &other) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
int  | SetDontRepeatList (const wchar_t *lps)
bool  | UseDontRepeatList () const
 Public Attributes
ON_ClassArray< ON_wString >  | m_dont_repeat_list
List of commands that will not repeat. More...
 Static Public Attributes
static const CRhinoAppDontRepeatCommandSettings  | Default
 Friends
class  | CRhAppSettingsData
class  | CRhinoAppSettings
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppDontRepeatCommandSettings()
 CRhinoAppDontRepeatCommandSettings::CRhinoAppDontRepeatCommandSettings  |  ( |   | )
Member Function Documentation
◆ CommandInDontRepeatList()
 bool CRhinoAppDontRepeatCommandSettings::CommandInDontRepeatList  |  ( |  const class CRhinoCommand *  |  cmd | ) |   const
◆ Defaults()
 void CRhinoAppDontRepeatCommandSettings::Defaults  |  ( |   | )
◆ GetDontRepeatList()
 void CRhinoAppDontRepeatCommandSettings::GetDontRepeatList  |  ( |  ON_wString &  |  list | ) |   const
Description: Convert m_dont_repeat_list to space delited string Parameters: list [out] Receives delimited string
◆ LoadProfile()
 void CRhinoAppDontRepeatCommandSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
For internal use only.
load from registry
◆ operator!=()
 bool CRhinoAppDontRepeatCommandSettings::operator!=  |  ( |  const CRhinoAppDontRepeatCommandSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoAppDontRepeatCommandSettings::operator==  |  ( |  const CRhinoAppDontRepeatCommandSettings &  |  other | ) |   const
◆ SaveProfile()
 void CRhinoAppDontRepeatCommandSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetDontRepeatList()
 int CRhinoAppDontRepeatCommandSettings::SetDontRepeatList  |  ( |  const wchar_t *  |  lps | )
Description: Parse input string and put command name tokens in m_dont_repeat_list. Parameters: lps [in] - String to parse. Will use " ", "," and ";" as delimiters. Returns: Number of items added to m_dont_repeat_list.
◆ UseDontRepeatList()
 bool CRhinoAppDontRepeatCommandSettings::UseDontRepeatList  |  ( |   | ) |   const
Description: Only use the m_dont_repeat_list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands() Returns: A return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list will be used instead. False means the individual CRhinoCommands will determine if they are repeatable.
Friends And Related Function Documentation
◆ CRhAppSettingsData
 friend class CRhAppSettingsData
friend
◆ CRhinoAppSettings
 friend class CRhinoAppSettings
friend
Member Data Documentation
◆ Default
 const CRhinoAppDontRepeatCommandSettings CRhinoAppDontRepeatCommandSettings::Default
static
◆ m_dont_repeat_list
 ON_ClassArray<ON_wString> CRhinoAppDontRepeatCommandSettings::m_dont_repeat_list
List of commands that will not repeat.