Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoSettings Class Reference
Rhino
#include <RhinoSdkPersistentSettings.h>
 Public Member Functions
~CRhinoSettings ()
CRhinoSettings *  | AddChild (const wchar_t *key)
const ON_UUID &  | CommandId () const
bool  | DeleteChild (const wchar_t *key)
bool  | DeleteItem (const wchar_t *key)
bool  | Get3dPoint (const wchar_t *key, ON_3dPoint &value) const
bool  | Get3dPoint (const wchar_t *key, ON_3dPoint &value, const ON_3dPoint &defaultValue) const
bool  | Get3dVector (const wchar_t *key, ON_3dVector &value) const
bool  | Get3dVector (const wchar_t *key, ON_3dVector &value, const ON_3dVector &defaultValue) const
bool  | GetBool (const wchar_t *key, bool &value) const
bool  | GetBool (const wchar_t *key, bool &value, bool defaultValue) const
CRhinoSettings *  | GetChild (const wchar_t *key) const
int  | GetChildKeys (ON_ClassArray< ON_wString > &keys) const
bool  | GetColor (const wchar_t *key, ON_Color &value) const
bool  | GetColor (const wchar_t *key, ON_Color &value, const ON_Color &defaultValue) const
bool  | GetDouble (const wchar_t *key, double &value) const
bool  | GetDouble (const wchar_t *key, double &value, double defaultValue) const
bool  | GetFloat (const wchar_t *key, float &value) const
bool  | GetFloat (const wchar_t *key, float &value, float defaultValue) const
bool  | GetHideFromUserInterface (const wchar_t *key, bool &value) const
bool  | GetInteger (const wchar_t *key, int &value, const wchar_t *const *legacyKeyList=NULL, int count=0) const
bool  | GetInteger (const wchar_t *key, int &value, int defaultValue, const wchar_t *const *legacyKeyList=NULL, int count=0) const
bool  | GetInteger (const wchar_t *key, int &value, int defaultValue, int bound, bool boundIsLower) const
bool  | GetInteger (const wchar_t *key, int &value, int defaultValue, int lowerBound, int upperBound) const
bool  | GetInteger (const wchar_t *key, unsigned int &value) const
bool  | GetInteger (const wchar_t *key, unsigned int &value, unsigned int defaultValue) const
int  | GetKeys (ON_ClassArray< ON_wString > &keys) const
bool  | GetPoint (const wchar_t *key, POINT &value) const
bool  | GetPoint (const wchar_t *key, POINT &value, const POINT &defaultValue) const
bool  | GetRect (const wchar_t *key, ON_4iRect &value) const
bool  | GetRect (const wchar_t *key, ON_4iRect &value, const ON_4iRect &defaultValue) const
bool  | GetRect (const wchar_t *key, RECT &value) const
bool  | GetRect (const wchar_t *key, RECT &value, const RECT &defaultValue) const
bool  | GetSize (const wchar_t *key, SIZE &value) const
bool  | GetSize (const wchar_t *key, SIZE &value, const SIZE &defaultValue) const
bool  | GetString (const wchar_t *key, ON_wString &value) const
bool  | GetString (const wchar_t *key, ON_wString &value, const wchar_t *defaultValue) const
bool  | GetStringDictionary (const wchar_t *key, CRhinoStringDictionary &value) const
bool  | GetStringDictionary (const wchar_t *key, CRhinoStringDictionary &value, const CRhinoStringDictionary &defaultValue) const
bool  | GetStringList (const wchar_t *key, ON_ClassArray< ON_wString > &value) const
bool  | GetStringList (const wchar_t *key, ON_ClassArray< ON_wString > &value, const ON_ClassArray< ON_wString > &defaultValue) const
bool  | GetUuid (const wchar_t *key, ON_UUID &value) const
bool  | GetUuid (const wchar_t *key, ON_UUID &value, const ON_UUID &defaultValue) const
bool  | HiddenFromUserInterface () const
bool  | HideFromUserInterface (bool hide)
const wchar_t *  | Name () const
const ON_UUID &  | PlugInId () const
bool  | Set3dPoint (const wchar_t *key, const ON_3dPoint &value)
bool  | Set3dVector (const wchar_t *key, const ON_3dVector &value)
bool  | SetBool (const wchar_t *key, bool value)
bool  | SetColor (const wchar_t *key, const ON_Color &value)
bool  | SetDefaultBool (const wchar_t *key, bool value)
bool  | SetDefaultColor (const wchar_t *key, const ON_Color &value)
bool  | SetDefaultDouble (const wchar_t *key, double value)
bool  | SetDefaultFloat (const wchar_t *key, float value)
bool  | SetDefaultInteger (const wchar_t *key, int value)
bool  | SetDefaultInteger (const wchar_t *key, unsigned int value)
bool  | SetDefaultPoint (const wchar_t *key, const POINT &value)
bool  | SetDefaultRect (const wchar_t *key, const RECT &value)
bool  | SetDefaultSize (const wchar_t *key, const SIZE &value)
bool  | SetDefaultString (const wchar_t *key, const wchar_t *value)
bool  | SetDefaultStringDictionary (const wchar_t *key, const CRhinoStringDictionary &value)
bool  | SetDefaultStringList (const wchar_t *key, const ON_ClassArray< ON_wString > &value)
bool  | SetDefaultUuid (const wchar_t *key, const ON_UUID &value)
bool  | SetDouble (const wchar_t *key, double value)
bool  | SetFloat (const wchar_t *key, float value)
bool  | SetHideFromUserInterface (const wchar_t *key, bool value)
bool  | SetInteger (const wchar_t *key, int value)
bool  | SetInteger (const wchar_t *key, unsigned int value)
bool  | SetPoint (const wchar_t *key, const POINT &value)
bool  | SetRect (const wchar_t *key, const ON_4iRect &value)
bool  | SetRect (const wchar_t *key, const RECT &value)
bool  | SetSize (const wchar_t *key, const SIZE &value)
bool  | SetString (const wchar_t *key, const wchar_t *value)
bool  | SetStringDictionary (const wchar_t *key, const CRhinoStringDictionary &value)
bool  | SetStringList (const wchar_t *key, const ON_ClassArray< ON_wString > &value)
bool  | SetUuid (const wchar_t *key, const ON_UUID &value)
 Static Public Member Functions
static CRhinoSettings *  | GetPlugInSettings (const ON_UUID &plugInId, bool forcePlugInToLoad)
 Protected Member Functions
CRhinoSettings (ON_UUID plugInId, unsigned int pointerId, const ON_UUID &commandId, const wchar_t *englishCommandName)
 Protected Attributes
ON_SimpleArray< CRhinoSettings * >  | m_children
ON_UUID  | m_command_id
ON_wString  | m_english_command_name
ON_UUID  | m_plug_in_id
unsigned int  | m_pointer_id
 Friends
class  | CRhinoCommand
class  | CRhPlugInSettings
class  | CRhSettingsHooks
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoSettings()
 CRhinoSettings::CRhinoSettings  |  ( |  ON_UUID  |  plugInId,
|  unsigned int  |  pointerId,
|  const ON_UUID &  |  commandId,
|  const wchar_t *  |  englishCommandName
)
protected
◆ ~CRhinoSettings()
 CRhinoSettings::~CRhinoSettings  |  ( |   | )
Member Function Documentation
◆ AddChild()
 CRhinoSettings* CRhinoSettings::AddChild  |  ( |  const wchar_t *  |  key | )
◆ CommandId()
 const ON_UUID& CRhinoSettings::CommandId  |  ( |   | ) |   const
inline
◆ DeleteChild()
 bool CRhinoSettings::DeleteChild  |  ( |  const wchar_t *  |  key | )
◆ DeleteItem()
 bool CRhinoSettings::DeleteItem  |  ( |  const wchar_t *  |  key | )
◆ Get3dPoint() [1/2]
 bool CRhinoSettings::Get3dPoint  |  ( |  const wchar_t *  |  key,
|  ON_3dPoint &  |  value
) |   |  const
◆ Get3dPoint() [2/2]
 bool CRhinoSettings::Get3dPoint  |  ( |  const wchar_t *  |  key,
|  ON_3dPoint &  |  value,
|  const ON_3dPoint &  |  defaultValue
) |   |  const
◆ Get3dVector() [1/2]
 bool CRhinoSettings::Get3dVector  |  ( |  const wchar_t *  |  key,
|  ON_3dVector &  |  value
) |   |  const
◆ Get3dVector() [2/2]
 bool CRhinoSettings::Get3dVector  |  ( |  const wchar_t *  |  key,
|  ON_3dVector &  |  value,
|  const ON_3dVector &  |  defaultValue
) |   |  const
◆ GetBool() [1/2]
 bool CRhinoSettings::GetBool  |  ( |  const wchar_t *  |  key,
|  bool &  |  value
) |   |  const
◆ GetBool() [2/2]
 bool CRhinoSettings::GetBool  |  ( |  const wchar_t *  |  key,
|  bool &  |  value,
|  bool  |  defaultValue
) |   |  const
◆ GetChild()
 CRhinoSettings* CRhinoSettings::GetChild  |  ( |  const wchar_t *  |  key | ) |   const
◆ GetChildKeys()
 int CRhinoSettings::GetChildKeys  |  ( |  ON_ClassArray< ON_wString > &  |  keys | ) |   const
◆ GetColor() [1/2]
 bool CRhinoSettings::GetColor  |  ( |  const wchar_t *  |  key,
|  ON_Color &  |  value
) |   |  const
◆ GetColor() [2/2]
 bool CRhinoSettings::GetColor  |  ( |  const wchar_t *  |  key,
|  ON_Color &  |  value,
|  const ON_Color &  |  defaultValue
) |   |  const
◆ GetDouble() [1/2]
 bool CRhinoSettings::GetDouble  |  ( |  const wchar_t *  |  key,
|  double &  |  value
) |   |  const
◆ GetDouble() [2/2]
 bool CRhinoSettings::GetDouble  |  ( |  const wchar_t *  |  key,
|  double &  |  value,
|  double  |  defaultValue
) |   |  const
◆ GetFloat() [1/2]
 bool CRhinoSettings::GetFloat  |  ( |  const wchar_t *  |  key,
|  float &  |  value
) |   |  const
◆ GetFloat() [2/2]
 bool CRhinoSettings::GetFloat  |  ( |  const wchar_t *  |  key,
|  float &  |  value,
|  float  |  defaultValue
) |   |  const
◆ GetHideFromUserInterface()
 bool CRhinoSettings::GetHideFromUserInterface  |  ( |  const wchar_t *  |  key,
|  bool &  |  value
) |   |  const
◆ GetInteger() [1/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  int &  |  value,
|  const wchar_t *const *  |  legacyKeyList = NULL,
|  int  |  count = 0
) |   |  const
◆ GetInteger() [2/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  int &  |  value,
|  int  |  defaultValue,
|  const wchar_t *const *  |  legacyKeyList = NULL,
|  int  |  count = 0
) |   |  const
◆ GetInteger() [3/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  int &  |  value,
|  int  |  defaultValue,
|  int  |  bound,
|  bool  |  boundIsLower
) |   |  const
◆ GetInteger() [4/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  int &  |  value,
|  int  |  defaultValue,
|  int  |  lowerBound,
|  int  |  upperBound
) |   |  const
◆ GetInteger() [5/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  unsigned int &  |  value
) |   |  const
◆ GetInteger() [6/6]
 bool CRhinoSettings::GetInteger  |  ( |  const wchar_t *  |  key,
|  unsigned int &  |  value,
|  unsigned int  |  defaultValue
) |   |  const
◆ GetKeys()
 int CRhinoSettings::GetKeys  |  ( |  ON_ClassArray< ON_wString > &  |  keys | ) |   const
◆ GetPlugInSettings()
 static CRhinoSettings* CRhinoSettings::GetPlugInSettings  |  ( |  const ON_UUID &  |  plugInId,
|  bool  |  forcePlugInToLoad
)
static
Description: Get settings associated with a plug-in Parameters: plugInId [in] Id of the plug-in to get settings from forcePlugInToLoad [in] Only used if the plug-in is not currently loaded, if it is not currently loaded and this is set to true then the plug-in will load and its settings returned, if this is false and the plug-in is not loaded NULL will be returned. Returns: Returns a pointer to a settings class if the plug-in is loaded otherwise returns NULL.
◆ GetPoint() [1/2]
 bool CRhinoSettings::GetPoint  |  ( |  const wchar_t *  |  key,
|  POINT &  |  value
) |   |  const
◆ GetPoint() [2/2]
 bool CRhinoSettings::GetPoint  |  ( |  const wchar_t *  |  key,
|  POINT &  |  value,
|  const POINT &  |  defaultValue
) |   |  const
◆ GetRect() [1/4]
 bool CRhinoSettings::GetRect  |  ( |  const wchar_t *  |  key,
|  ON_4iRect &  |  value
) |   |  const
◆ GetRect() [2/4]
 bool CRhinoSettings::GetRect  |  ( |  const wchar_t *  |  key,
|  ON_4iRect &  |  value,
|  const ON_4iRect &  |  defaultValue
) |   |  const
◆ GetRect() [3/4]
 bool CRhinoSettings::GetRect  |  ( |  const wchar_t *  |  key,
|  RECT &  |  value
) |   |  const
◆ GetRect() [4/4]
 bool CRhinoSettings::GetRect  |  ( |  const wchar_t *  |  key,
|  RECT &  |  value,
|  const RECT &  |  defaultValue
) |   |  const
◆ GetSize() [1/2]
 bool CRhinoSettings::GetSize  |  ( |  const wchar_t *  |  key,
|  SIZE &  |  value
) |   |  const
◆ GetSize() [2/2]
 bool CRhinoSettings::GetSize  |  ( |  const wchar_t *  |  key,
|  SIZE &  |  value,
|  const SIZE &  |  defaultValue
) |   |  const
◆ GetString() [1/2]
 bool CRhinoSettings::GetString  |  ( |  const wchar_t *  |  key,
|  ON_wString &  |  value
) |   |  const
◆ GetString() [2/2]
 bool CRhinoSettings::GetString  |  ( |  const wchar_t *  |  key,
|  ON_wString &  |  value,
|  const wchar_t *  |  defaultValue
) |   |  const
◆ GetStringDictionary() [1/2]
 bool CRhinoSettings::GetStringDictionary  |  ( |  const wchar_t *  |  key,
|  CRhinoStringDictionary &  |  value
) |   |  const
◆ GetStringDictionary() [2/2]
 bool CRhinoSettings::GetStringDictionary  |  ( |  const wchar_t *  |  key,
|  CRhinoStringDictionary &  |  value,
|  const CRhinoStringDictionary &  |  defaultValue
) |   |  const
◆ GetStringList() [1/2]
 bool CRhinoSettings::GetStringList  |  ( |  const wchar_t *  |  key,
|  ON_ClassArray< ON_wString > &  |  value
) |   |  const
◆ GetStringList() [2/2]
 bool CRhinoSettings::GetStringList  |  ( |  const wchar_t *  |  key,
|  ON_ClassArray< ON_wString > &  |  value,
|  const ON_ClassArray< ON_wString > &  |  defaultValue
) |   |  const
◆ GetUuid() [1/2]
 bool CRhinoSettings::GetUuid  |  ( |  const wchar_t *  |  key,
|  ON_UUID &  |  value
) |   |  const
◆ GetUuid() [2/2]
 bool CRhinoSettings::GetUuid  |  ( |  const wchar_t *  |  key,
|  ON_UUID &  |  value,
|  const ON_UUID &  |  defaultValue
) |   |  const
◆ HiddenFromUserInterface()
 bool CRhinoSettings::HiddenFromUserInterface  |  ( |   | ) |   const
◆ HideFromUserInterface()
 bool CRhinoSettings::HideFromUserInterface  |  ( |  bool  |  hide | )
◆ Name()
 const wchar_t* CRhinoSettings::Name  |  ( |   | ) |   const
inline
◆ PlugInId()
 const ON_UUID& CRhinoSettings::PlugInId  |  ( |   | ) |   const
inline
◆ Set3dPoint()
 bool CRhinoSettings::Set3dPoint  |  ( |  const wchar_t *  |  key,
|  const ON_3dPoint &  |  value
)
◆ Set3dVector()
 bool CRhinoSettings::Set3dVector  |  ( |  const wchar_t *  |  key,
|  const ON_3dVector &  |  value
)
◆ SetBool()
 bool CRhinoSettings::SetBool  |  ( |  const wchar_t *  |  key,
|  bool  |  value
)
◆ SetColor()
 bool CRhinoSettings::SetColor  |  ( |  const wchar_t *  |  key,
|  const ON_Color &  |  value
)
◆ SetDefaultBool()
 bool CRhinoSettings::SetDefaultBool  |  ( |  const wchar_t *  |  key,
|  bool  |  value
)
◆ SetDefaultColor()
 bool CRhinoSettings::SetDefaultColor  |  ( |  const wchar_t *  |  key,
|  const ON_Color &  |  value
)
◆ SetDefaultDouble()
 bool CRhinoSettings::SetDefaultDouble  |  ( |  const wchar_t *  |  key,
|  double  |  value
)
◆ SetDefaultFloat()
 bool CRhinoSettings::SetDefaultFloat  |  ( |  const wchar_t *  |  key,
|  float  |  value
)
◆ SetDefaultInteger() [1/2]
 bool CRhinoSettings::SetDefaultInteger  |  ( |  const wchar_t *  |  key,
|  int  |  value
)
◆ SetDefaultInteger() [2/2]
 bool CRhinoSettings::SetDefaultInteger  |  ( |  const wchar_t *  |  key,
|  unsigned int  |  value
)
◆ SetDefaultPoint()
 bool CRhinoSettings::SetDefaultPoint  |  ( |  const wchar_t *  |  key,
|  const POINT &  |  value
)
◆ SetDefaultRect()
 bool CRhinoSettings::SetDefaultRect  |  ( |  const wchar_t *  |  key,
|  const RECT &  |  value
)
◆ SetDefaultSize()
 bool CRhinoSettings::SetDefaultSize  |  ( |  const wchar_t *  |  key,
|  const SIZE &  |  value
)
◆ SetDefaultString()
 bool CRhinoSettings::SetDefaultString  |  ( |  const wchar_t *  |  key,
|  const wchar_t *  |  value
)
◆ SetDefaultStringDictionary()
 bool CRhinoSettings::SetDefaultStringDictionary  |  ( |  const wchar_t *  |  key,
|  const CRhinoStringDictionary &  |  value
)
◆ SetDefaultStringList()
 bool CRhinoSettings::SetDefaultStringList  |  ( |  const wchar_t *  |  key,
|  const ON_ClassArray< ON_wString > &  |  value
)
◆ SetDefaultUuid()
 bool CRhinoSettings::SetDefaultUuid  |  ( |  const wchar_t *  |  key,
|  const ON_UUID &  |  value
)
◆ SetDouble()
 bool CRhinoSettings::SetDouble  |  ( |  const wchar_t *  |  key,
|  double  |  value
)
◆ SetFloat()
 bool CRhinoSettings::SetFloat  |  ( |  const wchar_t *  |  key,
|  float  |  value
)
◆ SetHideFromUserInterface()
 bool CRhinoSettings::SetHideFromUserInterface  |  ( |  const wchar_t *  |  key,
|  bool  |  value
)
◆ SetInteger() [1/2]
 bool CRhinoSettings::SetInteger  |  ( |  const wchar_t *  |  key,
|  int  |  value
)
◆ SetInteger() [2/2]
 bool CRhinoSettings::SetInteger  |  ( |  const wchar_t *  |  key,
|  unsigned int  |  value
)
◆ SetPoint()
 bool CRhinoSettings::SetPoint  |  ( |  const wchar_t *  |  key,
|  const POINT &  |  value
)
◆ SetRect() [1/2]
 bool CRhinoSettings::SetRect  |  ( |  const wchar_t *  |  key,
|  const ON_4iRect &  |  value
)
◆ SetRect() [2/2]
 bool CRhinoSettings::SetRect  |  ( |  const wchar_t *  |  key,
|  const RECT &  |  value
)
◆ SetSize()
 bool CRhinoSettings::SetSize  |  ( |  const wchar_t *  |  key,
|  const SIZE &  |  value
)
◆ SetString()
 bool CRhinoSettings::SetString  |  ( |  const wchar_t *  |  key,
|  const wchar_t *  |  value
)
◆ SetStringDictionary()
 bool CRhinoSettings::SetStringDictionary  |  ( |  const wchar_t *  |  key,
|  const CRhinoStringDictionary &  |  value
)
◆ SetStringList()
 bool CRhinoSettings::SetStringList  |  ( |  const wchar_t *  |  key,
|  const ON_ClassArray< ON_wString > &  |  value
)
◆ SetUuid()
 bool CRhinoSettings::SetUuid  |  ( |  const wchar_t *  |  key,
|  const ON_UUID &  |  value
)
Friends And Related Function Documentation
◆ CRhinoCommand
 friend class CRhinoCommand
friend
◆ CRhPlugInSettings
 friend class CRhPlugInSettings
friend
◆ CRhSettingsHooks
 friend class CRhSettingsHooks
friend
Member Data Documentation
◆ m_children
 ON_SimpleArray<CRhinoSettings*> CRhinoSettings::m_children
protected
◆ m_command_id
 ON_UUID CRhinoSettings::m_command_id
protected
◆ m_english_command_name
 ON_wString CRhinoSettings::m_english_command_name
protected
◆ m_plug_in_id
 ON_UUID CRhinoSettings::m_plug_in_id
protected
◆ m_pointer_id
 unsigned int CRhinoSettings::m_pointer_id
protected