Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppSmartTrackSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppSmartTrackSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppSmartTrackSettings &src) const
bool  | operator== (const CRhinoAppSmartTrackSettings &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Public Attributes
ON_Color  | m_active_point_color
bool  | m_bDottedLines
bool  | m_bMarkerSmartPoint
bool  | m_bParallels
bool  | m_bSemiPermanentPoints
bool  | m_bShowMultipleTypes
bool  | m_bSmartBasePoint
bool  | m_bSmartOrtho
bool  | m_bSmartPointAtCPlaneOrigin
bool  | m_bSmartSuppress
bool  | m_bSmartTangents
bool  | m_bStrongOrtho
bool  | m_bUseSmartTrack
SmartTrack settings. More...
ON_Color  | m_guide_color
ON_Color  | m_line_color
int  | m_max_smart_points
ON_Color  | m_point_color
int  | m_smartpoint_wait_ms
ON_Color  | m_tanperp_line_color
 Static Public Attributes
static const CRhinoAppSmartTrackSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppSmartTrackSettings()
 CRhinoAppSmartTrackSettings::CRhinoAppSmartTrackSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppSmartTrackSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppSmartTrackSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppSmartTrackSettings::operator!=  |  ( |  const CRhinoAppSmartTrackSettings &  |  src | ) |   const
◆ operator==()
 bool CRhinoAppSmartTrackSettings::operator==  |  ( |  const CRhinoAppSmartTrackSettings &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppSmartTrackSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppSmartTrackSettings CRhinoAppSmartTrackSettings::Default
static
◆ m_active_point_color
 ON_Color CRhinoAppSmartTrackSettings::m_active_point_color
◆ m_bDottedLines
 bool CRhinoAppSmartTrackSettings::m_bDottedLines
◆ m_bMarkerSmartPoint
 bool CRhinoAppSmartTrackSettings::m_bMarkerSmartPoint
◆ m_bParallels
 bool CRhinoAppSmartTrackSettings::m_bParallels
◆ m_bSemiPermanentPoints
 bool CRhinoAppSmartTrackSettings::m_bSemiPermanentPoints
◆ m_bShowMultipleTypes
 bool CRhinoAppSmartTrackSettings::m_bShowMultipleTypes
◆ m_bSmartBasePoint
 bool CRhinoAppSmartTrackSettings::m_bSmartBasePoint
◆ m_bSmartOrtho
 bool CRhinoAppSmartTrackSettings::m_bSmartOrtho
◆ m_bSmartPointAtCPlaneOrigin
 bool CRhinoAppSmartTrackSettings::m_bSmartPointAtCPlaneOrigin
◆ m_bSmartSuppress
 bool CRhinoAppSmartTrackSettings::m_bSmartSuppress
◆ m_bSmartTangents
 bool CRhinoAppSmartTrackSettings::m_bSmartTangents
◆ m_bStrongOrtho
 bool CRhinoAppSmartTrackSettings::m_bStrongOrtho
◆ m_bUseSmartTrack
 bool CRhinoAppSmartTrackSettings::m_bUseSmartTrack
SmartTrack settings.
◆ m_guide_color
 ON_Color CRhinoAppSmartTrackSettings::m_guide_color
◆ m_line_color
 ON_Color CRhinoAppSmartTrackSettings::m_line_color
◆ m_max_smart_points
 int CRhinoAppSmartTrackSettings::m_max_smart_points
◆ m_point_color
 ON_Color CRhinoAppSmartTrackSettings::m_point_color
◆ m_smartpoint_wait_ms
 int CRhinoAppSmartTrackSettings::m_smartpoint_wait_ms
◆ m_tanperp_line_color
 ON_Color CRhinoAppSmartTrackSettings::m_tanperp_line_color