Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiSliderCtrl Class Reference
RhinoUI
#include <RhinoSdkUiSliderCtrl.h>
 Inheritance diagram for CRhinoUiSliderCtrl:
 Public Member Functions
CRhinoUiSliderCtrl ()
virtual  | ~CRhinoUiSliderCtrl ()
void  | LinkTo (CRhinoUiEdit *edit_ctrl, double slider_to_edit_scale=0.0)
void  | LinkTo (CRhinoUiEditInt *edit_ctrl, double slider_to_edit_scale=0.0)
afx_msg LRESULT  | OnGetText (WPARAM, LPARAM)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKeyUp (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
afx_msg LRESULT  | OnSetText (WPARAM, LPARAM)
void  | PaintText (CDC &dc)
void  | SetText (const char *lpsText)
void  | SetText (const wchar_t *lpsText)
LPCTSTR  | Text ()
 Protected Member Functions
void  | _LinkTo (CEdit *edit_ctrl, double slider_to_edit_scale)
void  | _SetLink (CEdit *edit_ctrl, CRhinoUiSliderCtrl *slider_ctrl)
void  | _SetMinMax (CEdit *edit_ctrl, int min_val, int max_val)
void  | _SetText (LPCTSTR lpsText)
 Friends
class  | CRhinoUiEdit
class  | CRhinoUiEditInt
class  | CRhinoUiEditReal
Constructor & Destructor Documentation
◆ CRhinoUiSliderCtrl()
 CRhinoUiSliderCtrl::CRhinoUiSliderCtrl  |  ( |   | )
◆ ~CRhinoUiSliderCtrl()
 virtual CRhinoUiSliderCtrl::~CRhinoUiSliderCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ _LinkTo()
 void CRhinoUiSliderCtrl::_LinkTo  |  ( |  CEdit *  |  edit_ctrl,
|  double  |  slider_to_edit_scale
)
protected
◆ _SetLink()
 void CRhinoUiSliderCtrl::_SetLink  |  ( |  CEdit *  |  edit_ctrl,
|  CRhinoUiSliderCtrl *  |  slider_ctrl
)
protected
◆ _SetMinMax()
 void CRhinoUiSliderCtrl::_SetMinMax  |  ( |  CEdit *  |  edit_ctrl,
|  int  |  min_val,
|  int  |  max_val
)
protected
◆ _SetText()
 void CRhinoUiSliderCtrl::_SetText  |  ( |  LPCTSTR  |  lpsText | )
protected
◆ LinkTo() [1/2]
 void CRhinoUiSliderCtrl::LinkTo  |  ( |  CRhinoUiEdit *  |  edit_ctrl,
|  double  |  slider_to_edit_scale = 0.0
)
◆ LinkTo() [2/2]
 void CRhinoUiSliderCtrl::LinkTo  |  ( |  CRhinoUiEditInt *  |  edit_ctrl,
|  double  |  slider_to_edit_scale = 0.0
)
◆ OnGetText()
 afx_msg LRESULT CRhinoUiSliderCtrl::OnGetText  |  ( |  WPARAM  |  ,
|  LPARAM
)
◆ OnKeyDown()
 afx_msg void CRhinoUiSliderCtrl::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnKeyUp()
 afx_msg void CRhinoUiSliderCtrl::OnKeyUp  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiSliderCtrl::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiSliderCtrl::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonUp()
 afx_msg void CRhinoUiSliderCtrl::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnPaint()
 afx_msg void CRhinoUiSliderCtrl::OnPaint  |  ( |   | )
◆ OnSetText()
 afx_msg LRESULT CRhinoUiSliderCtrl::OnSetText  |  ( |  WPARAM  |  ,
|  LPARAM
)
◆ PaintText()
 void CRhinoUiSliderCtrl::PaintText  |  ( |  CDC &  |  dc | )
◆ SetText() [1/2]
 void CRhinoUiSliderCtrl::SetText  |  ( |  const char *  |  lpsText | )
◆ SetText() [2/2]
 void CRhinoUiSliderCtrl::SetText  |  ( |  const wchar_t *  |  lpsText | )
◆ Text()
 LPCTSTR CRhinoUiSliderCtrl::Text  |  ( |   | )
Friends And Related Function Documentation
◆ CRhinoUiEdit
 friend class CRhinoUiEdit
friend
◆ CRhinoUiEditInt
 friend class CRhinoUiEditInt
friend
◆ CRhinoUiEditReal
 friend class CRhinoUiEditReal
friend