Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiHyperlink Class Reference
RhinoUI
CRhinoUiHyperlink. More...
#include <RhinoSdkUiHyperLink.h>
 Inheritance diagram for CRhinoUiHyperlink:
 Public Member Functions
CRhinoUiHyperlink (LPCTSTR lpLink=NULL, bool bDeleteOnDestroy=false)
virtual  | ~CRhinoUiHyperlink ()
afx_msg HBRUSH  | CtlColor (CDC *pDC, UINT nCtlColor)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg BOOL32  | OnSetCursor (CWnd *pWnd, UINT nHitTest, UINT message)
 Public Attributes
COLORREF  | m_cfCurrentColor
COLORREF  | m_cfUnvisitedColor
COLORREF  | m_cfVisitedColor
HCURSOR  | m_hHandCursor
CString  | m_strLink
 Protected Member Functions
virtual void  | PostNcDestroy ()
 Protected Attributes
BOOL32  | m_bDeleteOnDestroy
CFont  | m_Font
Detailed Description
CRhinoUiHyperlink.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiHyperlink()
 CRhinoUiHyperlink::CRhinoUiHyperlink  |  ( |  LPCTSTR  |  lpLink = NULL,
|  bool  |  bDeleteOnDestroy = false
)
◆ ~CRhinoUiHyperlink()
 virtual CRhinoUiHyperlink::~CRhinoUiHyperlink  |  ( |   | )
virtual
Member Function Documentation
◆ CtlColor()
 afx_msg HBRUSH CRhinoUiHyperlink::CtlColor  |  ( |  CDC *  |  pDC,
|  UINT  |  nCtlColor
)
◆ OnLButtonUp()
 afx_msg void CRhinoUiHyperlink::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnNcHitTest()
 afx_msg LRESULT CRhinoUiHyperlink::OnNcHitTest  |  ( |  CPoint  |  point | )
◆ OnSetCursor()
 afx_msg BOOL32 CRhinoUiHyperlink::OnSetCursor  |  ( |  CWnd *  |  pWnd,
|  UINT  |  nHitTest,
|  UINT  |  message
)
◆ PostNcDestroy()
 virtual void CRhinoUiHyperlink::PostNcDestroy  |  ( |   | )
protectedvirtual
Member Data Documentation
◆ m_bDeleteOnDestroy
 BOOL32 CRhinoUiHyperlink::m_bDeleteOnDestroy
protected
◆ m_cfCurrentColor
 COLORREF CRhinoUiHyperlink::m_cfCurrentColor
◆ m_cfUnvisitedColor
 COLORREF CRhinoUiHyperlink::m_cfUnvisitedColor
◆ m_cfVisitedColor
 COLORREF CRhinoUiHyperlink::m_cfVisitedColor
◆ m_Font
 CFont CRhinoUiHyperlink::m_Font
protected
◆ m_hHandCursor
 HCURSOR CRhinoUiHyperlink::m_hHandCursor
◆ m_strLink
 CString CRhinoUiHyperlink::m_strLink