Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppChooseOneObjectSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppChooseOneObjectSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppChooseOneObjectSettings &) const
bool  | operator== (const CRhinoAppChooseOneObjectSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Public Attributes
bool  | m_bAutomaticResize
bool  | m_bDynamicHighlight
bool  | m_bFollowCursor
Choose One Object dialog settings. More...
bool  | m_bShowAllOption
bool  | m_bShowObjectColor
bool  | m_bShowObjectLayer
bool  | m_bShowObjectName
bool  | m_bShowObjectType
bool  | m_bShowObjectTypeDetails
bool  | m_bShowTitlebarAndBorder
bool  | m_bUseCustomColor
ON_Color  | m_highlight_color
int  | m_max_autoresize_items
int  | m_xoffset
int  | m_yoffset
 Static Public Attributes
static const CRhinoAppChooseOneObjectSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppChooseOneObjectSettings()
 CRhinoAppChooseOneObjectSettings::CRhinoAppChooseOneObjectSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppChooseOneObjectSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppChooseOneObjectSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppChooseOneObjectSettings::operator!=  |  ( |  const CRhinoAppChooseOneObjectSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppChooseOneObjectSettings::operator==  |  ( |  const CRhinoAppChooseOneObjectSettings &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppChooseOneObjectSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppChooseOneObjectSettings CRhinoAppChooseOneObjectSettings::Default
static
◆ m_bAutomaticResize
 bool CRhinoAppChooseOneObjectSettings::m_bAutomaticResize
◆ m_bDynamicHighlight
 bool CRhinoAppChooseOneObjectSettings::m_bDynamicHighlight
◆ m_bFollowCursor
 bool CRhinoAppChooseOneObjectSettings::m_bFollowCursor
Choose One Object dialog settings.
◆ m_bShowAllOption
 bool CRhinoAppChooseOneObjectSettings::m_bShowAllOption
◆ m_bShowObjectColor
 bool CRhinoAppChooseOneObjectSettings::m_bShowObjectColor
◆ m_bShowObjectLayer
 bool CRhinoAppChooseOneObjectSettings::m_bShowObjectLayer
◆ m_bShowObjectName
 bool CRhinoAppChooseOneObjectSettings::m_bShowObjectName
◆ m_bShowObjectType
 bool CRhinoAppChooseOneObjectSettings::m_bShowObjectType
◆ m_bShowObjectTypeDetails
 bool CRhinoAppChooseOneObjectSettings::m_bShowObjectTypeDetails
◆ m_bShowTitlebarAndBorder
 bool CRhinoAppChooseOneObjectSettings::m_bShowTitlebarAndBorder
◆ m_bUseCustomColor
 bool CRhinoAppChooseOneObjectSettings::m_bUseCustomColor
◆ m_highlight_color
 ON_Color CRhinoAppChooseOneObjectSettings::m_highlight_color
◆ m_max_autoresize_items
 int CRhinoAppChooseOneObjectSettings::m_max_autoresize_items
◆ m_xoffset
 int CRhinoAppChooseOneObjectSettings::m_xoffset
◆ m_yoffset
 int CRhinoAppChooseOneObjectSettings::m_yoffset