Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoIniProfileContextIterator Class Reference
RhinoUI
#include <RhinoSdkUiProfileContextIterator.h>
 Inheritance diagram for CRhinoIniProfileContextIterator:
 Public Member Functions
CRhinoIniProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoIniProfileContextIterator ()
const wchar_t *  | FirstSection ()
Must override. More...
const wchar_t *  | FirstValue ()
const wchar_t *  | NextSection ()
const wchar_t *  | NextValue ()
 Public Member Functions inherited from CRhinoProfileContextIterator
CRhinoProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoProfileContextIterator ()
int  | IterateAllSections (bool(*cull)(const wchar_t *)=NULL)
int  | IterateAllValues (bool(*cull)(ON_wString &value_name, ON_wString &value)=NULL)
const wchar_t *  | Section (int index) const
int  | SectionCount () const
const ON_ClassArray< ON_wString > &  | Sections () const
const wchar_t *  | Value () const
bool  | Value (bool &result) const
bool  | Value (double &result) const
bool  | Value (int &result) const
bool  | Value (int index, bool &result) const
bool  | Value (int index, double &result) const
bool  | Value (int index, int &result) const
bool  | Value (int index, ON_3dPoint &result) const
bool  | Value (int index, ON_3dVector &result) const
bool  | Value (int index, ON_Color &result) const
bool  | Value (int index, ON_wString &result) const
bool  | Value (int index, POINT &result) const
bool  | Value (int index, RECT &result) const
bool  | Value (ON_3dPoint &result) const
bool  | Value (ON_3dVector &result) const
bool  | Value (ON_Color &result) const
bool  | Value (ON_wString &result) const
bool  | Value (POINT &result) const
bool  | Value (RECT &result) const
int  | ValueCount () const
const wchar_t *  | ValueName (int index) const
const ON_ClassArray< ON_wString > &  | ValueNames () const
const ON_ClassArray< ON_wString > &  | Values () const
 Protected Member Functions
ON_wString  | ExtractSubKey (const ON_wString &section, const ON_wString &key) const
ON_wString  | FormatSectionString (const ON_wString &section) const
int  | KeyIndex (const ON_wString &w) const
bool  | LoadIniFile (CRhinoIniProfileContext &pc, bool bForceReload)
 Protected Attributes
int  | m_iIniOffset
int  | m_iKeyIndex
ON_ClassArray< ON_wString >  | m_key_list
class CRhinoIniFile *  | m_pIniFile
 Protected Attributes inherited from CRhinoProfileContextIterator
int  | m_item
CRhinoProfileContext &  | m_pc
ON_wString  | m_section
ON_ClassArray< ON_wString >  | m_sections
ON_wString  | m_value
ON_wString  | m_value_name
ON_ClassArray< ON_wString >  | m_value_names
ON_ClassArray< ON_wString >  | m_values
ON_wString  | m_w
Detailed Description
class CRhinoIniProfileContextIterator
Constructor & Destructor Documentation
◆ CRhinoIniProfileContextIterator()
 CRhinoIniProfileContextIterator::CRhinoIniProfileContextIterator  |  ( |  const wchar_t *  |  section,
|  CRhinoProfileContext &  |  pc
)
◆ ~CRhinoIniProfileContextIterator()
 virtual CRhinoIniProfileContextIterator::~CRhinoIniProfileContextIterator  |  ( |   | )
virtual
Member Function Documentation
◆ ExtractSubKey()
 ON_wString CRhinoIniProfileContextIterator::ExtractSubKey  |  ( |  const ON_wString &  |  section,
|  const ON_wString &  |  key
) |   |  const
protected
◆ FirstSection()
 const wchar_t* CRhinoIniProfileContextIterator::FirstSection  |  ( |   | )
virtual
Must override.
Implements CRhinoProfileContextIterator.
◆ FirstValue()
 const wchar_t* CRhinoIniProfileContextIterator::FirstValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ FormatSectionString()
 ON_wString CRhinoIniProfileContextIterator::FormatSectionString  |  ( |  const ON_wString &  |  section | ) |   const
protected
◆ KeyIndex()
 int CRhinoIniProfileContextIterator::KeyIndex  |  ( |  const ON_wString &  |  w | ) |   const
protected
◆ LoadIniFile()
 bool CRhinoIniProfileContextIterator::LoadIniFile  |  ( |  CRhinoIniProfileContext &  |  pc,
|  bool  |  bForceReload
)
protected
◆ NextSection()
 const wchar_t* CRhinoIniProfileContextIterator::NextSection  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ NextValue()
 const wchar_t* CRhinoIniProfileContextIterator::NextValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
Member Data Documentation
◆ m_iIniOffset
 int CRhinoIniProfileContextIterator::m_iIniOffset
protected
◆ m_iKeyIndex
 int CRhinoIniProfileContextIterator::m_iKeyIndex
protected
◆ m_key_list
 ON_ClassArray<ON_wString> CRhinoIniProfileContextIterator::m_key_list
protected
◆ m_pIniFile
 class CRhinoIniFile* CRhinoIniProfileContextIterator::m_pIniFile
protected