Public Member Functions | List of all members
CRhRdkRenderingSettings Class Reference
RDK
#include <RhRdkRenderingSettings.h>
 Public Member Functions
CRhRdkRenderingSettings (const CRhinoDoc &)
CRhRdkRenderingSettings (const CRhinoDoc *=nullptr)
CRhRdkRenderingSettings (CRhRdkDocument &)
virtual  | ~CRhRdkRenderingSettings ()
bool  | ApplyToneMappingWhileRendering (void) const
UUID  | CustomEnvironmentForReflectionAndRefraction (void) const
ON_wString  | Dithering (void) const
bool  | EmbedOn (void) const
virtual void *  | EVF (const wchar_t *, void *)
double  | Gamma (void) const
void  | GetToneMapperParams (class CRhRdk_XMLSection &section) const
void  | SetApplyToneMappingWhileRendering (bool b)
void  | SetCustomEnvironmentForReflectionAndRefraction (const UUID &uuidInstance)
void  | SetDithering (const wchar_t *wsz)
void  | SetEmbedOn (bool b)
void  | SetGamma (double d)
void  | SetToneMapperParams (const class CRhRdk_XMLSection &section)
void  | SetToneMapping (const wchar_t *wsz)
void  | SetUseCustomEnvironmentForReflectionAndRefraction (bool b)
void  | SetUseLinearWorkflow (bool b)
ON_wString  | ToneMapping (void) const
bool  | UseCustomEnvironmentForReflectionAndRefraction (void) const
bool  | UseLinearWorkflow (void) const
Constructor & Destructor Documentation
◆ CRhRdkRenderingSettings() [1/3]
 CRhRdkRenderingSettings::CRhRdkRenderingSettings  |  ( |  const CRhinoDoc *  |   = nullptr | )
inline
◆ CRhRdkRenderingSettings() [2/3]
 CRhRdkRenderingSettings::CRhRdkRenderingSettings  |  ( |  const CRhinoDoc &  |   | )
inline
◆ CRhRdkRenderingSettings() [3/3]
 CRhRdkRenderingSettings::CRhRdkRenderingSettings  |  ( |  CRhRdkDocument &  |   | )
inline
◆ ~CRhRdkRenderingSettings()
 virtual CRhRdkRenderingSettings::~CRhRdkRenderingSettings  |  ( |   | )
inlinevirtual
Member Function Documentation
◆ ApplyToneMappingWhileRendering()
 bool CRhRdkRenderingSettings::ApplyToneMappingWhileRendering  |  ( |  void  |   | ) |   const
◆ CustomEnvironmentForReflectionAndRefraction()
 UUID CRhRdkRenderingSettings::CustomEnvironmentForReflectionAndRefraction  |  ( |  void  |   | ) |   const
◆ Dithering()
 ON_wString CRhRdkRenderingSettings::Dithering  |  ( |  void  |   | ) |   const
◆ EmbedOn()
 bool CRhRdkRenderingSettings::EmbedOn  |  ( |  void  |   | ) |   const
◆ EVF()
 virtual void* CRhRdkRenderingSettings::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
◆ Gamma()
 double CRhRdkRenderingSettings::Gamma  |  ( |  void  |   | ) |   const
◆ GetToneMapperParams()
 void CRhRdkRenderingSettings::GetToneMapperParams  |  ( |  class CRhRdk_XMLSection &  |  section | ) |   const
◆ SetApplyToneMappingWhileRendering()
 void CRhRdkRenderingSettings::SetApplyToneMappingWhileRendering  |  ( |  bool  |  b | )
◆ SetCustomEnvironmentForReflectionAndRefraction()
 void CRhRdkRenderingSettings::SetCustomEnvironmentForReflectionAndRefraction  |  ( |  const UUID &  |  uuidInstance | )
◆ SetDithering()
 void CRhRdkRenderingSettings::SetDithering  |  ( |  const wchar_t *  |  wsz | )
◆ SetEmbedOn()
 void CRhRdkRenderingSettings::SetEmbedOn  |  ( |  bool  |  b | )
◆ SetGamma()
 void CRhRdkRenderingSettings::SetGamma  |  ( |  double  |  d | )
◆ SetToneMapperParams()
 void CRhRdkRenderingSettings::SetToneMapperParams  |  ( |  const class CRhRdk_XMLSection &  |  section | )
◆ SetToneMapping()
 void CRhRdkRenderingSettings::SetToneMapping  |  ( |  const wchar_t *  |  wsz | )
◆ SetUseCustomEnvironmentForReflectionAndRefraction()
 void CRhRdkRenderingSettings::SetUseCustomEnvironmentForReflectionAndRefraction  |  ( |  bool  |  b | )
◆ SetUseLinearWorkflow()
 void CRhRdkRenderingSettings::SetUseLinearWorkflow  |  ( |  bool  |  b | )
◆ ToneMapping()
 ON_wString CRhRdkRenderingSettings::ToneMapping  |  ( |  void  |   | ) |   const
◆ UseCustomEnvironmentForReflectionAndRefraction()
 bool CRhRdkRenderingSettings::UseCustomEnvironmentForReflectionAndRefraction  |  ( |  void  |   | ) |   const
◆ UseLinearWorkflow()
 bool CRhRdkRenderingSettings::UseLinearWorkflow  |  ( |  void  |   | ) |   const