Public Member Functions | Public Attributes | List of all members
CRhinoGumballPickResult Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumballPickResult ()
ON_Circle  | CircleConstraint (bool bSnappyGumball) const
bool  | IsUvnPick () const
ON_3dPoint  | PickPoint (bool bSnappyGumball) const
void  | SetToDefaultPickResult ()
 Public Attributes
int  | m_drag_constraint
Dragging constraints. More...
ON_Circle  | m_gsnap_off_circle_constraint
ON_3dPoint  | m_gsnap_off_pick_point
point to use when CRhinoGumball::m_appearance.m_bSnappy is false; More...
ON_Circle  | m_gsnap_on_circle_constraint
ON_3dPoint  | m_gsnap_on_pick_point
point to use when CRhinoGumball::m_appearance.m_bSnappy is true; More...
GUMBALL_MODE  | m_gumball_mode
ON_Line  | m_line_constraint
double  | m_pick_depth
double  | m_pick_distance
ON_Plane  | m_plane_constraint
Detailed Description
CRhinoGumballPickResult class Used to return picking results
Constructor & Destructor Documentation
◆ CRhinoGumballPickResult()
 CRhinoGumballPickResult::CRhinoGumballPickResult  |  ( |   | )
Member Function Documentation
◆ CircleConstraint()
 ON_Circle CRhinoGumballPickResult::CircleConstraint  |  ( |  bool  |  bSnappyGumball | ) |   const
Returns: m_gsnap_off_circle_constraint if bSnappyGumball is false. m_gsnap_on_circle_constraint if bSnappyGumball is true.
◆ IsUvnPick()
 bool CRhinoGumballPickResult::IsUvnPick  |  ( |   | ) |   const
◆ PickPoint()
 ON_3dPoint CRhinoGumballPickResult::PickPoint  |  ( |  bool  |  bSnappyGumball | ) |   const
Parameters: bSnappyGumball - [in] Value of gumball.m_appearance_settings.m_bSnappy Returns: m_gsnap_off_pick_point if bSnappyGumball is false. m_gsnap_on_pick_point if bSnappyGumball is true.
◆ SetToDefaultPickResult()
 void CRhinoGumballPickResult::SetToDefaultPickResult  |  ( |   | )
Member Data Documentation
◆ m_drag_constraint
 int CRhinoGumballPickResult::m_drag_constraint
Dragging constraints.
0 = none,
◆ m_gsnap_off_circle_constraint
 ON_Circle CRhinoGumballPickResult::m_gsnap_off_circle_constraint
◆ m_gsnap_off_pick_point
 ON_3dPoint CRhinoGumballPickResult::m_gsnap_off_pick_point
point to use when CRhinoGumball::m_appearance.m_bSnappy is false;
◆ m_gsnap_on_circle_constraint
 ON_Circle CRhinoGumballPickResult::m_gsnap_on_circle_constraint
◆ m_gsnap_on_pick_point
 ON_3dPoint CRhinoGumballPickResult::m_gsnap_on_pick_point
point to use when CRhinoGumball::m_appearance.m_bSnappy is true;
◆ m_gumball_mode
 GUMBALL_MODE CRhinoGumballPickResult::m_gumball_mode
If m_gumball_mode is gb_mode_nothing, then the pick missed.
◆ m_line_constraint
 ON_Line CRhinoGumballPickResult::m_line_constraint
1 = infinite line 2 = infinite ray 3 = circle (start = pick point) 4 = plane
◆ m_pick_depth
 double CRhinoGumballPickResult::m_pick_depth
◆ m_pick_distance
 double CRhinoGumballPickResult::m_pick_distance
◆ m_plane_constraint
 ON_Plane CRhinoGumballPickResult::m_plane_constraint