Public Member Functions | Protected Member Functions | List of all members
ON_RenderContent::ChildIterator Class Reference
#include <opennurbs_render_content.h>
 Public Member Functions
ChildIterator (const ON_RenderContent *parent)
virtual  | ~ChildIterator ()
virtual ON_RenderContent *  | GetNextChild (void)
 Protected Member Functions
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
Constructor & Destructor Documentation
◆ ChildIterator()
 ON_RenderContent::ChildIterator::ChildIterator  |  ( |  const ON_RenderContent *  |  parent | )
◆ ~ChildIterator()
 virtual ON_RenderContent::ChildIterator::~ChildIterator  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* ON_RenderContent::ChildIterator::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
protectedvirtual
Emergency virtual function for future expansion.
◆ GetNextChild()
 virtual ON_RenderContent* ON_RenderContent::ChildIterator::GetNextChild  |  ( |  void  |   | )
virtual