Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_WeightedAverageHash Class Reference
OpenNURBS
#include <opennurbs_texture_mapping.h>
 Public Member Functions
ON_WeightedAverageHash ()
bool  | Matches (const ON_WeightedAverageHash &b, const ON_Xform &bt, double tol) const
bool  | Read (ON_BinaryArchive &binary_archive)
void  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &binary_archive) const
void  | Zero ()
 Public Attributes
ON_3dPoint  | m_sum [dim]
 Static Public Attributes
static const int  | dim = 5
Constructor & Destructor Documentation
◆ ON_WeightedAverageHash()
 ON_WeightedAverageHash::ON_WeightedAverageHash  |  ( |   | )
Member Function Documentation
◆ Matches()
 bool ON_WeightedAverageHash::Matches  |  ( |  const ON_WeightedAverageHash &  |  b,
|  const ON_Xform &  |  bt,
|  double  |  tol
) |   |  const
◆ Read()
 bool ON_WeightedAverageHash::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
◆ Transform()
 void ON_WeightedAverageHash::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool ON_WeightedAverageHash::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
◆ Zero()
 void ON_WeightedAverageHash::Zero  |  ( |   | )
Member Data Documentation
◆ dim
 const int ON_WeightedAverageHash::dim = 5
static
◆ m_sum
 ON_3dPoint ON_WeightedAverageHash::m_sum[dim]