Public Member Functions | List of all members
CRhRdkContent::ICustomUserData Class Referenceabstract
#include <RhRdkContent.h>
 Inheritance diagram for CRhRdkContent::ICustomUserData:
 Public Member Functions
virtual  | ~ICustomUserData ()
virtual const UUID &  | CustomUserDataId () const =0
virtual const UUID &  | PlugInId () const =0
virtual void  | Read (const CRhRdkVariant &v)=0
virtual void  | Write (CRhRdkVariant &v) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ ~ICustomUserData()
 virtual CRhRdkContent::ICustomUserData::~ICustomUserData  |  ( |   | )
inlinevirtual
Member Function Documentation
◆ CustomUserDataId()
 virtual const UUID& CRhRdkContent::ICustomUserData::CustomUserDataId  |  ( |   | ) |   const
pure virtual
◆ PlugInId()
 virtual const UUID& CRhRdkContent::ICustomUserData::PlugInId  |  ( |   | ) |   const
pure virtual
◆ Read()
 virtual void CRhRdkContent::ICustomUserData::Read  |  ( |  const CRhRdkVariant &  |  v | )
pure virtual
◆ Write()
 virtual void CRhRdkContent::ICustomUserData::Write  |  ( |  CRhRdkVariant &  |  v | ) |   const
pure virtual