Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoGumballSizes Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoGumballSizes ()
bool  | GetWorldRadius (const ON_Viewport &viewport, const ON_3dPoint &center, double *world_radius) const
bool  | operator!= (const CRhinoGumballSizes &) const
bool  | operator== (const CRhinoGumballSizes &) const
bool  | Read (LPCTSTR lpszSection, CRhinoProfileContext &pc)
bool  | Read (ON_BinaryArchive &binary_archive)
void  | Reset ()
void  | SetToDefaultSizes ()
void  | SetToFactorySizes ()
bool  | Write (LPCTSTR lpszSection, CRhinoProfileContext &pc) const
bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static int  | Compare (const CRhinoGumballSizes &a, const CRhinoGumballSizes &b)
 Public Attributes
int  | m_arc_thickness
in pixels More...
int  | m_axis_thickness
in pixels More...
int  | m_extrude_ball_size
double  | m_gumball_ptran_angle
planar translation grip visibility angle More...
int  | m_gumball_ptran_dist
planar translation grip corner More...
int  | m_gumball_ptran_size
planar translation grip size More...
int  | m_gumball_radius
in pixels More...
int  | m_gumball_tail_size
scale grip size More...
int  | m_gumball_tip_length
length of arrow head in pixels More...
int  | m_gumball_tip_width
width of arrow head in pixels More...
int  | m_menu_dist
distance of menu ball from center More...
int  | m_menu_size
radius of menu circle More...
 Static Public Attributes
static int  | default_arc_thickness
in pixels More...
static int  | default_axis_thickness
in pixels More...
static int  | default_extrude_ball_size
static double  | default_gumball_ptran_angle
planar translation grip visibility angle More...
static int  | default_gumball_ptran_dist
location of planar translation grip size More...
static int  | default_gumball_ptran_size
planar translation grip size More...
static int  | default_gumball_radius
in pixels More...
static int  | default_gumball_tail_size
scale grip size More...
static int  | default_gumball_tip_length
length of arrow head in pixels More...
static int  | default_gumball_tip_width
length of arrow head in pixels More...
static int  | default_menu_dist
static int  | default_menu_size
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoGumballSizes()
 CRhinoGumballSizes::CRhinoGumballSizes  |  ( |   | )
Member Function Documentation
◆ Compare()
 static int CRhinoGumballSizes::Compare  |  ( |  const CRhinoGumballSizes &  |  a,
|  const CRhinoGumballSizes &  |  b
)
static
◆ GetWorldRadius()
 bool CRhinoGumballSizes::GetWorldRadius  |  ( |  const ON_Viewport &  |  viewport,
|  const ON_3dPoint &  |  center,
|  double *  |  world_radius
) |   |  const
Description: Gets the world coordinate gumball radius. Parameters: viewport - [in] center - [in] center of gumball world_radius - [out] Returns: True if a valid world_radius is returned.
◆ operator!=()
 bool CRhinoGumballSizes::operator!=  |  ( |  const CRhinoGumballSizes &  |   | ) |   const
◆ operator==()
 bool CRhinoGumballSizes::operator==  |  ( |  const CRhinoGumballSizes &  |   | ) |   const
◆ Read() [1/2]
 bool CRhinoGumballSizes::Read  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
)
Description: Reads the CRhinoGumballAppearance settings from a CRhinoProfileContext. Any settings that are not in the profile context are set to the default values. Parameters: lpszSection - [in] pc - [in]; Returns: True if the read was successful.
◆ Read() [2/2]
 bool CRhinoGumballSizes::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
Description: Reads the CRhinoGumballAppearance from an ON_BinaryArchive. Parameters: binary_archive - [in] The CRhinoGumballAppearance information is read from the archive. Reading begins at the current location in the archive. Returns: True if the read was successful.
◆ Reset()
 void CRhinoGumballSizes::Reset  |  ( |   | )
Description: Set members to true built in original default gumball sizes.
◆ SetToDefaultSizes()
 void CRhinoGumballSizes::SetToDefaultSizes  |  ( |   | )
Description: Set members to default gumball sizes. These are the current settings, not the built in defaults.
◆ SetToFactorySizes()
 void CRhinoGumballSizes::SetToFactorySizes  |  ( |   | )
Description: Set members to factory gumball sizes.
Deprecated:
use CRhinoGumballSizes::Reset
◆ Write() [1/2]
 bool CRhinoGumballSizes::Write  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
) |   |  const
Description: Saves the CRhinoGumballAppearance settings to a CRhinoProfileContext. Parameters: lpszSection - [in] pc - [in]; Returns: True if the write was successful.
◆ Write() [2/2]
 bool CRhinoGumballSizes::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
Description: Saves the CRhinoGumballAppearance in an ON_BinaryArchive. This Write function includes a versioned chunk wrapper. Parameters: binary_archive - [in/out] The CRhinoGumballAppearance information is appended to this archive. Returns: True if the write was successful.
Member Data Documentation
◆ default_arc_thickness
 int CRhinoGumballSizes::default_arc_thickness
static
in pixels
◆ default_axis_thickness
 int CRhinoGumballSizes::default_axis_thickness
static
in pixels
◆ default_extrude_ball_size
 int CRhinoGumballSizes::default_extrude_ball_size
static
◆ default_gumball_ptran_angle
 double CRhinoGumballSizes::default_gumball_ptran_angle
static
planar translation grip visibility angle
◆ default_gumball_ptran_dist
 int CRhinoGumballSizes::default_gumball_ptran_dist
static
location of planar translation grip size
◆ default_gumball_ptran_size
 int CRhinoGumballSizes::default_gumball_ptran_size
static
planar translation grip size
◆ default_gumball_radius
 int CRhinoGumballSizes::default_gumball_radius
static
in pixels
These static values are used by the constructor. They are set by CRhinoApp.AppSettings().SetGumballSizes().
◆ default_gumball_tail_size
 int CRhinoGumballSizes::default_gumball_tail_size
static
scale grip size
◆ default_gumball_tip_length
 int CRhinoGumballSizes::default_gumball_tip_length
static
length of arrow head in pixels
◆ default_gumball_tip_width
 int CRhinoGumballSizes::default_gumball_tip_width
static
length of arrow head in pixels
◆ default_menu_dist
 int CRhinoGumballSizes::default_menu_dist
static
◆ default_menu_size
 int CRhinoGumballSizes::default_menu_size
static
◆ m_arc_thickness
 int CRhinoGumballSizes::m_arc_thickness
in pixels
◆ m_axis_thickness
 int CRhinoGumballSizes::m_axis_thickness
in pixels
◆ m_extrude_ball_size
 int CRhinoGumballSizes::m_extrude_ball_size
◆ m_gumball_ptran_angle
 double CRhinoGumballSizes::m_gumball_ptran_angle
planar translation grip visibility angle
◆ m_gumball_ptran_dist
 int CRhinoGumballSizes::m_gumball_ptran_dist
planar translation grip corner
◆ m_gumball_ptran_size
 int CRhinoGumballSizes::m_gumball_ptran_size
planar translation grip size
◆ m_gumball_radius
 int CRhinoGumballSizes::m_gumball_radius
in pixels
Size of the translation and rotation gumball controls in pixels
◆ m_gumball_tail_size
 int CRhinoGumballSizes::m_gumball_tail_size
scale grip size
◆ m_gumball_tip_length
 int CRhinoGumballSizes::m_gumball_tip_length
length of arrow head in pixels
◆ m_gumball_tip_width
 int CRhinoGumballSizes::m_gumball_tip_width
width of arrow head in pixels
◆ m_menu_dist
 int CRhinoGumballSizes::m_menu_dist
distance of menu ball from center
◆ m_menu_size
 int CRhinoGumballSizes::m_menu_size
radius of menu circle