Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
CRhinoGripsEnabler Class Referenceabstract
Rhino
#include <rhinoSdkApp.h>
 Public Member Functions
CRhinoGripsEnabler ()
See CRhinoApp::RegisterCustomGrips() More...
virtual  | ~CRhinoGripsEnabler ()
const ON_UUID  | CustomGripsId () const
virtual void  | TurnOnGrips (CRhinoObject *object) const =0
 Static Public Member Functions
static int  | CompareGripsId (CRhinoGripsEnabler *const *, CRhinoGripsEnabler *const *)
 Public Attributes
ON_UUID  | m_grips_id
Constructor & Destructor Documentation
◆ CRhinoGripsEnabler()
 CRhinoGripsEnabler::CRhinoGripsEnabler  |  ( |   | )
See CRhinoApp::RegisterCustomGrips()
◆ ~CRhinoGripsEnabler()
 virtual CRhinoGripsEnabler::~CRhinoGripsEnabler  |  ( |   | )
virtual
Member Function Documentation
◆ CompareGripsId()
 static int CRhinoGripsEnabler::CompareGripsId  |  ( |  CRhinoGripsEnabler *const *  |  ,
|  CRhinoGripsEnabler *const *
)
static
◆ CustomGripsId()
 const ON_UUID CRhinoGripsEnabler::CustomGripsId  |  ( |   | ) |   const
◆ TurnOnGrips()
 virtual void CRhinoGripsEnabler::TurnOnGrips  |  ( |  CRhinoObject *  |  object | ) |   const
pure virtual
If you add custom grips to Rhino and you want those grips to stay on when CRhinoDoc::Replace object is called (for example, somebody translates the object), then you have to register your grips with Rhino.
Member Data Documentation
◆ m_grips_id
 ON_UUID CRhinoGripsEnabler::m_grips_id
This is the id is used to distinguish between different types of custom grips. Rhino default grips (the ones you get with the PointsOn command) have the id = nil. Custom grips must have a non-nil id.