Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhRdkSdkIntegerNumberEdit Class Reference
RDK
#include <RhRdkSdkNumberEdit.h>
 Inheritance diagram for CRhRdkSdkIntegerNumberEdit:
 Public Member Functions
CRhRdkSdkIntegerNumberEdit ()
virtual  | ~CRhRdkSdkIntegerNumberEdit ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual int  | GetValue (void) const
virtual void  | Initialize (int iLowerBound, int iUpperBound, int iDelta, const TCHAR *tszSuffix=_T(""))
virtual bool  | SetValue (int iValue, bool bForceBlankOff=false)
 Public Member Functions inherited from CRhRdkSdkNumberEdit
virtual int  | AutoRepeatDelay (void) const
virtual double  | ChangeThreshold (void) const
virtual int  | CharFromPos (const CPoint &pt) const
virtual bool  | CreateCtrl (DWORD dwStyle, const ON_4iRect &rect, CWnd *pParentWnd, UINT iID)
virtual bool  | EditByTyping (void) const
virtual bool  | EnableSpinnerWhenBlank (void) const
virtual bool  | Format (const double dValue, CString &sText) const
virtual bool  | IsBlank (void) const
virtual bool  | IsFixedSpinnerDelta (void) const
virtual bool  | IsFocused (void) const
virtual bool  | IsLocked (void) const
virtual double  | LinearRollingDelta (void) const
virtual bool  | LockFrom (const CRhRdkSdkNumberEdit &srce)
virtual void  | OnBeginRollSpinner (void)
virtual void  | OnEndRollSpinner (void)
virtual void  | OnUserChangedValue (void)
virtual void  | OnValueChanged (void)
virtual bool  | Parse (const TCHAR *tsz, double &dValueOut) const
virtual void  | RemoveBounds (void)
virtual void  | RemoveFixedSpinnerDelta (void)
virtual bool  | SendChangeWhenDragging (void) const
virtual void  | SetAllowSetDuringChange (bool bAllow=true)
virtual void  | SetAutoRepeatDelay (int iDelay)
virtual void  | SetBlank (bool bBlank=true)
virtual void  | SetBounds (double dLowerBound, double dUpperBound)
virtual void  | SetCanHideCursor (bool bCanHide=true)
virtual void  | SetChangeThreshold (double dThresh)
virtual void  | SetControlKeyScaling (double d)
virtual void  | SetEditByTyping (bool bCanType)
virtual void  | SetEnableSpinnerWhenBlank (bool bEnable=true)
virtual void  | SetFixedSpinnerDelta (double dDelta)
virtual void  | SetForcedStyles (DWORD dwStyles)
virtual void  | SetKeyScaling (double dArrow=1.0, double dPage=10.0)
virtual void  | SetLimitText (int iMax)
virtual void  | SetLinearRollingDelta (double dDelta)
virtual bool  | SetLock (bool bLocked)
virtual void  | SetLowerBound (double dLowerBound)
virtual void  | SetSel (int iStartChar, int iEndChar, bool bNoScroll=false)
virtual void  | SetSendChangeWhenDragging (bool bSend=true)
virtual void  | SetShiftKeyScaling (double d)
virtual void  | SetSimpleArithmeticOn (bool bOn=true)
virtual void  | SetSpinnerVisibility (bool bVisible)
virtual void  | SetSpinnerWidth (int iWidth)
virtual void  | SetSuffixString (const TCHAR *szSuffix)
virtual void  | SetUpperBound (double dUpperBound)
virtual void  | SetUseHandCursor (bool bUseHand=true)
virtual bool  | SimpleArithmeticOn (void) const
virtual HCURSOR  | SpinDragCursor (void) const
virtual int  | SpinnerWidth (void) const
virtual bool  | UseHandCursor (void) const
virtual bool  | WantThemedSpinner (void) const
 Static Public Member Functions
static long  | Unbounded (void)
 Static Public Member Functions inherited from CRhRdkSdkNumberEdit
static UINT  | ChangedMessageNumber (void)
 Protected Member Functions
virtual CImpl &  | Impl (void)
virtual const CImpl &  | Impl (void) const
afx_msg void  | OnDestroy ()
afx_msg void  | OnEnable (BOOL32 b)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
 Protected Member Functions inherited from CRhRdkSdkNumberEdit
afx_msg void  | OnKillfocusEdit ()
virtual void  | PreSubclassWindow ()
 Protected Attributes
CImpl *  | m_pImpl
Constructor & Destructor Documentation
◆ CRhRdkSdkIntegerNumberEdit()
 CRhRdkSdkIntegerNumberEdit::CRhRdkSdkIntegerNumberEdit  |  ( |   | )
◆ ~CRhRdkSdkIntegerNumberEdit()
 virtual CRhRdkSdkIntegerNumberEdit::~CRhRdkSdkIntegerNumberEdit  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkSdkIntegerNumberEdit::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkSdkNumberEdit.
◆ GetValue()
 virtual int CRhRdkSdkIntegerNumberEdit::GetValue  |  ( |  void  |   | ) |   const
virtual
Get the value.
◆ Impl() [1/2]
 virtual CImpl& CRhRdkSdkIntegerNumberEdit::Impl  |  ( |  void  |   | )
protectedvirtual
Implements CRhRdkSdkNumberEdit.
◆ Impl() [2/2]
 virtual const CImpl& CRhRdkSdkIntegerNumberEdit::Impl  |  ( |  void  |   | ) |   const
protectedvirtual
Implements CRhRdkSdkNumberEdit.
◆ Initialize()
 virtual void CRhRdkSdkIntegerNumberEdit::Initialize  |  ( |  int  |  iLowerBound,
|  int  |  iUpperBound,
|  int  |  iDelta,
|  const TCHAR *  |  tszSuffix = _T("")
)
virtual
Initialize various properties.
◆ OnDestroy()
 afx_msg void CRhRdkSdkIntegerNumberEdit::OnDestroy  |  ( |   | )
protected
◆ OnEnable()
 afx_msg void CRhRdkSdkIntegerNumberEdit::OnEnable  |  ( |  BOOL32  |  b | )
protected
◆ OnSize()
 afx_msg void CRhRdkSdkIntegerNumberEdit::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected
◆ SetValue()
 virtual bool CRhRdkSdkIntegerNumberEdit::SetValue  |  ( |  int  |  iValue,
|  bool  |  bForceBlankOff = false
)
virtual
Set the value.
◆ Unbounded()
 static long CRhRdkSdkIntegerNumberEdit::Unbounded  |  ( |  void  |   | )
static
This value can be passed to Set*Bound(s) to make the control boundless.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkSdkIntegerNumberEdit::m_pImpl
mutableprotected