Public Member Functions | List of all members
CRhRdkBasicMaterialCCI Class Referenceabstract
RDK
#include <RhRdkBasicMaterialCCI.h>
 Inheritance diagram for CRhRdkBasicMaterialCCI:
 Public Member Functions
CRhRdkBasicMaterialCCI ()
virtual  | ~CRhRdkBasicMaterialCCI ()
virtual ON_Color  | Ambient (void) const
virtual double  | Amount (CRhRdkMaterial::ChildSlotUsage usage) const
virtual double  | Clarity (void) const
virtual ON_Color  | Diffuse (void) const
virtual bool  | DisableLighting (void) const
virtual ON_Color  | Emission (void) const
virtual void  | EnableAlphaTransparency (bool b)
virtual void  | EnableFresnel (bool b)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | Filtered (CRhRdkMaterial::ChildSlotUsage usage) const
virtual void *  | GetShader (const UUID &uuidRenderEngine, void *pvData) const =0
virtual double  | Ior (void) const
virtual bool  | IsAlphaTransparencyEnabled (void) const
virtual bool  | IsBuiltIn (void) const
virtual bool  | IsFresnelEnabled (void) const
virtual UUID  | Kind (void) const
virtual double  | Polish (void) const
virtual double  | Reflectivity (void) const
virtual ON_Color  | ReflectivityColor (void) const
virtual void  | SetAmbient (const ON_Color &col)
virtual void  | SetAmount (CRhRdkMaterial::ChildSlotUsage usage, double d)
virtual void  | SetClarity (double d)
virtual void  | SetDiffuse (const ON_Color &col)
virtual void  | SetDisableLighting (bool b)
virtual void  | SetEmission (const ON_Color &col)
virtual void  | SetFiltered (CRhRdkMaterial::ChildSlotUsage usage, bool b)
virtual void  | SetIor (double d)
virtual void  | SetPolish (double d)
virtual void  | SetReflectivity (double d)
virtual void  | SetReflectivityColor (const ON_Color &c)
virtual void  | SetShine (double d)
virtual void  | SetSpecular (const ON_Color &col)
virtual void  | SetTexture (CRhRdkMaterial::ChildSlotUsage usage, const CRhRdkTexture *pTexture)
virtual void  | SetTransparency (double d)
virtual void  | SetTransparencyColor (const ON_Color &c)
virtual double  | Shine (void) const
virtual ON_Color  | Specular (void) const
virtual const CRhRdkTexture *  | Texture (CRhRdkMaterial::ChildSlotUsage usage) const
virtual double  | Transparency (void) const
virtual ON_Color  | TransparencyColor (void) const
 Public Member Functions inherited from CRhRdkCompoundContentImplementor
virtual UUID  | InterfaceId (void) const final override
virtual CRhRdkCompoundContentImplementor *  | NewInstance (void) const =0
virtual UUID  | TargetRenderEngineId (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkBasicMaterialCCI()
 CRhRdkBasicMaterialCCI::CRhRdkBasicMaterialCCI  |  ( |   | )
◆ ~CRhRdkBasicMaterialCCI()
 virtual CRhRdkBasicMaterialCCI::~CRhRdkBasicMaterialCCI  |  ( |   | )
virtual
Member Function Documentation
◆ Ambient()
 virtual ON_Color CRhRdkBasicMaterialCCI::Ambient  |  ( |  void  |   | ) |   const
virtual
◆ Amount()
 virtual double CRhRdkBasicMaterialCCI::Amount  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage | ) |   const
virtual
◆ Clarity()
 virtual double CRhRdkBasicMaterialCCI::Clarity  |  ( |  void  |   | ) |   const
virtual
◆ Diffuse()
 virtual ON_Color CRhRdkBasicMaterialCCI::Diffuse  |  ( |  void  |   | ) |   const
virtual
◆ DisableLighting()
 virtual bool CRhRdkBasicMaterialCCI::DisableLighting  |  ( |  void  |   | ) |   const
virtual
Implements CRhRdkCompoundContentImplementor.
◆ Emission()
 virtual ON_Color CRhRdkBasicMaterialCCI::Emission  |  ( |  void  |   | ) |   const
virtual
◆ EnableAlphaTransparency()
 virtual void CRhRdkBasicMaterialCCI::EnableAlphaTransparency  |  ( |  bool  |  b | )
virtual
◆ EnableFresnel()
 virtual void CRhRdkBasicMaterialCCI::EnableFresnel  |  ( |  bool  |  b | )
virtual
◆ EVF()
 virtual void* CRhRdkBasicMaterialCCI::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
Implements CRhRdkCompoundContentImplementor.
◆ Filtered()
 virtual bool CRhRdkBasicMaterialCCI::Filtered  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage | ) |   const
virtual
◆ GetShader()
 virtual void* CRhRdkBasicMaterialCCI::GetShader  |  ( |  const UUID &  |  uuidRenderEngine,
|  void *  |  pvData
) |   |  const
pure virtual
Returns
Shader for target renderer.
◆ Ior()
 virtual double CRhRdkBasicMaterialCCI::Ior  |  ( |  void  |   | ) |   const
virtual
◆ IsAlphaTransparencyEnabled()
 virtual bool CRhRdkBasicMaterialCCI::IsAlphaTransparencyEnabled  |  ( |  void  |   | ) |   const
virtual
◆ IsBuiltIn()
 virtual bool CRhRdkBasicMaterialCCI::IsBuiltIn  |  ( |  void  |   | ) |   const
inlinevirtual
Implements CRhRdkCompoundContentImplementor.
◆ IsFresnelEnabled()
 virtual bool CRhRdkBasicMaterialCCI::IsFresnelEnabled  |  ( |  void  |   | ) |   const
virtual
◆ Kind()
 virtual UUID CRhRdkBasicMaterialCCI::Kind  |  ( |  void  |   | ) |   const
virtual
Returns
The unique id for the kind of CCI.
Implements CRhRdkCompoundContentImplementor.
◆ Polish()
 virtual double CRhRdkBasicMaterialCCI::Polish  |  ( |  void  |   | ) |   const
virtual
◆ Reflectivity()
 virtual double CRhRdkBasicMaterialCCI::Reflectivity  |  ( |  void  |   | ) |   const
virtual
◆ ReflectivityColor()
 virtual ON_Color CRhRdkBasicMaterialCCI::ReflectivityColor  |  ( |  void  |   | ) |   const
virtual
◆ SetAmbient()
 virtual void CRhRdkBasicMaterialCCI::SetAmbient  |  ( |  const ON_Color &  |  col | )
virtual
◆ SetAmount()
 virtual void CRhRdkBasicMaterialCCI::SetAmount  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage,
|  double  |  d
)
virtual
◆ SetClarity()
 virtual void CRhRdkBasicMaterialCCI::SetClarity  |  ( |  double  |  d | )
virtual
◆ SetDiffuse()
 virtual void CRhRdkBasicMaterialCCI::SetDiffuse  |  ( |  const ON_Color &  |  col | )
virtual
◆ SetDisableLighting()
 virtual void CRhRdkBasicMaterialCCI::SetDisableLighting  |  ( |  bool  |  b | )
virtual
◆ SetEmission()
 virtual void CRhRdkBasicMaterialCCI::SetEmission  |  ( |  const ON_Color &  |  col | )
virtual
◆ SetFiltered()
 virtual void CRhRdkBasicMaterialCCI::SetFiltered  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage,
|  bool  |  b
)
virtual
◆ SetIor()
 virtual void CRhRdkBasicMaterialCCI::SetIor  |  ( |  double  |  d | )
virtual
◆ SetPolish()
 virtual void CRhRdkBasicMaterialCCI::SetPolish  |  ( |  double  |  d | )
virtual
◆ SetReflectivity()
 virtual void CRhRdkBasicMaterialCCI::SetReflectivity  |  ( |  double  |  d | )
virtual
◆ SetReflectivityColor()
 virtual void CRhRdkBasicMaterialCCI::SetReflectivityColor  |  ( |  const ON_Color &  |  c | )
virtual
◆ SetShine()
 virtual void CRhRdkBasicMaterialCCI::SetShine  |  ( |  double  |  d | )
virtual
◆ SetSpecular()
 virtual void CRhRdkBasicMaterialCCI::SetSpecular  |  ( |  const ON_Color &  |  col | )
virtual
◆ SetTexture()
 virtual void CRhRdkBasicMaterialCCI::SetTexture  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage,
|  const CRhRdkTexture *  |  pTexture
)
virtual
◆ SetTransparency()
 virtual void CRhRdkBasicMaterialCCI::SetTransparency  |  ( |  double  |  d | )
virtual
◆ SetTransparencyColor()
 virtual void CRhRdkBasicMaterialCCI::SetTransparencyColor  |  ( |  const ON_Color &  |  c | )
virtual
◆ Shine()
 virtual double CRhRdkBasicMaterialCCI::Shine  |  ( |  void  |   | ) |   const
virtual
◆ Specular()
 virtual ON_Color CRhRdkBasicMaterialCCI::Specular  |  ( |  void  |   | ) |   const
virtual
◆ Texture()
 virtual const CRhRdkTexture* CRhRdkBasicMaterialCCI::Texture  |  ( |  CRhRdkMaterial::ChildSlotUsage  |  usage | ) |   const
virtual
◆ Transparency()
 virtual double CRhRdkBasicMaterialCCI::Transparency  |  ( |  void  |   | ) |   const
virtual
◆ TransparencyColor()
 virtual ON_Color CRhRdkBasicMaterialCCI::TransparencyColor  |  ( |  void  |   | ) |   const
virtual