Public Member Functions | Protected Attributes | List of all members
CRhinoUiRichEditCtrl Class Reference
RhinoUI
CRhinoUiRichEditCtrl. More...
#include <RhinoSdkUiRichEditCtrl.h>
 Inheritance diagram for CRhinoUiRichEditCtrl:
 Public Member Functions
CRhinoUiRichEditCtrl ()
virtual  | ~CRhinoUiRichEditCtrl ()
bool  | ContextMenuEnabled () const
int  | CreateFrom (CEdit *CopyControl)
void  | DDX_Text (CDataExchange *pDX, int nIDC, ON_wString &wValue)
bool  | EnableContextMenu (bool b)
ON_wString  | GetText () const
For backwards compatibility. More...
afx_msg void  | OnContextMenu (CWnd *pWnd, CPoint pt)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
LRESULT  | OnPaste (WPARAM wParam, LPARAM lParam)
afx_msg void  | OnSetFocus (CWnd *pOldWnd)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual int  | printf (const wchar_t *format,...)
ON_wString  | RmaGetUnicodeText () const
int  | RmaGetUnicodeText (ON_wString &wText) const
int  | RmaGetUnicodeText (wchar_t *psText, int nSize) const
int  | RmaGetUnicodeTextLength () const
void  | RmaSetUnicodeText (const wchar_t *sText, bool bAppend=false)
int  | RmaUnicodeGetSelText (ON_wString &wText) const
int  | RmaUnicodeGetSelText (wchar_t *sText, int nSize) const
void  | RmaUnicodeReplaceSel (const wchar_t *sText)
 Protected Attributes
bool  | m_bContextMenu
CHARRANGE  | m_SelRange
Detailed Description
CRhinoUiRichEditCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiRichEditCtrl()
 CRhinoUiRichEditCtrl::CRhinoUiRichEditCtrl  |  ( |   | )
◆ ~CRhinoUiRichEditCtrl()
 virtual CRhinoUiRichEditCtrl::~CRhinoUiRichEditCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ ContextMenuEnabled()
 bool CRhinoUiRichEditCtrl::ContextMenuEnabled  |  ( |   | ) |   const
◆ CreateFrom()
 int CRhinoUiRichEditCtrl::CreateFrom  |  ( |  CEdit *  |  CopyControl | )
◆ DDX_Text()
 void CRhinoUiRichEditCtrl::DDX_Text  |  ( |  CDataExchange *  |  pDX,
|  int  |  nIDC,
|  ON_wString &  |  wValue
)
Description: DoDataExchange method Replace the DDX_Text(....) function call in your dialog class with m_?my_control?.DDX_Text( ...)
Example: Header file contains: CRhinoUiRichEditCtrl m_wCtrl; ON_wString m_wValue; CPP file would contain: void CTestDialog::DoDataExchange( CDataExchange* pDX) { CRhinoUiDialog::DoDataExchange(pDX); ///<{{AFX_DATA_MAP(CTestDialog) DDX_Control(pDX, IDC_EDIT1, m_wCtrl); ///<}}AFX_DATA_MAP m_wCtrl.DDX_Text(pDX, IDC_EDIT1, m_wValue); }
Parameters: pDX [in] A pointer to a CDataExchange object. The framework supplies this object to establish the context of the data exchange, including its direction. nIDC [in] The ID of an edit control in the dialog box, form view, or control view object. wValue [in] A reference to a data member in the dialog box, form view, or control view object.
See Also: DDX_Text MFC macro
◆ EnableContextMenu()
 bool CRhinoUiRichEditCtrl::EnableContextMenu  |  ( |  bool  |  b | )
◆ GetText()
 ON_wString CRhinoUiRichEditCtrl::GetText  |  ( |   | ) |   const
For backwards compatibility.
◆ OnContextMenu()
 afx_msg void CRhinoUiRichEditCtrl::OnContextMenu  |  ( |  CWnd *  |  pWnd,
|  CPoint  |  pt
)
◆ OnKeyDown()
 afx_msg void CRhinoUiRichEditCtrl::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnKillFocus()
 afx_msg void CRhinoUiRichEditCtrl::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnPaste()
 LRESULT CRhinoUiRichEditCtrl::OnPaste  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
◆ OnSetFocus()
 afx_msg void CRhinoUiRichEditCtrl::OnSetFocus  |  ( |  CWnd *  |  pOldWnd | )
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiRichEditCtrl::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ printf()
 virtual int CRhinoUiRichEditCtrl::printf  |  ( |  const wchar_t *  |  format,
|    |  ...
)
virtual
◆ RmaGetUnicodeText() [1/3]
 ON_wString CRhinoUiRichEditCtrl::RmaGetUnicodeText  |  ( |   | ) |   const
◆ RmaGetUnicodeText() [2/3]
 int CRhinoUiRichEditCtrl::RmaGetUnicodeText  |  ( |  ON_wString &  |  wText | ) |   const
◆ RmaGetUnicodeText() [3/3]
 int CRhinoUiRichEditCtrl::RmaGetUnicodeText  |  ( |  wchar_t *  |  psText,
|  int  |  nSize
) |   |  const
◆ RmaGetUnicodeTextLength()
 int CRhinoUiRichEditCtrl::RmaGetUnicodeTextLength  |  ( |   | ) |   const
◆ RmaSetUnicodeText()
 void CRhinoUiRichEditCtrl::RmaSetUnicodeText  |  ( |  const wchar_t *  |  sText,
|  bool  |  bAppend = false
)
◆ RmaUnicodeGetSelText() [1/2]
 int CRhinoUiRichEditCtrl::RmaUnicodeGetSelText  |  ( |  ON_wString &  |  wText | ) |   const
◆ RmaUnicodeGetSelText() [2/2]
 int CRhinoUiRichEditCtrl::RmaUnicodeGetSelText  |  ( |  wchar_t *  |  sText,
|  int  |  nSize
) |   |  const
◆ RmaUnicodeReplaceSel()
 void CRhinoUiRichEditCtrl::RmaUnicodeReplaceSel  |  ( |  const wchar_t *  |  sText | )
Member Data Documentation
◆ m_bContextMenu
 bool CRhinoUiRichEditCtrl::m_bContextMenu
protected
◆ m_SelRange
 CHARRANGE CRhinoUiRichEditCtrl::m_SelRange
protected