Public Member Functions | List of all members
CRhRdkContent::unique_ptr< T > Class Template Reference
#include <RhRdkContent.h>
 Inheritance diagram for CRhRdkContent::unique_ptr< T >:
 Public Member Functions
unique_ptr (T *p=nullptr)
Constructor & Destructor Documentation
◆ unique_ptr()
 template<class T >
 CRhRdkContent::unique_ptr< T >::unique_ptr  |  ( |  T *  |  p = nullptr | )
inline