Public Member Functions | Public Attributes | List of all members
CRhinoSplopSpaceMorph Class Reference
Rhino
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoSplopSpaceMorph:
 Public Member Functions
CRhinoSplopSpaceMorph ()
~CRhinoSplopSpaceMorph ()
ON_3dPoint  | MorphPoint (ON_3dPoint pt) const
virtual ON_SpaceMorph override More...
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
virtual bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
double  | m_M [2][2]
ON_3dVector  | m_N
ON_3dPoint  | m_P0
const ON_Surface *  | m_srf
double  | m_u0
double  | m_v0
ON_3dVector  | m_X
ON_3dVector  | m_Y
Detailed Description
Splop morph Copies, rotates, scales, and wraps objects on a surface, like pottery sprigging or appliqué.
Constructor & Destructor Documentation
◆ CRhinoSplopSpaceMorph()
 CRhinoSplopSpaceMorph::CRhinoSplopSpaceMorph  |  ( |   | )
◆ ~CRhinoSplopSpaceMorph()
 CRhinoSplopSpaceMorph::~CRhinoSplopSpaceMorph  |  ( |   | )
Member Function Documentation
◆ MorphPoint()
 ON_3dPoint CRhinoSplopSpaceMorph::MorphPoint  |  ( |  ON_3dPoint  |  pt | ) |   const
virtual
virtual ON_SpaceMorph override
Implements ON_SpaceMorph.
Member Data Documentation
◆ m_M
 double CRhinoSplopSpaceMorph::m_M[2][2]
◆ m_N
 ON_3dVector CRhinoSplopSpaceMorph::m_N
◆ m_P0
 ON_3dPoint CRhinoSplopSpaceMorph::m_P0
◆ m_srf
 const ON_Surface* CRhinoSplopSpaceMorph::m_srf
◆ m_u0
 double CRhinoSplopSpaceMorph::m_u0
◆ m_v0
 double CRhinoSplopSpaceMorph::m_v0
◆ m_X
 ON_3dVector CRhinoSplopSpaceMorph::m_X
◆ m_Y
 ON_3dVector CRhinoSplopSpaceMorph::m_Y