Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiRegistry Class Reference
RhinoUI
#include <RhinoSdkUiRegistry.h>
 Public Member Functions
CRhinoUiRegistry ()
CRhinoUiRegistry (CRhinoUiRegistry &)
CRhinoUiRegistry (HKEY hKey)
~CRhinoUiRegistry ()
void  | Attach (HKEY hKey)
Attach the CRegKey object to an existing HKEY. Takes ownership. More...
bool  | AttachToRhinoAppRegistryKey (bool bWrite=false, CRhinoProfileContext::context_location nProfile=CRhinoProfileContext::cl_scheme_current_user)
bool  | AttachToRhinoRootRegistryKey (bool bWrite=false, CRhinoProfileContext::context_location nProfile=CRhinoProfileContext::cl_scheme_current_user)
bool  | AttachToRhinoSectionKey (LPCTSTR lpszSection, bool bWrite=false, CRhinoProfileContext::context_location nProfile=CRhinoProfileContext::cl_scheme_current_user)
bool  | Close ()
bool  | Create (HKEY hKeyParent, LPCTSTR lpsKeyName, bool *pbIsNewKey=NULL)
bool  | DeleteSubKey (LPCTSTR lpszSubKey) const
bool  | DeleteValue (LPCTSTR lpszValue) const
HKEY  | Detach ()
Detach the CRegKey object from its HKEY. Releases ownership. More...
int  | EnumKey ()
int  | EnumValue ()
bool  | Flush ()
HKEY  | GetHKEY () const
int  | KeyCount () const
LPCTSTR  | KeyString (int) const
bool  | Open (HKEY hKeyParent, LPCTSTR lpsKeyName, bool bWrite=false)
operator HKEY () const
CRhinoUiRegistry &  | operator= (CRhinoUiRegistry &)
bool  | Query2dPointValue (LPCTSTR lpsValueName, ON_2dPoint &ptValue) const
bool  | Query3dPointValue (LPCTSTR lpsValueName, ON_3dPoint &ptValue) const
bool  | Query3dVectorValue (LPCTSTR lpsValueName, ON_3dVector &vValue) const
bool  | QueryBinaryValue (LPCTSTR lpsValueName, void *pValue, ULONG &nBytesOut) const
bool  | QueryBoolValue (LPCTSTR lpsValueName, bool &bValue) const
bool  | QueryBoolValue (LPCTSTR lpsValueName, BOOL32 &bValue) const
bool  | QueryDoubleValue (LPCTSTR lpsValueName, double &nValue) const
bool  | QueryDWORDValue (LPCTSTR lpsValueName, DWORD &dwValue) const
bool  | QueryIntValue (LPCTSTR lpsValueName, int &iValue) const
bool  | QueryMultiStringValue (LPCTSTR lpsValueName, ON_ClassArray< CString > &sValues) const
bool  | QueryPointValue (LPCTSTR lpsValueName, CPoint &ptValue) const
bool  | QueryRectValue (LPCTSTR lpsValueName, CRect &rValue) const
bool  | QueryRGBValue (LPCTSTR lpsValueName, COLORREF &cr) const
bool  | QuerySizeValue (LPCTSTR lpsValueName, CSize &szValue) const
bool  | QueryStringValue (LPCTSTR lpsValueName, CString &sValue) const
bool  | QueryUUIDValue (LPCTSTR lpsValueName, UUID &uuid) const
bool  | QueryValue (LPCTSTR lpsValueName, DWORD *pdwType, LPBYTE pData, DWORD &dwData) const
bool  | QueryValueSize (LPCTSTR lpsValueName, DWORD &dwSize) const
bool  | QueryValueType (LPCTSTR lpsValueName, DWORD &dwType) const
bool  | Set2dPointValue (LPCTSTR lpsValueName, ON_2dPoint pt) const
bool  | Set3dPointValue (LPCTSTR lpsValueName, ON_3dPoint pt) const
bool  | Set3dVectorValue (LPCTSTR lpsValueName, ON_3dVector v) const
bool  | SetBinaryValue (LPCTSTR lpsValueName, const void *pValue, ULONG nBytes) const
bool  | SetBoolValue (LPCTSTR lpsValueName, bool b) const
bool  | SetBoolValue (LPCTSTR lpsValueName, BOOL32 b) const
bool  | SetDoubleValue (LPCTSTR lpsValueName, double n) const
bool  | SetDWORDValue (LPCTSTR lpsValueName, DWORD dwValue) const
bool  | SetIntValue (LPCTSTR lpsValueName, int i) const
bool  | SetMultiStringValue (LPCTSTR lpsValueName, const ON_ClassArray< CString > &sValues) const
bool  | SetMultiStringValueA (LPCTSTR lpsValueName, const ON_ClassArray< ON_String > &sValues) const
bool  | SetMultiStringValueW (LPCTSTR lpsValueName, const ON_ClassArray< ON_wString > &sValues) const
bool  | SetPointValue (LPCTSTR lpsValueName, CPoint pt) const
bool  | SetRectValue (LPCTSTR lpsValueName, CRect r) const
bool  | SetRGBValue (LPCTSTR lpsValueName, COLORREF cr) const
bool  | SetSchemeName (LPCTSTR lpsScheme)
bool  | SetSizeValue (LPCTSTR lpsValueName, CSize sz) const
bool  | SetStringValue (LPCTSTR lpsValueName, LPCTSTR lpsValue) const
bool  | SetStringValueA (LPCTSTR lpsValueName, const char *lpsValue) const
bool  | SetStringValueW (LPCTSTR lpsValueName, const wchar_t *lpsValue) const
bool  | SetUUIDValue (LPCTSTR lpsValueName, const UUID &uuid) const
bool  | SetValue (LPCTSTR lpsValueName, DWORD dwType, const LPBYTE pData, DWORD dwData) const
const CRhinoUiRegistryEnumValue *  | Value (int) const
const CRhinoUiRegistryEnumValue *  | Value (LPCTSTR) const
int  | ValueCount () const
 Protected Member Functions
bool  | QueryNumberList (LPCTSTR lpsValueName, double *iList, int iCount) const
bool  | QueryNumberList (LPCTSTR lpsValueName, int *iList, int iCount) const
 Protected Attributes
HKEY  | m_hKey
ON_ClassArray< CRhinoUiRegistryEnumValue >  | m_LabelList
CStringArray  | m_sKeyList
CString  | m_sSchemeName
Detailed Description
class CRhinoUiRegistry
Constructor & Destructor Documentation
◆ CRhinoUiRegistry() [1/3]
 CRhinoUiRegistry::CRhinoUiRegistry  |  ( |   | )
◆ CRhinoUiRegistry() [2/3]
 CRhinoUiRegistry::CRhinoUiRegistry  |  ( |  CRhinoUiRegistry &  |   | )
◆ CRhinoUiRegistry() [3/3]
 CRhinoUiRegistry::CRhinoUiRegistry  |  ( |  HKEY  |  hKey | )
◆ ~CRhinoUiRegistry()
 CRhinoUiRegistry::~CRhinoUiRegistry  |  ( |   | )
Member Function Documentation
◆ Attach()
 void CRhinoUiRegistry::Attach  |  ( |  HKEY  |  hKey | )
Attach the CRegKey object to an existing HKEY. Takes ownership.
◆ AttachToRhinoAppRegistryKey()
 bool CRhinoUiRegistry::AttachToRhinoAppRegistryKey  |  ( |  bool  |  bWrite = false,
|  CRhinoProfileContext::context_location  |  nProfile = CRhinoProfileContext::cl_scheme_current_user
)
◆ AttachToRhinoRootRegistryKey()
 bool CRhinoUiRegistry::AttachToRhinoRootRegistryKey  |  ( |  bool  |  bWrite = false,
|  CRhinoProfileContext::context_location  |  nProfile = CRhinoProfileContext::cl_scheme_current_user
)
◆ AttachToRhinoSectionKey()
 bool CRhinoUiRegistry::AttachToRhinoSectionKey  |  ( |  LPCTSTR  |  lpszSection,
|  bool  |  bWrite = false,
|  CRhinoProfileContext::context_location  |  nProfile = CRhinoProfileContext::cl_scheme_current_user
)
◆ Close()
 bool CRhinoUiRegistry::Close  |  ( |   | )
◆ Create()
 bool CRhinoUiRegistry::Create  |  ( |  HKEY  |  hKeyParent,
|  LPCTSTR  |  lpsKeyName,
|  bool *  |  pbIsNewKey = NULL
)
◆ DeleteSubKey()
 bool CRhinoUiRegistry::DeleteSubKey  |  ( |  LPCTSTR  |  lpszSubKey | ) |   const
◆ DeleteValue()
 bool CRhinoUiRegistry::DeleteValue  |  ( |  LPCTSTR  |  lpszValue | ) |   const
◆ Detach()
 HKEY CRhinoUiRegistry::Detach  |  ( |   | )
Detach the CRegKey object from its HKEY. Releases ownership.
◆ EnumKey()
 int CRhinoUiRegistry::EnumKey  |  ( |   | )
◆ EnumValue()
 int CRhinoUiRegistry::EnumValue  |  ( |   | )
◆ Flush()
 bool CRhinoUiRegistry::Flush  |  ( |   | )
◆ GetHKEY()
 HKEY CRhinoUiRegistry::GetHKEY  |  ( |   | ) |   const
◆ KeyCount()
 int CRhinoUiRegistry::KeyCount  |  ( |   | ) |   const
◆ KeyString()
 LPCTSTR CRhinoUiRegistry::KeyString  |  ( |  int  |   | ) |   const
◆ Open()
 bool CRhinoUiRegistry::Open  |  ( |  HKEY  |  hKeyParent,
|  LPCTSTR  |  lpsKeyName,
|  bool  |  bWrite = false
)
◆ operator HKEY()
 CRhinoUiRegistry::operator HKEY  |  ( |   | ) |   const
◆ operator=()
 CRhinoUiRegistry& CRhinoUiRegistry::operator=  |  ( |  CRhinoUiRegistry &  |   | )
◆ Query2dPointValue()
 bool CRhinoUiRegistry::Query2dPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_2dPoint &  |  ptValue
) |   |  const
◆ Query3dPointValue()
 bool CRhinoUiRegistry::Query3dPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_3dPoint &  |  ptValue
) |   |  const
◆ Query3dVectorValue()
 bool CRhinoUiRegistry::Query3dVectorValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_3dVector &  |  vValue
) |   |  const
◆ QueryBinaryValue()
 bool CRhinoUiRegistry::QueryBinaryValue  |  ( |  LPCTSTR  |  lpsValueName,
|  void *  |  pValue,
|  ULONG &  |  nBytesOut
) |   |  const
◆ QueryBoolValue() [1/2]
 bool CRhinoUiRegistry::QueryBoolValue  |  ( |  LPCTSTR  |  lpsValueName,
|  bool &  |  bValue
) |   |  const
◆ QueryBoolValue() [2/2]
 bool CRhinoUiRegistry::QueryBoolValue  |  ( |  LPCTSTR  |  lpsValueName,
|  BOOL32 &  |  bValue
) |   |  const
◆ QueryDoubleValue()
 bool CRhinoUiRegistry::QueryDoubleValue  |  ( |  LPCTSTR  |  lpsValueName,
|  double &  |  nValue
) |   |  const
◆ QueryDWORDValue()
 bool CRhinoUiRegistry::QueryDWORDValue  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD &  |  dwValue
) |   |  const
◆ QueryIntValue()
 bool CRhinoUiRegistry::QueryIntValue  |  ( |  LPCTSTR  |  lpsValueName,
|  int &  |  iValue
) |   |  const
◆ QueryMultiStringValue()
 bool CRhinoUiRegistry::QueryMultiStringValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_ClassArray< CString > &  |  sValues
) |   |  const
◆ QueryNumberList() [1/2]
 bool CRhinoUiRegistry::QueryNumberList  |  ( |  LPCTSTR  |  lpsValueName,
|  double *  |  iList,
|  int  |  iCount
) |   |  const
protected
◆ QueryNumberList() [2/2]
 bool CRhinoUiRegistry::QueryNumberList  |  ( |  LPCTSTR  |  lpsValueName,
|  int *  |  iList,
|  int  |  iCount
) |   |  const
protected
◆ QueryPointValue()
 bool CRhinoUiRegistry::QueryPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CPoint &  |  ptValue
) |   |  const
◆ QueryRectValue()
 bool CRhinoUiRegistry::QueryRectValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CRect &  |  rValue
) |   |  const
◆ QueryRGBValue()
 bool CRhinoUiRegistry::QueryRGBValue  |  ( |  LPCTSTR  |  lpsValueName,
|  COLORREF &  |  cr
) |   |  const
◆ QuerySizeValue()
 bool CRhinoUiRegistry::QuerySizeValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CSize &  |  szValue
) |   |  const
◆ QueryStringValue()
 bool CRhinoUiRegistry::QueryStringValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CString &  |  sValue
) |   |  const
◆ QueryUUIDValue()
 bool CRhinoUiRegistry::QueryUUIDValue  |  ( |  LPCTSTR  |  lpsValueName,
|  UUID &  |  uuid
) |   |  const
◆ QueryValue()
 bool CRhinoUiRegistry::QueryValue  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD *  |  pdwType,
|  LPBYTE  |  pData,
|  DWORD &  |  dwData
) |   |  const
◆ QueryValueSize()
 bool CRhinoUiRegistry::QueryValueSize  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD &  |  dwSize
) |   |  const
◆ QueryValueType()
 bool CRhinoUiRegistry::QueryValueType  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD &  |  dwType
) |   |  const
◆ Set2dPointValue()
 bool CRhinoUiRegistry::Set2dPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_2dPoint  |  pt
) |   |  const
◆ Set3dPointValue()
 bool CRhinoUiRegistry::Set3dPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_3dPoint  |  pt
) |   |  const
◆ Set3dVectorValue()
 bool CRhinoUiRegistry::Set3dVectorValue  |  ( |  LPCTSTR  |  lpsValueName,
|  ON_3dVector  |  v
) |   |  const
◆ SetBinaryValue()
 bool CRhinoUiRegistry::SetBinaryValue  |  ( |  LPCTSTR  |  lpsValueName,
|  const void *  |  pValue,
|  ULONG  |  nBytes
) |   |  const
◆ SetBoolValue() [1/2]
 bool CRhinoUiRegistry::SetBoolValue  |  ( |  LPCTSTR  |  lpsValueName,
|  bool  |  b
) |   |  const
◆ SetBoolValue() [2/2]
 bool CRhinoUiRegistry::SetBoolValue  |  ( |  LPCTSTR  |  lpsValueName,
|  BOOL32  |  b
) |   |  const
◆ SetDoubleValue()
 bool CRhinoUiRegistry::SetDoubleValue  |  ( |  LPCTSTR  |  lpsValueName,
|  double  |  n
) |   |  const
◆ SetDWORDValue()
 bool CRhinoUiRegistry::SetDWORDValue  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD  |  dwValue
) |   |  const
◆ SetIntValue()
 bool CRhinoUiRegistry::SetIntValue  |  ( |  LPCTSTR  |  lpsValueName,
|  int  |  i
) |   |  const
◆ SetMultiStringValue()
 bool CRhinoUiRegistry::SetMultiStringValue  |  ( |  LPCTSTR  |  lpsValueName,
|  const ON_ClassArray< CString > &  |  sValues
) |   |  const
◆ SetMultiStringValueA()
 bool CRhinoUiRegistry::SetMultiStringValueA  |  ( |  LPCTSTR  |  lpsValueName,
|  const ON_ClassArray< ON_String > &  |  sValues
) |   |  const
◆ SetMultiStringValueW()
 bool CRhinoUiRegistry::SetMultiStringValueW  |  ( |  LPCTSTR  |  lpsValueName,
|  const ON_ClassArray< ON_wString > &  |  sValues
) |   |  const
◆ SetPointValue()
 bool CRhinoUiRegistry::SetPointValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CPoint  |  pt
) |   |  const
◆ SetRectValue()
 bool CRhinoUiRegistry::SetRectValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CRect  |  r
) |   |  const
◆ SetRGBValue()
 bool CRhinoUiRegistry::SetRGBValue  |  ( |  LPCTSTR  |  lpsValueName,
|  COLORREF  |  cr
) |   |  const
◆ SetSchemeName()
 bool CRhinoUiRegistry::SetSchemeName  |  ( |  LPCTSTR  |  lpsScheme | )
◆ SetSizeValue()
 bool CRhinoUiRegistry::SetSizeValue  |  ( |  LPCTSTR  |  lpsValueName,
|  CSize  |  sz
) |   |  const
◆ SetStringValue()
 bool CRhinoUiRegistry::SetStringValue  |  ( |  LPCTSTR  |  lpsValueName,
|  LPCTSTR  |  lpsValue
) |   |  const
◆ SetStringValueA()
 bool CRhinoUiRegistry::SetStringValueA  |  ( |  LPCTSTR  |  lpsValueName,
|  const char *  |  lpsValue
) |   |  const
◆ SetStringValueW()
 bool CRhinoUiRegistry::SetStringValueW  |  ( |  LPCTSTR  |  lpsValueName,
|  const wchar_t *  |  lpsValue
) |   |  const
◆ SetUUIDValue()
 bool CRhinoUiRegistry::SetUUIDValue  |  ( |  LPCTSTR  |  lpsValueName,
|  const UUID &  |  uuid
) |   |  const
◆ SetValue()
 bool CRhinoUiRegistry::SetValue  |  ( |  LPCTSTR  |  lpsValueName,
|  DWORD  |  dwType,
|  const LPBYTE  |  pData,
|  DWORD  |  dwData
) |   |  const
◆ Value() [1/2]
 const CRhinoUiRegistryEnumValue* CRhinoUiRegistry::Value  |  ( |  int  |   | ) |   const
◆ Value() [2/2]
 const CRhinoUiRegistryEnumValue* CRhinoUiRegistry::Value  |  ( |  LPCTSTR  |   | ) |   const
◆ ValueCount()
 int CRhinoUiRegistry::ValueCount  |  ( |   | ) |   const
Member Data Documentation
◆ m_hKey
 HKEY CRhinoUiRegistry::m_hKey
protected
◆ m_LabelList
 ON_ClassArray<CRhinoUiRegistryEnumValue> CRhinoUiRegistry::m_LabelList
protected
◆ m_sKeyList
 CStringArray CRhinoUiRegistry::m_sKeyList
protected
◆ m_sSchemeName
 CString CRhinoUiRegistry::m_sSchemeName
protected