Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetSubCurve Class Reference
RhinoGet
#include <rhinoSdkGetSubCurve.h>
 Public Member Functions
CArgsRhinoGetSubCurve ()
CArgsRhinoGetSubCurve (const CArgsRhinoGetSubCurve &)
~CArgsRhinoGetSubCurve ()
void  | ClearIncludeRange ()
const ON_Curve *  | Curve () const
const ON_wString &  | FirstPrompt () const
gets More...
bool  | IncludeRange (ON_Interval &range) const
bool  | IncludeRangeValid () const
CArgsRhinoGetSubCurve &  | operator= (const CArgsRhinoGetSubCurve &)
bool  | Reverse () const
const ON_wString &  | SecondPrompt () const
void  | SetCurve (const ON_Curve *pC)
void  | SetFirstPrompt (const wchar_t *)
sets More...
void  | SetIncludeRange (const ON_Interval &range)
void  | SetReverse (bool bRev)
void  | SetSecondPrompt (const wchar_t *)
 Protected Attributes
bool  | m_bReverse
true if drag direction was opposite natural curve direction More...
ON_wString  | m_FirstPrompt
prompt for first point More...
ON_Interval  | m_include_range
const ON_Curve *  | m_pC
ON_wString  | m_SecondPrompt
prompt for following points More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
 CLASS CArgsRhinoGetSubCurve
OVERVIEW TEXT Arguments for RhinoGetSubCurve
KEYWORDS
RhinoGetSubCurve SubCrv SubCurve
Constructor & Destructor Documentation
◆ CArgsRhinoGetSubCurve() [1/2]
 CArgsRhinoGetSubCurve::CArgsRhinoGetSubCurve  |  ( |   | )
◆ ~CArgsRhinoGetSubCurve()
 CArgsRhinoGetSubCurve::~CArgsRhinoGetSubCurve  |  ( |   | )
◆ CArgsRhinoGetSubCurve() [2/2]
 CArgsRhinoGetSubCurve::CArgsRhinoGetSubCurve  |  ( |  const CArgsRhinoGetSubCurve &  |   | )
Member Function Documentation
◆ ClearIncludeRange()
 void CArgsRhinoGetSubCurve::ClearIncludeRange  |  ( |   | )
◆ Curve()
 const ON_Curve* CArgsRhinoGetSubCurve::Curve  |  ( |   | ) |   const
◆ FirstPrompt()
 const ON_wString& CArgsRhinoGetSubCurve::FirstPrompt  |  ( |   | ) |   const
gets
◆ IncludeRange()
 bool CArgsRhinoGetSubCurve::IncludeRange  |  ( |  ON_Interval &  |  range | ) |   const
◆ IncludeRangeValid()
 bool CArgsRhinoGetSubCurve::IncludeRangeValid  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetSubCurve& CArgsRhinoGetSubCurve::operator=  |  ( |  const CArgsRhinoGetSubCurve &  |   | )
◆ Reverse()
 bool CArgsRhinoGetSubCurve::Reverse  |  ( |   | ) |   const
◆ SecondPrompt()
 const ON_wString& CArgsRhinoGetSubCurve::SecondPrompt  |  ( |   | ) |   const
◆ SetCurve()
 void CArgsRhinoGetSubCurve::SetCurve  |  ( |  const ON_Curve *  |  pC | )
◆ SetFirstPrompt()
 void CArgsRhinoGetSubCurve::SetFirstPrompt  |  ( |  const wchar_t *  |   | )
sets
◆ SetIncludeRange()
 void CArgsRhinoGetSubCurve::SetIncludeRange  |  ( |  const ON_Interval &  |  range | )
◆ SetReverse()
 void CArgsRhinoGetSubCurve::SetReverse  |  ( |  bool  |  bRev | )
◆ SetSecondPrompt()
 void CArgsRhinoGetSubCurve::SetSecondPrompt  |  ( |  const wchar_t *  |   | )
Member Data Documentation
◆ m_bReverse
 bool CArgsRhinoGetSubCurve::m_bReverse
protected
true if drag direction was opposite natural curve direction
◆ m_FirstPrompt
 ON_wString CArgsRhinoGetSubCurve::m_FirstPrompt
protected
prompt for first point
◆ m_include_range
 ON_Interval CArgsRhinoGetSubCurve::m_include_range
protected
◆ m_pC
 const ON_Curve* CArgsRhinoGetSubCurve::m_pC
protected
◆ m_SecondPrompt
 ON_wString CArgsRhinoGetSubCurve::m_SecondPrompt
protected
prompt for following points