Public Member Functions | List of all members
ON_SubDEdgeChainCurve Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDEdgeChainCurve:
 Public Member Functions
ON_SubDEdgeChainCurve ()=default
ON_SubDEdgeChainCurve (const ON_SubDEdgeChain &edge_chain)
ON_SubDEdgeChainCurve (const ON_SubDEdgeChainCurve &)=default
ON_SubDEdgeChainCurve (ON_UUID persistent_subd_id, const ON_SubD &subd, const ON_SimpleArray< ON_SubDEdgePtr > &edge_chain)
ON_SubDEdgeChainCurve (ON_UUID persistent_subd_id, const ON_SubDRef subd_ref, const ON_SimpleArray< ON_SubDEdgePtr > &edge_chain)
~ON_SubDEdgeChainCurve ()=default
bool  | ChangeClosedChainStart (unsigned int edge_index)
bool  | ChangeClosedCurveSeam (double t) override
bool  | ChangeDimension (int desired_dimension) override
void  | ClearBoundingBox () override
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
int  | Degree () const override
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
int  | Dimension () const override
ON_Geometry virtual interface. More...
ON_Interval  | Domain () const override
ON_Curve virtual interface. More...
void  | Dump (ON_TextLog &) const override
const ON_SubDEdgeChain &  | EdgeChain () const
unsigned int  | EdgeCount () const
default is ok ///< class ON_CurveTree* CreateCurveTree() const override; More...
unsigned  | EdgeIndexFromParameter (double t, double *normalized_edge_parameter) const
const ON_SubDEdgePtr  | EdgePtr (unsigned int i) const
const ON_SubDEdgePtr  | EdgePtrFromParameter (double t, double *normalized_edge_parameter) const
ON_NurbsCurve *  | EdgeSurfaceCurve (ON_NurbsCurve *destination) const
bool  | Evaluate (double t, int der_count, int v_stride, double *v, int side=0, int *hint=0) const override
bool  | Extend (const ON_Interval &domain) override
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
bool  | GetClosestPoint (const ON_3dPoint &, double *t, double maximum_distance=0.0, const ON_Interval *sub_domain=nullptr) const override
bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const override
bool  | GetLength (double *length, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
bool  | GetLocalClosestPoint (const ON_3dPoint &test_point, double seed_parameter, double *t, const ON_Interval *sub_domain=0) const override
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | GetNormalizedArcLengthPoint (double s, double *t, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
bool  | GetNormalizedArcLengthPoints (int count, const double *s, double *t, double absolute_tolerance=0.0, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
int  | GetNurbForm (ON_NurbsCurve &nurbs_curve, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const override
bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const override
bool  | GetSpanVector (double *span_parameters) const override
bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override
 More...
int  | HasNurbForm () const override
int  | IntersectSelf (ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, const ON_Interval *curve_domain=0) const override
bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsClosed () const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsDeformable () const override
bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsMorphable () const override
bool  | IsPeriodic () const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
bool  | IsShort (double tolerance, const ON_Interval *sub_domain=0, double *length_estimate=0) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object virtual interface. More...
ON_NurbsCurve *  | LoftCurve (ON_NurbsCurve *destination) const
bool  | Morph (const class ON_SpaceMorph &morph) override
ON_SubDEdgeChainCurve &  | operator= (const ON_SubDEdgeChainCurve &)=default
const ON_UUID  | PersistentSubDId () const
bool  | Read (ON_BinaryArchive &binary_archive) override
bool  | RemoveShortSegments (double tolerance, bool bRemoveShortSegments=true) override
bool  | Reverse () override
bool  | SetDomain (double t0, double t1) override
unsigned int  | SetEdgeChain (const ON_SubDEdgeChain &edge_chain)
unsigned int  | SetEdgeChain (ON_UUID persistent_subd_id, const ON_SubD &subd, const ON_SimpleArray< ON_SubDEdgePtr > &edge_chain)
unsigned int  | SetEdgeChain (ON_UUID persistent_subd_id, const ON_SubDRef subd_ref, const ON_SimpleArray< ON_SubDEdgePtr > &edge_chain)
bool  | SetEndPoint (ON_3dPoint end_point) override
bool  | SetStartPoint (ON_3dPoint start_point) override
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
int  | SpanCount () const override
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
const ON_SubD &  | SubD () const
ON_SubDRef  | SubDRef () const
bool  | Transform (const ON_Xform &xform) override
bool  | Trim (const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
bool  | AreaMassProperties (ON_3dPoint base_point, ON_3dVector plane_normal, ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
bool  | ChangeClosedCurveSeam (double t, double min_dist)
virtual class ON_CurveTree *  | CreateCurveTree () const
ON_3dVector  | CurvatureAt (double t) const
const class ON_CurveTree *  | CurveTree () const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
virtual ON_Curve *  | DuplicateCurve () const
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvSignedCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, double &kappa, const ON_3dVector *normal=nullptr, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const
int  | IntersectCurve (const ON_Curve *curveB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *curveB_domain=0) const
int  | IntersectPlane (ON_PlaneEquation plane_equation, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curve_domain=0) const
int  | IntersectSurface (const ON_Surface *surfaceB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *surfaceB_udomain=0, const ON_Interval *surfaceB_vdomain=0) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
bool  | IsLong (double min_length, const ON_Interval *sub_domain=0) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | LengthMassProperties (class ON_MassProperties &mp, bool bLength=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
class ON_PolylineCurve *  | MeshCurve (ON_MeshCurveParameters &mp, ON_PolylineCurve *polyline, bool bSkipFirstPoint, const ON_Interval *domain) const
double  | NextCurveKink (ON_Interval search_domain, const class ON_CurveKinkDefinition &kink_definition) const
Find the next curve kink in the search domain. More...
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
class ON_NurbsCurve *  | NurbsCurveFit (ON_Interval domain, const class ON_NurbsCurveFitParameters &fit_parameters, class ON_NurbsCurve *destination_nurbs_cuve, class ON_Line &maximum_separation, double &this_separation_parameter, double &nurbs_separation_parameter) const
Get a uniform NURBS curve fit to this curve.. This function is useful when you want to fit this curve a single time. If you are in a situation where you are repeatedly adjusting fit_parameters, it is much more efficient to use the ON_NurbsCurveFitBuilder class because the steps involved in sampling points and other information from this input curve are expensive and can be reused as fit_parameters.Degree(), fit_parameters.PointCount(), and other fitting parmeters are changed. More...
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
class ON_NurbsCurve *  | RebuildToMatchTemplateCurve (const ON_Curve &template_curve, bool bFlipSourceDirection, bool bPreserveEndTangents, bool bMakeSubDFriendly, class ON_NurbsCurve *destination_nurbs_curve, class ON_Line *maximum_deviation) const
Rebuild this curve (the "source" curve) so it takes on the degree, knot vector, and control point count of a template curve. When rebuilding many curves against the same template, use the ON_TemplatedCurveRebuilder class so the template is analyzed only once. More...
bool  | SetDomain (ON_Interval domain)
double  | SignedCurvatureAt (double t, const ON_3dVector *plane_normal=nullptr) const
const ON_SimpleArray< double >  | SpanVector () const
The curve's span vector is a stricltly monotone increasing list of doubles that are the intervals on which the curve is C-infinity. More...
ON_3dVector  | TangentAt (double t) const
ON_3dVector  | TangentAt (double t, int side) const
Evaluate the unit tangent vector with the option to specify the direction of the limit. This is useful when evaluating tangent vectors at a tangent discontinuity. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | MakeDeformable ()
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from ON_Curve
static class ON_NurbsCurve *  | CreateCubicLoft (int point_count, int point_dim, int point_stride, const double *point_list, double k, int is_closed=0, ON::cubic_loft_end_condition start_shape=ON::cubic_loft_ec_quadratic, ON::cubic_loft_end_condition end_shape=ON::cubic_loft_ec_quadratic, class ON_NurbsCurve *nurbs_curve=0)
static bool  | GetCurveSeparation (const ON_Curve &curveA, ON_Interval domainA, const ON_Curve &curveB, ON_Interval domainB, ON_Line &minimum_separation, double *min_parameter_A, double *min_parameter_B, ON_Line &maximum_separation, double *max_parameter_A, double *max_parameter_B)
Find the locations of the minimimum and maximum separation between two curves. When the separation points are distinct, the line connecting the separation points is perpindicular to the curves. This calculates the distances and locations shown in the Rhino CrvDeviation command. More...
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Constructor & Destructor Documentation
◆ ON_SubDEdgeChainCurve() [1/5]
 ON_SubDEdgeChainCurve::ON_SubDEdgeChainCurve  |  ( |   | )
default
◆ ~ON_SubDEdgeChainCurve()
 ON_SubDEdgeChainCurve::~ON_SubDEdgeChainCurve  |  ( |   | )
default
◆ ON_SubDEdgeChainCurve() [2/5]
 ON_SubDEdgeChainCurve::ON_SubDEdgeChainCurve  |  ( |  const ON_SubDEdgeChainCurve &  |   | )
default
◆ ON_SubDEdgeChainCurve() [3/5]
 ON_SubDEdgeChainCurve::ON_SubDEdgeChainCurve  |  ( |  const ON_SubDEdgeChain &  |  edge_chain | )
◆ ON_SubDEdgeChainCurve() [4/5]
 ON_SubDEdgeChainCurve::ON_SubDEdgeChainCurve  |  ( |  ON_UUID  |  persistent_subd_id,
|  const ON_SubDRef  |  subd_ref,
|  const ON_SimpleArray< ON_SubDEdgePtr > &  |  edge_chain
)
Parameters: persistent_subd_id - [in] If this edge chain needs to persist in a 3dm archive, then persistent_subd_id should identify the subd in its current context. If that context is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If that context is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
◆ ON_SubDEdgeChainCurve() [5/5]
 ON_SubDEdgeChainCurve::ON_SubDEdgeChainCurve  |  ( |  ON_UUID  |  persistent_subd_id,
|  const ON_SubD &  |  subd,
|  const ON_SimpleArray< ON_SubDEdgePtr > &  |  edge_chain
)
Parameters: persistent_subd_id - [in] If this edge chain needs to persist in a 3dm archive, then persistent_subd_id should identify the subd in its current context. If that context is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If that context is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
Member Function Documentation
◆ ChangeClosedChainStart()
 bool ON_SubDEdgeChainCurve::ChangeClosedChainStart  |  ( |  unsigned int  |  edge_index | )
◆ ChangeClosedCurveSeam()
 bool ON_SubDEdgeChainCurve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful.
Reimplemented from ON_Curve.
◆ ChangeDimension()
 bool ON_SubDEdgeChainCurve::ChangeDimension  |  ( |  int  |  desired_dimension | )
overridevirtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented from ON_Curve.
◆ ClearBoundingBox()
 void ON_SubDEdgeChainCurve::ClearBoundingBox  |  ( |   | )
overridevirtual
Description: Some objects cache bounding box information. If you modify an object, then call ClearBoundingBox() to inform the object that any cached bounding boxes are invalid.
Remarks: Generally, ClearBoundingBox() overrides simply invalidate a cached bounding box and then wait for a call to GetBBox() before recomputing the bounding box.
The default implementation does nothing.
Reimplemented from ON_Geometry.
◆ DataCRC()
 ON__UINT32 ON_SubDEdgeChainCurve::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
Description: Returns a CRC calculated from the information that defines the object. This CRC can be used as a quick way to see if two objects are not identical. Parameters: current_remainder - [in]; use zero for starting a DataCRC computation, and use the result of another DataCRC to compose computations. Returns: CRC of the information the defines the object.
Reimplemented from ON_Object.
◆ Degree()
 int ON_SubDEdgeChainCurve::Degree  |  ( |   | ) |   const
overridevirtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Implements ON_Curve.
◆ DestroyRuntimeCache()
 void ON_SubDEdgeChainCurve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Curve.
◆ Dimension()
 int ON_SubDEdgeChainCurve::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry virtual interface.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_SubDEdgeChainCurve::Domain  |  ( |   | ) |   const
overridevirtual
ON_Curve virtual interface.
Implements ON_Curve.
◆ Dump()
 void ON_SubDEdgeChainCurve::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Description: Creates a text dump of the object. Remarks: Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_Object.
◆ EdgeChain()
 const ON_SubDEdgeChain& ON_SubDEdgeChainCurve::EdgeChain  |  ( |   | ) |   const
◆ EdgeCount()
 unsigned int ON_SubDEdgeChainCurve::EdgeCount  |  ( |   | ) |   const
default is ok ///< class ON_CurveTree* CreateCurveTree() const override;
ON_SubDEdgeChainCurve additions
◆ EdgeIndexFromParameter()
 unsigned ON_SubDEdgeChainCurve::EdgeIndexFromParameter  |  ( |  double  |  t,
|  double *  |  normalized_edge_parameter
) |   |  const
◆ EdgePtr()
 const ON_SubDEdgePtr ON_SubDEdgeChainCurve::EdgePtr  |  ( |  unsigned int  |  i | ) |   const
◆ EdgePtrFromParameter()
 const ON_SubDEdgePtr ON_SubDEdgeChainCurve::EdgePtrFromParameter  |  ( |  double  |  t,
|  double *  |  normalized_edge_parameter
) |   |  const
◆ EdgeSurfaceCurve()
 ON_NurbsCurve* ON_SubDEdgeChainCurve::EdgeSurfaceCurve  |  ( |  ON_NurbsCurve *  |  destination | ) |   const
◆ Evaluate()
 bool ON_SubDEdgeChainCurve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
overridevirtual
Description: This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. Parameters: t - [in] evaluation parameter ( usually in Domain() ). der_count - [in] (>=0) number of derivatives to evaluate v_stride - [in] (>=Dimension()) stride to use for the v[] array v - [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is returned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is returned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc. side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev1Der ON_Curve::Ev2Der
Implements ON_Curve.
◆ Extend()
 bool ON_SubDEdgeChainCurve::Extend  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain.
 Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented from ON_Curve.
◆ GetBBox()
 bool ON_SubDEdgeChainCurve::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
Description: This is the virtual function that actually calculates axis aligned bounding boxes. Parameters: boxmin - [in/out] array of Dimension() doubles boxmax - [in/out] array of Dimension() doubles bGrowBox - [in] (default=false) If true, then the union of the input bbox and the object's bounding box is returned in bbox.
 If false, the object's bounding box is returned in bbox. Returns: true if object has bounding box and calculation was successful
Reimplemented from ON_Geometry.
◆ GetClosestPoint()
 bool ON_SubDEdgeChainCurve::GetClosestPoint  |  ( |  const ON_3dPoint &  |  test_point,
|  double *  |  t,
|  double  |  maximum_distance = 0.0,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
overridevirtual
Find parameter of the point on a curve that is closest to test_point. If the maximum_distance parameter is > 0, then only points whose distance to the given point is <= maximum_distance will be returned. Using a positive value of maximum_distance can substantially speed up the search. If the sub_domain parameter is not nullptr, then the search is restricted to the specified portion of the curve.
true if returned if the search is successful. false is returned if the search fails.
Parameters
t | parameter of local closest point returned here
maximum_distance | maximum_distance
sub_domain | sub_domain
Reimplemented from ON_Curve.
◆ GetCurveParameterFromNurbFormParameter()
 bool ON_SubDEdgeChainCurve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
overridevirtual
Description: Convert a NURBS curve parameter to a curve parameter
Parameters: nurbs_t - [in] nurbs form parameter curve_t - [out] curve parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetNurbFormParameterFromCurveParameter
Reimplemented from ON_Curve.
◆ GetLength()
 bool ON_SubDEdgeChainCurve::GetLength  |  ( |  double *  |  length,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
overridevirtual
Description: Get the length of the curve. Parameters: length - [out] length returned here. fractional_tolerance - [in] desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve (must be non-decreasing) Returns: true if returned if the length calculation is successful. false is returned if the length is not calculated. Remarks: The arc length will be computed so that (returned length - real length)/(real length) <= fractional_tolerance More simply, if you want N significant figures in the answer, set the fractional_tolerance to 1.0e-N. For "nice" curves, 1.0e-8 works fine. For very high degree NURBS and NURBS with bad parameterizations, use larger values of fractional_tolerance.
Reimplemented from ON_Curve.
◆ GetLocalClosestPoint()
 bool ON_SubDEdgeChainCurve::GetLocalClosestPoint  |  ( |  const ON_3dPoint &  |  test_point,
|  double  |  seed_parameter,
|  double *  |  t,
|  const ON_Interval *  |  sub_domain = 0
) |   |  const
overridevirtual
Find parameter of the point on a curve that is locally closest to the test_point. The search for a local close point starts at seed_parameter. If the sub_domain parameter is not nullptr, then the search is restricted to the specified portion of the curve.
true if returned if the search is successful. false is returned if the search fails.
Reimplemented from ON_Curve.
◆ GetNextDiscontinuity()
 bool ON_SubDEdgeChainCurve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Search for a derivative, tangent, or curvature discontinuity. Parameters: c - [in] type of continity to test for. t0 - [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities. t1 - [in] (t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity type and t1 is at the start or end of the curve. t - [out] if a discontinuity is found, then *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means the curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. If 'c', the type of continuity to test for is ON::continuity::Gsmooth_continuous and the curvature changes from curved to 0 or 0 to curved and there is no tangency kink dtype is returns 3 cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
Reimplemented from ON_Curve.
◆ GetNormalizedArcLengthPoint()
 bool ON_SubDEdgeChainCurve::GetNormalizedArcLengthPoint  |  ( |  double  |  s,
|  double *  |  t,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
overridevirtual
Description: Get the parameter of the point on the curve that is a prescribed arc length from the start of the curve. Parameters: s - [in] normalized arc length parameter. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve. t - [out] parameter such that the length of the curve from its start to t is arc_length. fractional_tolerance - [in] desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve. Returns: true if successful
Reimplemented from ON_Curve.
◆ GetNormalizedArcLengthPoints()
 bool ON_SubDEdgeChainCurve::GetNormalizedArcLengthPoints  |  ( |  int  |  count,
|  const double *  |  s,
|  double *  |  t,
|  double  |  absolute_tolerance = 0.0,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
overridevirtual
Description: Get the parameter of the point on the curve that is a prescribed arc length from the start of the curve. Parameters: count - [in] number of parameters in s. s - [in] array of normalized arc length parameters. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve. t - [out] array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length. absolute_tolerance - [in] if absolute_tolerance > 0, then the difference between (s[i+1]-s[i])*curve_length and the length of the curve segment from t[i] to t[i+1] will be <= absolute_tolerance. fractional_tolerance - [in] desired fractional precision for each segment. fabs("true" length - actual length)/(actual length) <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve. A 0.0 s value corresponds to sub_domain->Min() and a 1.0 s value corresponds to sub_domain->Max(). Returns: true if successful
Reimplemented from ON_Curve.
◆ GetNurbForm()
 int ON_SubDEdgeChainCurve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
overridevirtual
Description: Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transcendental parameterization like circles Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use. See Also: ON_Curve::NurbsCurve
Reimplemented from ON_Curve.
◆ GetParameterTolerance()
 bool ON_SubDEdgeChainCurve::GetParameterTolerance  |  ( |  double  |  t,
|  double *  |  tminus,
|  double *  |  tplus
) |   |  const
overridevirtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Parameters
t | returns tminus < tplus: parameters tminus <= s <= tplus [IN] t = parameter in domain
[out] | tminus | [OUT] tminus
[out] | tplus | [OUT] tplus
Reimplemented from ON_Curve.
◆ GetSpanVector()
 bool ON_SubDEdgeChainCurve::GetSpanVector  |  ( |  double *  |  span_parameters | ) |   const
overridevirtual
Description: Get number of parameters of "knots". Parameters: span_parameters - [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity). Returns: true if successful
Implements ON_Curve.
◆ GetSpanVectorIndex()
 bool ON_SubDEdgeChainCurve::GetSpanVectorIndex  |  ( |  double  |  t,
|  int  |  side,
|  int *  |  span_vector_index,
|  ON_Interval *  |  span_domain
) |   |  const
overridevirtual
If t is in the domain of the curve, GetSpanVectorIndex() returns the span vector index "i" such that span_vector[i] <= t <= span_vector[i+1]. The "side" parameter determines which span is selected when t is at the end of a span.
Parameters
[in] | t | [IN] t = evaluation parameter
[in] | side | [IN] side 0 = default, -1 = from below, +1 = from above
[out] | span_vector_index | [OUT] span vector index
[out] | span_domain | [OUT] domain of the span containing "t"
Reimplemented from ON_Curve.
◆ GetTightBoundingBox()
 bool ON_SubDEdgeChainCurve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Curve.
◆ HasNurbForm()
 int ON_SubDEdgeChainCurve::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: Does a NURBS curve representation of this curve. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct.
 However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transcendental parameterization like circles Remarks: This is a low-level virtual function.
 See Also: ON_Curve::GetNurbForm ON_Curve::NurbsCurve
Reimplemented from ON_Curve.
◆ IntersectSelf()
 int ON_SubDEdgeChainCurve::IntersectSelf  |  ( |  ON_SimpleArray< ON_X_EVENT > &  |  x,
|  double  |  intersection_tolerance = 0.0,
|  const ON_Interval *  |  curve_domain = 0
) |   |  const
overridevirtual
Description: Find curve's self intersection points. Parameters: x - [out] Intersection events are appended to this array. Only intersection points are reported. Overlaps are not reported. intersection_tolerance - [in] curve_domain - [in] optional restriction Returns: Number of intersection events appended to x. Remarks: Overlaps were are not reported. Overlaps are now reported as of Rhino 8.0
Reimplemented from ON_Curve.
◆ IsArc()
 bool ON_SubDEdgeChainCurve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if the locus if its points is an arc or circle. Parameters: plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking Returns: ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Reimplemented from ON_Curve.
◆ IsClosed()
 bool ON_SubDEdgeChainCurve::IsClosed  |  ( |   | ) |   const
overridevirtual
Description: Test a curve to see if it is closed. Returns: true if the curve is closed.
Reimplemented from ON_Curve.
◆ IsContinuous()
 bool ON_SubDEdgeChainCurve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Test continuity at a curve parameter value. Parameters: c - [in] type of continuity to test for. Read ON::continuity comments for details. t - [in] parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the curve is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous.
 ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the curve has at least the c type continuity at the parameter t.
Reimplemented from ON_Curve.
◆ IsDeformable()
 bool ON_SubDEdgeChainCurve::IsDeformable  |  ( |   | ) |   const
overridevirtual
Returns: True if object can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling. See Also: ON_Geometry::MakeDeformable();
Reimplemented from ON_Geometry.
◆ IsEllipse()
 bool ON_SubDEdgeChainCurve::IsEllipse  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Ellipse *  |  ellipse = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Reimplemented from ON_Curve.
◆ IsInPlane()
 bool ON_SubDEdgeChainCurve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it lies in a specific plane. Parameters: test_plane - [in] tolerance - [in] tolerance to use when checking Returns: true if the maximum distance from the curve to the test_plane is <= tolerance.
Implements ON_Curve.
◆ IsLinear()
 bool ON_SubDEdgeChainCurve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
overridevirtual
Description: Test a curve to see if the locus if its points is a line segment. Parameters: tolerance - [in] ///< tolerance to use when checking linearity Returns: true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Reimplemented from ON_Curve.
◆ IsMorphable()
 bool ON_SubDEdgeChainCurve::IsMorphable  |  ( |   | ) |   const
overridevirtual
Returns: True if the object can be morphed by calling Morph(). See Also: ON_Geometry::Morph
Reimplemented from ON_Geometry.
◆ IsPeriodic()
 bool ON_SubDEdgeChainCurve::IsPeriodic  |  ( |   | ) |   const
overridevirtual
Description: Test a curve to see if it is periodic. Returns: true if the curve is closed and at least C2 at the start/end.
Reimplemented from ON_Curve.
◆ IsPlanar()
 bool ON_SubDEdgeChainCurve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a curve to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checkin Note: If the curve is a simple planar closed curve the plane orientation agrees with the curve orientation. Returns: true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Reimplemented from ON_Curve.
◆ IsPolyline()
 int ON_SubDEdgeChainCurve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
overridevirtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: @untitled table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented from ON_Curve.
◆ IsShort()
 bool ON_SubDEdgeChainCurve::IsShort  |  ( |  double  |  tolerance,
|  const ON_Interval *  |  sub_domain = 0,
|  double *  |  length_estimate = 0
) |   |  const
overridevirtual
Description: Used to quickly find short curves. Parameters: tolerance - [in] (>=0) sub_domain - [in] If not nullptr, the test is performed on the interval that is the intersection of sub_domain with Domain(). Returns: True if the length of the curve is <= tolerance. Remarks: Faster than calling Length() and testing the result.
Reimplemented from ON_Curve.
◆ IsValid()
 bool ON_SubDEdgeChainCurve::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
ON_Object virtual interface.
Reimplemented from ON_Geometry.
◆ LoftCurve()
 ON_NurbsCurve* ON_SubDEdgeChainCurve::LoftCurve  |  ( |  ON_NurbsCurve *  |  destination | ) |   const
Description: Get a NURBS curve that is appropriate for lofting SubDs. Parameters: destination - [in] If not nullptr, then the curve is created in this instance. Returns: A pointer to the curve or nullptr if the edge is not valid.
◆ Morph()
 bool ON_SubDEdgeChainCurve::Morph  |  ( |  const class ON_SpaceMorph &  |  morph | )
overridevirtual
Description: Apply the space morph to this geometry. Parameters: morph - [in] Returns: True is successful. If false is returned, the object may be damaged and should be discarded. See Also: ON_Geometry::IsMorphable
Reimplemented from ON_Geometry.
◆ operator=()
 ON_SubDEdgeChainCurve& ON_SubDEdgeChainCurve::operator=  |  ( |  const ON_SubDEdgeChainCurve &  |   | )
default
◆ PersistentSubDId()
 const ON_UUID ON_SubDEdgeChainCurve::PersistentSubDId  |  ( |   | ) |   const
◆ Read()
 bool ON_SubDEdgeChainCurve::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ RemoveShortSegments()
 bool ON_SubDEdgeChainCurve::RemoveShortSegments  |  ( |  double  |  tolerance,
|  bool  |  bRemoveShortSegments = true
)
overridevirtual
Description: Looks for segments that are shorter than tolerance that can be removed. If bRemoveShortSegments is true, then the short segments are removed. Does not change the domain, but it will change the relative parameterization. Parameters: tolerance - [in] bRemoveShortSegments - [in] If true, then short segments are removed. Returns: True if removable short segments can were found. False if no removable short segments can were found.
Reimplemented from ON_Curve.
◆ Reverse()
 bool ON_SubDEdgeChainCurve::Reverse  |  ( |   | )
overridevirtual
Description: Reverse the direction of the curve. Returns: true if curve was reversed. Remarks: If reversed, the domain changes from [a,b] to [-b,-a]
Implements ON_Curve.
◆ SetDomain()
 bool ON_SubDEdgeChainCurve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
overridevirtual
Description: Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented from ON_Curve.
◆ SetEdgeChain() [1/3]
 unsigned int ON_SubDEdgeChainCurve::SetEdgeChain  |  ( |  const ON_SubDEdgeChain &  |  edge_chain | )
◆ SetEdgeChain() [2/3]
 unsigned int ON_SubDEdgeChainCurve::SetEdgeChain  |  ( |  ON_UUID  |  persistent_subd_id,
|  const ON_SubD &  |  subd,
|  const ON_SimpleArray< ON_SubDEdgePtr > &  |  edge_chain
)
Parameters: persistent_subd_id - [in] If this edge chain needs to persist in a 3dm archive, then persistent_subd_id should identify the subd in its current context. If that context is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If that context is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
◆ SetEdgeChain() [3/3]
 unsigned int ON_SubDEdgeChainCurve::SetEdgeChain  |  ( |  ON_UUID  |  persistent_subd_id,
|  const ON_SubDRef  |  subd_ref,
|  const ON_SimpleArray< ON_SubDEdgePtr > &  |  edge_chain
)
Parameters: persistent_subd_id - [in] If this edge chain needs to persist in a 3dm archive, then persistent_subd_id should identify the subd in its current context. If that context is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If that context is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
◆ SetEndPoint()
 bool ON_SubDEdgeChainCurve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetEndPoint() returns true if end_point is the same as the end of the curve, false otherwise. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SetStartPoint()
 bool ON_SubDEdgeChainCurve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetStartPoint() returns true if start_point is the same as the start of the curve, false otherwise. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_Curve.
◆ SizeOf()
 unsigned int ON_SubDEdgeChainCurve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Curve.
◆ SpanCount()
 int ON_SubDEdgeChainCurve::SpanCount  |  ( |   | ) |   const
overridevirtual
Description: Get number of nonempty smooth (c-infinity) spans in curve Returns: Number of nonempty smooth (c-infinity) spans.
Implements ON_Curve.
◆ Split()
 bool ON_SubDEdgeChainCurve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
overridevirtual
Description: Splits (divides) the curve at the specified parameter.
 The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as left_side or right_side. Parameters: t - [in] parameter to split the curve at in the interval returned by Domain(). left_side - [out] left portion of curve returned here right_side - [out] right portion of curve returned here Returns: true - The curve was split into two pieces.
 false - The curve could not be split. For example if the parameter is too close to an endpoint.
Example: For example, if crv were an ON_NurbsCurve, then
  ON_NurbsCurve right_side;
  crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Reimplemented from ON_Curve.
◆ SubD()
 const ON_SubD& ON_SubDEdgeChainCurve::SubD  |  ( |   | ) |   const
◆ SubDRef()
 ON_SubDRef ON_SubDEdgeChainCurve::SubDRef  |  ( |   | ) |   const
◆ Transform()
 bool ON_SubDEdgeChainCurve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). Parameters: xform - [in] transformation to apply to object. Remarks: Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Curve.
◆ Trim()
 bool ON_SubDEdgeChainCurve::Trim  |  ( |  const ON_Interval &  |  domain | )
overridevirtual
Description: Removes portions of the curve outside the specified interval. Parameters: domain - [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed. Returns: true if successful.
Reimplemented from ON_Curve.
◆ Write()
 bool ON_SubDEdgeChainCurve::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.