Public Member Functions | Static Public Member Functions | List of all members
CRhRdkModalizer Class Referencefinal
RDK
#include <RhRdkModalizer.h>
 Public Member Functions
CRhRdkModalizer ()
~CRhRdkModalizer ()
 Static Public Member Functions
static bool  | IsActive (void)
Detailed Description
Embed one of these in any modal dialog that your renderer creates. This will ensure that RDK disables and enables any windows that could interfere with the dialog.
Constructor & Destructor Documentation
◆ CRhRdkModalizer()
 CRhRdkModalizer::CRhRdkModalizer  |  ( |   | )
◆ ~CRhRdkModalizer()
 CRhRdkModalizer::~CRhRdkModalizer  |  ( |   | )
Member Function Documentation
◆ IsActive()
 static bool CRhRdkModalizer::IsActive  |  ( |  void  |   | )
static
Returns
true if a modalizer is active.