Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_2dVector Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Public Member Functions
ON_2dVector ()=default
x,y not initialized More...
ON_2dVector (const double *)
from double[2] array More...
ON_2dVector (const float *)
from double[2] array More...
ON_2dVector (const ON_2dPoint &)
from 2d point More...
ON_2dVector (const ON_2dVector &)=default
ON_2dVector (const ON_2fPoint &)
from 2f point More...
ON_2dVector (const ON_2fVector &)
from 2f vector More...
ON_2dVector (const ON_3dPoint &)
from 3d point More...
ON_2dVector (const ON_3dVector &)
from 3d vector More...
ON_2dVector (const ON_3fPoint &)
from 3f point More...
ON_2dVector (const ON_3fVector &)
from 3f vector More...
ON_2dVector (double x, double y)
~ON_2dVector ()=default
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | Decompose (const ON_2dVector &, const ON_2dVector &, double *, double *) const
bool  | IsNan () const
bool  | IsNotZero () const
int  | IsParallelTo (const ON_2dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsPerpendicularTo (const ON_2dVector &other, double angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE) const
bool  | IsTiny (double tiny_tol=ON_ZERO_TOLERANCE) const
bool  | IsUnitVector () const
bool  | IsUnset () const
bool  | IsUnsetOrNan () const
bool  | IsValid () const
bool  | IsZero () const
double  | Length () const
double  | LengthSquared () const
double  | MaximumCoordinate () const
absolute value of maximum coordinate More...
int  | MaximumCoordinateIndex () const
double  | MinimumCoordinate () const
absolute value of minimum coordinate More...
int  | MinimumCoordinateIndex () const
operator const double * () const
operator double * ()
(double*) conversion operators More...
bool  | operator!= (const ON_2dVector &) const
double  | operator* (const ON_2dPoint &) const
inner (dot) product (point acting as vector) More...
double  | operator* (const ON_2dVector &) const
DO NOT ADD ANY MORE overrides of += or -=. More...
double  | operator* (const ON_2fVector &) const
inner (dot) product More...
ON_2dVector  | operator* (const ON_Xform &) const
ON_2dVector  | operator* (double) const
ON_2dVector  | operator* (float) const
ON_2dVector  | operator* (int) const
ON_2dVector &  | operator*= (double)
ON_2dPoint  | operator+ (const ON_2dPoint &) const
ON_2dVector  | operator+ (const ON_2dVector &) const
ON_2dPoint  | operator+ (const ON_2fPoint &) const
ON_2dVector  | operator+ (const ON_2fVector &) const
ON_3dPoint  | operator+ (const ON_3dPoint &) const
ON_3dVector  | operator+ (const ON_3dVector &) const
ON_3dPoint  | operator+ (const ON_3fPoint &) const
ON_3dVector  | operator+ (const ON_3fVector &) const
ON_2dVector &  | operator+= (const ON_2dVector &)
ON_2dVector  | operator- () const
ON_2dPoint  | operator- (const ON_2dPoint &) const
ON_2dVector  | operator- (const ON_2dVector &) const
ON_2dPoint  | operator- (const ON_2fPoint &) const
ON_2dVector  | operator- (const ON_2fVector &) const
ON_3dPoint  | operator- (const ON_3dPoint &) const
ON_3dVector  | operator- (const ON_3dVector &) const
ON_3dPoint  | operator- (const ON_3fPoint &) const
ON_3dVector  | operator- (const ON_3fVector &) const
ON_2dVector &  | operator-= (const ON_2dVector &)
ON_2dVector  | operator/ (double) const
ON_2dVector  | operator/ (float) const
ON_2dVector  | operator/ (int) const
ON_2dVector &  | operator/= (double)
bool  | operator< (const ON_2dVector &) const
bool  | operator<= (const ON_2dVector &) const
dictionary order comparisons More...
ON_2dVector &  | operator= (const double *)
vector = double[2] support More...
ON_2dVector &  | operator= (const float *)
vector = float[2] support More...
ON_2dVector &  | operator= (const ON_2dPoint &)
ON_2dVector &  | operator= (const ON_2dVector &)=default
ON_2dVector &  | operator= (const ON_2fPoint &)
ON_2dVector &  | operator= (const ON_2fVector &)
ON_2dVector &  | operator= (const ON_3dPoint &)
ON_2dVector &  | operator= (const ON_3dVector &)
use implicit operator=(const ON_2dVector&) More...
ON_2dVector &  | operator= (const ON_3fPoint &)
ON_2dVector &  | operator= (const ON_3fVector &)
bool  | operator== (const ON_2dVector &) const
bool  | operator> (const ON_2dVector &) const
bool  | operator>= (const ON_2dVector &) const
double &  | operator[] (int)
index operators mimic double[2] behavior More...
double  | operator[] (int) const
double &  | operator[] (unsigned int)
double  | operator[] (unsigned int) const
bool  | PerpendicularTo (const ON_2dPoint &, const ON_2dPoint &)
set this vector to be perpendicular to a line defined by 2 points More...
bool  | PerpendicularTo (const ON_2dVector &)
set this vector to be perpendicular to another vector More...
void  | Reverse ()
negate all coordinates More...
void  | Rotate (double angle)
void  | Rotate (double sin_angle, double cos_angle)
void  | Set (double x, double y)
set 2d vector value More...
void  | Transform (const ON_Xform &)
bool  | Unitize ()
returns false if vector has zero length More...
ON_2dVector  | UnitVector () const
double  | WedgeProduct (const ON_2dVector &B) const
void  | Zero ()
set all coordinates to zero; More...
 Static Public Member Functions
static int  | Compare (const ON_2dVector &lhs, const ON_2dVector &rhs)
static double  | SignedAngle (const ON_2dVector &A, const ON_2dVector &B)
static const ON_2dVector &  | UnitVector (int)
 Public Attributes
double  | x
double  | y
 Static Public Attributes
static const ON_2dVector  | NanVector
(ON_DBL_QNAN,ON_DBL_QNAN) More...
static const ON_2dVector  | UnsetVector
(ON_UNSET_VALUE,ON_UNSET_VALUE) More...
static const ON_2dVector  | XAxis
(1.0,0.0) More...
static const ON_2dVector  | YAxis
(0.0,1.0) More...
static const ON_2dVector  | ZeroVector
(0.0,0.0) More...
Detailed Description
ON_2dVector
Constructor & Destructor Documentation
◆ ON_2dVector() [1/12]
 ON_2dVector::ON_2dVector  |  ( |   | )
default
x,y not initialized
◆ ~ON_2dVector()
 ON_2dVector::~ON_2dVector  |  ( |   | )
default
◆ ON_2dVector() [2/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_2dVector &  |   | )
default
◆ ON_2dVector() [3/12]
 ON_2dVector::ON_2dVector  |  ( |  double  |  x,
|  double  |  y
)
explicit
◆ ON_2dVector() [4/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_3dVector &  |   | )
explicit
from 3d vector
◆ ON_2dVector() [5/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_2dPoint &  |   | )
from 2d point
◆ ON_2dVector() [6/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_3dPoint &  |   | )
explicit
from 3d point
◆ ON_2dVector() [7/12]
 ON_2dVector::ON_2dVector  |  ( |  const double *  |   | )
explicit
from double[2] array
◆ ON_2dVector() [8/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_2fVector &  |   | )
from 2f vector
◆ ON_2dVector() [9/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_3fVector &  |   | )
explicit
from 3f vector
◆ ON_2dVector() [10/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_2fPoint &  |   | )
explicit
from 2f point
◆ ON_2dVector() [11/12]
 ON_2dVector::ON_2dVector  |  ( |  const ON_3fPoint &  |   | )
explicit
from 3f point
◆ ON_2dVector() [12/12]
 ON_2dVector::ON_2dVector  |  ( |  const float *  |   | )
explicit
from double[2] array
Member Function Documentation
◆ Compare()
 static int ON_2dVector::Compare  |  ( |  const ON_2dVector &  |  lhs,
|  const ON_2dVector &  |  rhs
)
static
Description: A well ordered dictionary compare function that is nan aware and can be used for robust sorting.
◆ DataCRC()
 ON__UINT32 ON_2dVector::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
◆ Decompose()
 bool ON_2dVector::Decompose  |  ( |  const ON_2dVector &  |  ,
|  const ON_2dVector &  |  ,
|  double *  |  ,
|  double *
) |   |  const
◆ IsNan()
 bool ON_2dVector::IsNan  |  ( |   | ) |   const
Returns: True if any coordinate is a nan.
◆ IsNotZero()
 bool ON_2dVector::IsNotZero  |  ( |   | ) |   const
Returns: true if at lease one coordinate is not zero and no coordinates are unset or nans.
◆ IsParallelTo()
 int ON_2dVector::IsParallelTo  |  ( |  const ON_2dVector &  |  other,
|  double  |  angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE
) |   |  const
Parameters
other | returns 1: this and other vectors are parallel -1: this and other vectors are anti-parallel 0: this and other vectors are not parallel or at least one of the vectors is zero other vector
angle_tolerance | optional angle tolerance (radians)
◆ IsPerpendicularTo()
 bool ON_2dVector::IsPerpendicularTo  |  ( |  const ON_2dVector &  |  other,
|  double  |  angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE
) |   |  const
Parameters
other | returns true: this and other vectors are perpendicular false: this and other vectors are not perpendicular or at least one of the vectors is zero other vector
angle_tolerance | optional angle tolerance (radians)
◆ IsTiny()
 bool ON_2dVector::IsTiny  |  ( |  double  |  tiny_tol = ON_ZERO_TOLERANCE | ) |   const
Description: Test a vector to see if it is very short
Parameters: tiny_tol - [in] (default = ON_ZERO_TOLERANCE) a nonzero value used as the coordinate zero tolerance.
Returns: ( fabs(x) <= tiny_tol && fabs(y) <= tiny_tol )
Parameters
tiny_tol | tiny_tol
◆ IsUnitVector()
 bool ON_2dVector::IsUnitVector  |  ( |   | ) |   const
Returns: true if vector is valid and has length 1.
◆ IsUnset()
 bool ON_2dVector::IsUnset  |  ( |   | ) |   const
Returns: True if any coordinate is ON_UNSET_VALUE or ON_UNSET_POSITIVE_VALUE
◆ IsUnsetOrNan()
 bool ON_2dVector::IsUnsetOrNan  |  ( |   | ) |   const
Returns: True if any coordinate is ON_UNSET_VALUE, ON_UNSET_POSITIVE_VALUE, or a nan
◆ IsValid()
 bool ON_2dVector::IsValid  |  ( |   | ) |   const
Returns: False if any coordinate is infinite, a nan, or ON_UNSET_VALUE.
◆ IsZero()
 bool ON_2dVector::IsZero  |  ( |   | ) |   const
Returns: true if vector is the zero vector.
◆ Length()
 double ON_2dVector::Length  |  ( |   | ) |   const
◆ LengthSquared()
 double ON_2dVector::LengthSquared  |  ( |   | ) |   const
◆ MaximumCoordinate()
 double ON_2dVector::MaximumCoordinate  |  ( |   | ) |   const
absolute value of maximum coordinate
◆ MaximumCoordinateIndex()
 int ON_2dVector::MaximumCoordinateIndex  |  ( |   | ) |   const
◆ MinimumCoordinate()
 double ON_2dVector::MinimumCoordinate  |  ( |   | ) |   const
absolute value of minimum coordinate
◆ MinimumCoordinateIndex()
 int ON_2dVector::MinimumCoordinateIndex  |  ( |   | ) |   const
◆ operator const double *()
 ON_2dVector::operator const double *  |  ( |   | ) |   const
◆ operator double *()
 ON_2dVector::operator double *  |  ( |   | )
(double*) conversion operators
◆ operator!=()
 bool ON_2dVector::operator!=  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator*() [1/7]
 double ON_2dVector::operator*  |  ( |  const ON_2dPoint &  |   | ) |   const
inner (dot) product (point acting as vector)
◆ operator*() [2/7]
 double ON_2dVector::operator*  |  ( |  const ON_2dVector &  |   | ) |   const
DO NOT ADD ANY MORE overrides of += or -=.
inner (dot) product
◆ operator*() [3/7]
 double ON_2dVector::operator*  |  ( |  const ON_2fVector &  |   | ) |   const
inner (dot) product
◆ operator*() [4/7]
 ON_2dVector ON_2dVector::operator*  |  ( |  const ON_Xform &  |   | ) |   const
◆ operator*() [5/7]
 ON_2dVector ON_2dVector::operator*  |  ( |  double  |   | ) |   const
◆ operator*() [6/7]
 ON_2dVector ON_2dVector::operator*  |  ( |  float  |   | ) |   const
◆ operator*() [7/7]
 ON_2dVector ON_2dVector::operator*  |  ( |  int  |   | ) |   const
◆ operator*=()
 ON_2dVector& ON_2dVector::operator*=  |  ( |  double  |   | )
◆ operator+() [1/8]
 ON_2dPoint ON_2dVector::operator+  |  ( |  const ON_2dPoint &  |   | ) |   const
◆ operator+() [2/8]
 ON_2dVector ON_2dVector::operator+  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator+() [3/8]
 ON_2dPoint ON_2dVector::operator+  |  ( |  const ON_2fPoint &  |   | ) |   const
◆ operator+() [4/8]
 ON_2dVector ON_2dVector::operator+  |  ( |  const ON_2fVector &  |   | ) |   const
◆ operator+() [5/8]
 ON_3dPoint ON_2dVector::operator+  |  ( |  const ON_3dPoint &  |   | ) |   const
◆ operator+() [6/8]
 ON_3dVector ON_2dVector::operator+  |  ( |  const ON_3dVector &  |   | ) |   const
◆ operator+() [7/8]
 ON_3dPoint ON_2dVector::operator+  |  ( |  const ON_3fPoint &  |   | ) |   const
◆ operator+() [8/8]
 ON_3dVector ON_2dVector::operator+  |  ( |  const ON_3fVector &  |   | ) |   const
◆ operator+=()
 ON_2dVector& ON_2dVector::operator+=  |  ( |  const ON_2dVector &  |   | )
◆ operator-() [1/9]
 ON_2dVector ON_2dVector::operator-  |  ( |   | ) |   const
◆ operator-() [2/9]
 ON_2dPoint ON_2dVector::operator-  |  ( |  const ON_2dPoint &  |   | ) |   const
◆ operator-() [3/9]
 ON_2dVector ON_2dVector::operator-  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator-() [4/9]
 ON_2dPoint ON_2dVector::operator-  |  ( |  const ON_2fPoint &  |   | ) |   const
◆ operator-() [5/9]
 ON_2dVector ON_2dVector::operator-  |  ( |  const ON_2fVector &  |   | ) |   const
◆ operator-() [6/9]
 ON_3dPoint ON_2dVector::operator-  |  ( |  const ON_3dPoint &  |   | ) |   const
◆ operator-() [7/9]
 ON_3dVector ON_2dVector::operator-  |  ( |  const ON_3dVector &  |   | ) |   const
◆ operator-() [8/9]
 ON_3dPoint ON_2dVector::operator-  |  ( |  const ON_3fPoint &  |   | ) |   const
◆ operator-() [9/9]
 ON_3dVector ON_2dVector::operator-  |  ( |  const ON_3fVector &  |   | ) |   const
◆ operator-=()
 ON_2dVector& ON_2dVector::operator-=  |  ( |  const ON_2dVector &  |   | )
◆ operator/() [1/3]
 ON_2dVector ON_2dVector::operator/  |  ( |  double  |   | ) |   const
◆ operator/() [2/3]
 ON_2dVector ON_2dVector::operator/  |  ( |  float  |   | ) |   const
◆ operator/() [3/3]
 ON_2dVector ON_2dVector::operator/  |  ( |  int  |   | ) |   const
◆ operator/=()
 ON_2dVector& ON_2dVector::operator/=  |  ( |  double  |   | )
◆ operator<()
 bool ON_2dVector::operator<  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator<=()
 bool ON_2dVector::operator<=  |  ( |  const ON_2dVector &  |   | ) |   const
dictionary order comparisons
◆ operator=() [1/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const double *  |   | )
vector = double[2] support
◆ operator=() [2/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const float *  |   | )
vector = float[2] support
◆ operator=() [3/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_2dPoint &  |   | )
◆ operator=() [4/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_2dVector &  |   | )
default
◆ operator=() [5/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_2fPoint &  |   | )
◆ operator=() [6/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_2fVector &  |   | )
◆ operator=() [7/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_3dPoint &  |   | )
◆ operator=() [8/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_3dVector &  |   | )
use implicit operator=(const ON_2dVector&)
◆ operator=() [9/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_3fPoint &  |   | )
◆ operator=() [10/10]
 ON_2dVector& ON_2dVector::operator=  |  ( |  const ON_3fVector &  |   | )
◆ operator==()
 bool ON_2dVector::operator==  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator>()
 bool ON_2dVector::operator>  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator>=()
 bool ON_2dVector::operator>=  |  ( |  const ON_2dVector &  |   | ) |   const
◆ operator[]() [1/4]
 double& ON_2dVector::operator[]  |  ( |  int  |   | )
index operators mimic double[2] behavior
◆ operator[]() [2/4]
 double ON_2dVector::operator[]  |  ( |  int  |   | ) |   const
◆ operator[]() [3/4]
 double& ON_2dVector::operator[]  |  ( |  unsigned int  |   | )
◆ operator[]() [4/4]
 double ON_2dVector::operator[]  |  ( |  unsigned int  |   | ) |   const
◆ PerpendicularTo() [1/2]
 bool ON_2dVector::PerpendicularTo  |  ( |  const ON_2dPoint &  |  ,
|  const ON_2dPoint &
)
set this vector to be perpendicular to a line defined by 2 points
◆ PerpendicularTo() [2/2]
 bool ON_2dVector::PerpendicularTo  |  ( |  const ON_2dVector &  |   | )
set this vector to be perpendicular to another vector
◆ Reverse()
 void ON_2dVector::Reverse  |  ( |   | )
negate all coordinates
Deprecated:
Use v = -v;
◆ Rotate() [1/2]
 void ON_2dVector::Rotate  |  ( |  double  |  angle | )
Parameters
angle | angle in radians
◆ Rotate() [2/2]
 void ON_2dVector::Rotate  |  ( |  double  |  sin_angle,
|  double  |  cos_angle
)
Parameters
sin_angle | sin(angle)
cos_angle | cos(angle)
◆ Set()
 void ON_2dVector::Set  |  ( |  double  |  x,
|  double  |  y
)
set 2d vector value
◆ SignedAngle()
 static double ON_2dVector::SignedAngle  |  ( |  const ON_2dVector &  |  A,
|  const ON_2dVector &  |  B
)
static
Signed Angle (in radians) to A from B. A and B must be non-zero vectors. Returns -ON_PI <= angle <= ON_PI Note: The function is anti-symmetric, i.e Angle(A,B) = - Angle(A,B)
◆ Transform()
 void ON_2dVector::Transform  |  ( |  const ON_Xform &  |   | )
These transform the vector in place. The transformation matrix acts on the left of the vector; i.e., result = transformation*vector
◆ Unitize()
 bool ON_2dVector::Unitize  |  ( |   | )
returns false if vector has zero length
◆ UnitVector() [1/2]
 ON_2dVector ON_2dVector::UnitVector  |  ( |   | ) |   const
Returns: If this is a valid non-zero vector, a unit vector parallel to this is returned. Otherwise the zero vector is returned.
◆ UnitVector() [2/2]
 static const ON_2dVector& ON_2dVector::UnitVector  |  ( |  int  |   | )
static
Description: A index driven function to get unit axis vectors. Parameters: index - [in] 0 returns (1,0), 1 returns (0,1) Returns: Unit 2d vector with vector[i] = (i==index)?1:0;
◆ WedgeProduct()
 double ON_2dVector::WedgeProduct  |  ( |  const ON_2dVector &  |  B | ) |   const
Signed area of the parallelogram. The volume element. returns x*B.y - y*B.x
◆ Zero()
 void ON_2dVector::Zero  |  ( |   | )
set all coordinates to zero;
Deprecated:
Use v = ON_2dVector::ZeroVector;
Member Data Documentation
◆ NanVector
 const ON_2dVector ON_2dVector::NanVector
static
(ON_DBL_QNAN,ON_DBL_QNAN)
◆ UnsetVector
 const ON_2dVector ON_2dVector::UnsetVector
static
(ON_UNSET_VALUE,ON_UNSET_VALUE)
◆ x
 double ON_2dVector::x
◆ XAxis
 const ON_2dVector ON_2dVector::XAxis
static
(1.0,0.0)
◆ y
 double ON_2dVector::y
◆ YAxis
 const ON_2dVector ON_2dVector::YAxis
static
(0.0,1.0)
◆ ZeroVector
 const ON_2dVector ON_2dVector::ZeroVector
static
(0.0,0.0)