Public Types | Public Member Functions | Static Public Attributes | List of all members
ON_SubDFromSurfaceParameters Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Types
enum  | Methods : unsigned char { Methods::Unset = 0, Methods::SubDFriendlyFit = 1, Methods::FromNurbsControlNet = 2 }
ON_SubDFromSurfaceParameters::Method are ways to create a SubD from a surface. More...
 Public Member Functions
ON_SubDFromSurfaceParameters ()=default
Default construction is identical to ON_SubDFromMeshParameters::Smooth. More...
ON_SubDFromSurfaceParameters (const ON_SubDFromSurfaceParameters &)=default
~ON_SubDFromSurfaceParameters ()=default
bool  | Corners () const
ON_SubDFromSurfaceParameters::Methods  | Method () const
ON_SubDFromSurfaceParameters &  | operator= (const ON_SubDFromSurfaceParameters &)=default
void  | SetCorners (bool bCorners)
void  | SetMethod (ON_SubDFromSurfaceParameters::Methods method)
 Static Public Attributes
static const ON_SubDFromSurfaceParameters  | ControlNet
static const ON_SubDFromSurfaceParameters  | ControlNetWithCorners
static const ON_SubDFromSurfaceParameters  | Default
static const ON_SubDFromSurfaceParameters  | DefaultWithCorners
Detailed Description
ON_SubDFromMeshParameters
Member Enumeration Documentation
◆ Methods
 enum ON_SubDFromSurfaceParameters::Methods : unsigned char
strong
ON_SubDFromSurfaceParameters::Method are ways to create a SubD from a surface.
Enumerator
Unset
Used to indicate the method is not set.
SubDFriendlyFit
The surface is approximated with a SubD friendly NURBS surface and the SubD is created to match the subd friendly nurbs surface. If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.
FromNurbsControlNet
The surface is converted to a NURBS surface and then a subd with one face per NURBS bispan is created by using an appropriate subset of the NURBS surface control net. If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.
Constructor & Destructor Documentation
◆ ON_SubDFromSurfaceParameters() [1/2]
 ON_SubDFromSurfaceParameters::ON_SubDFromSurfaceParameters  |  ( |   | )
default
Default construction is identical to ON_SubDFromMeshParameters::Smooth.
◆ ~ON_SubDFromSurfaceParameters()
 ON_SubDFromSurfaceParameters::~ON_SubDFromSurfaceParameters  |  ( |   | )
default
◆ ON_SubDFromSurfaceParameters() [2/2]
 ON_SubDFromSurfaceParameters::ON_SubDFromSurfaceParameters  |  ( |  const ON_SubDFromSurfaceParameters &  |   | )
default
Member Function Documentation
◆ Corners()
 bool ON_SubDFromSurfaceParameters::Corners  |  ( |   | ) |   const
◆ Method()
 ON_SubDFromSurfaceParameters::Methods ON_SubDFromSurfaceParameters::Method  |  ( |   | ) |   const
◆ operator=()
 ON_SubDFromSurfaceParameters& ON_SubDFromSurfaceParameters::operator=  |  ( |  const ON_SubDFromSurfaceParameters &  |   | )
default
◆ SetCorners()
 void ON_SubDFromSurfaceParameters::SetCorners  |  ( |  bool  |  bCorners | )
◆ SetMethod()
 void ON_SubDFromSurfaceParameters::SetMethod  |  ( |  ON_SubDFromSurfaceParameters::Methods  |  method | )
Member Data Documentation
◆ ControlNet
 const ON_SubDFromSurfaceParameters ON_SubDFromSurfaceParameters::ControlNet
static
◆ ControlNetWithCorners
 const ON_SubDFromSurfaceParameters ON_SubDFromSurfaceParameters::ControlNetWithCorners
static
◆ Default
 const ON_SubDFromSurfaceParameters ON_SubDFromSurfaceParameters::Default
static
◆ DefaultWithCorners
 const ON_SubDFromSurfaceParameters ON_SubDFromSurfaceParameters::DefaultWithCorners
static