Public Types | Public Member Functions | List of all members
CRhRdkEventSinkBase Class Reference
RDK
#include <RhRdkEventSink.h>
 Inheritance diagram for CRhRdkEventSinkBase:
 Public Types
enum  | {
 rendering = 0x0001, safe_frame = 0x0002, document_sun = 0x0004, post_effects = 0x0008,
 ground_plane = 0x0010, content_filter = 0x0020, custom_render_mesh = 0x0040, unspecified = 0x8000,
 all = 0xFFFF, force32bit_flags1 = 0xFFFFFFFF
 }
enum  | rendering_info {
 save_support_files = 1, dithering = 2, gamma = 3, use_linear_workflow = 4,
 tone_mapping = 5, tone_mapper_params = 6, reflective_refractive_environment = 7, force32bit_flags2 = 0xFFFFFFFF
 }
 Public Member Functions
CRhRdkEventSinkBase ()
virtual  | ~CRhRdkEventSinkBase ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual void  | OnAddRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnAllFactoriesAdded (void)
virtual void  | OnCacheImageChanged (void)
virtual void  | OnClientPlugInUnloading (const UUID &)
virtual void  | OnContentAdded (const CRhRdkContent *)
virtual void  | OnContentChanged (const CRhRdkContent *, RhRdkChangeContext)
virtual void  | OnContentCurrencyChanged (const wchar_t *, const CRhRdkContent *)
virtual void  | OnContentDeleted (void)
virtual void  | OnContentDeleting (const CRhRdkContent *)
virtual void  | OnContentEditorActivated (const IRhRdkContentEditor &)
virtual void  | OnContentEditorExtended (bool)
virtual void  | OnContentFilterChanged (const CRhRdkUuidCollection &)
virtual void  | OnContentListCleared (const IRhRdkContentList &)
virtual void  | OnContentListClearing (const IRhRdkContentList &)
virtual void  | OnContentListLoaded (const IRhRdkContentList &)
virtual void  | OnContentMoved (const CRhRdkContent *, const CRhRdkContent *, const IRhRdkContentEditor *)
virtual void  | OnContentRenamed (const CRhRdkContent *)
virtual void  | OnContentReplaced (CRhRdkContent *)
virtual void  | OnContentReplacing (const CRhRdkContent *)
virtual void  | OnContentSelected (const CRhRdkContent *, const IRhRdkContentEditor &)
virtual void  | OnContentUpdateMarkers (const CRhRdkContent *)
virtual void  | OnContentUpdatePreview (const CRhRdkContent *)
virtual void  | OnCustomEvent (const UUID &, void *)
virtual void  | OnCustomRenderMeshesChanged (void)
virtual void  | OnDeleteRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnDocumentSettingsChanged (UINT, UINT_PTR)
virtual void  | OnFactoryAdded (const IRhRdkContentFactory &)
virtual void  | OnFactoryDeleted (const wchar_t *)
virtual void  | OnFactoryDeleting (const IRhRdkContentFactory &)
virtual void  | OnGlobalSettingsChanged (void)
virtual void  | OnLazyTimer (void)
virtual void  | OnModifyObjectTextureMapping (CRhinoDoc &, const CRhinoObject &)
virtual void  | OnNewRdkDocument (void)
virtual void  | OnRenderEngineStateChanged (bool)
virtual void  | OnRendererChanged (void)
virtual void  | OnReplaceRhinoObject (CRhinoDoc &, CRhinoObject &, CRhinoObject &)
virtual void  | OnSelectionChanged (CRhinoDoc &)
virtual void  | OnUpdateAllPreviews (void)
virtual void  | TextureMappingTableEvent (const ON_TextureMapping &)
Detailed Description
Deprecated:
OBSOLETE -
See also
CRhRdkEventWatcher
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
rendering
safe_frame
document_sun
post_effects
ground_plane
content_filter
custom_render_mesh
unspecified
all
force32bit_flags1
◆ rendering_info
 enum CRhRdkEventSinkBase::rendering_info
Enumerator
save_support_files
dithering
gamma
use_linear_workflow
tone_mapping
tone_mapper_params
reflective_refractive_environment
force32bit_flags2
Constructor & Destructor Documentation
◆ CRhRdkEventSinkBase()
 CRhRdkEventSinkBase::CRhRdkEventSinkBase  |  ( |   | )
◆ ~CRhRdkEventSinkBase()
 virtual CRhRdkEventSinkBase::~CRhRdkEventSinkBase  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkEventSinkBase::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
◆ OnAddRhinoObject()
 virtual void CRhRdkEventSinkBase::OnAddRhinoObject  |  ( |  CRhinoDoc &  |  ,
|  CRhinoObject &
)
inlinevirtual
◆ OnAllFactoriesAdded()
 virtual void CRhRdkEventSinkBase::OnAllFactoriesAdded  |  ( |  void  |   | )
inlinevirtual
◆ OnCacheImageChanged()
 virtual void CRhRdkEventSinkBase::OnCacheImageChanged  |  ( |  void  |   | )
inlinevirtual
◆ OnClientPlugInUnloading()
 virtual void CRhRdkEventSinkBase::OnClientPlugInUnloading  |  ( |  const UUID &  |   | )
inlinevirtual
◆ OnContentAdded()
 virtual void CRhRdkEventSinkBase::OnContentAdded  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentChanged()
 virtual void CRhRdkEventSinkBase::OnContentChanged  |  ( |  const CRhRdkContent *  |  ,
|  RhRdkChangeContext
)
inlinevirtual
◆ OnContentCurrencyChanged()
 virtual void CRhRdkEventSinkBase::OnContentCurrencyChanged  |  ( |  const wchar_t *  |  ,
|  const CRhRdkContent *
)
inlinevirtual
◆ OnContentDeleted()
 virtual void CRhRdkEventSinkBase::OnContentDeleted  |  ( |  void  |   | )
inlinevirtual
◆ OnContentDeleting()
 virtual void CRhRdkEventSinkBase::OnContentDeleting  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentEditorActivated()
 virtual void CRhRdkEventSinkBase::OnContentEditorActivated  |  ( |  const IRhRdkContentEditor &  |   | )
inlinevirtual
◆ OnContentEditorExtended()
 virtual void CRhRdkEventSinkBase::OnContentEditorExtended  |  ( |  bool  |   | )
inlinevirtual
◆ OnContentFilterChanged()
 virtual void CRhRdkEventSinkBase::OnContentFilterChanged  |  ( |  const CRhRdkUuidCollection &  |   | )
inlinevirtual
◆ OnContentListCleared()
 virtual void CRhRdkEventSinkBase::OnContentListCleared  |  ( |  const IRhRdkContentList &  |   | )
inlinevirtual
◆ OnContentListClearing()
 virtual void CRhRdkEventSinkBase::OnContentListClearing  |  ( |  const IRhRdkContentList &  |   | )
inlinevirtual
◆ OnContentListLoaded()
 virtual void CRhRdkEventSinkBase::OnContentListLoaded  |  ( |  const IRhRdkContentList &  |   | )
inlinevirtual
◆ OnContentMoved()
 virtual void CRhRdkEventSinkBase::OnContentMoved  |  ( |  const CRhRdkContent *  |  ,
|  const CRhRdkContent *  |  ,
|  const IRhRdkContentEditor *
)
inlinevirtual
◆ OnContentRenamed()
 virtual void CRhRdkEventSinkBase::OnContentRenamed  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentReplaced()
 virtual void CRhRdkEventSinkBase::OnContentReplaced  |  ( |  CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentReplacing()
 virtual void CRhRdkEventSinkBase::OnContentReplacing  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentSelected()
 virtual void CRhRdkEventSinkBase::OnContentSelected  |  ( |  const CRhRdkContent *  |  ,
|  const IRhRdkContentEditor &
)
inlinevirtual
◆ OnContentUpdateMarkers()
 virtual void CRhRdkEventSinkBase::OnContentUpdateMarkers  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnContentUpdatePreview()
 virtual void CRhRdkEventSinkBase::OnContentUpdatePreview  |  ( |  const CRhRdkContent *  |   | )
inlinevirtual
◆ OnCustomEvent()
 virtual void CRhRdkEventSinkBase::OnCustomEvent  |  ( |  const UUID &  |  ,
|  void *
)
inlinevirtual
◆ OnCustomRenderMeshesChanged()
 virtual void CRhRdkEventSinkBase::OnCustomRenderMeshesChanged  |  ( |  void  |   | )
inlinevirtual
◆ OnDeleteRhinoObject()
 virtual void CRhRdkEventSinkBase::OnDeleteRhinoObject  |  ( |  CRhinoDoc &  |  ,
|  CRhinoObject &
)
inlinevirtual
◆ OnDocumentSettingsChanged()
 virtual void CRhRdkEventSinkBase::OnDocumentSettingsChanged  |  ( |  UINT  |  ,
|  UINT_PTR
)
inlinevirtual
◆ OnFactoryAdded()
 virtual void CRhRdkEventSinkBase::OnFactoryAdded  |  ( |  const IRhRdkContentFactory &  |   | )
inlinevirtual
◆ OnFactoryDeleted()
 virtual void CRhRdkEventSinkBase::OnFactoryDeleted  |  ( |  const wchar_t *  |   | )
inlinevirtual
◆ OnFactoryDeleting()
 virtual void CRhRdkEventSinkBase::OnFactoryDeleting  |  ( |  const IRhRdkContentFactory &  |   | )
inlinevirtual
◆ OnGlobalSettingsChanged()
 virtual void CRhRdkEventSinkBase::OnGlobalSettingsChanged  |  ( |  void  |   | )
inlinevirtual
◆ OnLazyTimer()
 virtual void CRhRdkEventSinkBase::OnLazyTimer  |  ( |  void  |   | )
inlinevirtual
◆ OnModifyObjectTextureMapping()
 virtual void CRhRdkEventSinkBase::OnModifyObjectTextureMapping  |  ( |  CRhinoDoc &  |  ,
|  const CRhinoObject &
)
inlinevirtual
◆ OnNewRdkDocument()
 virtual void CRhRdkEventSinkBase::OnNewRdkDocument  |  ( |  void  |   | )
inlinevirtual
◆ OnRenderEngineStateChanged()
 virtual void CRhRdkEventSinkBase::OnRenderEngineStateChanged  |  ( |  bool  |   | )
inlinevirtual
◆ OnRendererChanged()
 virtual void CRhRdkEventSinkBase::OnRendererChanged  |  ( |  void  |   | )
inlinevirtual
◆ OnReplaceRhinoObject()
 virtual void CRhRdkEventSinkBase::OnReplaceRhinoObject  |  ( |  CRhinoDoc &  |  ,
|  CRhinoObject &  |  ,
|  CRhinoObject &
)
inlinevirtual
◆ OnSelectionChanged()
 virtual void CRhRdkEventSinkBase::OnSelectionChanged  |  ( |  CRhinoDoc &  |   | )
inlinevirtual
◆ OnUpdateAllPreviews()
 virtual void CRhRdkEventSinkBase::OnUpdateAllPreviews  |  ( |  void  |   | )
inlinevirtual
◆ TextureMappingTableEvent()
 virtual void CRhRdkEventSinkBase::TextureMappingTableEvent  |  ( |  const ON_TextureMapping &  |   | )
inlinevirtual