Public Member Functions | Static Public Attributes | Friends | List of all members
ON_ModelComponentWeakReference Class Reference
OpenNURBS
ON_ModelComponentWeakReference is a weak shared reference to a model component. ON_ModelComponentReference and ON_ModelComponentWeakReference are based on like std::shared_ptr and std::weak_ptr. More...
#include <opennurbs_model_component.h>
 Public Member Functions
ON_ModelComponentWeakReference () ON_NOEXCEPT
No = default to insure m_sp is completely managed in the opennurbs DLL. More...
ON_ModelComponentWeakReference (const class ON_ModelComponentReference &) ON_NOEXCEPT
ON_ModelComponentWeakReference (const ON_ModelComponentWeakReference &) ON_NOEXCEPT
No = default to insure m_sp is completely managed in the opennurbs DLL. More...
~ON_ModelComponentWeakReference ()
No = default to insure m_sp is completely managed in the opennurbs DLL. More...
ON_ModelComponentWeakReference &  | operator= (const ON_ModelComponentReference &)
ON_ModelComponentWeakReference &  | operator= (const ON_ModelComponentWeakReference &)
No = default to insure m_sp is completely managed in the opennurbs DLL. More...
 Static Public Attributes
static const ON_ModelComponentWeakReference  | Empty
 Friends
class  | ON_ModelComponentReference
Detailed Description
ON_ModelComponentWeakReference is a weak shared reference to a model component. ON_ModelComponentReference and ON_ModelComponentWeakReference are based on like std::shared_ptr and std::weak_ptr.
Constructor & Destructor Documentation
◆ ON_ModelComponentWeakReference() [1/3]
 ON_ModelComponentWeakReference::ON_ModelComponentWeakReference  |  ( |   | )
No = default to insure m_sp is completely managed in the opennurbs DLL.
No = default to insure m_sp is completely managed in the opennurbs DLL.
◆ ~ON_ModelComponentWeakReference()
 ON_ModelComponentWeakReference::~ON_ModelComponentWeakReference  |  ( |   | )
No = default to insure m_sp is completely managed in the opennurbs DLL.
◆ ON_ModelComponentWeakReference() [2/3]
 ON_ModelComponentWeakReference::ON_ModelComponentWeakReference  |  ( |  const ON_ModelComponentWeakReference &  |   | )
No = default to insure m_sp is completely managed in the opennurbs DLL.
◆ ON_ModelComponentWeakReference() [3/3]
 ON_ModelComponentWeakReference::ON_ModelComponentWeakReference  |  ( |  const class ON_ModelComponentReference &  |   | )
Member Function Documentation
◆ operator=() [1/2]
 ON_ModelComponentWeakReference& ON_ModelComponentWeakReference::operator=  |  ( |  const ON_ModelComponentReference &  |   | )
◆ operator=() [2/2]
 ON_ModelComponentWeakReference& ON_ModelComponentWeakReference::operator=  |  ( |  const ON_ModelComponentWeakReference &  |   | )
No = default to insure m_sp is completely managed in the opennurbs DLL.
Friends And Related Function Documentation
◆ ON_ModelComponentReference
 friend class ON_ModelComponentReference
friend
Member Data Documentation
◆ Empty
 const ON_ModelComponentWeakReference ON_ModelComponentWeakReference::Empty
static