Static Public Member Functions | List of all members
CRhinoUiMultiMonitor Class Reference
RhinoUI
#include <RhinoSdkUiMultiMonitor.h>
 Static Public Member Functions
static bool  | ForceWindowRectOnMonitor (ON_4iRect &rc, HWND hWnd)
static int  | GetMultipleMonitorRects (ON_SimpleArray< ON_4iRect > &mon_rects)
static HMONITOR  | MonitorFromPoint (const ON_2iPoint &point)
static HMONITOR  | MonitorFromRect (const ON_4iRect &rc)
static ON_4iRect  | MonitorRectFromPoint (const ON_2iPoint &point)
static ON_4iRect  | MonitorRectFromRect (const ON_4iRect &rc)
static ON_4iRect  | MonitorRectFromWindow (HWND hWnd)
static int  | NumberOfMonitors ()
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Member Function Documentation
◆ ForceWindowRectOnMonitor()
 static bool CRhinoUiMultiMonitor::ForceWindowRectOnMonitor  |  ( |  ON_4iRect &  |  rc,
|  HWND  |  hWnd
)
static
Description: Force specified rectangle to monitor which contains the majority of the window specified by hWnd. Parameters: rc [in/out] Rectangle to validate hWnd [in] Window handle used to search for monitor which contains the majority of the window. Returns: true If main monitor was determined and rectangle was forced on monitors client work area; otherwise false.
◆ GetMultipleMonitorRects()
 static int CRhinoUiMultiMonitor::GetMultipleMonitorRects  |  ( |  ON_SimpleArray< ON_4iRect > &  |  mon_rects | )
static
Description: Call this method to get a list of screen rectangles associated with the currently installed monitors Parameters: mon_rects [out] List of screen rectangles Returns: Returns the number of rectangles added to mon_rects
◆ MonitorFromPoint()
 static HMONITOR CRhinoUiMultiMonitor::MonitorFromPoint  |  ( |  const ON_2iPoint &  |  point | )
static
Description: Get monitor indexfor monitor which contains the point. Parameters: rc [in] Point used to identify monitor. Returns: Returns NULL if point is not on a monitor otherwise a valid monitor handle.
◆ MonitorFromRect()
 static HMONITOR CRhinoUiMultiMonitor::MonitorFromRect  |  ( |  const ON_4iRect &  |  rc | )
static
Description: Get monitor indexfor monitor which contains the majority of the specified rectangle. Parameters: rc [in] Rectangle used to identify monitor. Returns: Returns NULL if rect is not on a monitor otherwise a valid monitor handle.
◆ MonitorRectFromPoint()
 static ON_4iRect CRhinoUiMultiMonitor::MonitorRectFromPoint  |  ( |  const ON_2iPoint &  |  point | )
static
Description: Get client workspace rectangle for monitor which contains the specified screen point. Parameters: point [in] Screen point used to identify monitor. Returns: If CRect::IsRectEmpty() then there was an error; otherwise a valid client workspace rectangle is returned;
◆ MonitorRectFromRect()
 static ON_4iRect CRhinoUiMultiMonitor::MonitorRectFromRect  |  ( |  const ON_4iRect &  |  rc | )
static
Description: Get client workspace rectangle for monitor which contains the majority of the specified rectangle. Parameters: rc [in] Rectangle used to identify monitor. Returns: If CRect::IsRectEmpty() then there was an error; otherwise a valid client workspace rectangle is returned;
◆ MonitorRectFromWindow()
 static ON_4iRect CRhinoUiMultiMonitor::MonitorRectFromWindow  |  ( |  HWND  |  hWnd | )
static
Description: Get client workspace rectangle for monitor which contains the majority of the specified window. Parameters: hWnd [in] Window handle used to search for monitor which contains the majority of the window. Returns: If CRect::IsRectEmpty() then there was an error; otherwise a valid client workspace rectangle is returned;
◆ NumberOfMonitors()
 static int CRhinoUiMultiMonitor::NumberOfMonitors  |  ( |   | )
static
Description: Get the number of monitors currently active. Returns: Returns the number of monitors currently active or value less than one on error.