Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppSpaceBallSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppSpaceBallSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppSpaceBallSettings &src) const
bool  | operator== (const CRhinoAppSpaceBallSettings &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Public Attributes
bool  | m_allow_tilt
bool  | m_rotate_about_camera
bool  | m_rotate_parallel_view
int  | m_rotation_scale
spacemouse/spaceball settings More...
bool  | m_swap_pan_and_zoom
bool  | m_swap_zoom_with_dolly
int  | m_translation_scale
bool  | m_use_legacy
 Static Public Attributes
static const CRhinoAppSpaceBallSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppSpaceBallSettings()
 CRhinoAppSpaceBallSettings::CRhinoAppSpaceBallSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppSpaceBallSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppSpaceBallSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppSpaceBallSettings::operator!=  |  ( |  const CRhinoAppSpaceBallSettings &  |  src | ) |   const
◆ operator==()
 bool CRhinoAppSpaceBallSettings::operator==  |  ( |  const CRhinoAppSpaceBallSettings &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppSpaceBallSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppSpaceBallSettings CRhinoAppSpaceBallSettings::Default
static
◆ m_allow_tilt
 bool CRhinoAppSpaceBallSettings::m_allow_tilt
◆ m_rotate_about_camera
 bool CRhinoAppSpaceBallSettings::m_rotate_about_camera
◆ m_rotate_parallel_view
 bool CRhinoAppSpaceBallSettings::m_rotate_parallel_view
◆ m_rotation_scale
 int CRhinoAppSpaceBallSettings::m_rotation_scale
spacemouse/spaceball settings
◆ m_swap_pan_and_zoom
 bool CRhinoAppSpaceBallSettings::m_swap_pan_and_zoom
◆ m_swap_zoom_with_dolly
 bool CRhinoAppSpaceBallSettings::m_swap_zoom_with_dolly
◆ m_translation_scale
 int CRhinoAppSpaceBallSettings::m_translation_scale
◆ m_use_legacy
 bool CRhinoAppSpaceBallSettings::m_use_legacy