Public Member Functions | Protected Member Functions | List of all members
CRhinoUiDockBarClientWnd Class Reference
RhinoUI
CRhinoUiDockBarClientWnd. More...
#include <RhinoSdkUiDockBarClientWnd.h>
 Inheritance diagram for CRhinoUiDockBarClientWnd:
 Public Member Functions
CRhinoUiDockBarClientWnd (CRhinoUiDockBar *pCB)
virtual  | ~CRhinoUiDockBarClientWnd ()
CRhinoUiDockBar *  | GetRhinoDockBar ()
 Protected Member Functions
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
Detailed Description
CRhinoUiDockBarClientWnd.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiDockBarClientWnd()
 CRhinoUiDockBarClientWnd::CRhinoUiDockBarClientWnd  |  ( |  CRhinoUiDockBar *  |  pCB | )
Description: Constructor
Parameters: pCB [in] Control bar that owns this window
See Also: CRhinoUiDockBarClientWnd::RhinoControlBar()
◆ ~CRhinoUiDockBarClientWnd()
 virtual CRhinoUiDockBarClientWnd::~CRhinoUiDockBarClientWnd  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ GetRhinoDockBar()
 CRhinoUiDockBar* CRhinoUiDockBarClientWnd::GetRhinoDockBar  |  ( |   | )
Description: Rhino control bar this window is embedded in
Returns: Rhino control bar this window is embedded in
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiDockBarClientWnd::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnLButtonDown()
 afx_msg void CRhinoUiDockBarClientWnd::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
protected
◆ OnPaint()
 afx_msg void CRhinoUiDockBarClientWnd::OnPaint  |  ( |   | )
protected