Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_UuidPtr Class Reference
OpenNURBS
#include <opennurbs_uuid.h>
 Public Member Functions
ON_UuidPtr ()=default
ON_UuidPtr (const ON_UuidPtr &)=default
~ON_UuidPtr ()=default
ON_UuidPtr &  | operator= (const ON_UuidPtr &)=default
 Static Public Member Functions
static int  | CompareId (const ON_UuidPtr *a, const ON_UuidPtr *b)
static int  | CompareIdAndPtr (const ON_UuidPtr *a, const ON_UuidPtr *b)
static int  | ComparePtr (const ON_UuidPtr *a, const ON_UuidPtr *b)
static int  | ComparePtrAndId (const ON_UuidPtr *a, const ON_UuidPtr *b)
 Public Attributes
ON_UUID  | m_id = ON_nil_uuid
ON__UINT_PTR  | m_ptr = 0
 Static Public Attributes
static const ON_UuidPtr  | NilPtr
uuid = nil, ptr = 0; More...
Detailed Description
Description: This class is used by ON_UuidIndexList. It is used when uuids are used to search for items that can be found by an integer index.
Constructor & Destructor Documentation
◆ ON_UuidPtr() [1/2]
 ON_UuidPtr::ON_UuidPtr  |  ( |   | )
default
◆ ~ON_UuidPtr()
 ON_UuidPtr::~ON_UuidPtr  |  ( |   | )
default
◆ ON_UuidPtr() [2/2]
 ON_UuidPtr::ON_UuidPtr  |  ( |  const ON_UuidPtr &  |   | )
default
Member Function Documentation
◆ CompareId()
 static int ON_UuidPtr::CompareId  |  ( |  const ON_UuidPtr *  |  a,
|  const ON_UuidPtr *  |  b
)
static
Compare m_id and ignore m_ptr.
◆ CompareIdAndPtr()
 static int ON_UuidPtr::CompareIdAndPtr  |  ( |  const ON_UuidPtr *  |  a,
|  const ON_UuidPtr *  |  b
)
static
Dictionary compare m_id and then m_ptr.
◆ ComparePtr()
 static int ON_UuidPtr::ComparePtr  |  ( |  const ON_UuidPtr *  |  a,
|  const ON_UuidPtr *  |  b
)
static
Compare m_ptr and ignore m_id.
◆ ComparePtrAndId()
 static int ON_UuidPtr::ComparePtrAndId  |  ( |  const ON_UuidPtr *  |  a,
|  const ON_UuidPtr *  |  b
)
static
Dictionary compare m_id and then m_ptr.
◆ operator=()
 ON_UuidPtr& ON_UuidPtr::operator=  |  ( |  const ON_UuidPtr &  |   | )
default
Member Data Documentation
◆ m_id
 ON_UUID ON_UuidPtr::m_id = ON_nil_uuid
In cases when there is a discrepancy between the m_id and m_ptr, m_id is assumed to be valid unless comments where this class is used indicate otherwise.
◆ m_ptr
 ON__UINT_PTR ON_UuidPtr::m_ptr = 0
◆ NilPtr
 const ON_UuidPtr ON_UuidPtr::NilPtr
static
uuid = nil, ptr = 0;