Public Member Functions | Public Attributes | List of all members
CRhinoFlowSpaceMorph Class Reference
Rhino
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoFlowSpaceMorph:
 Public Member Functions
CRhinoFlowSpaceMorph ()
~CRhinoFlowSpaceMorph ()
void  | FlowCleanup ()
void  | FlowInit (const ON_Curve *crv_from, bool bReverseFrom, const ON_Curve *crv_to, bool bReverseTo, bool bPreventStretching, const ON_Surface *srf_to=nullptr)
ON_3dPoint  | MorphPoint (ON_3dPoint pt) const
virtual ON_SpaceMorph override More...
ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | SetRadii (double r0, double r1)
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
virtual bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
bool  | m_bPreventStretching
if true, no stretching happens along the flow curve More...
bool  | m_bStairlike
If true, the flow "from" and "to" frame z axes are always m_fastflow_from_up and m_fastflow_to_up. More...
ON_Curve *  | m_fastflow_crv_from
ON_Curve *  | m_fastflow_crv_to
ON_SimpleArray< double >  | m_fastflow_from_t
ON_3dVector  | m_fastflow_from_up
double  | m_fastflow_length_from
double  | m_fastflow_length_to
ON_Surface *  | m_fastflow_srf_to
ON_SimpleArray< double >  | m_fastflow_to_t
ON_3dVector  | m_fastflow_to_up
Detailed Description
Flow morph Re-aligns an object or group of objects from a base curve to a target curve.
Constructor & Destructor Documentation
◆ CRhinoFlowSpaceMorph()
 CRhinoFlowSpaceMorph::CRhinoFlowSpaceMorph  |  ( |   | )
◆ ~CRhinoFlowSpaceMorph()
 CRhinoFlowSpaceMorph::~CRhinoFlowSpaceMorph  |  ( |   | )
Member Function Documentation
◆ FlowCleanup()
 void CRhinoFlowSpaceMorph::FlowCleanup  |  ( |   | )
◆ FlowInit()
 void CRhinoFlowSpaceMorph::FlowInit  |  ( |  const ON_Curve *  |  crv_from,
|  bool  |  bReverseFrom,
|  const ON_Curve *  |  crv_to,
|  bool  |  bReverseTo,
|  bool  |  bPreventStretching,
|  const ON_Surface *  |  srf_to = nullptr
)
30 June 2004 Dale Lear: Stuff that FastMorphPoint() needs to work.
Parameters
srf_to | optional target surface. If supplied crv_to should be on srf_to for predictable results.
◆ MorphPoint()
 ON_3dPoint CRhinoFlowSpaceMorph::MorphPoint  |  ( |  ON_3dPoint  |  pt | ) |   const
virtual
virtual ON_SpaceMorph override
Implements ON_SpaceMorph.
◆ MorphVector()
 ON_3dVector CRhinoFlowSpaceMorph::MorphVector  |  ( |  ON_3dPoint  |  tail_point,
|  ON_3dVector  |  vector
) |   |  const
virtual
Description: Morphs vector. Parameters: tail_point - [in] tail point vector - [in] Returns: Morphed vector. Remarks: Default returns difference of morphed tail+vector and tail.
Reimplemented from ON_SpaceMorph.
◆ SetRadii()
 bool CRhinoFlowSpaceMorph::SetRadii  |  ( |  double  |  r0,
|  double  |  r1
)
Member Data Documentation
◆ m_bPreventStretching
 bool CRhinoFlowSpaceMorph::m_bPreventStretching
if true, no stretching happens along the flow curve
◆ m_bStairlike
 bool CRhinoFlowSpaceMorph::m_bStairlike
If true, the flow "from" and "to" frame z axes are always m_fastflow_from_up and m_fastflow_to_up.
◆ m_fastflow_crv_from
 ON_Curve* CRhinoFlowSpaceMorph::m_fastflow_crv_from
◆ m_fastflow_crv_to
 ON_Curve* CRhinoFlowSpaceMorph::m_fastflow_crv_to
◆ m_fastflow_from_t
 ON_SimpleArray< double > CRhinoFlowSpaceMorph::m_fastflow_from_t
◆ m_fastflow_from_up
 ON_3dVector CRhinoFlowSpaceMorph::m_fastflow_from_up
◆ m_fastflow_length_from
 double CRhinoFlowSpaceMorph::m_fastflow_length_from
◆ m_fastflow_length_to
 double CRhinoFlowSpaceMorph::m_fastflow_length_to
◆ m_fastflow_srf_to
 ON_Surface* CRhinoFlowSpaceMorph::m_fastflow_srf_to
◆ m_fastflow_to_t
 ON_SimpleArray< double > CRhinoFlowSpaceMorph::m_fastflow_to_t
◆ m_fastflow_to_up
 ON_3dVector CRhinoFlowSpaceMorph::m_fastflow_to_up