Public Member Functions | Static Public Member Functions | Protected Member Functions | Static Protected Member Functions | Protected Attributes | Friends | List of all members
ON_Annotation Class Referenceabstract
OpenNURBS
#include <opennurbs_annotationbase.h>
 Inheritance diagram for ON_Annotation:
 Public Member Functions
bool  | AllowTextScaling () const
bool  | Alternate (const ON_DimStyle *parent_style) const
Additional measurement display toggle. More...
bool  | AlternateBelow (const ON_DimStyle *parent_style) const
ON_DimStyle::LengthDisplay  | AlternateDimensionLengthDisplay (const ON_DimStyle *parent_style) const
ON::LengthUnitSystem  | AlternateDimensionLengthDisplayUnit (const ON_DimStyle *parent_style, unsigned int model_sn) const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary> More...
double  | AlternateLengthFactor (const ON_DimStyle *parent_style) const
Distance scale factor for alternate display. More...
int  | AlternateLengthResolution (const ON_DimStyle *parent_style) const
Display resolution for alternate length measurements. More...
const wchar_t *  | AlternatePrefix (const ON_DimStyle *parent_style) const
Dimension alternate prefix text. More...
double  | AlternateRoundOff (const ON_DimStyle *parent_style) const
const wchar_t *  | AlternateSuffix (const ON_DimStyle *parent_style) const
Dimension alternate suffix text. More...
int  | AlternateToleranceResolution (const ON_DimStyle *parent_style) const
ON_DimStyle::suppress_zero  | AlternateZeroSuppress (const ON_DimStyle *parent_style) const
ON_DimStyle::angle_format  | AngleFormat (const ON_DimStyle *parent_style) const
Angle units - Degrees, Degrees-Minutes-Seconds, Radians. More...
int  | AngleResolution (const ON_DimStyle *parent_style) const
Display resolution for angle measurements. More...
double  | AngleRoundOff (const ON_DimStyle *parent_style) const
ON_DimStyle::suppress_zero  | AngleZeroSuppress (const ON_DimStyle *parent_style) const
bool  | AnyLengthFieldIsOverridden () const
int  | ArcLengthSymbol (const ON_DimStyle *parent_style) const
ON_UUID  | ArrowBlockId1 (const ON_DimStyle *parent_style) const
ON_UUID  | ArrowBlockId2 (const ON_DimStyle *parent_style) const
double  | ArrowSize (const ON_DimStyle *parent_style) const
Arrow size. More...
ON_Arrowhead::arrow_type  | ArrowType1 (const ON_DimStyle *parent_style) const
ON_Arrowhead::arrow_type  | ArrowType2 (const ON_DimStyle *parent_style) const
double  | BaselineSpacing (const ON_DimStyle *parent_style) const
double  | CenterMarkSize (const ON_DimStyle *parent_style) const
Centermark size. More...
ON_DimStyle::centermark_style  | CenterMarkStyle (const ON_DimStyle *parent_style) const
Centermark style. More...
void  | ClearFieldOverride (ON_DimStyle::field field)
void  | ClearOverrideDimensionStyle ()
void  | ClearText () const
wchar_t  | DecimalSeparator (const ON_DimStyle *parent_style) const
ON_DimStyle::LengthDisplay  | DimensionLengthDisplay (const ON_DimStyle *parent_style) const
ON::LengthUnitSystem  | DimensionLengthDisplayUnit (const ON_DimStyle *parent_style, unsigned int model_sn) const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary> More...
const ON_DimStyle &  | DimensionStyle (const ON_DimStyle &parent_dimstyle) const
const ON_DimStyle &  | DimensionStyle (const ON_DimStyle &parent_dimstyle, bool bForceOverrideUpdate) const
ON_UUID  | DimensionStyleId () const
double  | DimExtension (const ON_DimStyle *parent_style) const
Extension of dimension line past extension lines. More...
ON_DimStyle::ContentAngleStyle  | DimRadialTextAngleStyle (const ON_DimStyle *parent_style) const
ON_DimStyle::TextLocation  | DimRadialTextLocation (const ON_DimStyle *parent_style) const
The location of text relative to the dimension line in radial dimensions. More...
ON::TextOrientation  | DimRadialTextOrientation (const ON_DimStyle *parent_style) const
double  | DimScale (const ON_DimStyle *parent_style) const
ON_SHA1_Hash  | DimStyleTextPositionPropertiesHash () const
ON_DimStyle::ContentAngleStyle  | DimTextAngleStyle (const ON_DimStyle *parent_style) const
ON_DimStyle::TextLocation  | DimTextLocation (const ON_DimStyle *parent_style) const
The location of text relative to the dimension line in linear, angular, and ordinate dimensions. More...
ON::TextOrientation  | DimTextOrientation (const ON_DimStyle *parent_style) const
bool  | DrawForward (const ON_DimStyle *parent_style) const
bool  | DrawTextMask (const ON_DimStyle *parent_style) const
Determines whether or not to draw a Text Mask. More...
bool  | EqualTextPositionProperties (const class ON_DimStyle *dimstyle) const
double  | ExtensionLineExtension (const ON_DimStyle *parent_style) const
These next several functions are to set overrides on individual annotation objects. More...
double  | ExtensionLineOffset (const ON_DimStyle *parent_style) const
Extension line offset. More...
bool  | FieldIsOverridden (ON_DimStyle::field field) const
const ON_Font *  | FirstCharFont () const
double  | FixedExtensionLength (const ON_DimStyle *parent_style) const
bool  | FixedExtensionLengthOn (const ON_DimStyle *parent_style) const
const class ON_Font &  | Font (const ON_DimStyle *parent_style) const
const class ON_Font &  | FontCharacteristics (const ON_DimStyle *parent_style) const
const bool  | FontSubstituted (const ON_DimStyle *parent_style) const
double  | FormattingRectangleWidth () const
FormattingRectangleWidth is a width set by text wrapping. It's in model units. More...
void  | GetAlignment (ON::TextHorizontalAlignment &horz, ON::TextVerticalAlignment &vert) const
virtual bool  | GetAnnotationBoundingBox (const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, double *boxmin, double *boxmax, bool bGrow=false) const =0
bool  | GetText3dCorners (ON_3dPoint corners[4]) const
bool  | GetTextGlyphBoxCorners (const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, ON_3dPoint corners[8]) const
bool  | GetTextGlyphContours (const ON_Viewport *vp, const ON_DimStyle *dimstyle, bool bApplyDimStyleDimScale, bool bSingleStrokeFont, ON_ClassArray< ON_ClassArray< ON_SimpleArray< ON_Curve * > > > &text_contours) const
virtual bool  | GetTextXform (const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, ON_Xform &text_xform_out) const =0
bool  | GetTextXform (const ON_Xform *model_xform, const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, ON_Xform &text_xform_out) const
bool  | HasDimensionStyleOverrides () const
Quickly check if this annotation object has style overrides applied. More...
const ON_2dVector  | HorizontalDirection () const
bool  | IsAllBold () const
true if all of the text is bold More...
bool  | IsAllItalic () const
true if all of the text is italic More...
bool  | IsAllUnderlined () const
true if all of the text is underlined More...
bool  | IsOverrideDimStyleCandidate (const ON_DimStyle *override_style_candidate, bool bRequireSetOverrides) const
bool  | IsOverrideStylePointer (const ON_DimStyle *ptr) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UUID  | LeaderArrowBlockId (const ON_DimStyle *parent_style) const
double  | LeaderArrowSize (const ON_DimStyle *parent_style) const
Arrow size. More...
ON_Arrowhead::arrow_type  | LeaderArrowType (const ON_DimStyle *parent_style) const
double  | LeaderContentAngleDegrees (const ON_DimStyle *parent_style) const
double  | LeaderContentAngleRadians (const ON_DimStyle *parent_style) const
ON_DimStyle::ContentAngleStyle  | LeaderContentAngleStyle (const ON_DimStyle *parent_style) const
ON_DimStyle::leader_curve_type  | LeaderCurveType (const ON_DimStyle *parent_style) const
bool  | LeaderHasLanding (const ON_DimStyle *parent_style) const
double  | LeaderLandingLength (const ON_DimStyle *parent_style) const
ON::TextHorizontalAlignment  | LeaderTextHorizontalAlignment (const ON_DimStyle *parent_style) const
ON::TextOrientation  | LeaderTextOrientation (const ON_DimStyle *parent_style) const
ON::TextVerticalAlignment  | LeaderTextVerticalAlignment (const ON_DimStyle *parent_style) const
double  | LengthFactor (const ON_DimStyle *parent_style) const
Scale factor for displayed distances. More...
int  | LengthResolution (const ON_DimStyle *parent_style) const
Display resolution for distance measurements. More...
double  | LineSpaceScale (const ON_DimStyle *parent_style) const
double  | MaskBorder (const ON_DimStyle *parent_style) const
ON_Color  | MaskColor (const ON_DimStyle *parent_style) const
Only works right if MaskColorSource returns 1. More...
ON_TextMask::MaskType  | MaskFillType (const ON_DimStyle *parent_style) const
Determines where to get the color to draw a Text Mask. More...
ON_TextMask::MaskFrame  | MaskFrameType (const ON_DimStyle *parent_style) const
Determines whether to draw a frame around a text mask. More...
ON::object_type  | ObjectType () const override
const ON_wString  | PlainText () const
const ON_wString  | PlainTextWithFields () const
const ON_wString  | PlainTextWithFields (ON_SimpleArray< ON_3dex > *runmap) const
const ON_Plane &  | Plane () const
const wchar_t *  | Prefix (const ON_DimStyle *parent_style) const
Dimension prefix text. More...
bool  | ReplaceTextString (const wchar_t *RtfString, const ON_DimStyle *dimstyle)
const ON_wString  | RichText () const
double  | RoundOff (const ON_DimStyle *parent_style) const
const wchar_t *  | RtfText () const
bool  | RunReplaceString (const ON_DimStyle *dimstyle, const wchar_t *str, int start_run_idx, int start_run_pos, int end_run_idx, int end_run_pos)
void  | ScaleOverrideDimstyle (const ON_DimStyle *parent_dimstyle, double scale)
void  | ScaleOverrideDimstyle (const ON_DimStyle *parent_dimstyle, double scale, bool only_overrides)
void  | SetAlignment (ON::TextHorizontalAlignment horz, ON::TextVerticalAlignment vert)
void  | SetAllowTextScaling (bool scale)
void  | SetAlternate (const ON_DimStyle *parent_style, bool)
void  | SetAlternateBelow (const ON_DimStyle *parent_style, bool below)
void  | SetAlternateDimensionLengthDisplay (const ON_DimStyle *parent_style, ON_DimStyle::LengthDisplay length_display)
void  | SetAlternateLengthFactor (const ON_DimStyle *parent_style, double)
void  | SetAlternateLengthResolution (const ON_DimStyle *parent_style, int)
void  | SetAlternatePrefix (const ON_DimStyle *parent_style, const wchar_t *)
void  | SetAlternateRoundOff (const ON_DimStyle *parent_style, double r)
void  | SetAlternateSuffix (const ON_DimStyle *parent_style, const wchar_t *)
void  | SetAlternateToleranceResolution (const ON_DimStyle *parent_style, int r)
void  | SetAlternateZeroSuppress (const ON_DimStyle *parent_style, ON_DimStyle::suppress_zero s)
void  | SetAngleFormat (const ON_DimStyle *parent_style, ON_DimStyle::angle_format format)
void  | SetAngleResolution (const ON_DimStyle *parent_style, int r)
void  | SetAngleRoundOff (const ON_DimStyle *parent_style, double r)
void  | SetAngleZeroSuppress (const ON_DimStyle *parent_style, ON_DimStyle::suppress_zero s)
bool  | SetAnnotationBold (bool bold, const ON_DimStyle *dimstyle)
bool  | SetAnnotationFacename (bool set_or_clear, const wchar_t *facename, const ON_DimStyle *parent_style)
bool  | SetAnnotationFont (const ON_Font *font, const ON_DimStyle *parent_style)
bool  | SetAnnotationFont (const ON_Font *font, const ON_DimStyle *parent_style, bool keep_overrides)
bool  | SetAnnotationFont (const ON_Font *font, const ON_DimStyle *parent_style, bool keep_overrides, const ON_Font *old_font)
bool  | SetAnnotationItalic (bool italic, const ON_DimStyle *dimstyle)
bool  | SetAnnotationUnderline (bool underline, const ON_DimStyle *dimstyle)
void  | SetArcLengthSymbol (const ON_DimStyle *parent_style, int m)
void  | SetArrowBlockId1 (const ON_DimStyle *parent_style, ON_UUID id)
void  | SetArrowBlockId2 (const ON_DimStyle *parent_style, ON_UUID id)
void  | SetArrowSize (const ON_DimStyle *parent_style, double d)
void  | SetArrowType1 (const ON_DimStyle *parent_style, ON_Arrowhead::arrow_type)
void  | SetArrowType1And2 (const ON_DimStyle *parent_style, ON_Arrowhead::arrow_type)
void  | SetArrowType2 (const ON_DimStyle *parent_style, ON_Arrowhead::arrow_type)
void  | SetBaselineSpacing (const ON_DimStyle *parent_style, double spacing)
void  | SetCenterMarkSize (const ON_DimStyle *parent_style, double d)
void  | SetCenterMarkStyle (const ON_DimStyle *parent_style, ON_DimStyle::centermark_style style)
void  | SetDecimalSeparator (const ON_DimStyle *parent_style, wchar_t separator)
void  | SetDimensionLengthDisplay (const ON_DimStyle *parent_style, ON_DimStyle::LengthDisplay length_display)
void  | SetDimensionStyleId (const class ON_DimStyle &dim_style)
void  | SetDimensionStyleId (ON_UUID dimstyle_id)
void  | SetDimensionStyleIdForExperts (ON_UUID dimstyle_id, bool bKeepOverrides)
void  | SetDimExtension (const ON_DimStyle *parent_style, const double e)
void  | SetDimRadialTextAngleStyle (const ON_DimStyle *parent_style, ON_DimStyle::ContentAngleStyle style)
void  | SetDimRadialTextLocation (const ON_DimStyle *parent_style, ON_DimStyle::TextLocation dim_text_location)
void  | SetDimRadialTextOrientation (const ON_DimStyle *parent_style, ON::TextOrientation orientation)
void  | SetDimScale (const ON_DimStyle *parent_style, double scale)
void  | SetDimTextAngleStyle (const ON_DimStyle *parent_style, ON_DimStyle::ContentAngleStyle style)
void  | SetDimTextLocation (const ON_DimStyle *parent_style, ON_DimStyle::TextLocation dim_text_location)
void  | SetDimTextOrientation (const ON_DimStyle *parent_style, ON::TextOrientation orientation)
void  | SetDrawForward (const ON_DimStyle *parent_style, bool drawforward)
void  | SetDrawTextMask (const ON_DimStyle *parent_style, bool bDraw)
void  | SetExtensionLineExtension (const ON_DimStyle *parent_style, double d)
void  | SetExtensionLineOffset (const ON_DimStyle *parent_style, double d)
void  | SetFixedExtensionLength (const ON_DimStyle *parent_style, double l)
void  | SetFixedExtensionLengthOn (const ON_DimStyle *parent_style, bool on)
void  | SetFont (const ON_DimStyle *parent_style, const class ON_Font &font_characteristics)
void  | SetFormattingRectangleWidth (double width)
void  | SetHorizontalDirection (ON_2dVector)
void  | SetLeaderArrowBlockId (const ON_DimStyle *parent_style, ON_UUID id)
void  | SetLeaderArrowSize (const ON_DimStyle *parent_style, double d)
void  | SetLeaderArrowType (const ON_DimStyle *parent_style, ON_Arrowhead::arrow_type)
void  | SetLeaderContentAngleDegrees (const ON_DimStyle *parent_style, double angle_degrees)
void  | SetLeaderContentAngleRadians (const ON_DimStyle *parent_style, double angle_radians)
void  | SetLeaderContentAngleStyle (const ON_DimStyle *parent_style, ON_DimStyle::ContentAngleStyle style)
void  | SetLeaderCurveType (const ON_DimStyle *parent_style, ON_DimStyle::leader_curve_type type)
void  | SetLeaderHasLanding (const ON_DimStyle *parent_style, bool landing)
void  | SetLeaderLandingLength (const ON_DimStyle *parent_style, double length)
void  | SetLeaderTextHorizontalAlignment (const ON_DimStyle *parent_style, ON::TextHorizontalAlignment halign)
void  | SetLeaderTextOrientation (const ON_DimStyle *parent_style, ON::TextOrientation orientation)
void  | SetLeaderTextVerticalAlignment (const ON_DimStyle *parent_style, ON::TextVerticalAlignment style)
void  | SetLengthFactor (const ON_DimStyle *parent_style, double)
void  | SetLengthResolution (const ON_DimStyle *parent_style, int r)
void  | SetLineSpaceScale (const ON_DimStyle *parent_style, double scale)
void  | SetMaskBorder (const ON_DimStyle *parent_style, double offset)
void  | SetMaskColor (const ON_DimStyle *parent_style, ON_Color color)
Does not return viewport background color. More...
void  | SetMaskFillType (const ON_DimStyle *parent_style, ON_TextMask::MaskType source)
void  | SetMaskFrameType (const ON_DimStyle *parent_style, ON_TextMask::MaskFrame source)
bool  | SetOverrideDimensionStyle (const ON_DimStyle *override_style_candidate, bool bRequireSetOverrides)
bool  | SetOverrideDimensionStyle (ON_DimStyle *&override_style) const
void  | SetPlane (const ON_Plane &plane)
void  | SetPrefix (const ON_DimStyle *parent_style, const wchar_t *)
void  | SetRoundOff (const ON_DimStyle *parent_style, double r)
void  | SetSignedOrdinate (const ON_DimStyle *parent_style, bool allowsigned)
void  | SetStackFractionFormat (const ON_DimStyle *parent_style, ON_DimStyle::stack_format f)
void  | SetStackHeightScale (const ON_DimStyle *parent_style, double f)
void  | SetSuffix (const ON_DimStyle *parent_style, const wchar_t *)
void  | SetSuppressArrow1 (const ON_DimStyle *parent_style, bool s)
void  | SetSuppressArrow2 (const ON_DimStyle *parent_style, bool s)
void  | SetSuppressDimLine1 (const ON_DimStyle *parent_style, bool b)
void  | SetSuppressDimLine2 (const ON_DimStyle *parent_style, bool b)
void  | SetSuppressExtension1 (const ON_DimStyle *parent_style, bool b)
void  | SetSuppressExtension2 (const ON_DimStyle *parent_style, bool b)
void  | SetText (const ON_TextRunArray &runs) const
void  | SetText (ON_TextContent *&text) const
void  | SetTextGap (const ON_DimStyle *parent_style, double gap)
void  | SetTextHeight (const ON_DimStyle *parent_style, double height)
void  | SetTextHorizontalAlignment (const ON_DimStyle *parent_style, ON::TextHorizontalAlignment halign)
void  | SetTextMask (const ON_DimStyle *parent_style, const ON_TextMask &mask)
void  | SetTextMoveLeader (const ON_DimStyle *parent_style, int m)
void  | SetTextOrientation (const ON_DimStyle *parent_style, ON::TextOrientation orientation)
virtual void  | SetTextRotationDegrees (double rotation)
virtual void  | SetTextRotationRadians (double rotation)
void  | SetTextUnderlined (const ON_DimStyle *parent_style, bool underlined)
void  | SetTextVerticalAlignment (const ON_DimStyle *parent_style, ON::TextVerticalAlignment style)
void  | SetToleranceFormat (const ON_DimStyle *parent_style, ON_DimStyle::tolerance_format format)
void  | SetToleranceHeightScale (const ON_DimStyle *parent_style, double scale)
void  | SetToleranceLowerValue (const ON_DimStyle *parent_style, double lower_value)
void  | SetToleranceResolution (const ON_DimStyle *parent_style, int resolution)
void  | SetToleranceUpperValue (const ON_DimStyle *parent_style, double upper_value)
void  | SetToleranceZeroSuppress (const ON_DimStyle *parent_style, ON_DimStyle::suppress_zero s)
void  | SetUseKerning (const ON_DimStyle *parent_style, bool enabled)
void  | SetZeroSuppress (const ON_DimStyle *parent_style, ON_DimStyle::suppress_zero s)
bool  | SignedOrdinate (const ON_DimStyle *parent_style) const
ON_DimStyle::stack_format  | StackFractionFormat (const ON_DimStyle *parent_style) const
double  | StackHeightScale (const ON_DimStyle *parent_style) const
const wchar_t *  | Suffix (const ON_DimStyle *parent_style) const
Dimension suffix text. More...
bool  | SuppressArrow1 (const ON_DimStyle *parent_style) const
bool  | SuppressArrow2 (const ON_DimStyle *parent_style) const
bool  | SuppressDimLine1 (const ON_DimStyle *parent_style) const
bool  | SuppressDimLine2 (const ON_DimStyle *parent_style) const
bool  | SuppressExtension1 (const ON_DimStyle *parent_style) const
Suppress first dimension extension line. More...
bool  | SuppressExtension2 (const ON_DimStyle *parent_style) const
Suppress second dimension extension line. More...
ON_TextContent *  | Text ()
const ON_TextContent *  | Text () const
double  | TextGap (const ON_DimStyle *parent_style) const
Distance from dimension lines to text. More...
double  | TextHeight (const ON_DimStyle *parent_style) const
Height of dimension text. More...
ON::TextHorizontalAlignment  | TextHorizontalAlignment (const ON_DimStyle *parent_style) const
int  | TextMoveLeader (const ON_DimStyle *parent_style) const
ON::TextOrientation  | TextOrientation (const ON_DimStyle *parent_style) const
virtual double  | TextRotationDegrees () const
return angle in degrees between text plane and object plane More...
virtual double  | TextRotationRadians () const
return angle in radians between text plane and object plane More...
bool  | TextUnderlined (const ON_DimStyle *parent_style) const
ON::TextVerticalAlignment  | TextVerticalAlignment (const ON_DimStyle *parent_style) const
ON_DimStyle::tolerance_format  | ToleranceFormat (const ON_DimStyle *parent_style) const
double  | ToleranceHeightScale (const ON_DimStyle *parent_style) const
double  | ToleranceLowerValue (const ON_DimStyle *parent_style) const
int  | ToleranceResolution (const ON_DimStyle *parent_style) const
double  | ToleranceUpperValue (const ON_DimStyle *parent_style) const
ON_DimStyle::suppress_zero  | ToleranceZeroSuppress (const ON_DimStyle *parent_style) const
ON::AnnotationType  | Type () const
bool  | UseKerning (const ON_DimStyle *parent_style) const
ON_DimStyle::suppress_zero  | ZeroSuppress (const ON_DimStyle *parent_style) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual int  | Dimension () const
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
virtual bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
virtual bool  | IsMorphable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | MakeDeformable ()
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
virtual bool  | Transform (const ON_Xform &xform)
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
virtual unsigned int  | SizeOf () const
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static void  | CalcTextFlip (const ON_3dVector &text_xdir, const ON_3dVector &text_ydir, const ON_3dVector &text_zdir, const ON_3dVector &view_xdir, const ON_3dVector &view_ydir, const ON_3dVector &view_zdir, const ON_Xform *model_xform, const double flip_tol, bool &flip_x, bool &flip_y)
static bool  | ClearRtfFmt (const wchar_t *fmt_str_on, const wchar_t *fmt_str_off, ON_wString &rtf_in)
static ON_Annotation *  | CreateFromV2Annotation (const class ON_OBSOLETE_V2_Annotation &V2_annotation, const class ON_3dmAnnotationContext *annotation_context)
static ON_Annotation *  | CreateFromV5Annotation (const class ON_OBSOLETE_V5_Annotation &V5_annotation, const class ON_3dmAnnotationContext *annotation_context)
static int  | FindRtfTable (ON_wString rtf_in, int startidx, const wchar_t *tablename)
static bool  | FirstCharTextProperties (const wchar_t *rtf_in, bool &bold, bool &italic, bool &underline, ON_wString &facename)
static ON_3dVector  | GetDefaultHorizontal (const ON_Plane &plane)
static bool  | SetAnnotationTextFormat (ON_wString &rtf_in, const wchar_t *fmt_str_on, const wchar_t *fmt_str_off, bool set_on)
static bool  | SetRtfFmt (ON_wString &rtf_in, const wchar_t *fmt_str)
 Protected Member Functions
ON_Annotation (const ON_Annotation &src)
ON_Annotation (ON::AnnotationType annotation_type)
~ON_Annotation ()
bool  | Internal_GetBBox_Begin (const ON_SHA1_Hash &hash, double *boxmin, double *boxmax, bool bGrow) const
bool  | Internal_GetBBox_End (const ON_BoundingBox &bbox, const ON_SHA1_Hash &hash, double *boxmin, double *boxmax, bool bGrow) const
const ON_SHA1_Hash  | Internal_GetBBox_InputHash (const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, const ON_2dPoint &text_point, unsigned int point_count, const ON_2dPoint *points) const
bool  | Internal_GetBBox_TextGlyphBox (const ON_Viewport *vp, const ON_DimStyle *dimstyle, double dimscale, ON_BoundingBox &text_glyph_box) const
bool  | Internal_ReadAnnotation (ON_BinaryArchive &archive)
void  | Internal_SetDimStyleFromV5Annotation (const class ON_OBSOLETE_V5_Annotation &V5_annotation, const class ON_3dmAnnotationContext *annotation_context)
bool  | Internal_WriteAnnotation (ON_BinaryArchive &archive) const
ON_Annotation &  | operator= (const ON_Annotation &src)
 Static Protected Member Functions
static bool  | Internal_IsOverrideDimStyleCandidate (const ON_DimStyle *override_style_candidate, ON_UUID parent_id, bool bRequireSetOverrides, bool bIssueErrorsAndWarnings)
 Protected Attributes
bool  | m_allow_text_scaling = true
ON::AnnotationType  | m_annotation_type = ON::AnnotationType::Unset
ON_UUID  | m_dimstyle_id = ON_DimStyle::Default.Id()
ON_2dVector  | m_horizontal_direction = ON_2dVector::XAxis
direction used as horizontal to draw annotation, especially text More...
ON_Plane  | m_plane = ON_Plane::World_xy
plane origin used for alignment point More...
unsigned char  | m_reserved2 = 0
unsigned char  | m_reserved3 = 0
unsigned int  | m_reserved4 = 0
ON_TextContent *  | m_text = nullptr
Deleted by ~ON_Annotation() More...
 Friends
class  | ON_Dimension
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_Annotation() [1/2]
 ON_Annotation::ON_Annotation  |  ( |  ON::AnnotationType  |  annotation_type | )
protected
◆ ON_Annotation() [2/2]
 ON_Annotation::ON_Annotation  |  ( |  const ON_Annotation &  |  src | )
protected
◆ ~ON_Annotation()
 ON_Annotation::~ON_Annotation  |  ( |   | )
protected
Member Function Documentation
◆ AllowTextScaling()
 bool ON_Annotation::AllowTextScaling  |  ( |   | ) |   const
These functions are being added to continue the V5 behavior of per-object text scaling. There is no user interface in V6 or V7 that shows this setting or that allows a user to change this setting. AllowTextScaling() = false means the effective dimstyle value of DimScale() (model space scale factor) is ignored (treated as if it were 1).
◆ Alternate()
 bool ON_Annotation::Alternate  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Additional measurement display toggle.
◆ AlternateBelow()
 bool ON_Annotation::AlternateBelow  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AlternateDimensionLengthDisplay()
 ON_DimStyle::LengthDisplay ON_Annotation::AlternateDimensionLengthDisplay  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AlternateDimensionLengthDisplayUnit()
 ON::LengthUnitSystem ON_Annotation::AlternateDimensionLengthDisplayUnit  |  ( |  const ON_DimStyle *  |  parent_style,
|  unsigned int  |  model_sn
) |   |  const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary>
◆ AlternateLengthFactor()
 double ON_Annotation::AlternateLengthFactor  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Distance scale factor for alternate display.
◆ AlternateLengthResolution()
 int ON_Annotation::AlternateLengthResolution  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Display resolution for alternate length measurements.
◆ AlternatePrefix()
 const wchar_t* ON_Annotation::AlternatePrefix  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Dimension alternate prefix text.
◆ AlternateRoundOff()
 double ON_Annotation::AlternateRoundOff  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AlternateSuffix()
 const wchar_t* ON_Annotation::AlternateSuffix  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Dimension alternate suffix text.
◆ AlternateToleranceResolution()
 int ON_Annotation::AlternateToleranceResolution  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AlternateZeroSuppress()
 ON_DimStyle::suppress_zero ON_Annotation::AlternateZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AngleFormat()
 ON_DimStyle::angle_format ON_Annotation::AngleFormat  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Angle units - Degrees, Degrees-Minutes-Seconds, Radians.
◆ AngleResolution()
 int ON_Annotation::AngleResolution  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Display resolution for angle measurements.
◆ AngleRoundOff()
 double ON_Annotation::AngleRoundOff  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AngleZeroSuppress()
 ON_DimStyle::suppress_zero ON_Annotation::AngleZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ AnyLengthFieldIsOverridden()
 bool ON_Annotation::AnyLengthFieldIsOverridden  |  ( |   | ) |   const
◆ ArcLengthSymbol()
 int ON_Annotation::ArcLengthSymbol  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ArrowBlockId1()
 ON_UUID ON_Annotation::ArrowBlockId1  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ArrowBlockId2()
 ON_UUID ON_Annotation::ArrowBlockId2  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ArrowSize()
 double ON_Annotation::ArrowSize  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Arrow size.
◆ ArrowType1()
 ON_Arrowhead::arrow_type ON_Annotation::ArrowType1  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ArrowType2()
 ON_Arrowhead::arrow_type ON_Annotation::ArrowType2  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ BaselineSpacing()
 double ON_Annotation::BaselineSpacing  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ CalcTextFlip()
 static void ON_Annotation::CalcTextFlip  |  ( |  const ON_3dVector &  |  text_xdir,
|  const ON_3dVector &  |  text_ydir,
|  const ON_3dVector &  |  text_zdir,
|  const ON_3dVector &  |  view_xdir,
|  const ON_3dVector &  |  view_ydir,
|  const ON_3dVector &  |  view_zdir,
|  const ON_Xform *  |  model_xform,
|  const double  |  flip_tol,
|  bool &  |  flip_x,
|  bool &  |  flip_y
)
static
◆ CenterMarkSize()
 double ON_Annotation::CenterMarkSize  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Centermark size.
◆ CenterMarkStyle()
 ON_DimStyle::centermark_style ON_Annotation::CenterMarkStyle  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Centermark style.
◆ ClearFieldOverride()
 void ON_Annotation::ClearFieldOverride  |  ( |  ON_DimStyle::field  |  field | )
◆ ClearOverrideDimensionStyle()
 void ON_Annotation::ClearOverrideDimensionStyle  |  ( |   | )
Description: Removes any override dimension style that is present.
◆ ClearRtfFmt()
 static bool ON_Annotation::ClearRtfFmt  |  ( |  const wchar_t *  |  fmt_str_on,
|  const wchar_t *  |  fmt_str_off,
|  ON_wString &  |  rtf_in
)
static
◆ ClearText()
 void ON_Annotation::ClearText  |  ( |   | ) |   const
◆ CreateFromV2Annotation()
 static ON_Annotation* ON_Annotation::CreateFromV2Annotation  |  ( |  const class ON_OBSOLETE_V2_Annotation &  |  V2_annotation,
|  const class ON_3dmAnnotationContext *  |  annotation_context
)
static
◆ CreateFromV5Annotation()
 static ON_Annotation* ON_Annotation::CreateFromV5Annotation  |  ( |  const class ON_OBSOLETE_V5_Annotation &  |  V5_annotation,
|  const class ON_3dmAnnotationContext *  |  annotation_context
)
static
◆ DecimalSeparator()
 wchar_t ON_Annotation::DecimalSeparator  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimensionLengthDisplay()
 ON_DimStyle::LengthDisplay ON_Annotation::DimensionLengthDisplay  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimensionLengthDisplayUnit()
 ON::LengthUnitSystem ON_Annotation::DimensionLengthDisplayUnit  |  ( |  const ON_DimStyle *  |  parent_style,
|  unsigned int  |  model_sn
) |   |  const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary>
◆ DimensionStyle() [1/2]
 const ON_DimStyle& ON_Annotation::DimensionStyle  |  ( |  const ON_DimStyle &  |  parent_dimstyle | ) |   const
Get the proper dimension style, including overrides, to use for this annotation object. If there is an override in place, that dimstyle will be returned If there is no override, the parent style passed in will be returned If the content of the parent style has changed since the override was made, the override style will be updated with the non-overriden values from
 the parent before returning. If your annotation object has an override style and you call either of these functions with a dimstyle other than the correct parent style for this annotation, the override style will be removed.
◆ DimensionStyle() [2/2]
 const ON_DimStyle& ON_Annotation::DimensionStyle  |  ( |  const ON_DimStyle &  |  parent_dimstyle,
|  bool  |  bForceOverrideUpdate
) |   |  const
◆ DimensionStyleId()
 ON_UUID ON_Annotation::DimensionStyleId  |  ( |   | ) |   const
Return the id of the main (parent) dimstyle used by this object. The style with this id should not be used directly if there is an override dimstyle present. Use this->DimensionStyle(parent_style) to get the effective dimstyle for this object.
◆ DimExtension()
 double ON_Annotation::DimExtension  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Extension of dimension line past extension lines.
◆ DimRadialTextAngleStyle()
 ON_DimStyle::ContentAngleStyle ON_Annotation::DimRadialTextAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimRadialTextLocation()
 ON_DimStyle::TextLocation ON_Annotation::DimRadialTextLocation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
The location of text relative to the dimension line in radial dimensions.
◆ DimRadialTextOrientation()
 ON::TextOrientation ON_Annotation::DimRadialTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimScale()
 double ON_Annotation::DimScale  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimStyleTextPositionPropertiesHash()
 ON_SHA1_Hash ON_Annotation::DimStyleTextPositionPropertiesHash  |  ( |   | ) |   const
virtual bool Explode( const ON_DimStyle* dimstyle, ON_SimpleArray<const ON_Geometry*> object_parts) const = 0; Returns: The value of ON_DimStyle.TextPositionPropertiesHash() from the dimension style used to calculate the runtime text position (location, glyphs, and size).
◆ DimTextAngleStyle()
 ON_DimStyle::ContentAngleStyle ON_Annotation::DimTextAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DimTextLocation()
 ON_DimStyle::TextLocation ON_Annotation::DimTextLocation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
The location of text relative to the dimension line in linear, angular, and ordinate dimensions.
◆ DimTextOrientation()
 ON::TextOrientation ON_Annotation::DimTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DrawForward()
 bool ON_Annotation::DrawForward  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ DrawTextMask()
 bool ON_Annotation::DrawTextMask  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Determines whether or not to draw a Text Mask.
◆ EqualTextPositionProperties()
 bool ON_Annotation::EqualTextPositionProperties  |  ( |  const class ON_DimStyle *  |  dimstyle | ) |   const
Returns: True if this text position information used to create this text is identical to the text position parameters on dimstyle.
◆ ExtensionLineExtension()
 double ON_Annotation::ExtensionLineExtension  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
These next several functions are to set overrides on individual annotation objects.
Extension line extension
◆ ExtensionLineOffset()
 double ON_Annotation::ExtensionLineOffset  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Extension line offset.
◆ FieldIsOverridden()
 bool ON_Annotation::FieldIsOverridden  |  ( |  ON_DimStyle::field  |  field | ) |   const
◆ FindRtfTable()
 static int ON_Annotation::FindRtfTable  |  ( |  ON_wString  |  rtf_in,
|  int  |  startidx,
|  const wchar_t *  |  tablename
)
static
◆ FirstCharFont()
 const ON_Font* ON_Annotation::FirstCharFont  |  ( |   | ) |   const
◆ FirstCharTextProperties()
 static bool ON_Annotation::FirstCharTextProperties  |  ( |  const wchar_t *  |  rtf_in,
|  bool &  |  bold,
|  bool &  |  italic,
|  bool &  |  underline,
|  ON_wString &  |  facename
)
static
◆ FixedExtensionLength()
 double ON_Annotation::FixedExtensionLength  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ FixedExtensionLengthOn()
 bool ON_Annotation::FixedExtensionLengthOn  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ Font()
 const class ON_Font& ON_Annotation::Font  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Returns: The managed font used to render text.
◆ FontCharacteristics()
 const class ON_Font& ON_Annotation::FontCharacteristics  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Returns: A copy of the font_characteristics information. Remarks: You probably want to use Font(). This function is only useful in isolated situations and is typically used to study font substitutions when a model moves between computers or platforms.
◆ FontSubstituted()
 const bool ON_Annotation::FontSubstituted  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Returns: True if the font returned by Font() is a substitute for the font passed to SetFont(). Remarks: Font substitution can occur when a model is moved between computers that have different fonts installed.
◆ FormattingRectangleWidth()
 double ON_Annotation::FormattingRectangleWidth  |  ( |   | ) |   const
FormattingRectangleWidth is a width set by text wrapping. It's in model units.
◆ GetAlignment()
 void ON_Annotation::GetAlignment  |  ( |  ON::TextHorizontalAlignment &  |  horz,
|  ON::TextVerticalAlignment &  |  vert
) |   |  const
Deprecated - Use ON::TextVerticalAlignment ON_Annotation::TextVerticalAlignment(const ON_DimStyle* parent_style) const; void ON_Annotation::SetTextVerticalAlignment(const ON_DimStyle* parent_style, ON::TextVerticalAlignment style); ON::TextVerticalAlignment ON_Annotation::LeaderVerticalAlignment(const ON_DimStyle* parent_style) const; void ON_Annotation::SetLeaderVerticalAlignment(const ON_DimStyle* parent_style, ON::TextVerticalAlignment style);
◆ GetAnnotationBoundingBox()
 virtual bool ON_Annotation::GetAnnotationBoundingBox  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrow = false
) |   |  const
pure virtual
Implemented in ON_Centermark, ON_DimOrdinate, ON_DimRadial, ON_DimAngular, ON_DimLinear, ON_Text, and ON_Leader.
◆ GetDefaultHorizontal()
 static ON_3dVector ON_Annotation::GetDefaultHorizontal  |  ( |  const ON_Plane &  |  plane | )
static
Returns a 2d vector to use as annotation horizontal Use this function when you don't have a known horizontal direction
◆ GetText3dCorners()
 bool ON_Annotation::GetText3dCorners  |  ( |  ON_3dPoint  |  corners[4] | ) |   const
Get corners of the whole text object corners requires space for 4 points
◆ GetTextGlyphBoxCorners()
 bool ON_Annotation::GetTextGlyphBoxCorners  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  ON_3dPoint  |  corners[8]
) |   |  const
Description: Like GetAnnotationBoundingBox() for the text glyph box, but returns the eight corners of the box in world space without collapsing them into a world axis-aligned box. The corners stay oriented to the text plane so a caller can compute a tight bounding box for an arbitrary frame (for example a plane-aligned bounding box) without it being oversized for tilted or skewed frames. Parameters: vp - [in] nullptr or viewport where annotation object is displayed dimstyle - [in] &this->DimensionStyle(const ON_DimStyle& parent_dimstyle) dimscale - [in] annotation scale to apply corners - [out] The eight oriented corners of the text glyph box in world coordinates. Returns: True if the text glyph box is non-empty and corners[] is set.
◆ GetTextGlyphContours()
 bool ON_Annotation::GetTextGlyphContours  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  bool  |  bApplyDimStyleDimScale,
|  bool  |  bSingleStrokeFont,
|  ON_ClassArray< ON_ClassArray< ON_SimpleArray< ON_Curve * > > > &  |  text_contours
) |   |  const
Parameters: vp - [in] nullptr or viewport where annotation object is displayed dimstyle - [in] &this->DimensionStyle(const ON_DimStyle& parent_dimstyle) bApplyDimStyleDimScale - [in] If true, dimsytyle->DimScale() is applied. If vp is a page view, bApplyDimStyleDimScale is generally false. If vp is a model view, bApplyDimStyleDimScale is generally the value of a model property IsAnnotationScalingEnabled(). from bSingleStrokeFont - [in] True if text uses a single font that is a single stroke font and returned contours should be left open. text_contours - [out]
◆ GetTextXform() [1/2]
 virtual bool ON_Annotation::GetTextXform  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  ON_Xform &  |  text_xform_out
) |   |  const
pure virtual
Implemented in ON_DimOrdinate, ON_DimRadial, ON_DimAngular, ON_DimLinear, ON_Text, ON_Leader, and ON_Centermark.
◆ GetTextXform() [2/2]
 bool ON_Annotation::GetTextXform  |  ( |  const ON_Xform *  |  model_xform,
|  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  ON_Xform &  |  text_xform_out
) |   |  const
◆ HasDimensionStyleOverrides()
 bool ON_Annotation::HasDimensionStyleOverrides  |  ( |   | ) |   const
Quickly check if this annotation object has style overrides applied.
◆ HorizontalDirection()
 const ON_2dVector ON_Annotation::HorizontalDirection  |  ( |   | ) |   const
◆ Internal_GetBBox_Begin()
 bool ON_Annotation::Internal_GetBBox_Begin  |  ( |  const ON_SHA1_Hash &  |  hash,
|  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrow
) |   |  const
protected
Returns: True if a cached bounding box was found and boxmin, boxmax are set.
◆ Internal_GetBBox_End()
 bool ON_Annotation::Internal_GetBBox_End  |  ( |  const ON_BoundingBox &  |  bbox,
|  const ON_SHA1_Hash &  |  hash,
|  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrow
) |   |  const
protected
Returns: True if a boxmin, boxmax is a valid bounding box
◆ Internal_GetBBox_InputHash()
 const ON_SHA1_Hash ON_Annotation::Internal_GetBBox_InputHash  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  const ON_2dPoint &  |  text_point,
|  unsigned int  |  point_count,
|  const ON_2dPoint *  |  points
) |   |  const
protected
Parameters: vp - [in] nullptr or viewport where annotation object is displayed dimstyle - [in] &this->DimensionStyle(const ON_DimStyle& parent_dimstyle)
◆ Internal_GetBBox_TextGlyphBox()
 bool ON_Annotation::Internal_GetBBox_TextGlyphBox  |  ( |  const ON_Viewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle,
|  double  |  dimscale,
|  ON_BoundingBox &  |  text_glyph_box
) |   |  const
protected
Parameters: vp - [in] nullptr or viewport where annotation object is displayed dimstyle - [in] &this->DimensionStyle(const ON_DimStyle& parent_dimstyle)
◆ Internal_IsOverrideDimStyleCandidate()
 static bool ON_Annotation::Internal_IsOverrideDimStyleCandidate  |  ( |  const ON_DimStyle *  |  override_style_candidate,
|  ON_UUID  |  parent_id,
|  bool  |  bRequireSetOverrides,
|  bool  |  bIssueErrorsAndWarnings
)
staticprotected
◆ Internal_ReadAnnotation()
 bool ON_Annotation::Internal_ReadAnnotation  |  ( |  ON_BinaryArchive &  |  archive | )
protected
◆ Internal_SetDimStyleFromV5Annotation()
 void ON_Annotation::Internal_SetDimStyleFromV5Annotation  |  ( |  const class ON_OBSOLETE_V5_Annotation &  |  V5_annotation,
|  const class ON_3dmAnnotationContext *  |  annotation_context
)
protected
◆ Internal_WriteAnnotation()
 bool ON_Annotation::Internal_WriteAnnotation  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
protected
◆ IsAllBold()
 bool ON_Annotation::IsAllBold  |  ( |   | ) |   const
true if all of the text is bold
◆ IsAllItalic()
 bool ON_Annotation::IsAllItalic  |  ( |   | ) |   const
true if all of the text is italic
◆ IsAllUnderlined()
 bool ON_Annotation::IsAllUnderlined  |  ( |   | ) |   const
true if all of the text is underlined
◆ IsOverrideDimStyleCandidate()
 bool ON_Annotation::IsOverrideDimStyleCandidate  |  ( |  const ON_DimStyle *  |  override_style_candidate,
|  bool  |  bRequireSetOverrides
) |   |  const
Description: A valid override dimstyle candidate has all of the following properties. override_style_candidate != nullptr. IsDeleted() = false; Id() = ON_nil_uuid; Name() is empty. Index() = ON_ModelComponent::Unset.Index() bRequireSetOverrides is false or HasOverrides() returns true. Parameters: override_style_candidate -[in] style candidate to evaluate. bRequireSetOverrides - [in] If bRequireSetOverrides is true, then override_style_candidate->HasOverrides() must be true for a valid candidate. If bRequireSetOverrides is false, then override_style_candidate->HasOverrides() can have any value. Returns: True if override_style could be successfully used as the parameter to SetOverrideDimensionStyle.
◆ IsOverrideStylePointer()
 bool ON_Annotation::IsOverrideStylePointer  |  ( |  const ON_DimStyle *  |  ptr | ) |   const
Parameters: ptr - [in] pointer to test Returns: True if ptr is not nullptr and points to the override style managed by this instance.
◆ IsValid()
 bool ON_Annotation::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
Reimplemented in ON_Dimension, ON_Leader, and ON_Text.
◆ LeaderArrowBlockId()
 ON_UUID ON_Annotation::LeaderArrowBlockId  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderArrowSize()
 double ON_Annotation::LeaderArrowSize  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Arrow size.
◆ LeaderArrowType()
 ON_Arrowhead::arrow_type ON_Annotation::LeaderArrowType  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderContentAngleDegrees()
 double ON_Annotation::LeaderContentAngleDegrees  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderContentAngleRadians()
 double ON_Annotation::LeaderContentAngleRadians  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderContentAngleStyle()
 ON_DimStyle::ContentAngleStyle ON_Annotation::LeaderContentAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderCurveType()
 ON_DimStyle::leader_curve_type ON_Annotation::LeaderCurveType  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderHasLanding()
 bool ON_Annotation::LeaderHasLanding  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderLandingLength()
 double ON_Annotation::LeaderLandingLength  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderTextHorizontalAlignment()
 ON::TextHorizontalAlignment ON_Annotation::LeaderTextHorizontalAlignment  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderTextOrientation()
 ON::TextOrientation ON_Annotation::LeaderTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LeaderTextVerticalAlignment()
 ON::TextVerticalAlignment ON_Annotation::LeaderTextVerticalAlignment  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ LengthFactor()
 double ON_Annotation::LengthFactor  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Scale factor for displayed distances.
◆ LengthResolution()
 int ON_Annotation::LengthResolution  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Display resolution for distance measurements.
◆ LineSpaceScale()
 double ON_Annotation::LineSpaceScale  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ MaskBorder()
 double ON_Annotation::MaskBorder  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Offset for the border around text to the rectangle used to draw the mask This number is the offset on each side of the tight rectangle around the text characters to the mask rectangle.
◆ MaskColor()
 ON_Color ON_Annotation::MaskColor  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Only works right if MaskColorSource returns 1.
◆ MaskFillType()
 ON_TextMask::MaskType ON_Annotation::MaskFillType  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Determines where to get the color to draw a Text Mask.
◆ MaskFrameType()
 ON_TextMask::MaskFrame ON_Annotation::MaskFrameType  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Determines whether to draw a frame around a text mask.
◆ ObjectType()
 ON::object_type ON_Annotation::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: Useful for switch statements that need to differentiate between basic object types like points, curves, surfaces, and so on.
Returns: ON::object_type enum value.
Remarks: The default implementation of this virtual function returns ON::unknown_object_type
Reimplemented from ON_Object.
Reimplemented in ON_Leader.
◆ operator=()
 ON_Annotation& ON_Annotation::operator=  |  ( |  const ON_Annotation &  |  src | )
protected
◆ PlainText()
 const ON_wString ON_Annotation::PlainText  |  ( |   | ) |   const
Returns: Text information with rich text formatting instructions removed. Fields are not evaluated.
◆ PlainTextWithFields() [1/2]
 const ON_wString ON_Annotation::PlainTextWithFields  |  ( |   | ) |   const
Returns: Text information with rich text formatting instructions removed. The result string from evaluating fields is included Field results may be cached from previous evaluation
◆ PlainTextWithFields() [2/2]
 const ON_wString ON_Annotation::PlainTextWithFields  |  ( |  ON_SimpleArray< ON_3dex > *  |  runmap | ) |   const
Finds the positions and lengths of substrings in the string returned by PlainTextWithFields() That string is the plain text (no rtf formatting) with field source unevaluated Each 3dex in the array is i: run index, j: position in the string where text from run[i] starts, k: length of text from run[i]
Returns the same string that PlainTextWithFields() returns
◆ Plane()
 const ON_Plane& ON_Annotation::Plane  |  ( |   | ) |   const
◆ Prefix()
 const wchar_t* ON_Annotation::Prefix  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Dimension prefix text.
◆ ReplaceTextString()
 bool ON_Annotation::ReplaceTextString  |  ( |  const wchar_t *  |  RtfString,
|  const ON_DimStyle *  |  dimstyle
)
◆ RichText()
 const ON_wString ON_Annotation::RichText  |  ( |   | ) |   const
Returns: Rich text that can contain rich text formatting instructions.
◆ RoundOff()
 double ON_Annotation::RoundOff  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ RtfText()
 const wchar_t* ON_Annotation::RtfText  |  ( |   | ) |   const
◆ RunReplaceString()
 bool ON_Annotation::RunReplaceString  |  ( |  const ON_DimStyle *  |  dimstyle,
|  const wchar_t *  |  str,
|  int  |  start_run_idx,
|  int  |  start_run_pos,
|  int  |  end_run_idx,
|  int  |  end_run_pos
)
◆ ScaleOverrideDimstyle() [1/2]
 void ON_Annotation::ScaleOverrideDimstyle  |  ( |  const ON_DimStyle *  |  parent_dimstyle,
|  double  |  scale
)
Description: Conceptually, calling this function applies ON_DimsStyle(scale) to the dimstyle information used for this annotation.
When an annotation object is in layout/page space, this is the only way top get properties like TextHeight() to scale properly.
When an annotation object is in model space and model space scaling is enabled**, then calling this->SetDimScale(this->DimScale()*scale) will work as well.
Parameters: parent_dimstyle - [in] scale - [in]
◆ ScaleOverrideDimstyle() [2/2]
 void ON_Annotation::ScaleOverrideDimstyle  |  ( |  const ON_DimStyle *  |  parent_dimstyle,
|  double  |  scale,
|  bool  |  only_overrides
)
◆ SetAlignment()
 void ON_Annotation::SetAlignment  |  ( |  ON::TextHorizontalAlignment  |  horz,
|  ON::TextVerticalAlignment  |  vert
)
◆ SetAllowTextScaling()
 void ON_Annotation::SetAllowTextScaling  |  ( |  bool  |  scale | )
◆ SetAlternate()
 void ON_Annotation::SetAlternate  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool
)
◆ SetAlternateBelow()
 void ON_Annotation::SetAlternateBelow  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  below
)
◆ SetAlternateDimensionLengthDisplay()
 void ON_Annotation::SetAlternateDimensionLengthDisplay  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::LengthDisplay  |  length_display
)
◆ SetAlternateLengthFactor()
 void ON_Annotation::SetAlternateLengthFactor  |  ( |  const ON_DimStyle *  |  parent_style,
|  double
)
◆ SetAlternateLengthResolution()
 void ON_Annotation::SetAlternateLengthResolution  |  ( |  const ON_DimStyle *  |  parent_style,
|  int
)
◆ SetAlternatePrefix()
 void ON_Annotation::SetAlternatePrefix  |  ( |  const ON_DimStyle *  |  parent_style,
|  const wchar_t *
)
◆ SetAlternateRoundOff()
 void ON_Annotation::SetAlternateRoundOff  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  r
)
◆ SetAlternateSuffix()
 void ON_Annotation::SetAlternateSuffix  |  ( |  const ON_DimStyle *  |  parent_style,
|  const wchar_t *
)
◆ SetAlternateToleranceResolution()
 void ON_Annotation::SetAlternateToleranceResolution  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  r
)
◆ SetAlternateZeroSuppress()
 void ON_Annotation::SetAlternateZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::suppress_zero  |  s
)
◆ SetAngleFormat()
 void ON_Annotation::SetAngleFormat  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::angle_format  |  format
)
◆ SetAngleResolution()
 void ON_Annotation::SetAngleResolution  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  r
)
◆ SetAngleRoundOff()
 void ON_Annotation::SetAngleRoundOff  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  r
)
◆ SetAngleZeroSuppress()
 void ON_Annotation::SetAngleZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::suppress_zero  |  s
)
◆ SetAnnotationBold()
 bool ON_Annotation::SetAnnotationBold  |  ( |  bool  |  bold,
|  const ON_DimStyle *  |  dimstyle
)
◆ SetAnnotationFacename()
 bool ON_Annotation::SetAnnotationFacename  |  ( |  bool  |  set_or_clear,
|  const wchar_t *  |  facename,
|  const ON_DimStyle *  |  parent_style
)
◆ SetAnnotationFont() [1/3]
 bool ON_Annotation::SetAnnotationFont  |  ( |  const ON_Font *  |  font,
|  const ON_DimStyle *  |  parent_style
)
◆ SetAnnotationFont() [2/3]
 bool ON_Annotation::SetAnnotationFont  |  ( |  const ON_Font *  |  font,
|  const ON_DimStyle *  |  parent_style,
|  bool  |  keep_overrides
)
◆ SetAnnotationFont() [3/3]
 bool ON_Annotation::SetAnnotationFont  |  ( |  const ON_Font *  |  font,
|  const ON_DimStyle *  |  parent_style,
|  bool  |  keep_overrides,
|  const ON_Font *  |  old_font
)
◆ SetAnnotationItalic()
 bool ON_Annotation::SetAnnotationItalic  |  ( |  bool  |  italic,
|  const ON_DimStyle *  |  dimstyle
)
◆ SetAnnotationTextFormat()
 static bool ON_Annotation::SetAnnotationTextFormat  |  ( |  ON_wString &  |  rtf_in,
|  const wchar_t *  |  fmt_str_on,
|  const wchar_t *  |  fmt_str_off,
|  bool  |  set_on
)
static
◆ SetAnnotationUnderline()
 bool ON_Annotation::SetAnnotationUnderline  |  ( |  bool  |  underline,
|  const ON_DimStyle *  |  dimstyle
)
◆ SetArcLengthSymbol()
 void ON_Annotation::SetArcLengthSymbol  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  m
)
◆ SetArrowBlockId1()
 void ON_Annotation::SetArrowBlockId1  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_UUID  |  id
)
◆ SetArrowBlockId2()
 void ON_Annotation::SetArrowBlockId2  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_UUID  |  id
)
◆ SetArrowSize()
 void ON_Annotation::SetArrowSize  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  d
)
◆ SetArrowType1()
 void ON_Annotation::SetArrowType1  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_Arrowhead::arrow_type
)
◆ SetArrowType1And2()
 void ON_Annotation::SetArrowType1And2  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_Arrowhead::arrow_type
)
◆ SetArrowType2()
 void ON_Annotation::SetArrowType2  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_Arrowhead::arrow_type
)
◆ SetBaselineSpacing()
 void ON_Annotation::SetBaselineSpacing  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  spacing
)
◆ SetCenterMarkSize()
 void ON_Annotation::SetCenterMarkSize  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  d
)
◆ SetCenterMarkStyle()
 void ON_Annotation::SetCenterMarkStyle  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::centermark_style  |  style
)
◆ SetDecimalSeparator()
 void ON_Annotation::SetDecimalSeparator  |  ( |  const ON_DimStyle *  |  parent_style,
|  wchar_t  |  separator
)
◆ SetDimensionLengthDisplay()
 void ON_Annotation::SetDimensionLengthDisplay  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::LengthDisplay  |  length_display
)
◆ SetDimensionStyleId() [1/2]
 void ON_Annotation::SetDimensionStyleId  |  ( |  const class ON_DimStyle &  |  dim_style | )
parameters: dim_style - [in] If dim_style.ParentId() is nil, then this function calls SetDimensionStyleId(dim_style.Id()) and returns. If dim_style.ParentId() is not nil, then this functions calls SetDimensionStyleId(dim_style.ParentId()) and uses a copy of dim_style as the override dimstyle.
◆ SetDimensionStyleId() [2/2]
 void ON_Annotation::SetDimensionStyleId  |  ( |  ON_UUID  |  dimstyle_id | )
Sets the id of the main (parent) dimstyle used by this annotation object Any override dimstyle on this object will be deleted when this is called, resetting any style overrides.
◆ SetDimensionStyleIdForExperts()
 void ON_Annotation::SetDimensionStyleIdForExperts  |  ( |  ON_UUID  |  dimstyle_id,
|  bool  |  bKeepOverrides
)
Description: Set the id of the main (parent) dimstyle used by this annotation object and allow an expert user to control what happens to style override settings in cases where id collisions occur and ids need to be changed. Parameters: bKeepOverrides - [in] If you are not an expert coding something low level and complicated, then call SetDimensionStyleId(dimstyle_id) or pass bKeepOverrides = false.
If bKeepOverrides is true and dimstyle_id is not nil and this object has valid overrides, those overrides are retained. In all other cases, any existing overrides are deleted.
◆ SetDimExtension()
 void ON_Annotation::SetDimExtension  |  ( |  const ON_DimStyle *  |  parent_style,
|  const double  |  e
)
◆ SetDimRadialTextAngleStyle()
 void ON_Annotation::SetDimRadialTextAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::ContentAngleStyle  |  style
)
◆ SetDimRadialTextLocation()
 void ON_Annotation::SetDimRadialTextLocation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::TextLocation  |  dim_text_location
)
◆ SetDimRadialTextOrientation()
 void ON_Annotation::SetDimRadialTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextOrientation  |  orientation
)
◆ SetDimScale()
 void ON_Annotation::SetDimScale  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  scale
)
◆ SetDimTextAngleStyle()
 void ON_Annotation::SetDimTextAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::ContentAngleStyle  |  style
)
◆ SetDimTextLocation()
 void ON_Annotation::SetDimTextLocation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::TextLocation  |  dim_text_location
)
◆ SetDimTextOrientation()
 void ON_Annotation::SetDimTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextOrientation  |  orientation
)
◆ SetDrawForward()
 void ON_Annotation::SetDrawForward  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  drawforward
)
◆ SetDrawTextMask()
 void ON_Annotation::SetDrawTextMask  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  bDraw
)
◆ SetExtensionLineExtension()
 void ON_Annotation::SetExtensionLineExtension  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  d
)
◆ SetExtensionLineOffset()
 void ON_Annotation::SetExtensionLineOffset  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  d
)
◆ SetFixedExtensionLength()
 void ON_Annotation::SetFixedExtensionLength  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  l
)
◆ SetFixedExtensionLengthOn()
 void ON_Annotation::SetFixedExtensionLengthOn  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  on
)
◆ SetFont()
 void ON_Annotation::SetFont  |  ( |  const ON_DimStyle *  |  parent_style,
|  const class ON_Font &  |  font_characteristics
)
Description: Set the font used to render text. Parameters: font_characteristics - [in] This parameter does not have to be a managed font. Remarks: If the parameter is a managed font (font_characteristics.IsManagedFont() is true), then the identical value is returned by ON_DimStyle.Font(). If the parameter is not a managed font (font_characteristics.IsManagedFont() is false), then the ON_Font::GetManagedFont(font_characteristics) will be returned by ON_DimStyle.Font().
◆ SetFormattingRectangleWidth()
 void ON_Annotation::SetFormattingRectangleWidth  |  ( |  double  |  width | )
◆ SetHorizontalDirection()
 void ON_Annotation::SetHorizontalDirection  |  ( |  ON_2dVector  |   | )
◆ SetLeaderArrowBlockId()
 void ON_Annotation::SetLeaderArrowBlockId  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_UUID  |  id
)
◆ SetLeaderArrowSize()
 void ON_Annotation::SetLeaderArrowSize  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  d
)
◆ SetLeaderArrowType()
 void ON_Annotation::SetLeaderArrowType  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_Arrowhead::arrow_type
)
◆ SetLeaderContentAngleDegrees()
 void ON_Annotation::SetLeaderContentAngleDegrees  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  angle_degrees
)
◆ SetLeaderContentAngleRadians()
 void ON_Annotation::SetLeaderContentAngleRadians  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  angle_radians
)
◆ SetLeaderContentAngleStyle()
 void ON_Annotation::SetLeaderContentAngleStyle  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::ContentAngleStyle  |  style
)
◆ SetLeaderCurveType()
 void ON_Annotation::SetLeaderCurveType  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::leader_curve_type  |  type
)
◆ SetLeaderHasLanding()
 void ON_Annotation::SetLeaderHasLanding  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  landing
)
◆ SetLeaderLandingLength()
 void ON_Annotation::SetLeaderLandingLength  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  length
)
◆ SetLeaderTextHorizontalAlignment()
 void ON_Annotation::SetLeaderTextHorizontalAlignment  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextHorizontalAlignment  |  halign
)
◆ SetLeaderTextOrientation()
 void ON_Annotation::SetLeaderTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextOrientation  |  orientation
)
◆ SetLeaderTextVerticalAlignment()
 void ON_Annotation::SetLeaderTextVerticalAlignment  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextVerticalAlignment  |  style
)
◆ SetLengthFactor()
 void ON_Annotation::SetLengthFactor  |  ( |  const ON_DimStyle *  |  parent_style,
|  double
)
◆ SetLengthResolution()
 void ON_Annotation::SetLengthResolution  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  r
)
◆ SetLineSpaceScale()
 void ON_Annotation::SetLineSpaceScale  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  scale
)
◆ SetMaskBorder()
 void ON_Annotation::SetMaskBorder  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  offset
)
◆ SetMaskColor()
 void ON_Annotation::SetMaskColor  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_Color  |  color
)
Does not return viewport background color.
◆ SetMaskFillType()
 void ON_Annotation::SetMaskFillType  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_TextMask::MaskType  |  source
)
◆ SetMaskFrameType()
 void ON_Annotation::SetMaskFrameType  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_TextMask::MaskFrame  |  source
)
◆ SetOverrideDimensionStyle() [1/2]
 bool ON_Annotation::SetOverrideDimensionStyle  |  ( |  const ON_DimStyle *  |  override_style_candidate,
|  bool  |  bRequireSetOverrides
)
Description: If this->IsOverrideDimStyleCandidate(override_style_candidate,bRequireSetOverrides) is true, then a managed copy of override_style_candidate is set as an override. Returns: True if an override is set.
◆ SetOverrideDimensionStyle() [2/2]
 bool ON_Annotation::SetOverrideDimensionStyle  |  ( |  ON_DimStyle *&  |  override_style | ) |   const
Apply a dimstyle with overrides set to this annotation object.
Use ON_Annotation::IsOverrideDimStyleCandidate() to determine if a non-nullptr override_style is a valid to be used to set overrides.
The override dimstyle memory will be managed and deleted by the annotation object and must have been allocated using new. On return, if this function returns true, The dimstyle id of the annotation object must be set before this function is called. Calling SetOverrideDimensionStyle(nullptr) will remove all overrides for this object. override_dimstyle will be null.
Returns: true if the override style was successfully set false if this->m_dimstyle_id is ON_nil_uuid causing failure
◆ SetPlane()
 void ON_Annotation::SetPlane  |  ( |  const ON_Plane &  |  plane | )
◆ SetPrefix()
 void ON_Annotation::SetPrefix  |  ( |  const ON_DimStyle *  |  parent_style,
|  const wchar_t *
)
◆ SetRoundOff()
 void ON_Annotation::SetRoundOff  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  r
)
◆ SetRtfFmt()
 static bool ON_Annotation::SetRtfFmt  |  ( |  ON_wString &  |  rtf_in,
|  const wchar_t *  |  fmt_str
)
static
◆ SetSignedOrdinate()
 void ON_Annotation::SetSignedOrdinate  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  allowsigned
)
◆ SetStackFractionFormat()
 void ON_Annotation::SetStackFractionFormat  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::stack_format  |  f
)
◆ SetStackHeightScale()
 void ON_Annotation::SetStackHeightScale  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  f
)
◆ SetSuffix()
 void ON_Annotation::SetSuffix  |  ( |  const ON_DimStyle *  |  parent_style,
|  const wchar_t *
)
◆ SetSuppressArrow1()
 void ON_Annotation::SetSuppressArrow1  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  s
)
◆ SetSuppressArrow2()
 void ON_Annotation::SetSuppressArrow2  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  s
)
◆ SetSuppressDimLine1()
 void ON_Annotation::SetSuppressDimLine1  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  b
)
◆ SetSuppressDimLine2()
 void ON_Annotation::SetSuppressDimLine2  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  b
)
◆ SetSuppressExtension1()
 void ON_Annotation::SetSuppressExtension1  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  b
)
◆ SetSuppressExtension2()
 void ON_Annotation::SetSuppressExtension2  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  b
)
◆ SetText() [1/2]
 void ON_Annotation::SetText  |  ( |  const ON_TextRunArray &  |  runs | ) |   const
◆ SetText() [2/2]
 void ON_Annotation::SetText  |  ( |  ON_TextContent *&  |  text | ) |   const
◆ SetTextGap()
 void ON_Annotation::SetTextGap  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  gap
)
◆ SetTextHeight()
 void ON_Annotation::SetTextHeight  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  height
)
◆ SetTextHorizontalAlignment()
 void ON_Annotation::SetTextHorizontalAlignment  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextHorizontalAlignment  |  halign
)
◆ SetTextMask()
 void ON_Annotation::SetTextMask  |  ( |  const ON_DimStyle *  |  parent_style,
|  const ON_TextMask &  |  mask
)
The ON_TextMask class contains the property values for DrawTextMask() MaskColor() MaskFillType() MaskBorder() Use the DrawTextMask() MaskColor() MaskFillType() MaskBorder() functions to query individual text mask properties.
◆ SetTextMoveLeader()
 void ON_Annotation::SetTextMoveLeader  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  m
)
◆ SetTextOrientation()
 void ON_Annotation::SetTextOrientation  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextOrientation  |  orientation
)
◆ SetTextRotationDegrees()
 virtual void ON_Annotation::SetTextRotationDegrees  |  ( |  double  |  rotation | )
virtual
◆ SetTextRotationRadians()
 virtual void ON_Annotation::SetTextRotationRadians  |  ( |  double  |  rotation | )
virtual
◆ SetTextUnderlined()
 void ON_Annotation::SetTextUnderlined  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  underlined
)
◆ SetTextVerticalAlignment()
 void ON_Annotation::SetTextVerticalAlignment  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON::TextVerticalAlignment  |  style
)
◆ SetToleranceFormat()
 void ON_Annotation::SetToleranceFormat  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::tolerance_format  |  format
)
◆ SetToleranceHeightScale()
 void ON_Annotation::SetToleranceHeightScale  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  scale
)
◆ SetToleranceLowerValue()
 void ON_Annotation::SetToleranceLowerValue  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  lower_value
)
◆ SetToleranceResolution()
 void ON_Annotation::SetToleranceResolution  |  ( |  const ON_DimStyle *  |  parent_style,
|  int  |  resolution
)
◆ SetToleranceUpperValue()
 void ON_Annotation::SetToleranceUpperValue  |  ( |  const ON_DimStyle *  |  parent_style,
|  double  |  upper_value
)
◆ SetToleranceZeroSuppress()
 void ON_Annotation::SetToleranceZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::suppress_zero  |  s
)
OBSOLETE - The ZeroSuppress() or AlternateZeroSuppress() property is used to format tolerance display. ToleranceZeroSuppress() is ignored.
◆ SetUseKerning()
 void ON_Annotation::SetUseKerning  |  ( |  const ON_DimStyle *  |  parent_style,
|  bool  |  enabled
)
◆ SetZeroSuppress()
 void ON_Annotation::SetZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style,
|  ON_DimStyle::suppress_zero  |  s
)
◆ SignedOrdinate()
 bool ON_Annotation::SignedOrdinate  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ StackFractionFormat()
 ON_DimStyle::stack_format ON_Annotation::StackFractionFormat  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ StackHeightScale()
 double ON_Annotation::StackHeightScale  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ Suffix()
 const wchar_t* ON_Annotation::Suffix  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Dimension suffix text.
◆ SuppressArrow1()
 bool ON_Annotation::SuppressArrow1  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ SuppressArrow2()
 bool ON_Annotation::SuppressArrow2  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ SuppressDimLine1()
 bool ON_Annotation::SuppressDimLine1  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Suppress the dimension line and arrowhead between the first extension line and the text.
◆ SuppressDimLine2()
 bool ON_Annotation::SuppressDimLine2  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Suppress the dimension line and arrowhead between the second extension line and the text.
◆ SuppressExtension1()
 bool ON_Annotation::SuppressExtension1  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Suppress first dimension extension line.
◆ SuppressExtension2()
 bool ON_Annotation::SuppressExtension2  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Suppress second dimension extension line.
◆ Text() [1/2]
 ON_TextContent* ON_Annotation::Text  |  ( |   | )
◆ Text() [2/2]
 const ON_TextContent* ON_Annotation::Text  |  ( |   | ) |   const
◆ TextGap()
 double ON_Annotation::TextGap  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Distance from dimension lines to text.
◆ TextHeight()
 double ON_Annotation::TextHeight  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Height of dimension text.
◆ TextHorizontalAlignment()
 ON::TextHorizontalAlignment ON_Annotation::TextHorizontalAlignment  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ TextMoveLeader()
 int ON_Annotation::TextMoveLeader  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ TextOrientation()
 ON::TextOrientation ON_Annotation::TextOrientation  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ TextRotationDegrees()
 virtual double ON_Annotation::TextRotationDegrees  |  ( |   | ) |   const
virtual
return angle in degrees between text plane and object plane
◆ TextRotationRadians()
 virtual double ON_Annotation::TextRotationRadians  |  ( |   | ) |   const
virtual
return angle in radians between text plane and object plane
◆ TextUnderlined()
 bool ON_Annotation::TextUnderlined  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ TextVerticalAlignment()
 ON::TextVerticalAlignment ON_Annotation::TextVerticalAlignment  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceFormat()
 ON_DimStyle::tolerance_format ON_Annotation::ToleranceFormat  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceHeightScale()
 double ON_Annotation::ToleranceHeightScale  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceLowerValue()
 double ON_Annotation::ToleranceLowerValue  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceResolution()
 int ON_Annotation::ToleranceResolution  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceUpperValue()
 double ON_Annotation::ToleranceUpperValue  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ToleranceZeroSuppress()
 ON_DimStyle::suppress_zero ON_Annotation::ToleranceZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
OBSOLETE - The ZeroSuppress() or AlternateZeroSuppress() property is used to format tolerance display. ToleranceZeroSuppress() is ignored.
◆ Type()
 ON::AnnotationType ON_Annotation::Type  |  ( |   | ) |   const
Returns: An ON::AnnotationType value that indicates the type of the annotation.
◆ UseKerning()
 bool ON_Annotation::UseKerning  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
◆ ZeroSuppress()
 ON_DimStyle::suppress_zero ON_Annotation::ZeroSuppress  |  ( |  const ON_DimStyle *  |  parent_style | ) |   const
Friends And Related Function Documentation
◆ ON_Dimension
 friend class ON_Dimension
friend
Member Data Documentation
◆ m_allow_text_scaling
 bool ON_Annotation::m_allow_text_scaling = true
protected
◆ m_annotation_type
 ON::AnnotationType ON_Annotation::m_annotation_type = ON::AnnotationType::Unset
protected
◆ m_dimstyle_id
 ON_UUID ON_Annotation::m_dimstyle_id = ON_DimStyle::Default.Id()
protected
◆ m_horizontal_direction
 ON_2dVector ON_Annotation::m_horizontal_direction = ON_2dVector::XAxis
protected
direction used as horizontal to draw annotation, especially text
◆ m_plane
 ON_Plane ON_Annotation::m_plane = ON_Plane::World_xy
protected
plane origin used for alignment point
◆ m_reserved2
 unsigned char ON_Annotation::m_reserved2 = 0
protected
◆ m_reserved3
 unsigned char ON_Annotation::m_reserved3 = 0
protected
◆ m_reserved4
 unsigned int ON_Annotation::m_reserved4 = 0
protected
◆ m_text
 ON_TextContent* ON_Annotation::m_text = nullptr
mutableprotected
Deleted by ~ON_Annotation()