Public Member Functions | Protected Member Functions | List of all members
CRhinoUiInPlaceEdit Class Reference
RhinoUI
#include <RhinoSdkUiInPlaceCtrls.h>
 Inheritance diagram for CRhinoUiInPlaceEdit:
 Public Member Functions
CRhinoUiInPlaceEdit ()
virtual  | ~CRhinoUiInPlaceEdit ()
void  | Hide ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg UINT  | OnGetDlgCode ()
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | SetParentMessageWnd (HWND hWnd)
void  | Show (CRect rcEdit)
 Protected Member Functions
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// In-place control events:
VK_RETURN, VK_ESCAPE -> IPEK_KEY
Button click -> IPEK_ACTION
WM_KILLFOCUS ->IPEK_FOCUS CRhinoUiInPlaceEdit
Constructor & Destructor Documentation
◆ CRhinoUiInPlaceEdit()
 CRhinoUiInPlaceEdit::CRhinoUiInPlaceEdit  |  ( |   | )
◆ ~CRhinoUiInPlaceEdit()
 virtual CRhinoUiInPlaceEdit::~CRhinoUiInPlaceEdit  |  ( |   | )
virtual
Member Function Documentation
◆ Hide()
 void CRhinoUiInPlaceEdit::Hide  |  ( |   | )
◆ OnCreate()
 afx_msg int CRhinoUiInPlaceEdit::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnGetDlgCode()
 afx_msg UINT CRhinoUiInPlaceEdit::OnGetDlgCode  |  ( |   | )
◆ OnKeyDown()
 afx_msg void CRhinoUiInPlaceEdit::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnKillFocus()
 afx_msg void CRhinoUiInPlaceEdit::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiInPlaceEdit::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiInPlaceEdit::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ SetParentMessageWnd()
 void CRhinoUiInPlaceEdit::SetParentMessageWnd  |  ( |  HWND  |  hWnd | )
◆ Show()
 void CRhinoUiInPlaceEdit::Show  |  ( |  CRect  |  rcEdit | )