Public Member Functions | List of all members
CRhinoSelSubObjectCommand Class Referenceabstract
Rhino
#include <rhinoSdkCommand.h>
 Inheritance diagram for CRhinoSelSubObjectCommand:
 Public Member Functions
CRhinoSelSubObjectCommand (const class CRhinoPlugIn *pPlugIn=nullptr, bool bTestCommand=false)
CRhinoCommand::result  | RunCommand (const CRhinoCommandContext &)
virtual bool  | SelSubObjectFilter (const CRhinoObject *, ON_SimpleArray< ON_COMPONENT_INDEX > &indices_to_select)=0
 Public Member Functions inherited from CRhinoSelCommand
CRhinoSelCommand (const class CRhinoPlugIn *pPlugIn=nullptr, bool bTestCommand=false)
void  | BeQuiet (bool bQuiet)
virtual bool  | SelFilter (const CRhinoObject *)=0
void  | TestGrips (bool bTestGrips)
void  | TestLights (bool bTestLights)
 Public Member Functions inherited from CRhinoCommand
CRhinoCommand (bool bTransparent=false, bool bDoNotRepeat=false, const class CRhinoPlugIn *pPlugIn=nullptr, bool bTestCommand=false)
virtual  | ~CRhinoCommand ()
const unsigned int &  | CommandFlags () const
UUID  | CommandId () const
virtual UUID  | CommandUUID ()=0
!! See cmdExample.cpp for instructions on the use of this class. !! ///< More...
virtual bool  | ContextHelpURL (ON_wString &url) const
virtual void  | DoHelp ()
Override this function to display help for this command. More...
virtual void  | DynamicDraw (class CRhinoView &)
virtual CRhinoObject *  | EditObjects (const class CRhinoHistoryRecord &history_record, ON_SimpleArray< CRhinoObjectPair > &results)
void  | EnableHistoryReplayOnObjectAttributeChange (bool bEnable=true)
void  | EnableRepeatable (BOOL32 bRepeatable=true)
void  | EnableSystem (bool bSystem)
void  | EnableUndo (bool bUndoable=true)
virtual const wchar_t *  | EnglishCommandName () const
virtual const wchar_t *  | EnglishCommandName ()=0
bool  | HistoryReplayOnObjectAttributeChange () const
bool  | IsAlphaCommand () const
Returns true if a command is an "alpha" command. More...
bool  | IsRepeatable () const
bool  | IsScriptRunnerCommand () const
bool  | IsSystem () const
bool  | IsTestCommand () const
bool  | IsTransparent () const
bool  | IsUndoable () const
virtual void  | LoadProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
virtual const wchar_t *  | LocalCommandName () const
const class CRhinoPlugIn *  | PlugIn () const
virtual CRhinoObject *  | ReplayHistory (const class CRhinoHistoryRecord &history_record)
virtual bool  | ReplayHistory (const class CRhinoHistoryRecord &history_record, ON_SimpleArray< CRhinoObjectPair > &results)
virtual void  | SaveProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
CRhinoSettings &  | Settings ()
 Additional Inherited Members
 Public Types inherited from CRhinoCommand
enum  | result {
 success = 0, cancel = 1, nothing = 2, failure,
 unknown_command, cancel_modeless_dialog, exit_rhino = 0x0FFFFFFF
 }
 Static Public Member Functions inherited from CRhinoCommand
static bool  | IsValidCommandName (const wchar_t *)
 Protected Attributes inherited from CRhinoSelCommand
bool  | m_bIgnoreGripsState
bool  | m_bIgnoreLayerLocking
bool  | m_bIgnoreLayerVisibility
bool  | m_bQuiet
bool  | m_bReserved0
bool  | m_bReserved1
bool  | m_bTestGrips
bool  | m_bTestLights
int  | m_reserved1
int  | m_reserved2
ON__UINT_PTR  | m_sdk_reserved = 0
Detailed Description
Description: For adding nestable whole object & subobject selection commands, derive your command from CRhinoSelSubObjectCommand and override the virtual SelFilter and SelSubObjectFilter functions.
Constructor & Destructor Documentation
◆ CRhinoSelSubObjectCommand()
 CRhinoSelSubObjectCommand::CRhinoSelSubObjectCommand  |  ( |  const class CRhinoPlugIn *  |  pPlugIn = nullptr,
|  bool  |  bTestCommand = false
)
inline
Member Function Documentation
◆ RunCommand()
 CRhinoCommand::result CRhinoSelSubObjectCommand::RunCommand  |  ( |  const CRhinoCommandContext &  |   | )
virtual
Description: Do not need to override CRhinoSelSubObjectCommand::RunCommand().
Reimplemented from CRhinoSelCommand.
◆ SelSubObjectFilter()
 virtual bool CRhinoSelSubObjectCommand::SelSubObjectFilter  |  ( |  const CRhinoObject *  |  ,
|  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  indices_to_select
)
pure virtual
Description: To select subobjects, override this virtual function, add component indices of the subobjects that should get selected to indices_to_select array and return true. This is called only if the SelFilter returns false and the whole object does not get selected. Returns: true if components added to indices_to_select should get selected.