Public Member Functions | List of all members
ON_TextLogIndent Class Reference
OpenNURBS
#include <opennurbs_textlog.h>
 Public Member Functions
ON_TextLogIndent (class ON_TextLog &text_log)
ON_TextLogIndent (class ON_TextLog &text_log, bool bEnabled)
~ON_TextLogIndent ()
Detailed Description
Description: ON_TextLogIndent is a class used with ON_TextLog to push and pop indentation.
Constructor & Destructor Documentation
◆ ON_TextLogIndent() [1/2]
 ON_TextLogIndent::ON_TextLogIndent  |  ( |  class ON_TextLog &  |  text_log | )
The constructor calls text_log.PushIndent() and the destructor calls text_log.PopIndent()
◆ ON_TextLogIndent() [2/2]
 ON_TextLogIndent::ON_TextLogIndent  |  ( |  class ON_TextLog &  |  text_log,
|  bool  |  bEnabled
)
If bEnabled is true, the constructor calls text_log.PushIndent() and the destructor calls text_log.PopIndent()
◆ ~ON_TextLogIndent()
 ON_TextLogIndent::~ON_TextLogIndent  |  ( |   | )