Public Member Functions | List of all members
ON_Displacement::SubItem Class Referencefinal
Sub-items can exist to override the top-level parameters for polysurface/SubD faces. More...
#include <opennurbs_mesh_modifiers.h>
 Public Member Functions
SubItem (const ON_XMLNode &sub_node)
SubItem (const SubItem &)=delete
~SubItem ()
double  | BlackPoint (void) const
Overrides displacement 'black-point'. More...
int  | FaceIndex (void) const
int  | MappingChannel (void) const
Overrides displacement 'mapping channel'. More...
bool  | On (void) const
Overrides displacement 'on'. More...
bool  | operator!= (const SubItem &sub) const
const SubItem &  | operator= (const SubItem &sub)
bool  | operator== (const SubItem &sub) const
void  | SetBlackPoint (double b)
void  | SetFaceIndex (int i)
void  | SetMappingChannel (int c)
void  | SetOn (bool b)
void  | SetTexture (const ON_UUID &id)
void  | SetWhitePoint (double w)
ON_UUID  | Texture (void) const
Overrides displacement 'texture'. More...
void  | ToXML (ON_XMLNode &node) const
For internal use only. More...
double  | WhitePoint (void) const
Overrides displacement 'white-point'. More...
Detailed Description
Sub-items can exist to override the top-level parameters for polysurface/SubD faces.
Constructor & Destructor Documentation
◆ SubItem() [1/2]
 ON_Displacement::SubItem::SubItem  |  ( |  const ON_XMLNode &  |  sub_node | )
◆ SubItem() [2/2]
 ON_Displacement::SubItem::SubItem  |  ( |  const SubItem &  |   | )
delete
◆ ~SubItem()
 ON_Displacement::SubItem::~SubItem  |  ( |   | )
Member Function Documentation
◆ BlackPoint()
 double ON_Displacement::SubItem::BlackPoint  |  ( |  void  |   | ) |   const
Overrides displacement 'black-point'.
◆ FaceIndex()
 int ON_Displacement::SubItem::FaceIndex  |  ( |  void  |   | ) |   const
Returns the index of this sub-item. When this is >= 0 it is the component index of the polysurface or SubD face.
◆ MappingChannel()
 int ON_Displacement::SubItem::MappingChannel  |  ( |  void  |   | ) |   const
Overrides displacement 'mapping channel'.
◆ On()
 bool ON_Displacement::SubItem::On  |  ( |  void  |   | ) |   const
Overrides displacement 'on'.
◆ operator!=()
 bool ON_Displacement::SubItem::operator!=  |  ( |  const SubItem &  |  sub | ) |   const
◆ operator=()
 const SubItem& ON_Displacement::SubItem::operator=  |  ( |  const SubItem &  |  sub | )
◆ operator==()
 bool ON_Displacement::SubItem::operator==  |  ( |  const SubItem &  |  sub | ) |   const
◆ SetBlackPoint()
 void ON_Displacement::SubItem::SetBlackPoint  |  ( |  double  |  b | )
◆ SetFaceIndex()
 void ON_Displacement::SubItem::SetFaceIndex  |  ( |  int  |  i | )
◆ SetMappingChannel()
 void ON_Displacement::SubItem::SetMappingChannel  |  ( |  int  |  c | )
◆ SetOn()
 void ON_Displacement::SubItem::SetOn  |  ( |  bool  |  b | )
◆ SetTexture()
 void ON_Displacement::SubItem::SetTexture  |  ( |  const ON_UUID &  |  id | )
◆ SetWhitePoint()
 void ON_Displacement::SubItem::SetWhitePoint  |  ( |  double  |  w | )
◆ Texture()
 ON_UUID ON_Displacement::SubItem::Texture  |  ( |  void  |   | ) |   const
Overrides displacement 'texture'.
◆ ToXML()
 void ON_Displacement::SubItem::ToXML  |  ( |  ON_XMLNode &  |  node | ) |   const
For internal use only.
◆ WhitePoint()
 double ON_Displacement::SubItem::WhitePoint  |  ( |  void  |   | ) |   const
Overrides displacement 'white-point'.