Classes | Public Types | Public Member Functions | List of all members
CRhinoDocMarkupViewChanged Class Referenceabstract
Rhino
#include <rhinoSdkEventWatcher.h>
 Inheritance diagram for CRhinoDocMarkupViewChanged:
 Classes
class  | CParameters
 Public Types
enum  | MarkupMode : unsigned char { MarkupMode::None, MarkupMode::Create, MarkupMode::View, MarkupMode::Edit }
The markup mode the document is now in. Values match the internal MarkupModeType. More...
 Public Types inherited from CRhinoEventWatcherEx
enum  | event_type {
 event_type_none = 0, event_type_transform_object = 1, event_type_change_object_select_state = 2, event_type_after_transform_object = 3,
 event_type_set_active_detail_object = 4, event_type_view_display_mode_changed = 5, event_type_before_post_read_view_update = 6, event_type_after_post_read_view_update = 7,
 event_type_rhino_is_idle = 8, event_type_modeless_ui_doc_changed = 9, event_type_target_doc_changed = 10, event_type_plug_in_settings_changed = 11,
 event_type_rui_file = 12, event_type_main_loop = 13, event_type_view_modified = 14, event_type_doc_user_text_changed = 15,
 event_type_display_mode_settings_changed = 16, event_type_object_manager_changed = 17, event_type_pageview_properties_changed = 18, event_type_getpoint_event = 19,
 event_type_enable_drawing_changed = 20, event_type_rhino_object_analysis_mode_changed = 21, event_type_rhinodoc_section_style_table_changed = 22, event_type_rhinodoc_markup_table_changed = 23,
 event_type_rhinodoc_pageview_group_table_changed = 24, event_type_worksession_file = 25, event_type_rhinodoc_markup_view_changed = 26, event_type_max,
 event_type_force_4byte_size = 0xFFFFFFFF
 }
 Public Member Functions
CRhinoDocMarkupViewChanged (ON_UUID plugin_id)
CRhinoDocMarkupViewChanged (ON_UUID plugin_id, bool headlessDocAware, bool headlessAppAware)
virtual void  | Notify (const class CRhinoDocMarkupViewChanged::CParameters &params)=0
 Public Member Functions inherited from CRhinoEventWatcherEx
void  | Enable (bool bEnable)
bool  | IsEnabled () const
bool  | IsHeadlessAppAware () const
bool  | IsHeadlessDocAware () const
bool  | IsRegistered () const
void  | operator delete (void *)
void  | operator delete (void *, void *)
void  | operator delete[] (void *)
void *  | operator new (size_t)
new/delete More...
void *  | operator new (size_t, void *)
in place new/delete More...
void *  | operator new[] (size_t)
array new/delete More...
bool  | Register ()
bool  | Unregister ()
 Additional Inherited Members
 Public Attributes inherited from CRhinoEventWatcherEx
const event_type  | m_event_type
Type of event being watched. More...
const ON_UUID  | m_plugin_id
ID of plug-in that is watching. More...
const unsigned int  | m_watcher_sn
unique runtime serial number for this watcher More...
 Protected Member Functions inherited from CRhinoEventWatcherEx
CRhinoEventWatcherEx (CRhinoEventWatcherEx::event_type et, ON_UUID plugin_id)
CRhinoEventWatcherEx (CRhinoEventWatcherEx::event_type et, ON_UUID plugin_id, bool headlessDocAware, bool headlessAppAware)
virtual  | ~CRhinoEventWatcherEx ()
Detailed Description
https://mcneel.myjetbrains.com/youtrack/issue/RH-92369 Fired when a document's markup view state changes, i.e. when the document enters or leaves markup Create/View/Edit mode, or switches which markup is being viewed/edited. Unlike CRhinoDocMarkupTableChanged (which reports table add/delete/modify), this reports the "which markup is currently active" state so UI (e.g. the Markups panel) can indicate it.
Member Enumeration Documentation
◆ MarkupMode
 enum CRhinoDocMarkupViewChanged::MarkupMode : unsigned char
strong
The markup mode the document is now in. Values match the internal MarkupModeType.
Enumerator
None
Create
View
Edit
Constructor & Destructor Documentation
◆ CRhinoDocMarkupViewChanged() [1/2]
 CRhinoDocMarkupViewChanged::CRhinoDocMarkupViewChanged  |  ( |  ON_UUID  |  plugin_id | )
◆ CRhinoDocMarkupViewChanged() [2/2]
 CRhinoDocMarkupViewChanged::CRhinoDocMarkupViewChanged  |  ( |  ON_UUID  |  plugin_id,
|  bool  |  headlessDocAware,
|  bool  |  headlessAppAware
)
Member Function Documentation
◆ Notify()
 virtual void CRhinoDocMarkupViewChanged::Notify  |  ( |  const class CRhinoDocMarkupViewChanged::CParameters &  |  params | )
pure virtual
Rhino will call Notify() immediately after the document's markup view state changes. WARNING: Never modify the Rhino document in a CRhinoDocMarkupViewChanged::Notify override. If you need to change the Rhino document or post update messages to controls, then your CRhinoDocMarkupViewChanged::Notify should record what happened in an efficient way and then make any changes that are required in a CRhinoIsIdle.Notify() override.