Public Types | Public Member Functions | Public Attributes | List of all members
ON_MMX_POINT Class Reference
OpenNURBS
#include <opennurbs_plus_x.h>
 Public Types
enum  | TYPE { no_mx_event = 0, mmx_point = 1, mmx_overlap = 2 }
 Public Member Functions
ON_MMX_POINT ()
bool  | IsValid (ON_TextLog *text_log, double intersection_tolerance) const
 Public Attributes
ON_MESH_POINT  | m_A
ON_MESH_POINT  | m_B
int  | m_MeshVertex_ID
ID for a set of points that theoretically ought to match. More...
int  | m_MMX_Set_ID
ID for a set of points that theoretically ought to match. More...
ON_3fPoint  | m_MMX_Set_PT
the point chosen to be the intersection for the entire set. Chosen based on a logical best answer (point that is on an edge or vertex) More...
int  | m_overlap_sn
unsigned int  | m_sn
ON_MMX_POINT serial number. More...
TYPE  | m_type
Member Enumeration Documentation
◆ TYPE
 enum ON_MMX_POINT::TYPE
Enumerator
no_mx_event
mmx_point
Two valid event types for curve-mesh intersections.
mesh-mesh transverse intersection point
mmx_overlap
mesh-mesh intersection overlap
Constructor & Destructor Documentation
◆ ON_MMX_POINT()
 ON_MMX_POINT::ON_MMX_POINT  |  ( |   | )
Member Function Documentation
◆ IsValid()
 bool ON_MMX_POINT::IsValid  |  ( |  ON_TextLog *  |  text_log,
|  double  |  intersection_tolerance
) |   |  const
Member Data Documentation
◆ m_A
 ON_MESH_POINT ON_MMX_POINT::m_A
Nothing that needs a constructor can be in this class. In particular, NO simple arrays. I want to be able to safely use memset((ptr,0,sizeof(ON_MESH_X_EVENT)) to create one of these. Should be something really simple along the lines of ... This is just a suggestion
◆ m_B
 ON_MESH_POINT ON_MMX_POINT::m_B
◆ m_MeshVertex_ID
 int ON_MMX_POINT::m_MeshVertex_ID
ID for a set of points that theoretically ought to match.
◆ m_MMX_Set_ID
 int ON_MMX_POINT::m_MMX_Set_ID
ID for a set of points that theoretically ought to match.
◆ m_MMX_Set_PT
 ON_3fPoint ON_MMX_POINT::m_MMX_Set_PT
the point chosen to be the intersection for the entire set. Chosen based on a logical best answer (point that is on an edge or vertex)
◆ m_overlap_sn
 int ON_MMX_POINT::m_overlap_sn
ON_MMX_POINT overlap serial number. -1 if the ON_MMX_POINT does not have mmx_overlap as it's type.
 No more than 2 ON_MMX_POINT should have the same m_overlap_sn.
◆ m_sn
 unsigned int ON_MMX_POINT::m_sn
ON_MMX_POINT serial number.
◆ m_type
 TYPE ON_MMX_POINT::m_type
The m_type field determines how the values in the other fields are interpreted.
mmx_point = intersection point on mesh mmx_overlap = overlap endpoints on mesh: