Public Member Functions | Public Attributes | List of all members
ON_RenderMeshInfo Class Reference
OpenNURBS
#include <opennurbs_texture_mapping.h>
 Public Member Functions
ON_RenderMeshInfo ()
 Public Attributes
ON_GeometryFingerprint  | m_geometryFingerprint
int  | m_sourceFaceId
Constructor & Destructor Documentation
◆ ON_RenderMeshInfo()
 ON_RenderMeshInfo::ON_RenderMeshInfo  |  ( |   | )
Member Data Documentation
◆ m_geometryFingerprint
 ON_GeometryFingerprint ON_RenderMeshInfo::m_geometryFingerprint
◆ m_sourceFaceId
 int ON_RenderMeshInfo::m_sourceFaceId