Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoEndAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoEndAnalysisSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoEndAnalysisSettings &other) const
bool  | operator== (const CRhinoEndAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
 Public Attributes
bool  | m_bJoints
bool  | m_bOpenEnd
bool  | m_bOpenStart
bool  | m_bSeams
ON_Color  | m_color
color used to enhance display More...
 Static Public Attributes
static const CRhinoEndAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoEndAnalysisSettings()
 CRhinoEndAnalysisSettings::CRhinoEndAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoEndAnalysisSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoEndAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoEndAnalysisSettings::operator!=  |  ( |  const CRhinoEndAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoEndAnalysisSettings::operator==  |  ( |  const CRhinoEndAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoEndAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoEndAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoEndAnalysisSettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoEndAnalysisSettings CRhinoEndAnalysisSettings::Default
static
◆ m_bJoints
 bool CRhinoEndAnalysisSettings::m_bJoints
◆ m_bOpenEnd
 bool CRhinoEndAnalysisSettings::m_bOpenEnd
◆ m_bOpenStart
 bool CRhinoEndAnalysisSettings::m_bOpenStart
◆ m_bSeams
 bool CRhinoEndAnalysisSettings::m_bSeams
◆ m_color
 ON_Color CRhinoEndAnalysisSettings::m_color
color used to enhance display