Public Member Functions | Public Attributes | List of all members
ON_3dmViewPosition Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmViewPosition ()
view window relative position and state in parent frame More...
ON_3dmViewPosition (const ON_3dmViewPosition &)
~ON_3dmViewPosition ()
void  | Default ()
ON_3dmViewPosition &  | operator= (const ON_3dmViewPosition &)
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bMaximized
true if view window is maximized More...
unsigned char  | m_floating_viewport
double  | m_wnd_bottom
double  | m_wnd_left
0.0 to 1.0 More...
double  | m_wnd_right
double  | m_wnd_top
Detailed Description
ON_3dmViewPosition
Constructor & Destructor Documentation
◆ ON_3dmViewPosition() [1/2]
 ON_3dmViewPosition::ON_3dmViewPosition  |  ( |   | )
view window relative position and state in parent frame
◆ ~ON_3dmViewPosition()
 ON_3dmViewPosition::~ON_3dmViewPosition  |  ( |   | )
◆ ON_3dmViewPosition() [2/2]
 ON_3dmViewPosition::ON_3dmViewPosition  |  ( |  const ON_3dmViewPosition &  |   | )
Member Function Documentation
◆ Default()
 void ON_3dmViewPosition::Default  |  ( |   | )
◆ operator=()
 ON_3dmViewPosition& ON_3dmViewPosition::operator=  |  ( |  const ON_3dmViewPosition &  |   | )
◆ Read()
 bool ON_3dmViewPosition::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmViewPosition::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bMaximized
 bool ON_3dmViewPosition::m_bMaximized
true if view window is maximized
◆ m_floating_viewport
 unsigned char ON_3dmViewPosition::m_floating_viewport
m_floating_viewport is used to track floating viewport information. 0 = the view is docked in the main application window. >0 = the view is floating. When floating, this corresponds to the number of monitors on the user's computer when the file was saved
◆ m_wnd_bottom
 double ON_3dmViewPosition::m_wnd_bottom
◆ m_wnd_left
 double ON_3dmViewPosition::m_wnd_left
0.0 to 1.0
relative position of view window in main frame if m_floating_viewport>0, this is relative position of the view window on the virtual screen (union of potentially multiple monitors)
◆ m_wnd_right
 double ON_3dmViewPosition::m_wnd_right
◆ m_wnd_top
 double ON_3dmViewPosition::m_wnd_top