Public Member Functions | Public Attributes | List of all members
CArgsRhinoGetPolyline Class Reference
RhinoGet
#include <rhinoSdkGetLine.h>
 Inheritance diagram for CArgsRhinoGetPolyline:
 Public Member Functions
CArgsRhinoGetPolyline ()
CArgsRhinoGetPolyline (const CArgsRhinoGetPolyline &)
~CArgsRhinoGetPolyline ()
const wchar_t *  | NextPointPrompt () const
CArgsRhinoGetPolyline &  | operator= (const CArgsRhinoGetPolyline &)
void  | SetNextPointPrompt (const wchar_t *)
void  | SetThirdPointPrompt (const wchar_t *)
const wchar_t *  | ThirdPointPrompt () const
 Public Member Functions inherited from CArgsRhinoGetLine
CArgsRhinoGetLine ()
CArgsRhinoGetLine (const CArgsRhinoGetLine &)
~CArgsRhinoGetLine ()
BOOL32  | AcceptZeroLengthLine () const
void  | EnableAcceptZeroLengthLine (BOOL32=TRUE)
void  | EnableFromMidPoint (BOOL32=TRUE)
If TRUE, then the user picks the midpoint and endpoint. More...
void  | EnableFromMidPointOption (BOOL32=TRUE)
void  | EnableShowVariations (BOOL32=FALSE)
If TRUE, then the all line variations are shown if the default line mode is used. More...
ON_Color  | FeedbackColor () const
const ON_3dPoint *  | FirstPoint () const
const wchar_t *  | FirstPointPrompt () const
prompt when getting first point More...
BOOL32  | FromMidPoint () const
If TRUE, then the user picked the midpoint and endpoint. More...
BOOL32  | HaveFeedbackColor () const
BOOL32  | IgnoreTrims ()
The current ignore trims state. More...
double  | Length () const
If Length() > 0, the line must have the specified length. More...
int  | LineMode () const
The current line mode. More...
BOOL32  | MidPointOption () const
const wchar_t *  | MidPointPrompt () const
prompt when getting midpoint More...
CArgsRhinoGetLine &  | operator= (const CArgsRhinoGetLine &)
const wchar_t *  | SecondPointPrompt () const
prompt when getting second point More...
void  | SetFeedbackColor (COLORREF)
void  | SetFirstPoint (const ON_3dPoint &)
void  | SetFirstPointPrompt (const wchar_t *)
void  | SetIgnoreTrims (BOOL32=TRUE)
Makes point picker ignore trims on trimmed surface when mode is surface_normal. More...
void  | SetLength (double)
If the line should have a fixed length, set that length here. More...
void  | SetLineMode (int=CArgsRhinoGetLine::two_point)
Set current line mode. More...
void  | SetMidPointPrompt (const wchar_t *)
void  | SetSecondPointPrompt (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
BOOL32  | ShowVariations () const
If TRUE, then showing line variations is enabled. More...
bool  | UseActiveLayerLinetype () const
 Public Attributes
BOOL32  | m_bClosed
BOOL32  | m_bForceClosed
BOOL32  | m_bPermitCloseOption
BOOL32  | m_bPermitCloseSnap
int  | m_max_point_count
int  | m_min_point_count
 Public Attributes inherited from CArgsRhinoGetLine
CRhinoObjRef  | m_objref [2]
 Additional Inherited Members
 Public Types inherited from CArgsRhinoGetLine
enum  | eLineMode {
 two_point, surface_normal, angled, vertical,
 four_point, bisector, perpendicular, tangent,
 curve_end, cpnormalvector
 }
 Protected Attributes inherited from CArgsRhinoGetLine
BOOL32  | m_bAcceptZeroLengthLine
[in] More...
BOOL32  | m_bBothSides
BOOL32  | m_bEnableBothSidesOption
BOOL32  | m_bHaveStartPoint
BOOL32  | m_bIgnoreTrims
BOOL32  | m_bShowVariations
ON_Color  | m_dynamic_line_color
[in] color to use when drawing dynamic line while getting end point More...
ON_wString  | m_first_point_prompt
[in] prompt when getting start point More...
double  | m_fixed_length
int  | m_LineMode
ON_wString  | m_midpoint_prompt
[in] prompt when getting midpoint More...
ON_wString  | m_second_point_prompt
[in] prompt when getting end point More...
ON_3dPoint  | m_start_point
Detailed Description
Description: CArgsRhinoGetLine is used to pass input to RhinoGetLine().
Constructor & Destructor Documentation
◆ CArgsRhinoGetPolyline() [1/2]
 CArgsRhinoGetPolyline::CArgsRhinoGetPolyline  |  ( |   | )
◆ ~CArgsRhinoGetPolyline()
 CArgsRhinoGetPolyline::~CArgsRhinoGetPolyline  |  ( |   | )
◆ CArgsRhinoGetPolyline() [2/2]
 CArgsRhinoGetPolyline::CArgsRhinoGetPolyline  |  ( |  const CArgsRhinoGetPolyline &  |   | )
Member Function Documentation
◆ NextPointPrompt()
 const wchar_t* CArgsRhinoGetPolyline::NextPointPrompt  |  ( |   | ) |   const
prompt when getting forth and subsequent points Default = "Next point of polyline".
◆ operator=()
 CArgsRhinoGetPolyline& CArgsRhinoGetPolyline::operator=  |  ( |  const CArgsRhinoGetPolyline &  |   | )
◆ SetNextPointPrompt()
 void CArgsRhinoGetPolyline::SetNextPointPrompt  |  ( |  const wchar_t *  |   | )
◆ SetThirdPointPrompt()
 void CArgsRhinoGetPolyline::SetThirdPointPrompt  |  ( |  const wchar_t *  |   | )
◆ ThirdPointPrompt()
 const wchar_t* CArgsRhinoGetPolyline::ThirdPointPrompt  |  ( |   | ) |   const
prompt when getting third point Default = "Next point of polyline".
Member Data Documentation
◆ m_bClosed
 BOOL32 CArgsRhinoGetPolyline::m_bClosed
[out] If the polyline was closed by using the "Close" option or snapping to the start point, then m_bClosed is set to TRUE.
◆ m_bForceClosed
 BOOL32 CArgsRhinoGetPolyline::m_bForceClosed
[in] If m_bForceClosed is TRUE, then the returned polyline is always closed. If m_bForceClosed is TRUE, then m_max_point_count must be 0 or >= 4. The default is FALSE.
◆ m_bPermitCloseOption
 BOOL32 CArgsRhinoGetPolyline::m_bPermitCloseOption
[in] If m_bPermitCloseOption is TRUE, then after 3 points have been picked, the user can type "Close" and a closed polyline will be returned. The default is TRUE.
◆ m_bPermitCloseSnap
 BOOL32 CArgsRhinoGetPolyline::m_bPermitCloseSnap
[in] If m_bPermitCloseSnap is TRUE, then after 3 points have been picked, the user can pick near the start point and a closed polyline will be returned. The default is TRUE.
◆ m_max_point_count
 int CArgsRhinoGetPolyline::m_max_point_count
[in] maximum number of points to require; zero for no limit. On closed polylines, the start/end point is counted twice. The default is 0.
◆ m_min_point_count
 int CArgsRhinoGetPolyline::m_min_point_count
[in] minimum number of points to require. On closed polylines, the start/end point is counted once. The default is 2.