Public Member Functions | Protected Member Functions | List of all members
CRhRdkOneColorTextureBase Class Reference
RDK
#include <RhRdkTwoColorTextureBase.h>
 Inheritance diagram for CRhRdkOneColorTextureBase:
 Public Member Functions
CRhRdkOneColorTextureBase ()
CRhRdkOneColorTextureBase (bool bAutoGlobalRegister)
virtual  | ~CRhRdkOneColorTextureBase ()
virtual CRhRdkColor  | Color1 (void) const
virtual void  | SetColor1 (const CRhRdkColor &col)
virtual void  | SetSuperSample (bool bSwap)
virtual void  | SetTextureAmount1 (double d)
virtual void  | SetTextureOn1 (bool bOn)
virtual void  | SetTile (bool bTile)
virtual bool  | SuperSample (void) const
virtual double  | TextureAmount1 (void) const
virtual bool  | TextureOn1 (void) const
virtual bool  | Tile (void) const
 Public Member Functions inherited from CRhRdkTexture
CRhRdkTexture ()
CRhRdkTexture (bool bAutoGlobalRegister)
virtual  | ~CRhRdkTexture ()
virtual RDK_DEPRECATED void  | AddGraphSection (void)
virtual RDK_DEPRECATED void  | AddLocalMappingSection (void)
virtual void  | AddTwoColorSection (IRhRdkExpandableContentUI &ui)
virtual RDK_DEPRECATED void  | AddTwoColorSection (void)
virtual void  | AddUISections (IRhRdkExpandableContentUI &ui) override
virtual RDK_DEPRECATED void  | AddUISections (void) override
virtual bool  | AdjustmentClamp (void) const
virtual double  | AdjustmentClampMax (void) const
virtual double  | AdjustmentClampMin (void) const
virtual double  | AdjustmentGain (void) const
virtual double  | AdjustmentGamma (void) const
virtual bool  | AdjustmentGrayscale (void) const
virtual double  | AdjustmentHueShift (void) const
virtual bool  | AdjustmentInvert (void) const
virtual double  | AdjustmentMultiplier (void) const
virtual double  | AdjustmentSaturation (void) const
virtual bool  | AdjustmentScaleToClamp (void) const
virtual EnvironmentMappingModes  | AutomaticEnvironmentMappingMode (void) const
virtual void  | ConvertMetersToUnits (void) override
virtual void  | ConvertUnitsToMeters (void) override
virtual bool  | CreateLibraryPreview (const ON_2iSize &sizeImage, const IRhRdkPreviewSceneServer *pSceneServer, CRhinoDib &dibOut) const override
virtual bool  | CreatePreview (CRhRdkRenderPlugIn &plugIn, const ON_2iSize &sizeImage, RhRdkPreviewQuality qual, const IRhRdkPreviewSceneServer *pSceneServer, IRhRdkPreviewCallbacks *pNotify, CRhinoDib &dibOut) const override
virtual bool  | DisplayInViewport (void) const
virtual bool  | DynamicIcon (const ON_2iSize &size, CRhinoDib &dibOut, DynamicIconUsage usage) const override
virtual EnvironmentMappingModes  | EnvironmentMappingMode (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual bool  | GenerateRawBuffer (ON_2iSize &sizeOut, eBitFormat &bfOut, CRhRdkVariant &vOut) const
virtual bool  | GenerateTextureSimulation (CRhinoDib &dibOut, IRhRdkTextureEvaluator::CEvalFlags ef) const
virtual bool  | GetFilenameUI (ON_wString &sFilenameOut) const
virtual CRhRdkVariant  | GetParameter (const wchar_t *) const override
virtual void  | GraphInfo (CRhRdkTextureGraphInfo &infoOut) const
virtual Harvested  | HarvestData (const CRhRdkContent &oldContent) override
virtual bool  | Icon (const ON_2iSize &size, CRhinoDib &dibOut) const override
virtual bool  | Initialize (void) override
virtual EnvironmentMappingModes  | InternalEnvironmentMappingMode (void) const
virtual bool  | IsCachedTextureFileInUse (const wchar_t *wszTextureFile) const
virtual bool  | IsHDRCapable (void) const
virtual bool  | IsLinear (void) const
virtual_su bool  | IsNormalMap (void) const
virtual Kinds  | Kind (void) const final override
virtual const wchar_t *  | LibraryFileExtension (void) const override
virtual ON_Xform  | LocalMappingTransform (void) const
virtual eLocalMappingType  | LocalMappingType (void) const
virtual int  | MappingChannel (void) const
virtual double  | MetersToUnits (double dMeters) const
virtual_su bool  | NeedsBaking (const ON_UUID &rendererId) const
virtual_su bool  | NeedsBaking (void) const
virtual IColorAdjuster *  | NewColorAdjuster (void) const
virtual CRhRdkPreviewBackground *  | NewPreviewBackground (void) const override
virtual CRhRdkPreviewGeometry *  | NewPreviewGeometry (void) const override
virtual IRhRdkPreviewSceneServer *  | NewPreviewSceneServer (const CRhRdkSSData &data) const override
virtual IRhRdkTextureEvaluator *  | NewSimulatedTextureEvaluator (int iBaseSize=-1) const
virtual IRhRdkTextureEvaluator *  | NewTextureEvaluator (IRhRdkTextureEvaluator::CEvalFlags ef) const
virtual RDK_DEPRECATED IRhRdkTextureEvaluator *  | NewTextureEvaluator (void) const
virtual ON_3dVector  | Offset (void) const
virtual bool  | OffsetLocked (void) const
virtual ParamSerialMethod  | ParameterSerializationMethod (void) const override
virtual bool  | PixelSize (int &widthOut, int &heightOut, int &depthOut) const
virtual UINT  | PreviewBackgroundFlags (void) const override
virtual UINT  | PreviewGeometryFlags (void) const override
virtual bool  | PreviewIn3D (void) const
virtual UINT  | PreviewLightingFlags (void) const override
virtual bool  | PreviewLocalMapping (void) const
virtual ePreviewSceneType  | PreviewSceneType (void) const override
virtual int  | PreviewUpdateDelay (void) const override
virtual ProjectionModes  | ProjectionMode (void) const
virtual RDK_DEPRECATED bool  | RecreateLocalMapping (void)
virtual ON_3dVector  | Repeat (void) const
virtual bool  | RepeatLocked (void) const
virtual ON_3dVector  | Rotation (void) const
bool  | SaveAsImage (const wchar_t *wszFilename, int width, int height, int depth) const
virtual void  | SetAdjustmentClamp (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentClamp (bool, eChangeContext cc)
virtual void  | SetAdjustmentClampMax (double)
virtual RDK_DEPRECATED void  | SetAdjustmentClampMax (double, eChangeContext cc)
virtual void  | SetAdjustmentClampMin (double)
virtual RDK_DEPRECATED void  | SetAdjustmentClampMin (double, eChangeContext cc)
virtual void  | SetAdjustmentGain (double)
virtual RDK_DEPRECATED void  | SetAdjustmentGain (double, eChangeContext cc)
virtual void  | SetAdjustmentGamma (double)
virtual RDK_DEPRECATED void  | SetAdjustmentGamma (double, eChangeContext cc)
virtual void  | SetAdjustmentGrayscale (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentGrayscale (bool, eChangeContext cc)
virtual void  | SetAdjustmentHueShift (double dShift)
virtual RDK_DEPRECATED void  | SetAdjustmentHueShift (double dShift, eChangeContext cc)
virtual void  | SetAdjustmentInvert (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentInvert (bool, eChangeContext cc)
virtual void  | SetAdjustmentMultiplier (double)
virtual RDK_DEPRECATED void  | SetAdjustmentMultiplier (double, eChangeContext cc)
virtual void  | SetAdjustmentSaturation (double)
virtual RDK_DEPRECATED void  | SetAdjustmentSaturation (double, eChangeContext cc)
virtual void  | SetAdjustmentScaleToClamp (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentScaleToClamp (bool, eChangeContext cc)
virtual void  | SetDisplayInViewport (bool b)
virtual RDK_DEPRECATED void  | SetDisplayInViewport (bool b, eChangeContext cc)
virtual RDK_DEPRECATED void  | SetEnvironmentMappingMode (eEnvironmentMappingMode e, eChangeContext cc)
virtual void  | SetEnvironmentMappingMode (EnvironmentMappingModes emm)
virtual void  | SetGraphInfo (const CRhRdkTextureGraphInfo &info)
void  | SetIsNormalMap (bool bIsNormalMap)
virtual void  | SetMappingChannel (int iMappingChannel)
virtual RDK_DEPRECATED void  | SetMappingChannel (int iMappingChannel, eChangeContext cc)
virtual void  | SetOffset (const ON_3dVector &vecOffset)
virtual RDK_DEPRECATED void  | SetOffset (const ON_3dVector &vecOffset, eChangeContext cc)
virtual void  | SetOffsetLocked (bool bLocked)
virtual RDK_DEPRECATED void  | SetOffsetLocked (bool bLocked, eChangeContext cc)
virtual void  | SetPreviewIn3D (bool b)
virtual RDK_DEPRECATED void  | SetPreviewIn3D (bool b, eChangeContext cc)
virtual void  | SetPreviewLocalMapping (bool b)
virtual RDK_DEPRECATED void  | SetPreviewLocalMapping (bool b, eChangeContext cc)
virtual RDK_DEPRECATED void  | SetProjectionMode (eProjectionMode pm, eChangeContext cc)
virtual void  | SetProjectionMode (ProjectionModes pm)
virtual void  | SetRepeat (const ON_3dVector &vecRepeat)
virtual RDK_DEPRECATED void  | SetRepeat (const ON_3dVector &vecRepeat, eChangeContext cc)
virtual void  | SetRepeatLocked (bool bLocked)
virtual RDK_DEPRECATED void  | SetRepeatLocked (bool bLocked, eChangeContext cc)
virtual void  | SetRotation (const ON_3dVector &vecRotation)
virtual RDK_DEPRECATED void  | SetRotation (const ON_3dVector &vecRotation, eChangeContext cc)
virtual bool  | SetSimulation (IRhRdk_XMLSection &section) const override
virtual RDK_DEPRECATED void  | SetWrapType (eWrapType wt, eChangeContext cc)
virtual void  | SetWrapType (WrapTypes wt)
virtual RDK_DEPRECATED void  | SimulateTexture (CRhRdkSimulatedTexture &texOut, bool bForDataOnly) const
virtual void  | SimulateTexture (CRhRdkSimulatedTexture &texOut, TextureGeneration tg=TextureGeneration::Allow, int iSimulatedTextureSize=-1, const CRhinoObject *pObject=NULL) const
virtual_su bool  | SupportedByRenderer (const ON_UUID &rendererId) const
virtual double  | UnitsToMeters (double dUnits) const
virtual bool  | UpdateDocumentTables (void) const override
virtual WrapTypes  | WrapType (void) const
 Public Member Functions inherited from CRhRdkCoreContent
CRhRdkCoreContent ()
CRhRdkCoreContent (bool bAutoGlobalRegister)
virtual  | ~CRhRdkCoreContent ()
virtual RDK_DEPRECATED bool  | AddAutomaticUISection (const wchar_t *wszCaption, int id=0)
virtual bool  | AddAutomaticUISection (IRhRdkExpandableContentUI &ui, const wchar_t *wszLocalCaption, const wchar_t *wszEnglishCaption, int id=0)
virtual void  | AddUI (IRhRdkContentUI &ui) const override
virtual IRhRdkContentUI *  | CreateUI (IRhRdkContentEditor &e, const UUID &uuidUI, const CRhRdkContentArray &aInitialClients, void *pReserved) override
virtual IRhRdkCustomCurveGraphSectionCallback *  | CustomCurveGraphSectionCallback (void)
virtual void  | GetUIs (ON_SimpleArray< IRhRdkContentUI * > &aOut) const override
virtual RDK_DEPRECATED bool  | RecreateTextureSummary (void)
virtual void  | ReleaseAllEditorUIs (const UUID &uuidEditor, bool bIncludeChildren) const override
virtual void  | ReleaseAllUIs (bool bIncludeChildren) const override
virtual void  | TransferUIsFrom (const CRhRdkContent &c) override
virtual RDK_DEPRECATED IRhRdkExpandableContentUI *  | UI (void) const override
 Public Member Functions inherited from CRhRdkContent
CRhRdkContent ()
CRhRdkContent (bool bAutoGlobalRegister)
virtual  | ~CRhRdkContent ()
virtual RDK_DEPRECATED void  | AddAutoParameters (class IRhRdkParamBlock &paramBlock, int id)
virtual RDK_DEPRECATED bool  | AddChild (CRhRdkContent *pChild, const wchar_t *wszChildSlotName)
virtual bool  | AddToDocumentList (CRhRdkDocument &rdkDoc)
virtual const class IRhRdkPreviewAppearanceDefaults *  | AppearanceDefaults (void) const
virtual bool  | AttachCustomUserData (ICustomUserData *data)
virtual bool  | AutoDelete (void) const
virtual ON_wString  | AutomaticInstanceName (void) const
virtual CRhRdkContent &  | BeginChange (RhRdkChangeContext cc) const
virtual bool  | CanBeEdited (void) const
virtual const wchar_t *  | Category (void) const =0
virtual bool  | ChangeChild (CRhRdkContent *pOldChild, CRhRdkContent *pNewChild)
virtual RDK_DEPRECATED void  | Changed (eChangeContext cc)
virtual void  | Changed (void)
virtual_su bool  | CheckComplete (ON_wString &sReason) const
virtual RDK_DEPRECATED DWORD  | ChildrenRenderCRC (void) const
virtual CRhRdkVariant  | ChildSlotAmount (const wchar_t *wszChildSlotName) const
virtual_su ON_wString  | ChildSlotDisplayName (void) const
virtual ON_wString  | ChildSlotName (void) const
virtual ON_wString  | ChildSlotNameFromParamName (const wchar_t *wszParamName) const
virtual CRhRdkVariant  | ChildSlotOn (const wchar_t *wszChildSlotName) const
CRhRdkContent *  | Clone (CopyMethods m=CopyMethods::Normal) const
void  | CommonCtor (bool b)
virtual bool  | ContentNameTakenFromFileName (void) const
virtual bool  | CreatedByLoading (void) const
virtual RDK_DEPRECATED HBITMAP  | CreateLibraryPreview (const class CSize &sizeImage, const IRhRdkPreviewSceneServer *pSceneServer) const
virtual RDK_DEPRECATED HBITMAP  | CreatePreview (class CRhRdkRenderPlugIn &plugIn, const class CSize &sizeImage, eRhRdkRenderQuality qual, const class IRhRdkPreviewSceneServer *pSceneServer) const
virtual class IRhRdkContentUI *  | CreateUI (class IRhRdkContentEditor &e, const UUID &uuidUI, const class CRhRdkContentArray &aInitialClients, void *pReserved)=0
virtual const ICustomUserData *  | CustomUserData (const UUID &uuidDataId) const
virtual RDK_DEPRECATED void  | DecrementUseCount (void) const
virtual void  | DeleteAllChildren (void)
virtual bool  | DeleteChild (const wchar_t *wszChildSlotName)
virtual RDK_DEPRECATED void  | DestroyChildContent (const UUID &uuidPlugIn)
virtual void  | DestroyChildContent (const UUID &uuidPlugIn) const
virtual bool  | DetachCustomUserData (ICustomUserData *pUD)
virtual void  | DisplayContextHelp (HWND hwndParent) const
virtual void  | DisplayDebugString (const wchar_t *wszTitle=L"") const
virtual_su ON_wString  | DisplayName (void) const
virtual RDK_DEPRECATED CRhinoDoc *  | Document (void) const
virtual_su CRhinoDoc *  | DocumentAssoc (void)
virtual const CRhinoDoc *  | DocumentAssoc (void) const
virtual ON_wString  | DragText (const UUID &uuidSource) const
ON_wString  | DragTextEx (const UUID &uuidSource, int version, void *) const
virtual_su void  | Dump (const DumpContext &dc, unsigned int gds_flags, int indent=0) const
virtual const RDK_DEPRECATED CRhRdkContent *  | Duplicate (void) const
const RDK_DEPRECATED CRhRdkContent *  | DuplicateEx (bool reserved) const
const CRhRdkContent *  | DuplicateEx (DupOpt d) const
virtual IAutoUIExtraRequirements *  | DuplicateExtraRequirementsInterface (void) const
virtual bool  | DuplicationInProgress (void) const
virtual CRhRdkContent *  | Edit (void) const
virtual ON_wString  | EmbeddedFiles (void) const
virtual ON_wString  | EmbeddedFilesRecursive (void) const
void  | EmergencyUnregister (void) const
virtual bool  | EndChange (void)
virtual void  | ExecuteCommand (UUID uuidCommand, void *pvData) const
virtual const CRhRdkContentFactory *  | Factory (void) const
virtual CRhRdkContent *  | FastMakeCopy (CopyMethods m) const
class CRhRdkContentFields &  | Fields (void) const
virtual const CRhRdkContent *  | FindChild (const wchar_t *wszChildSlotName) const
virtual const CRhRdkContent *  | FindInstance (const UUID &uuidInstance) const
virtual RDK_DEPRECATED CRhRdkContent *  | FindInstance (const wchar_t *wszName) const
virtual void  | FindInstanceByName (const wchar_t *wszName, bool bCaseSensitive, bool bRecurse, OUT CRhRdkContentArray &aContent) const
virtual const CRhRdkContent *  | FirstChild (void) const
virtual const CRhRdkContent *  | ForDisplay (void) const
virtual RhRdkChangeContext  | GetChangeContext (void) const
virtual CChildIterator  | GetChildIterator (void) const
virtual ON_wString  | GetDebugString (const wchar_t *sep, UINT_PTR flags) const
virtual RDK_DEPRECATED bool  | GetDefaultsFromUser (HWND)
virtual bool  | GetDefaultsFromUser (void)
virtual ON_wString  | GetEnglishParamName (const wchar_t *wszParamName) const
virtual void  | GetInstanceIdsRecursive (class CRhRdkInstanceIdArray &aOut) const
virtual ON_wString  | GetLocalizedParamName (const wchar_t *wszParamName) const
virtual RDK_DEPRECATED bool  | GetParameters (const class IRhRdk_XMLSection &section, eGetParamsContext context)
virtual bool  | GetSimulation (const IRhRdk_XMLSection &section)
void  | GetSortedChildren (OUT CRhRdkContentArray &aChild) const
virtual_su bool  | GetUnderlyingInstances (OUT CRhRdkContentArray &a) const
virtual bool  | GlobalRegister (bool bRegister=true)
virtual const UUID &  | GroupId (void) const
virtual RDK_DEPRECATED HICON  | Icon (void) const
CImpl &  | Imp (void) const
virtual RDK_DEPRECATED void  | IncrementUseCount (void) const
virtual const UUID &  | InstanceId (void) const
virtual ON_wString  | InstanceName (void) const
virtual void  | InternalChanged (RhRdkChangeContext, const CRhRdkContent *)
virtual ON_wString  | InternalName (void) const =0
virtual bool  | IsBasicType (void) const
virtual_su bool  | IsChild (void) const
virtual bool  | IsCompatible (const UUID &uuidRenderEngine) const
virtual bool  | IsContentTypeAcceptableAsChild (const UUID &uuidType, const wchar_t *wszChildSlotName) const
virtual RDK_DEPRECATED bool  | IsCRCCached (void) const
virtual bool  | IsDefaultInstance (void) const
virtual bool  | IsFactoryProductAcceptableAsChild (const class CRhRdkContentFactory &f, const wchar_t *wszChildSlotName) const
virtual RDK_DEPRECATED bool  | IsFactoryProductAcceptableAsChild (const class CRhRdkContentFactory *pFactory, const wchar_t *wszChildSlotName) const
virtual bool  | IsHidden (void) const
virtual bool  | IsHiddenByAutoDelete (void) const
virtual RDK_DEPRECATED bool  | IsInDocument (void) const
virtual bool  | IsKind (CRhRdkContent::Kinds kind) const
virtual bool  | IsLocked (void) const
virtual bool  | IsOwnedByDocument (void) const
virtual bool  | IsPerObject (void) const
virtual bool  | IsPrivate (void) const
virtual bool  | IsReference (void) const
virtual bool  | IsRhinoObjectSelected (void) const
virtual bool  | IsSurrogate (void) const
virtual bool  | IsTopLevel (void) const
virtual bool  | IsUniversal (void) const
virtual bool  | IsV4Material (void) const
virtual ON_wString  | LibraryFileName (void) const
virtual_su CRhRdkContent *  | MakeCopyForPreview (void) const
virtual RDK_DEPRECATED CRhRdkContent *  | MakeGroupInstance (void)
virtual CRhRdkContent *  | MakeGroupInstance (void) const
virtual class IRhRdkPreviewSceneServer *  | NewPreviewSceneServer (const class CRhRdkSSData &data) const =0
virtual const CRhRdkContent *  | NextSibling (void) const
virtual ON_wString  | Notes (void) const
virtual bool  | OnChildChanging (const CRhRdkContent *pOldChild, const CRhRdkContent *pNewChild) const
virtual bool  | OnChildSlotChanged (const wchar_t *wszChildSlotName) const
virtual bool  | OnChildSlotChanging (const wchar_t *wszChildSlotName) const
virtual void  | OnDocumentRegister (void) const
virtual void  | OnDocumentUnregister (void) const
virtual bool  | OnExtraRequirementButtonClicked (const wchar_t *wszParamName, const wchar_t *wszButtonName)
virtual void  | OnFieldChanged (const class CRhRdkContentField &field, const CRhRdkVariant &vOldValue, RhRdkChangeContext cc, void *pReserved)
virtual_su bool  | OpenInFirstMainModelessEditor (void) const
virtual bool  | OpenInMainEditor (void) const
virtual RDK_DEPRECATED bool  | OpenInModalEditor (UINT uFlags=0)
virtual ON_wString  | ParamNameFromChildSlotName (const wchar_t *wszChildSlotName) const
virtual const CRhRdkContent *  | Parent (void) const
virtual_su void  | Promote (void)
virtual ProxyTypes  | ProxyType (void) const
virtual const CRhRdkDocument *  | RdkDocumentAssoc (void) const
virtual UUID  | RdkDocumentId (void) const
virtual const CRhRdkDocument *  | RdkDocumentOwner (void) const
virtual const RDK_DEPRECATED CRhRdkDocument *  | RdkDocumentRegistered (void) const
virtual RDK_DEPRECATED bool  | ReadParameterXMLStream (const wchar_t *wszStream, eGetParamsContext context)
virtual bool  | ReadParameterXMLStream (const wchar_t *wszStream, ReadParamsContext context)
virtual RDK_DEPRECATED bool  | ReadSimulationXMLStream (wchar_t *wszStream)
RDK_DEPRECATED bool  | ReadXMLStream (const wchar_t *wszStream)
virtual bool  | ReadXMLStream (const wchar_t *wszStream, const CRhinoFileReadOptions *pOptions)
virtual bool  | RemoveFromDocumentList (CRhRdkDocument &rdkDoc)
virtual bool  | RemoveRdkDocumentAssoc (void)
virtual unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags) const
RDK_DEPRECATED unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags, const IRhRdkLinearWorkflow &lw) const
unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags, const ON_LinearWorkflow &lw) const
virtual void  | ResetParametersToDefaults (const ON_ClassArray< ON_wString > &aParams)
virtual RDK_DEPRECATED void  | ResetUseCount (void) const
virtual void  | ResolveRelativePaths (const wchar_t *wszPathToFile)
virtual void  | ResolveURLPaths (bool bForceDownload=false)
ON_wString  | SavedCSN (void) const
virtual RDK_DEPRECATED bool  | SaveToLibraryFile (const ON_wString &sFullPath, const IRhRdkPreviewSceneServer *pSceneServer) const
virtual bool  | SaveToLibraryFile (const ON_wString &sFullPath, const IRhRdkPreviewSceneServer *pSceneServer, EmbedFilesChoice c) const
virtual bool  | SaveToLibraryFile_Internal (const wchar_t *wszFullPath, const IRhRdkPreviewSceneServer *pSceneServer, bool bEmbedFiles) const
virtual void  | SetAutoDelete (bool bAutoDelete)
virtual bool  | SetChild (const CRhRdkContent *pChild, const wchar_t *wszChildSlotName)
virtual bool  | SetChildSlotAmount (const wchar_t *wszChildSlotName, double dPercent)
virtual void  | SetChildSlotName (const wchar_t *wszChildSlotName)
virtual bool  | SetChildSlotOn (const wchar_t *wszChildSlotName, bool bOn)
virtual RDK_DEPRECATED void  | SetCRCCache (DWORD dwCRC) const
virtual bool  | SetDocumentAssoc (const CRhinoDoc &doc) const
virtual_su bool  | SetDocumentAssoc (const CRhRdkContent &source) const
virtual void  | SetGroupId (const UUID &uuidGroup) const
virtual void  | SetHidden (bool bHidden)
RDK_DEPRECATED void  | SetHidden (bool bHidden, eChangeContext cc)
virtual void  | SetInstanceId (UUID uuidInstance)
virtual void  | SetInstanceName (const wchar_t *wszName)
virtual_su void  | SetInstanceName (const wchar_t *wszName, bool bRenameEvents, bool bEnsureNameUnique)
virtual void  | SetInstanceNameImpl (const wchar_t *wszName, bool bRenameEvents)
virtual_su void  | SetInstanceNameImpl (const wchar_t *wszName, bool bRenameEvents, bool bEnsureNameUnique)
virtual void  | SetIsReference (bool b)
void  | SetIsRenderCRCRecursive (bool bRecursive)
virtual void  | SetIsRhinoObjectSelected (bool bSelected) const
virtual void  | SetLocked (void)
virtual void  | SetNotes (const wchar_t *wszNotes)
RDK_DEPRECATED void  | SetNotes (const wchar_t *wszNotes, bool bSendEvents)
virtual RDK_DEPRECATED bool  | SetParameter (const wchar_t *wszName, const CRhRdkVariant &vValue, eChangeContext cc)
virtual RDK_DEPRECATED bool  | SetParameters (class IRhRdk_XMLSection &section, eSetParamsContext context) const
virtual bool  | SetRdkDocumentAssoc (const CRhRdkDocument &rdkDoc)
virtual bool  | SetRdkDocumentOwner (CRhRdkDocument *pRdkDoc)
virtual void  | SetTags (const wchar_t *wszTags, bool bSendEvents=true)
virtual_su void  | SetWorkSessionReferenceModelSerialNumber (unsigned int sn)
virtual bool  | SmartUngroupRecursive (void)
virtual bool  | SupportsCommand (UUID uuidCommand) const
virtual bool  | SupportsContextHelp (void) const
virtual ON_wString  | Tags (void) const
ON_RenderContent *  | ToON_RenderContent (bool bRecursive=true) const
virtual CRhRdkContent &  | TopLevel (void)
virtual const CRhRdkContent &  | TopLevel (void) const
virtual CRhRdkContent *  | TopLevelParent (void)
virtual const CRhRdkContent *  | TopLevelParent (void) const
virtual ON_wString  | TypeDescription (void) const =0
virtual UUID  | TypeId (void) const =0
virtual ON_wString  | TypeName (void) const =0
virtual RDK_DEPRECATED bool  | Ungroup (void)
virtual bool  | Ungroup (void) const
virtual RDK_DEPRECATED bool  | UngroupRecursive (void)
virtual bool  | UngroupRecursive (void) const
virtual void  | Uninitialize (void)
ON_UnitSystem  | UnitSystem () const
virtual void  | UpdatePreview (void) const
virtual RDK_DEPRECATED void  | UpdateUI (void) const
virtual int  | UseCount (void) const
virtual void  | VerifyCopy (const CRhRdkContent *pCopy) const
virtual RDK_DEPRECATED const class IRhRdkThumbViewDefaults *  | ViewDefaults (void) const
virtual_su unsigned int  | WorkSessionReferenceModelSerialNumber (void) const
virtual RDK_DEPRECATED DWORD  | WriteParameterXMLStream (wchar_t *wszStream, DWORD dwMaxChars, eSetParamsContext context) const
virtual size_t  | WriteParameterXMLStream (wchar_t *wszStream, size_t maxChars, WriteParamsContext context) const
virtual size_t  | WriteSimulationXMLStream (wchar_t *wszStream, size_t maxChars) const
virtual RDK_DEPRECATED DWORD  | WriteXMLStream (wchar_t *wszStream, DWORD dwMaxChars, eSetParamsContext context) const
virtual size_t  | WriteXMLStream (wchar_t *wszStream, size_t maxChars, WriteParamsContext context, const CRhinoFileWriteOptions *pOptions) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IAutoUIExtraRequirements
virtual  | ~IAutoUIExtraRequirements ()
 Protected Member Functions
virtual void  | AddAutoParameters (IRhRdkParamBlock &paramBlock, int sectionId) const override
virtual unsigned int  | BitFlags (void) const override
virtual unsigned int  | ComputeRenderCRC (const CRenderCRCFlags &rcrcFlags) const override
virtual void  | GetAutoParameters (const IRhRdkParamBlock &paramBlock, int sectionId) override
virtual bool  | GetExtraRequirementParameter (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, CRhRdkVariant &vValueOut) const override
virtual void *  | GetShader (const UUID &uuidRenderEngine, void *pvData) const override
virtual bool  | IsBuiltIn (void) const override
virtual bool  | IsFactoryProductAcceptableAsChild (const CRhRdkContentFactory &f, const wchar_t *wszChildSlotName) const override
virtual bool  | IsImageBased (void) const override
virtual CRhRdkContent *  | MakeCopy (CopyMethods m=CopyMethods::Normal) const override
virtual CChildSlotIterator *  | NewChildSlotIterator (CSIContext context) const override
virtual UUID  | PlugInId (void) const override
virtual bool  | ReadParametersFromSection (const IRhRdk_XMLSection &section, ReadParamsContext context) override
virtual UUID  | RenderEngineId (void) const override
virtual bool  | SetExtraRequirementParameter (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, const CRhRdkVariant &vValue, SetContext sc) override
virtual bool  | SetParameter (const wchar_t *wszName, const CRhRdkVariant &value) override
virtual bool  | WriteParametersToSection (IRhRdk_XMLSection &section, WriteParamsContext context) const override
 Additional Inherited Members
 Public Types inherited from CRhRdkTexture
enum  | eBitFormat : int {
 eBitFormat::k32_bpc_RGB, eBitFormat::k32_bpc_BGR, eBitFormat::k32_bpc_RGBA, eBitFormat::k32_bpc_BGRA,
 eBitFormat::k8_bpc_RGB, eBitFormat::k8_bpc_BGR, eBitFormat::k8_bpc_RGBA, eBitFormat::k8_bpc_BGRA
 }
enum  | eLocalMappingType { lmt_none, lmt_2D, lmt_3D, lmt_force32bit = 0xFFFFFFFF }
enum  | EnvironmentMappingModes : unsigned int {
 EnvironmentMappingModes::Automatic = 0, EnvironmentMappingModes::Spherical = 1, EnvironmentMappingModes::Emap = 2, EnvironmentMappingModes::Box = 3,
 EnvironmentMappingModes::Lightprobe = 5, EnvironmentMappingModes::Cubemap = 6, EnvironmentMappingModes::VerticalCrossCubemap = 7, EnvironmentMappingModes::HorizontalCrossCubemap = 8,
 EnvironmentMappingModes::Hemispherical = 9
 }
enum  | ProjectionModes : int {
 ProjectionModes::Unset =-1, ProjectionModes::MappingChannel = 0, ProjectionModes::Wcs = 2, ProjectionModes::Emap = 3,
 ProjectionModes::WcsBox = 4, ProjectionModes::Screen = 5
 }
enum  | RDK_DEPRECATED {
 efNormal = 0, efDisableFiltering = 1, efDisableLocalMapping = 2, efDisableAdjustment = 4,
 efDisableProjectionChange = 8
 }
enum  | TextureGeneration : int { TextureGeneration::Allow = 1, TextureGeneration::Disallow = 2, TextureGeneration::Skip = 3 }
enum  | WrapTypes : unsigned int { WrapTypes::Clamped, WrapTypes::Repeating }
 Public Types inherited from CRhRdkCoreContent
enum  | SectionId : int { TextureSummary = 0x8000, NotUsed = 0x8001 }
 Public Types inherited from CRhRdkContent
enum  | : unsigned int {
 bfTextureSummary = 0x0001, bfQuickPreview = 0x0002, bfPreviewCache = 0x0004, bfLocalTextureMapping = 0x0010,
 bfGraphDisplay = 0x0020, bfAdjustment = 0x0080, bfFields = 0x0100, bfNameTypeSection = 0x0800
 }
enum  | {
 pg_unused = 0x00000000, pg_sphere = 0x00000001, pg_cube = 0x00000002, pg_cone = 0x00000004,
 pg_pyramid = 0x00000008, pg_torus = 0x00000010, pg_plane = 0x00000020, pg_cone_sphere = 0x00010000,
 pg_scene = 0x00020000, pg_default_mat = pg_sphere | pg_cube | pg_cone | pg_pyramid | pg_torus | pg_plane | pg_scene, pg_default_env = pg_cone_sphere, pg_default_tex = pg_unused,
 pg_mat_scene = pg_scene, force32bit_pgflags = 0xFFFFFFFF
 }
enum  | {
 pb_unused = 0x00000000, pb_none = 0x00000001, pb_checker = 0x00000002, pb_custom = 0x00000004,
 pb_scene = 0x00000008, pb_default_mat = pb_none | pb_checker | pb_custom | pb_scene, pb_default_env = pb_unused, pb_default_tex = pb_unused,
 force32bit_pbflags = 0xFFFFFFFF
 }
enum  | {
 pl_unused = 0x00000000, pl_simple = 0x00000001, pl_sky = 0x00000002, pl_default_mat = pl_simple | pl_sky,
 pl_default_env = pl_unused, pl_default_tex = pl_unused, force32bit_plflags = 0xFFFFFFFF
 }
enum  | CopyMethods : unsigned int { CopyMethods::Normal, CopyMethods::Transient }
enum  | CSIContext : unsigned int { CSIContext::All = 0, CSIContext::TextureSummary = 1, CSIContext::Private1 = 2, CSIContext::Private2 = 3 }
enum  | DupOpt { DupOpt::Attach, DupOpt::NoAttach }
enum  | DynamicIconUsage : unsigned int { DynamicIconUsage::TreeControl, DynamicIconUsage::SubnodeControl, DynamicIconUsage::ContentControl, DynamicIconUsage::General }
enum  | EmbedFilesChoice : unsigned int { EmbedFilesChoice::kNeverEmbed = 0, EmbedFilesChoice::kAlwaysEmbed = 1, EmbedFilesChoice::kAskUser = 2, EmbedFilesChoice::kRepeatLast = 3 }
enum  | ePreviewSceneType { preview_scene_server = 0, texture_2d_image = 1, force32_bit_sceneType = 0xFFFFFFFF }
enum  | GDS_Flags : UINT_PTR {
 gds_Normal = 0x00000, gds_KindPrefix = 0x00001, gds_UppercasePropNames = 0x00002, gds_AbbreviatePropNames = 0x00004,
 gds_NameAndIdFirst = 0x00008, gds_ShortUuids = 0x00010, gds_SuppressDocumentId = 0x00020, gds_SuppressGroupId = 0x00040,
 gds_SuppressKind = 0x00080, gds_SuppressTags = 0x00100, gds_SuppressUsage = 0x00200, gds_SuppressSerialNumber = 0x00400,
 gds_SuppressCRCs = 0x00800, gds_SuppressChildSlotName = 0x01000, gds_SuppressRegistration = 0x02000, gds_SuppressAttributes = 0x04000,
 gds_SuppressCustomUserData = 0x08000, gds_SuppressTextureProxy = 0x10000
 }
enum  | Harvested : unsigned int { Harvested::None = 0, Harvested::Some = 1, Harvested::All = 2 }
enum  | Kinds : unsigned int { Kinds::Unset, Kinds::Material, Kinds::Environment, Kinds::Texture }
enum  | ParamSerialMethod : unsigned int { ParamSerialMethod::GetSet, ParamSerialMethod::XmlStream }
enum  | ProxyTypes : unsigned int { ProxyTypes::None, ProxyTypes::Single, ProxyTypes::Multi, ProxyTypes::Texture }
enum  | ReadParamsContext : unsigned int { ReadParamsContext::Serialization = 0, ReadParamsContext::Harvesting = 1, ReadParamsContext::Rendering = 2 }
enum  | WriteParamsContext : unsigned int { WriteParamsContext::Serialization = 0, WriteParamsContext::Harvesting = 1, WriteParamsContext::Rendering = 2, WriteParamsContext::DragDrop = 3 }
 Public Types inherited from IAutoUIExtraRequirements
enum  | SetContext : unsigned int { SetContext::UI, SetContext::Drop, SetContext::Program }
 Static Public Member Functions inherited from CRhRdkTexture
static void  | ClearIconCache (void)
static bool  | EnvironmentMappingProjection (EnvironmentMappingModes emm, const ON_3dVector &reflection_vector, float &u, float &v)
static ON_3dPoint  | WcsBoxMapping (const ON_3dPoint &world_xyz, const ON_3dVector &normal)
 Static Public Member Functions inherited from CRhRdkContent
static RhRdkChangeContext  | ChangeContextFromSetContext (SetContext sc)
static RDK_DEPRECATED CRhRdkContent *  | CreateObjectFromType (UUID uuidType)
static CRhRdkContent *  | FromON_RenderContent (const class ON_RenderContent &rc, const CRhinoDoc *pDocAssoc, bool bRecursive)
static RDK_DEPRECATED CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML)
static RDK_DEPRECATED CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML, const CRhinoDoc *pDocAssoc)
static CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML, const CRhinoDoc *pDocAssoc, bool bUseXMLInstanceId)
static bool  | IsChangeContextUIBased (RhRdkChangeContext cc)
static CRhRdkContent *  | LoadFromLibraryFile (const wchar_t *sFullPath)
static SetContext  | SetContextFromChangeContext (RhRdkChangeContext cc)
static void  | UninitializeAndDelete (CRhRdkContent *pContent)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkOneColorTextureBase() [1/2]
 CRhRdkOneColorTextureBase::CRhRdkOneColorTextureBase  |  ( |   | )
◆ CRhRdkOneColorTextureBase() [2/2]
 CRhRdkOneColorTextureBase::CRhRdkOneColorTextureBase  |  ( |  bool  |  bAutoGlobalRegister | )
◆ ~CRhRdkOneColorTextureBase()
 virtual CRhRdkOneColorTextureBase::~CRhRdkOneColorTextureBase  |  ( |   | )
virtual
Member Function Documentation
◆ AddAutoParameters()
 virtual void CRhRdkOneColorTextureBase::AddAutoParameters  |  ( |  IRhRdkParamBlock &  |  paramBlock,
|  int  |  id
) |   |  const
overrideprotectedvirtual
Optionally override this method to add the content's parameters to a collection. You need to override this method if you are using the automatic UI system and also if your content supports the texture summary.
See also
BitFlags(). The default implementation is a no-op. Even if you are using fields, you still need to override this and call Fields().AddValuesToParamBlock().
Parameters
paramBlock | is the collection.
id | is a caller-defined identifier (can be zero if not needed). Values of 0x8000 and above are reserved for RDK internal use.
See also
enum CRhRdkCoreContent::eSectionId for special values used internally.
Reimplemented from CRhRdkContent.
◆ BitFlags()
 virtual unsigned int CRhRdkOneColorTextureBase::BitFlags  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Optionally override this method to modify the content's bit-flags. You should first call the base class and then modify the resulting value before finally returning it. This will ensure that you get the correct default behavior before modifying it.
Returns
The bit-coded flags for this content.
Reimplemented from CRhRdkTexture.
◆ Color1()
 virtual CRhRdkColor CRhRdkOneColorTextureBase::Color1  |  ( |  void  |   | ) |   const
virtual
◆ ComputeRenderCRC()
 virtual unsigned int CRhRdkOneColorTextureBase::ComputeRenderCRC  |  ( |  const CRenderCRCFlags &  |  rcrcFlags | ) |   const
overrideprotectedvirtual
Calculate the render CRC of the state that affects how the content is rendered. Does not include children or perform any caching. Render CRCs are now automatically cached by the content framework and you do not have to worry about caching. You also do not have to worry about recursing into children. This method is now only called internally by the RDK. If you have existing code that calls it (or CalculateRenderCRC()), please change your code to call RenderCRC() instead. RenderCRC() is the method that manages the cache and recursion by calling this method as needed. If you override this method and implement your own CRC function, you only have to compute the CRC of this content alone. This removes the need for the methods ChildrenRenderCRC(), IsCRCCached() and SetCRCCache(). These methods are now deprecated and never called.
See also
RenderCRC()
Reimplemented from CRhRdkContent.
◆ GetAutoParameters()
 virtual void CRhRdkOneColorTextureBase::GetAutoParameters  |  ( |  const IRhRdkParamBlock &  |  paramBlock,
|  int  |  id
)
overrideprotectedvirtual
Optionally override this method to get the content's parameters from a collection. You need to override this method if you are using the automatic UI system and also if your content supports the texture summary.
See also
BitFlags(). The default implementation is a no-op. Even if you are using fields, you still need to override this and call Fields().GetValuesFromParamBlock().
Parameters
paramBlock | is the collection.
id | is a caller-defined identifier (can be zero if not needed). Values of 0x8000 and above are reserved for RDK internal use.
See also
enum CRhRdkCoreContent::eSectionId for special values used internally.
Reimplemented from CRhRdkContent.
◆ GetExtraRequirementParameter()
 virtual bool CRhRdkOneColorTextureBase::GetExtraRequirementParameter  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszExtraReqName,
|  CRhRdkVariant &  |  vValueOut
) |   |  const
overrideprotectedvirtual
Optionally override this method to get a parameter for extra UI requirements. Please be sure to call the base class.
Parameters
wszParamName | The name of the content parameter for which to get an extra requirement parameter.
See also
ParamNameFromChildSlotName() which is relevant when addressing child slots.
Parameters
wszExtraReqName | The name of the extra requirement parameter to retrieve.
vValueOut | Receives the parameter's value.
Returns
true if the parameter was retrieved successfuly, else false.
Note
This method must set vValueOut to a non-null value if it returns true.
Reimplemented from CRhRdkContent.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ GetShader()
 virtual void* CRhRdkOneColorTextureBase::GetShader  |  ( |  const UUID &  |  uuidRenderEngine,
|  void *  |  pvData
) |   |  const
overrideprotectedvirtual
Implement this method to return a pointer to your renderer's shader object for this content.
Parameters
uuidRenderEngine | is the render engine id of the caller.
pvData | is a pointer to any necessary private data, or null if not required.
Returns
A pointer to your renderer's shader object or null on failure.
Reimplemented from CRhRdkContent.
◆ IsBuiltIn()
 virtual bool CRhRdkOneColorTextureBase::IsBuiltIn  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Reimplemented from CRhRdkContent.
◆ IsFactoryProductAcceptableAsChild()
 virtual bool CRhRdkOneColorTextureBase::IsFactoryProductAcceptableAsChild  |  ( |  const CRhRdkContentFactory &  |  f,
|  const wchar_t *  |  wszChildSlotName
) |   |  const
overrideprotectedvirtual
◆ IsImageBased()
 virtual bool CRhRdkOneColorTextureBase::IsImageBased  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Call this method to determine whether the texture is, at heart, an image. Generally it will be more efficient to call SimulateTexture in this case than using a texture evaluator, since all that really happens inside the evaluator is that the image is loaded and sampled.
Implements CRhRdkTexture.
◆ MakeCopy()
 virtual CRhRdkContent* CRhRdkOneColorTextureBase::MakeCopy  |  ( |  CopyMethods  |  m = CopyMethods::Normal | ) |   const
overrideprotectedvirtual
Copies the current content including its children.
Parameters
m | is the method used to create the copy. Most (if not all) clients will use the default, 'Normal'. 'Transient' is an advanced feature used for complex internal manipulation of contents; it will rarely, if ever, be used by ordinary clients.
Note
The copy can subsequently be attached to a document if desired.
 The copied contents will be found by RhRdkFindContentInstance().
Returns
A copy of the content tree.
Reimplemented from CRhRdkContent.
◆ NewChildSlotIterator()
 virtual CChildSlotIterator* CRhRdkOneColorTextureBase::NewChildSlotIterator  |  ( |  CSIContext  |  context | ) |   const
overrideprotectedvirtual
Returns
An iterator for accessing child slot information or null if not implemented. The caller shall delete the iterator.
Reimplemented from CRhRdkContent.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ PlugInId()
 virtual UUID CRhRdkOneColorTextureBase::PlugInId  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
The plug-in's Rhino plug-in id.
Implements CRhRdkContent.
◆ ReadParametersFromSection()
 virtual bool CRhRdkOneColorTextureBase::ReadParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  ReadParamsContext  |  context
)
overrideprotectedvirtual
Please be sure to call the base class if you override this function.
Reimplemented from CRhRdkTexture.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ RenderEngineId()
 virtual UUID CRhRdkOneColorTextureBase::RenderEngineId  |  ( |  void  |   | ) |   const
overrideprotectedvirtual
Returns
The plug-in's render engine id.
Implements CRhRdkContent.
◆ SetColor1()
 virtual void CRhRdkOneColorTextureBase::SetColor1  |  ( |  const CRhRdkColor &  |  col | )
virtual
◆ SetExtraRequirementParameter()
 virtual bool CRhRdkOneColorTextureBase::SetExtraRequirementParameter  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszExtraReqName,
|  const CRhRdkVariant &  |  vValue,
|  SetContext  |  sc
)
overrideprotectedvirtual
Optionally override this method to set a parameter for extra UI requirements. Please be sure to call the base class.
Parameters
wszParamName | The name of the content parameter for which to set an extra requirement parameter.
See also
ParamNameFromChildSlotName() which is relevant when addressing child slots.
Parameters
wszExtraReqName | The name of the extra requirement parameter to be set.
vValue | Contains the new value for the specified extra req. parameter.
sc | The context in which the set operation is being performed.
Returns
true if the parameter was set successfuly, else false.
Reimplemented from CRhRdkContent.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ SetParameter()
 virtual bool CRhRdkOneColorTextureBase::SetParameter  |  ( |  const wchar_t *  |  wszName,
|  const CRhRdkVariant &  |  value
)
overrideprotectedvirtual
Reimplemented from CRhRdkTexture.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ SetSuperSample()
 virtual void CRhRdkOneColorTextureBase::SetSuperSample  |  ( |  bool  |  bSwap | )
virtual
◆ SetTextureAmount1()
 virtual void CRhRdkOneColorTextureBase::SetTextureAmount1  |  ( |  double  |  d | )
virtual
◆ SetTextureOn1()
 virtual void CRhRdkOneColorTextureBase::SetTextureOn1  |  ( |  bool  |  bOn | )
virtual
◆ SetTile()
 virtual void CRhRdkOneColorTextureBase::SetTile  |  ( |  bool  |  bTile | )
virtual
◆ SuperSample()
 virtual bool CRhRdkOneColorTextureBase::SuperSample  |  ( |  void  |   | ) |   const
virtual
◆ TextureAmount1()
 virtual double CRhRdkOneColorTextureBase::TextureAmount1  |  ( |  void  |   | ) |   const
virtual
◆ TextureOn1()
 virtual bool CRhRdkOneColorTextureBase::TextureOn1  |  ( |  void  |   | ) |   const
virtual
◆ Tile()
 virtual bool CRhRdkOneColorTextureBase::Tile  |  ( |  void  |   | ) |   const
virtual
◆ WriteParametersToSection()
 virtual bool CRhRdkOneColorTextureBase::WriteParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section,
|  WriteParamsContext  |  context
) |   |  const
overrideprotectedvirtual
Please be sure to call the base class if you override this function.
Reimplemented from CRhRdkTexture.
Reimplemented in CRhRdkTwoColorTextureBase.