Public Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiModlessDockingDialogRecord Class Reference
RhinoUI
#include <RhinoSdkUiPageDockBarManager.h>
 Public Member Functions
CRhinoUiModlessDockingDialogRecord ()=default
virtual  | ~CRhinoUiModlessDockingDialogRecord ()=default
CDialog *  | Dialog () const
CRhinoUiModelessDockingDialog *  | DockingDialog () const
const wchar_t *  | Name () const
CRhinoUiPageDockBar *  | PageDockBar () const
 Protected Attributes
CRhinoUiModelessDockingDialog *  | m_dlg_page = nullptr
CRhinoUiPageDockBar *  | m_pPDB = nullptr
 Friends
class  | CRhinoUiModlessDockingDialogManager
Detailed Description
class CRhinoUiModelessDockingDialog
Constructor & Destructor Documentation
◆ CRhinoUiModlessDockingDialogRecord()
 CRhinoUiModlessDockingDialogRecord::CRhinoUiModlessDockingDialogRecord  |  ( |   | )
default
◆ ~CRhinoUiModlessDockingDialogRecord()
 virtual CRhinoUiModlessDockingDialogRecord::~CRhinoUiModlessDockingDialogRecord  |  ( |   | )
virtualdefault
Member Function Documentation
◆ Dialog()
 CDialog* CRhinoUiModlessDockingDialogRecord::Dialog  |  ( |   | ) |   const
◆ DockingDialog()
 CRhinoUiModelessDockingDialog* CRhinoUiModlessDockingDialogRecord::DockingDialog  |  ( |   | ) |   const
◆ Name()
 const wchar_t* CRhinoUiModlessDockingDialogRecord::Name  |  ( |   | ) |   const
◆ PageDockBar()
 CRhinoUiPageDockBar* CRhinoUiModlessDockingDialogRecord::PageDockBar  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoUiModlessDockingDialogManager
 friend class CRhinoUiModlessDockingDialogManager
friend
Member Data Documentation
◆ m_dlg_page
 CRhinoUiModelessDockingDialog* CRhinoUiModlessDockingDialogRecord::m_dlg_page = nullptr
protected
◆ m_pPDB
 CRhinoUiPageDockBar* CRhinoUiModlessDockingDialogRecord::m_pPDB = nullptr
protected