Public Member Functions | Friends | List of all members
CRhinoAnimatingDouble Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Public Member Functions
CRhinoAnimatingDouble ()
CRhinoAnimatingDouble (double value)
~CRhinoAnimatingDouble ()
void  | SetValue (double value)
double  | Value () const
 Friends
class  | CRhAnimatingDoublePrivate
Detailed Description
Copyright (c) 1993-2025 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoAnimatingDouble() [1/2]
 CRhinoAnimatingDouble::CRhinoAnimatingDouble  |  ( |   | )
◆ CRhinoAnimatingDouble() [2/2]
 CRhinoAnimatingDouble::CRhinoAnimatingDouble  |  ( |  double  |  value | )
◆ ~CRhinoAnimatingDouble()
 CRhinoAnimatingDouble::~CRhinoAnimatingDouble  |  ( |   | )
Member Function Documentation
◆ SetValue()
 void CRhinoAnimatingDouble::SetValue  |  ( |  double  |  value | )
◆ Value()
 double CRhinoAnimatingDouble::Value  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhAnimatingDoublePrivate
 friend class CRhAnimatingDoublePrivate
friend