Public Member Functions | List of all members
CRhinoViewportIterator Class Reference
Rhino
#include <rhinoSdkViewport.h>
 Public Member Functions
CRhinoViewportIterator (unsigned int rhino_doc_sn, unsigned int rhino_view_sn)
class CRhinoViewport *  | CurrentViewport () const
unsigned int  | CurrentViewportRuntimeSerialNumber () const
unsigned int  | DocRuntimeSerialNumber () const
class CRhinoViewport *  | First ()
class CRhinoViewport *  | Next ()
unsigned int  | ViewRuntimeSerialNumber () const
Constructor & Destructor Documentation
◆ CRhinoViewportIterator()
 CRhinoViewportIterator::CRhinoViewportIterator  |  ( |  unsigned int  |  rhino_doc_sn,
|  unsigned int  |  rhino_view_sn
)
Parameters: rhino_doc_sn - [in] 0: iteration ignores the document a viewportport is associated with. >0: iteration is restricted to viewportports associated with a specific document. rhino_view_sn - [in] 0: iteration ignores the viewport a viewportport is associated with. >0: iteration is restricted to viewportports associated with the specified viewport.
Member Function Documentation
◆ CurrentViewport()
 class CRhinoViewport* CRhinoViewportIterator::CurrentViewport  |  ( |   | ) |   const
Returns: The current value of the iterator. Remarks:
If First() or Next() has not been called, then Current() will return null.
If the viewport returned by First() or Next() has been deleted since the call to First() or Next(), then CurrentViewport() will return a null pointer.
◆ CurrentViewportRuntimeSerialNumber()
 unsigned int CRhinoViewportIterator::CurrentViewportRuntimeSerialNumber  |  ( |   | ) |   const
◆ DocRuntimeSerialNumber()
 unsigned int CRhinoViewportIterator::DocRuntimeSerialNumber  |  ( |   | ) |   const
Example: Iteratate all viewports: unsigned int rhino_doc_sn = 0 or CRhinoDoc.RuntimeSerialNumber(); unsigned int rhino_view_sn = 0 or CRhinoView.RuntimeSerialNumber(); CRhinoDocIterator doc_it(rhino_doc_sn,rhino_view_sn); for ( CRhinoViewport* rhino_viewport = viewport_it.First(); 0 != rhino_viewport; rhino_viewport = viewport_it.Next() ) { ... } Returns: 0: iteration ignores the document a viewportport is associated with. >0: iteration is restricted to viewportports associated with a specific document.
◆ First()
 class CRhinoViewport* CRhinoViewportIterator::First  |  ( |   | )
Returns: The first viewport that exists. Remarks: You may call First() multiple times on the same iterator.
◆ Next()
 class CRhinoViewport* CRhinoViewportIterator::Next  |  ( |   | )
Returns: The next viewport that exists. Remarks:
Once Next() returns null, it will continue to return null until First() is called.
If First() has not be called, the first call to Next() returns the first viewport in Rhino. This is done so that people can write while loops like CRhinoViewportIterator it(rhino_doc_sn); while ( CRhinoViewport* rhino_viewport = it.Next() ) { ... }
◆ ViewRuntimeSerialNumber()
 unsigned int CRhinoViewportIterator::ViewRuntimeSerialNumber  |  ( |   | ) |   const
Returns: 0: iteration ignores the viewport a viewportport is associated with. >0: iteration is restricted to viewportports associated with the specified viewport.