Public Member Functions | Public Attributes | List of all members
CRhinoUiLinetypeListCtrlInfo Class Reference
RhinoUI
CRhinoUiLinetypeListCtrlInfo. More...
#include <RhinoSdkUiLineTypeListCtrl.h>
 Public Member Functions
CRhinoUiLinetypeListCtrlInfo ()
CRhinoUiLinetypeListCtrlInfo (const ON_Linetype &linetype)
~CRhinoUiLinetypeListCtrlInfo ()
 Public Attributes
bool  | m_added
linetype was added or loaded More...
bool  | m_deleted
linetype was deleted More...
ON_Linetype  | m_linetype
bool  | m_modified
linetype was modified More...
Detailed Description
CRhinoUiLinetypeListCtrlInfo.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiLinetypeListCtrlInfo() [1/2]
 CRhinoUiLinetypeListCtrlInfo::CRhinoUiLinetypeListCtrlInfo  |  ( |   | )
◆ CRhinoUiLinetypeListCtrlInfo() [2/2]
 CRhinoUiLinetypeListCtrlInfo::CRhinoUiLinetypeListCtrlInfo  |  ( |  const ON_Linetype &  |  linetype | )
◆ ~CRhinoUiLinetypeListCtrlInfo()
 CRhinoUiLinetypeListCtrlInfo::~CRhinoUiLinetypeListCtrlInfo  |  ( |   | )
Member Data Documentation
◆ m_added
 bool CRhinoUiLinetypeListCtrlInfo::m_added
linetype was added or loaded
◆ m_deleted
 bool CRhinoUiLinetypeListCtrlInfo::m_deleted
linetype was deleted
◆ m_linetype
 ON_Linetype CRhinoUiLinetypeListCtrlInfo::m_linetype
◆ m_modified
 bool CRhinoUiLinetypeListCtrlInfo::m_modified
linetype was modified