Public Member Functions | Friends | List of all members
ON_GroundPlane Class Reference
OpenNURBS
#include <opennurbs_ground_plane.h>
 Public Member Functions
ON_GroundPlane ()
ON_GroundPlane (const ON_GroundPlane &gp)
ON_GroundPlane (ON_XMLNode &model_node)
virtual  | ~ON_GroundPlane ()
virtual double  | Altitude (void) const
virtual bool  | AutoAltitude (void) const
Returns true if auto-altitude is enabled. More...
virtual bool  | Enabled (void) const
Returns true if the ground plane is enabled, else false. More...
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual ON_UUID  | MaterialInstanceId (void) const
Returns the instance id of the ground plane's material. More...
virtual void  | OnInternalXmlChanged (const ON_GroundPlane *)
For internal use only. More...
virtual bool  | operator!= (const ON_GroundPlane &gp) const
virtual const ON_GroundPlane &  | operator= (const ON_GroundPlane &gp)
virtual bool  | operator== (const ON_GroundPlane &gp) const
virtual bool  | PopulateMaterial (ON_Material &mat) const
virtual void  | SetAltitude (double altitude)
Set the ground plane's altitude. More...
virtual void  | SetAutoAltitude (bool on)
Set if the ground plane is set to auto-altitude. More...
virtual void  | SetEnabled (bool on)
Set the ground plane enabled state. More...
virtual void  | SetMaterialInstanceId (const ON_UUID &uuid)
Set the instance id of the ground plane's material. More...
virtual void  | SetShadowOnly (bool on)
Set if the ground plane is set to shadow-only. More...
virtual void  | SetShowUnderside (bool on)
Set if the ground plane backface is enabled. More...
virtual void  | SetTextureOffset (const ON_2dVector &vec)
Set the texture offset of the ground plane in model units. More...
virtual void  | SetTextureOffsetLocked (bool locked)
Set if the texture offset x and y are locked together. More...
virtual void  | SetTextureRotation (double angle)
Set the texture rotation of the ground plane in degrees. More...
virtual void  | SetTextureSize (const ON_2dVector &vec)
Set the texture size of the ground plane in model units. More...
virtual void  | SetTextureSizeLocked (bool locked)
Set if the texture size x and y are locked together. More...
virtual bool  | ShadowOnly (void) const
Returns true if the ground plane is set to shadow-only. More...
virtual bool  | ShowUnderside (void) const
Returns true if ground plane backface is enabled, else false. More...
virtual ON_2dVector  | TextureOffset (void) const
Returns the texture offset of the ground plane in model units. More...
virtual bool  | TextureOffsetLocked (void) const
Returns true if the texture offset x and y are locked together. More...
virtual double  | TextureRotation (void) const
Returns the texture rotation of the ground plane in degrees. More...
virtual ON_2dVector  | TextureSize (void) const
Returns the texture size of the ground plane in model units. More...
virtual bool  | TextureSizeLocked (void) const
Returns true if the texture size x and y are locked together. More...
 Friends
class  | ON_3dmRenderSettingsPrivate
< For internal use only. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_GroundPlane() [1/3]
 ON_GroundPlane::ON_GroundPlane  |  ( |   | )
◆ ON_GroundPlane() [2/3]
 ON_GroundPlane::ON_GroundPlane  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_GroundPlane() [3/3]
 ON_GroundPlane::ON_GroundPlane  |  ( |  const ON_GroundPlane &  |  gp | )
◆ ~ON_GroundPlane()
 virtual ON_GroundPlane::~ON_GroundPlane  |  ( |   | )
virtual
Member Function Documentation
◆ Altitude()
 virtual double ON_GroundPlane::Altitude  |  ( |  void  |   | ) |   const
virtual
Returns the altitude of the ground plane. Note that this merely returns the stored value. It does not do any auto-altitude computation. Auto-altitude must be computed by a subclass (e.g., in Rhino).
◆ AutoAltitude()
 virtual bool ON_GroundPlane::AutoAltitude  |  ( |  void  |   | ) |   const
virtual
Returns true if auto-altitude is enabled.
◆ Enabled()
 virtual bool ON_GroundPlane::Enabled  |  ( |  void  |   | ) |   const
virtual
Returns true if the ground plane is enabled, else false.
◆ EVF()
 virtual void* ON_GroundPlane::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ MaterialInstanceId()
 virtual ON_UUID ON_GroundPlane::MaterialInstanceId  |  ( |  void  |   | ) |   const
virtual
Returns the instance id of the ground plane's material.
◆ OnInternalXmlChanged()
 virtual void ON_GroundPlane::OnInternalXmlChanged  |  ( |  const ON_GroundPlane *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_GroundPlane::operator!=  |  ( |  const ON_GroundPlane &  |  gp | ) |   const
virtual
◆ operator=()
 virtual const ON_GroundPlane& ON_GroundPlane::operator=  |  ( |  const ON_GroundPlane &  |  gp | )
virtual
◆ operator==()
 virtual bool ON_GroundPlane::operator==  |  ( |  const ON_GroundPlane &  |  gp | ) |   const
virtual
◆ PopulateMaterial()
 virtual bool ON_GroundPlane::PopulateMaterial  |  ( |  ON_Material &  |  mat | ) |   const
virtual
This method populates an ON_Material with default settings and returns true. This is designed to be overridden by a subclass that can return a more interesting material.
◆ SetAltitude()
 virtual void ON_GroundPlane::SetAltitude  |  ( |  double  |  altitude | )
virtual
Set the ground plane's altitude.
◆ SetAutoAltitude()
 virtual void ON_GroundPlane::SetAutoAltitude  |  ( |  bool  |  on | )
virtual
Set if the ground plane is set to auto-altitude.
◆ SetEnabled()
 virtual void ON_GroundPlane::SetEnabled  |  ( |  bool  |  on | )
virtual
Set the ground plane enabled state.
◆ SetMaterialInstanceId()
 virtual void ON_GroundPlane::SetMaterialInstanceId  |  ( |  const ON_UUID &  |  uuid | )
virtual
Set the instance id of the ground plane's material.
◆ SetShadowOnly()
 virtual void ON_GroundPlane::SetShadowOnly  |  ( |  bool  |  on | )
virtual
Set if the ground plane is set to shadow-only.
◆ SetShowUnderside()
 virtual void ON_GroundPlane::SetShowUnderside  |  ( |  bool  |  on | )
virtual
Set if the ground plane backface is enabled.
◆ SetTextureOffset()
 virtual void ON_GroundPlane::SetTextureOffset  |  ( |  const ON_2dVector &  |  vec | )
virtual
Set the texture offset of the ground plane in model units.
◆ SetTextureOffsetLocked()
 virtual void ON_GroundPlane::SetTextureOffsetLocked  |  ( |  bool  |  locked | )
virtual
Set if the texture offset x and y are locked together.
◆ SetTextureRotation()
 virtual void ON_GroundPlane::SetTextureRotation  |  ( |  double  |  angle | )
virtual
Set the texture rotation of the ground plane in degrees.
◆ SetTextureSize()
 virtual void ON_GroundPlane::SetTextureSize  |  ( |  const ON_2dVector &  |  vec | )
virtual
Set the texture size of the ground plane in model units.
◆ SetTextureSizeLocked()
 virtual void ON_GroundPlane::SetTextureSizeLocked  |  ( |  bool  |  locked | )
virtual
Set if the texture size x and y are locked together.
◆ ShadowOnly()
 virtual bool ON_GroundPlane::ShadowOnly  |  ( |  void  |   | ) |   const
virtual
Returns true if the ground plane is set to shadow-only.
◆ ShowUnderside()
 virtual bool ON_GroundPlane::ShowUnderside  |  ( |  void  |   | ) |   const
virtual
Returns true if ground plane backface is enabled, else false.
◆ TextureOffset()
 virtual ON_2dVector ON_GroundPlane::TextureOffset  |  ( |  void  |   | ) |   const
virtual
Returns the texture offset of the ground plane in model units.
◆ TextureOffsetLocked()
 virtual bool ON_GroundPlane::TextureOffsetLocked  |  ( |  void  |   | ) |   const
virtual
Returns true if the texture offset x and y are locked together.
◆ TextureRotation()
 virtual double ON_GroundPlane::TextureRotation  |  ( |  void  |   | ) |   const
virtual
Returns the texture rotation of the ground plane in degrees.
◆ TextureSize()
 virtual ON_2dVector ON_GroundPlane::TextureSize  |  ( |  void  |   | ) |   const
virtual
Returns the texture size of the ground plane in model units.
◆ TextureSizeLocked()
 virtual bool ON_GroundPlane::TextureSizeLocked  |  ( |  void  |   | ) |   const
virtual
Returns true if the texture size x and y are locked together.
Friends And Related Function Documentation
◆ ON_3dmRenderSettingsPrivate
 friend class ON_3dmRenderSettingsPrivate
friend
< For internal use only.