Public Member Functions | Public Attributes | Friends | List of all members
ON_BrepRegion Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepRegion:
 Public Member Functions
ON_BrepRegion ()
~ON_BrepRegion ()
bool  | AreaMassProperties (ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
const ON_BoundingBox &  | BoundingBox () const
const ON_Brep *  | Brep () const
ON_BrepFaceSide *  | FaceSide (int rfsi) const
bool  | GetSilhouette (const ON_SilhouetteParameters parameters, size_t clipping_plane_count, const ON_PlaneEquation *clipping_planes, ON_ClassArray< ON_SIL_EVENT > &silhouettes, ON_ProgressReporter *progress, ON_Terminator *terminator) const
bool  | IsFinite () const
bool  | IsPointInside (ON_3dPoint P, double tolerance, bool bStrictlyInside) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_BrepRegion &  | operator= (const ON_BrepRegion &)
bool  | Read (ON_BinaryArchive &binary_archive) override
ON_Brep *  | RegionBoundaryBrep (ON_Brep *brep=nullptr) const
class ON_BrepRegionTopology *  | RegionTopology () const
bool  | VolumeMassProperties (ON_MassProperties &mp, bool bVolume=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, ON_3dPoint base_point=ON_3dPoint::UnsetPoint, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
virtual unsigned int  | SizeOf () const
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
ON_BoundingBox  | m_bbox
ON_SimpleArray< int >  | m_fsi
indices of face sides More...
int  | m_region_index
index of region in ON_BrepRegionTopology.m_R[] array More...
ON_U  | m_region_user
int  | m_type
0 = infinite, 1 = bounded More...
 Friends
class  | ON_Brep
class  | ON_BrepRegionTopology
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Constructor & Destructor Documentation
◆ ON_BrepRegion()
 ON_BrepRegion::ON_BrepRegion  |  ( |   | )
◆ ~ON_BrepRegion()
 ON_BrepRegion::~ON_BrepRegion  |  ( |   | )
Member Function Documentation
◆ AreaMassProperties()
 bool ON_BrepRegion::AreaMassProperties  |  ( |  ON_MassProperties &  |  mp,
|  bool  |  bArea = true,
|  bool  |  bFirstMoments = true,
|  bool  |  bSecondMoments = true,
|  bool  |  bProductMoments = true,
|  double  |  rel_tol = 1.0e-6,
|  double  |  abs_tol = 1.0e-6
) |   |  const
◆ BoundingBox()
 const ON_BoundingBox& ON_BrepRegion::BoundingBox  |  ( |   | ) |   const
Returns: Region bounding box.
◆ Brep()
 const ON_Brep* ON_BrepRegion::Brep  |  ( |   | ) |   const
Returns: Brep this region belongs to.
◆ FaceSide()
 ON_BrepFaceSide* ON_BrepRegion::FaceSide  |  ( |  int  |  rfsi | ) |   const
Parameter: rfsi - [in] index into the region's m_fsi[] array. Returns: The face side in rtop.m_FS[m_fsi[rsi]], where rtop is the ON_BrepRegionTopology class this region belongs to.
◆ GetSilhouette()
 bool ON_BrepRegion::GetSilhouette  |  ( |  const ON_SilhouetteParameters  |  parameters,
|  size_t  |  clipping_plane_count,
|  const ON_PlaneEquation *  |  clipping_planes,
|  ON_ClassArray< ON_SIL_EVENT > &  |  silhouettes,
|  ON_ProgressReporter *  |  progress,
|  ON_Terminator *  |  terminator
) |   |  const
◆ IsFinite()
 bool ON_BrepRegion::IsFinite  |  ( |   | ) |   const
Returns: True if the region is finite.
◆ IsPointInside()
 bool ON_BrepRegion::IsPointInside  |  ( |  ON_3dPoint  |  P,
|  double  |  tolerance,
|  bool  |  bStrictlyInside
) |   |  const
◆ IsValid()
 bool ON_BrepRegion::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ operator=()
 ON_BrepRegion& ON_BrepRegion::operator=  |  ( |  const ON_BrepRegion &  |   | )
◆ Read()
 bool ON_BrepRegion::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ RegionBoundaryBrep()
 ON_Brep* ON_BrepRegion::RegionBoundaryBrep  |  ( |  ON_Brep *  |  brep = nullptr | ) |   const
Description: Get the boundary of a region as a brep object.
 If the region is finite, the boundary will be a closed manifold brep. The boundary may have more than one connected component. Parameters: brep - [in] if not nullptr, the brep form is put into this brep. Returns: the region boundary as a brep or nullptr if the calculation fails.
◆ RegionTopology()
 class ON_BrepRegionTopology* ON_BrepRegion::RegionTopology  |  ( |   | ) |   const
Returns: Region topology this region belongs to.
◆ VolumeMassProperties()
 bool ON_BrepRegion::VolumeMassProperties  |  ( |  ON_MassProperties &  |  mp,
|  bool  |  bVolume = true,
|  bool  |  bFirstMoments = true,
|  bool  |  bSecondMoments = true,
|  bool  |  bProductMoments = true,
|  ON_3dPoint  |  base_point = ON_3dPoint::UnsetPoint,
|  double  |  rel_tol = 1.0e-6,
|  double  |  abs_tol = 1.0e-6
) |   |  const
◆ Write()
 bool ON_BrepRegion::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Friends And Related Function Documentation
◆ ON_Brep
 friend class ON_Brep
friend
◆ ON_BrepRegionTopology
 friend class ON_BrepRegionTopology
friend
Member Data Documentation
◆ m_bbox
 ON_BoundingBox ON_BrepRegion::m_bbox
◆ m_fsi
 ON_SimpleArray<int> ON_BrepRegion::m_fsi
indices of face sides
◆ m_region_index
 int ON_BrepRegion::m_region_index
index of region in ON_BrepRegionTopology.m_R[] array
◆ m_region_user
 ON_U ON_BrepRegion::m_region_user
mutable
Union available for application use. The constructor zeros m_region_user. The value is of m_region_user is not saved in 3DM archives and may be changed by some computations.
◆ m_type
 int ON_BrepRegion::m_type
0 = infinite, 1 = bounded