Public Member Functions | Protected Attributes | List of all members
CArgsRhinoRailRevolve Class Reference
RhinoGet
#include <rhinoSdkGetRevolve.h>
 Public Member Functions
CArgsRhinoRailRevolve ()
~CArgsRhinoRailRevolve ()
ON_Line  | Axis () const
const wchar_t *  | AxisEndPrompt () const
const wchar_t *  | AxisStartPrompt () const
const ON_Curve *  | ProfileCurve () const
const CRhinoObjRef &  | ProfileObject () const
const wchar_t *  | ProfilePrompt () const
const ON_Curve *  | RailCurve () const
const CRhinoObjRef &  | RailObject () const
const wchar_t *  | RailPrompt () const
bool  | ScaleHeight () const
void  | SetAxis (ON_Line axis)
void  | SetAxisEndPrompt (const wchar_t *prompt)
void  | SetAxisStartPrompt (const wchar_t *prompt)
void  | SetProfileCurve (const ON_Curve *profile_curve)
void  | SetProfileObject (const CRhinoObjRef &profile_or)
void  | SetProfilePrompt (const wchar_t *prompt)
void  | SetRail (const ON_Curve *pCrv)
void  | SetRailCurve (const ON_Curve *rail_curve)
void  | SetRailObject (const CRhinoObjRef &rail_object)
void  | SetRailPrompt (const wchar_t *prompt)
void  | SetScaleHeight (bool scale)
 Protected Attributes
ON_Line  | m_axis
ON_wString  | m_axis_end_prompt
ON_wString  | m_axis_start_prompt
bool  | m_bScaleHeight
const ON_Curve *  | m_profile_curve
CRhinoObjRef  | m_profile_object
ON_wString  | m_profile_prompt
const ON_Curve *  | m_rail_curve
CRhinoObjRef  | m_rail_object
ON_wString  | m_rail_prompt
Detailed Description
class CArgsRhinoRevolve
Constructor & Destructor Documentation
◆ CArgsRhinoRailRevolve()
 CArgsRhinoRailRevolve::CArgsRhinoRailRevolve  |  ( |   | )
◆ ~CArgsRhinoRailRevolve()
 CArgsRhinoRailRevolve::~CArgsRhinoRailRevolve  |  ( |   | )
Member Function Documentation
◆ Axis()
 ON_Line CArgsRhinoRailRevolve::Axis  |  ( |   | ) |   const
◆ AxisEndPrompt()
 const wchar_t* CArgsRhinoRailRevolve::AxisEndPrompt  |  ( |   | ) |   const
◆ AxisStartPrompt()
 const wchar_t* CArgsRhinoRailRevolve::AxisStartPrompt  |  ( |   | ) |   const
Description: Set or Get the prompt for revolve axis Parameters: prompt [in] the new prompt Returns: The current prompt
◆ ProfileCurve()
 const ON_Curve* CArgsRhinoRailRevolve::ProfileCurve  |  ( |   | ) |   const
Description: Get profile curve Returns: profile_curve
◆ ProfileObject()
 const CRhinoObjRef& CArgsRhinoRailRevolve::ProfileObject  |  ( |   | ) |   const
Description: Get profile curve object Returns: profile_object.
◆ ProfilePrompt()
 const wchar_t* CArgsRhinoRailRevolve::ProfilePrompt  |  ( |   | ) |   const
C++ default copy constructor and operator equal work fine CArgsRhinoRailRevolve( const CArgsRhinoRailRevolve& src); CArgsRhinoRailRevolve& operator=( const CArgsRhinoRailRevolve& src); Description: Set or Get the prompt for profile curve Parameters: prompt [in] the new prompt Returns: The current prompt
◆ RailCurve()
 const ON_Curve* CArgsRhinoRailRevolve::RailCurve  |  ( |   | ) |   const
◆ RailObject()
 const CRhinoObjRef& CArgsRhinoRailRevolve::RailObject  |  ( |   | ) |   const
◆ RailPrompt()
 const wchar_t* CArgsRhinoRailRevolve::RailPrompt  |  ( |   | ) |   const
Description: Set or Get the prompt for rail curve Parameters: prompt [in] the new prompt Returns: The current prompt
◆ ScaleHeight()
 bool CArgsRhinoRailRevolve::ScaleHeight  |  ( |   | ) |   const
◆ SetAxis()
 void CArgsRhinoRailRevolve::SetAxis  |  ( |  ON_Line  |  axis | )
Description: Set or get the revolve axis Parameters: axis [in] - a line on the axis Returns: a line on the axis
◆ SetAxisEndPrompt()
 void CArgsRhinoRailRevolve::SetAxisEndPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetAxisStartPrompt()
 void CArgsRhinoRailRevolve::SetAxisStartPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetProfileCurve()
 void CArgsRhinoRailRevolve::SetProfileCurve  |  ( |  const ON_Curve *  |  profile_curve | )
Description: Set profile curve Parameters: profile_curve [in] - profile curve. Remarks: ~CArgsRhinoRailRevolve does not delete this curve.
◆ SetProfileObject()
 void CArgsRhinoRailRevolve::SetProfileObject  |  ( |  const CRhinoObjRef &  |  profile_or | )
Description: Set profile curve Parameters: profile_or [in] - profile_or.Curve() is used as the profile.
◆ SetProfilePrompt()
 void CArgsRhinoRailRevolve::SetProfilePrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetRail()
 void CArgsRhinoRailRevolve::SetRail  |  ( |  const ON_Curve *  |  pCrv | )
Description: Set or get a pointer to the rail curve Parameters: rail_curve [in] - rail curve to save Returns: pointer to the rail curve
◆ SetRailCurve()
 void CArgsRhinoRailRevolve::SetRailCurve  |  ( |  const ON_Curve *  |  rail_curve | )
◆ SetRailObject()
 void CArgsRhinoRailRevolve::SetRailObject  |  ( |  const CRhinoObjRef &  |  rail_object | )
◆ SetRailPrompt()
 void CArgsRhinoRailRevolve::SetRailPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetScaleHeight()
 void CArgsRhinoRailRevolve::SetScaleHeight  |  ( |  bool  |  scale | )
Description: Set or get whether or not hight of input profiles should scaled. Parameters: scale [in] - true: scale profile, false: don't scale Returns: @untitled table true Scale profile false Don't scale profile
Member Data Documentation
◆ m_axis
 ON_Line CArgsRhinoRailRevolve::m_axis
protected
◆ m_axis_end_prompt
 ON_wString CArgsRhinoRailRevolve::m_axis_end_prompt
protected
◆ m_axis_start_prompt
 ON_wString CArgsRhinoRailRevolve::m_axis_start_prompt
protected
◆ m_bScaleHeight
 bool CArgsRhinoRailRevolve::m_bScaleHeight
protected
◆ m_profile_curve
 const ON_Curve* CArgsRhinoRailRevolve::m_profile_curve
protected
◆ m_profile_object
 CRhinoObjRef CArgsRhinoRailRevolve::m_profile_object
protected
◆ m_profile_prompt
 ON_wString CArgsRhinoRailRevolve::m_profile_prompt
protected
◆ m_rail_curve
 const ON_Curve* CArgsRhinoRailRevolve::m_rail_curve
protected
◆ m_rail_object
 CRhinoObjRef CArgsRhinoRailRevolve::m_rail_object
protected
◆ m_rail_prompt
 ON_wString CArgsRhinoRailRevolve::m_rail_prompt
protected