Public Member Functions | Static Public Member Functions | List of all members
CRhRdkContentKindList Class Reference
RDK
#include <RhRdkContentKindList.h>
 Inheritance diagram for CRhRdkContentKindList:
 Public Member Functions
CRhRdkContentKindList ()
CRhRdkContentKindList (const CRhRdkContentKindList &)
CRhRdkContentKindList (CRhRdkContent::Kinds kind)
virtual  | ~CRhRdkContentKindList ()
virtual void  | Add (CRhRdkContent::Kinds kind)
virtual void  | AddAllKinds (void)
virtual bool  | Contains (CRhRdkContent::Kinds kind) const
virtual int  | Count (void) const
const CRhRdkContentKindList &  | operator= (const CRhRdkContentKindList &other)
CRhRdkContent::Kinds  | operator[] (int index) const
virtual void  | Remove (CRhRdkContent::Kinds kind)
virtual bool  | SetFromSemicolonDelimitedString (const wchar_t *wsz)
virtual CRhRdkContent::Kinds  | SingleKind (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static bool  | IsSupportedKind (CRhRdkContent::Kinds kind)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class is a collection of content kind designations.
Supported kinds are listed in "RhRdkContentKinds.h"
Constructor & Destructor Documentation
◆ CRhRdkContentKindList() [1/3]
 CRhRdkContentKindList::CRhRdkContentKindList  |  ( |   | )
Construct with no kinds.
◆ CRhRdkContentKindList() [2/3]
 CRhRdkContentKindList::CRhRdkContentKindList  |  ( |  CRhRdkContent::Kinds  |  kind | )
Construct from a single content kind.
◆ CRhRdkContentKindList() [3/3]
 CRhRdkContentKindList::CRhRdkContentKindList  |  ( |  const CRhRdkContentKindList &  |   | )
Copy constructor.
◆ ~CRhRdkContentKindList()
 virtual CRhRdkContentKindList::~CRhRdkContentKindList  |  ( |   | )
virtual
Member Function Documentation
◆ Add()
 virtual void CRhRdkContentKindList::Add  |  ( |  CRhRdkContent::Kinds  |  kind | )
virtual
Add a kind to the list.
◆ AddAllKinds()
 virtual void CRhRdkContentKindList::AddAllKinds  |  ( |  void  |   | )
virtual
Add all kinds to the list.
◆ Contains()
 virtual bool CRhRdkContentKindList::Contains  |  ( |  CRhRdkContent::Kinds  |  kind | ) |   const
virtual
Query whether or not the collection contains a particular kind designation.
Returns
true if the kind is in the collection, else false. This logic can be reversed by the SetInverse() method.
◆ Count()
 virtual int CRhRdkContentKindList::Count  |  ( |  void  |   | ) |   const
virtual
Returns
The number of kinds in the list.
◆ IsSupportedKind()
 static bool CRhRdkContentKindList::IsSupportedKind  |  ( |  CRhRdkContent::Kinds  |  kind | )
static
Query whether or not a content kind is supported by RDK.
Returns
true if kind is supported, else false.
◆ operator=()
 const CRhRdkContentKindList& CRhRdkContentKindList::operator=  |  ( |  const CRhRdkContentKindList &  |  other | )
◆ operator[]()
 CRhRdkContent::Kinds CRhRdkContentKindList::operator[]  |  ( |  int  |  index | ) |   const
◆ Remove()
 virtual void CRhRdkContentKindList::Remove  |  ( |  CRhRdkContent::Kinds  |  kind | )
virtual
Remove a kind from the list.
◆ SetFromSemicolonDelimitedString()
 virtual bool CRhRdkContentKindList::SetFromSemicolonDelimitedString  |  ( |  const wchar_t *  |  wsz | )
virtual
Set from a semicolon-delimited string of kinds, e.g., L"material;texture".
Returns
true if successful, false if the string is invalid.
◆ SingleKind()
 virtual CRhRdkContent::Kinds CRhRdkContentKindList::SingleKind  |  ( |  void  |   | ) |   const
virtual
Returns
the single kind in the list. If the list does not contain exactly one kind, returns 'Unset'.