Public Member Functions | Friends | List of all members
ON_GlyphMap Class Reference
OpenNURBS
#include <opennurbs_internal_glyph.h>
 Public Member Functions
ON_GlyphMap ()
~ON_GlyphMap ()=default
const class ON_FontGlyph *  | FindGlyph (const ON__UINT32 unicode_code_point) const
unsigned int  | GlyphCount () const
const ON_FontGlyph *  | InsertGlyph (const ON_FontGlyph &glyph)
returns pointer to the persistent glyph item More...
 Friends
class  | ON_Font
class  | ON_FontGlyph
Constructor & Destructor Documentation
◆ ON_GlyphMap()
 ON_GlyphMap::ON_GlyphMap  |  ( |   | )
◆ ~ON_GlyphMap()
 ON_GlyphMap::~ON_GlyphMap  |  ( |   | )
default
Member Function Documentation
◆ FindGlyph()
 const class ON_FontGlyph* ON_GlyphMap::FindGlyph  |  ( |  const ON__UINT32  |  unicode_code_point | ) |   const
◆ GlyphCount()
 unsigned int ON_GlyphMap::GlyphCount  |  ( |   | ) |   const
◆ InsertGlyph()
 const ON_FontGlyph* ON_GlyphMap::InsertGlyph  |  ( |  const ON_FontGlyph &  |  glyph | )
returns pointer to the persistent glyph item
Friends And Related Function Documentation
◆ ON_Font
 friend class ON_Font
friend
◆ ON_FontGlyph
 friend class ON_FontGlyph
friend