Public Member Functions | List of all members
CRhinoPurgeStatistics Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Public Member Functions
CRhinoPurgeStatistics ()
void  | Clear ()
int  | PurgedCount (RhinoDocPurgeFilter purge_filter) const
void  | SetPurgedCount (RhinoDocPurgeFilter purge_filter, int count)
int  | TotalPurgedCount () const
Detailed Description
Description: Statistics that describe what RhinoPurgeDocument() purged. Remarks: A count is recorded for every RhinoDocPurgeFilter value that was purged. See Also: RhinoPurgeDocument
Constructor & Destructor Documentation
◆ CRhinoPurgeStatistics()
 CRhinoPurgeStatistics::CRhinoPurgeStatistics  |  ( |   | )
Member Function Documentation
◆ Clear()
 void CRhinoPurgeStatistics::Clear  |  ( |   | )
Description: Sets all counts to zero.
◆ PurgedCount()
 int CRhinoPurgeStatistics::PurgedCount  |  ( |  RhinoDocPurgeFilter  |  purge_filter | ) |   const
Description: The number of table objects that were purged. Parameters: purge_filter [in] - The document table object types of interest. Values can be or-ed ( | ) together, in which case the sum of the counts of each type is returned. Returns: The number of table objects that were purged.
◆ SetPurgedCount()
 void CRhinoPurgeStatistics::SetPurgedCount  |  ( |  RhinoDocPurgeFilter  |  purge_filter,
|  int  |  count
)
Description: Sets the number of table objects that were purged. Parameters: purge_filter [in] - A single document table object type. count [in] - The number of table objects that were purged.
◆ TotalPurgedCount()
 int CRhinoPurgeStatistics::TotalPurgedCount  |  ( |   | ) |   const
Description: The total number of table objects that were purged. Returns: The number of table objects that were purged.