Public Member Functions | List of all members
ON_SafeFrame Class Reference
OpenNURBS
#include <opennurbs_safe_frame.h>
 Public Member Functions
ON_SafeFrame ()
ON_SafeFrame (const ON_SafeFrame &)
ON_SafeFrame (ON_XMLNode &model_node)
virtual  | ~ON_SafeFrame ()
virtual bool  | ActionFrameLinked (void) const
Returns true if the action frame X and Y scales are linked. More...
virtual bool  | ActionFrameOn (void) const
Returns true if the action frame is on. More...
virtual double  | ActionFrameXScale (void) const
Returns the action frame X scale. More...
virtual double  | ActionFrameYScale (void) const
Returns the action frame Y scale. More...
virtual bool  | Enabled (void) const
Returns true if the safe frame is enabled. More...
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual bool  | FieldGridOn (void) const
Returns true if the 4x3 field grid is on. More...
virtual bool  | LiveFrameOn (void) const
Returns true if the live frame is on. More...
virtual void  | OnInternalXmlChanged (const ON_SafeFrame *)
For internal use only. More...
virtual bool  | operator!= (const ON_SafeFrame &sf) const
virtual const ON_SafeFrame &  | operator= (const ON_SafeFrame &sf)
virtual bool  | operator== (const ON_SafeFrame &sf) const
virtual bool  | PerspectiveOnly (void) const
Returns true if the safe frame is only displayed in perspective views. More...
virtual void  | SetActionFrameLinked (bool b)
Sets whether or not the action frame X and Y scales are linked. More...
virtual void  | SetActionFrameOn (bool b)
Sets whether or not the action frame is on. More...
virtual void  | SetActionFrameXScale (double d)
virtual void  | SetActionFrameYScale (double d)
virtual void  | SetEnabled (bool b)
Sets the safe frame on or off. More...
virtual void  | SetFieldGridOn (bool b)
Sets whether or not the 4x3 field grid is on. More...
virtual void  | SetLiveFrameOn (bool b)
Sets whether or not the live frame is on. More...
virtual void  | SetPerspectiveOnly (bool b)
Sets whether or not the safe frame is only displayed in perspective views. More...
virtual void  | SetTitleFrameLinked (bool b)
Sets whether or not the title frame X and Y scales are linked. More...
virtual void  | SetTitleFrameOn (bool b)
Sets whether or not the title frame is on. More...
virtual void  | SetTitleFrameXScale (double d)
virtual void  | SetTitleFrameYScale (double d)
virtual bool  | TitleFrameLinked (void) const
Returns true if the title frame X and Y scales are linked. More...
virtual bool  | TitleFrameOn (void) const
Returns true if the title frame is on. More...
virtual double  | TitleFrameXScale (void) const
Returns the title frame X scale. More...
virtual double  | TitleFrameYScale (void) const
Returns the title frame Y scale. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_SafeFrame() [1/3]
 ON_SafeFrame::ON_SafeFrame  |  ( |   | )
◆ ON_SafeFrame() [2/3]
 ON_SafeFrame::ON_SafeFrame  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_SafeFrame() [3/3]
 ON_SafeFrame::ON_SafeFrame  |  ( |  const ON_SafeFrame &  |   | )
◆ ~ON_SafeFrame()
 virtual ON_SafeFrame::~ON_SafeFrame  |  ( |   | )
virtual
Member Function Documentation
◆ ActionFrameLinked()
 virtual bool ON_SafeFrame::ActionFrameLinked  |  ( |  void  |   | ) |   const
virtual
Returns true if the action frame X and Y scales are linked.
◆ ActionFrameOn()
 virtual bool ON_SafeFrame::ActionFrameOn  |  ( |  void  |   | ) |   const
virtual
Returns true if the action frame is on.
◆ ActionFrameXScale()
 virtual double ON_SafeFrame::ActionFrameXScale  |  ( |  void  |   | ) |   const
virtual
Returns the action frame X scale.
◆ ActionFrameYScale()
 virtual double ON_SafeFrame::ActionFrameYScale  |  ( |  void  |   | ) |   const
virtual
Returns the action frame Y scale.
◆ Enabled()
 virtual bool ON_SafeFrame::Enabled  |  ( |  void  |   | ) |   const
virtual
Returns true if the safe frame is enabled.
◆ EVF()
 virtual void* ON_SafeFrame::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ FieldGridOn()
 virtual bool ON_SafeFrame::FieldGridOn  |  ( |  void  |   | ) |   const
virtual
Returns true if the 4x3 field grid is on.
◆ LiveFrameOn()
 virtual bool ON_SafeFrame::LiveFrameOn  |  ( |  void  |   | ) |   const
virtual
Returns true if the live frame is on.
◆ OnInternalXmlChanged()
 virtual void ON_SafeFrame::OnInternalXmlChanged  |  ( |  const ON_SafeFrame *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_SafeFrame::operator!=  |  ( |  const ON_SafeFrame &  |  sf | ) |   const
virtual
◆ operator=()
 virtual const ON_SafeFrame& ON_SafeFrame::operator=  |  ( |  const ON_SafeFrame &  |  sf | )
virtual
◆ operator==()
 virtual bool ON_SafeFrame::operator==  |  ( |  const ON_SafeFrame &  |  sf | ) |   const
virtual
◆ PerspectiveOnly()
 virtual bool ON_SafeFrame::PerspectiveOnly  |  ( |  void  |   | ) |   const
virtual
Returns true if the safe frame is only displayed in perspective views.
◆ SetActionFrameLinked()
 virtual void ON_SafeFrame::SetActionFrameLinked  |  ( |  bool  |  b | )
virtual
Sets whether or not the action frame X and Y scales are linked.
◆ SetActionFrameOn()
 virtual void ON_SafeFrame::SetActionFrameOn  |  ( |  bool  |  b | )
virtual
Sets whether or not the action frame is on.
◆ SetActionFrameXScale()
 virtual void ON_SafeFrame::SetActionFrameXScale  |  ( |  double  |  d | )
virtual
Sets the action frame X scale. This value should be in the range 0..1 but it is not clamped.
◆ SetActionFrameYScale()
 virtual void ON_SafeFrame::SetActionFrameYScale  |  ( |  double  |  d | )
virtual
Sets the action frame Y scale. This value should be in the range 0..1 but it is not clamped.
◆ SetEnabled()
 virtual void ON_SafeFrame::SetEnabled  |  ( |  bool  |  b | )
virtual
Sets the safe frame on or off.
◆ SetFieldGridOn()
 virtual void ON_SafeFrame::SetFieldGridOn  |  ( |  bool  |  b | )
virtual
Sets whether or not the 4x3 field grid is on.
◆ SetLiveFrameOn()
 virtual void ON_SafeFrame::SetLiveFrameOn  |  ( |  bool  |  b | )
virtual
Sets whether or not the live frame is on.
◆ SetPerspectiveOnly()
 virtual void ON_SafeFrame::SetPerspectiveOnly  |  ( |  bool  |  b | )
virtual
Sets whether or not the safe frame is only displayed in perspective views.
◆ SetTitleFrameLinked()
 virtual void ON_SafeFrame::SetTitleFrameLinked  |  ( |  bool  |  b | )
virtual
Sets whether or not the title frame X and Y scales are linked.
◆ SetTitleFrameOn()
 virtual void ON_SafeFrame::SetTitleFrameOn  |  ( |  bool  |  b | )
virtual
Sets whether or not the title frame is on.
◆ SetTitleFrameXScale()
 virtual void ON_SafeFrame::SetTitleFrameXScale  |  ( |  double  |  d | )
virtual
Sets the title frame X scale. This value should be in the range 0..1 but it is not clamped.
◆ SetTitleFrameYScale()
 virtual void ON_SafeFrame::SetTitleFrameYScale  |  ( |  double  |  d | )
virtual
Sets the title frame Y scale. This value should be in the range 0..1 but it is not clamped.
◆ TitleFrameLinked()
 virtual bool ON_SafeFrame::TitleFrameLinked  |  ( |  void  |   | ) |   const
virtual
Returns true if the title frame X and Y scales are linked.
◆ TitleFrameOn()
 virtual bool ON_SafeFrame::TitleFrameOn  |  ( |  void  |   | ) |   const
virtual
Returns true if the title frame is on.
◆ TitleFrameXScale()
 virtual double ON_SafeFrame::TitleFrameXScale  |  ( |  void  |   | ) |   const
virtual
Returns the title frame X scale.
◆ TitleFrameYScale()
 virtual double ON_SafeFrame::TitleFrameYScale  |  ( |  void  |   | ) |   const
virtual
Returns the title frame Y scale.