Public Member Functions | Public Attributes | List of all members
CRhinoVarSrfResult Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Member Functions
CRhinoVarSrfResult ()
~CRhinoVarSrfResult ()
 Public Attributes
bool  | m_angleToleranceMet = false
true if edge G1 constraints are met More...
bool  | m_curvatureToleranceMet = false
true if edge G2 constraints are met More...
ON_wString  | m_error
errors More...
bool  | m_internalToleranceMet = false
true if internal G0 constraints More...
bool  | m_toleranceMet = false
true if edge G0 constraints are met More...
ON_wString  | m_warning
warnings to the user More...
Constructor & Destructor Documentation
◆ CRhinoVarSrfResult()
 CRhinoVarSrfResult::CRhinoVarSrfResult  |  ( |   | )
◆ ~CRhinoVarSrfResult()
 CRhinoVarSrfResult::~CRhinoVarSrfResult  |  ( |   | )
Member Data Documentation
◆ m_angleToleranceMet
 bool CRhinoVarSrfResult::m_angleToleranceMet = false
true if edge G1 constraints are met
◆ m_curvatureToleranceMet
 bool CRhinoVarSrfResult::m_curvatureToleranceMet = false
true if edge G2 constraints are met
◆ m_error
 ON_wString CRhinoVarSrfResult::m_error
errors
◆ m_internalToleranceMet
 bool CRhinoVarSrfResult::m_internalToleranceMet = false
true if internal G0 constraints
◆ m_toleranceMet
 bool CRhinoVarSrfResult::m_toleranceMet = false
true if edge G0 constraints are met
◆ m_warning
 ON_wString CRhinoVarSrfResult::m_warning
warnings to the user