Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_LinetypeSegment Class Reference
OpenNURBS
class ON_LinetypeSegment More...
#include <opennurbs_linestyle.h>
 Public Types
enum  | eSegType : unsigned int { eSegType::Unset = 0, eSegType::stLine = 1, eSegType::stSpace = 2 }
 Public Member Functions
ON_LinetypeSegment ()=default
ON_LinetypeSegment (const ON_LinetypeSegment &)=default
ON_LinetypeSegment (double segment_length, ON_LinetypeSegment::eSegType segment_type)
~ON_LinetypeSegment ()=default
void  | Dump (class ON_TextLog &) const
bool  | operator!= (const ON_LinetypeSegment &src) const
ON_LinetypeSegment &  | operator= (const ON_LinetypeSegment &)=default
bool  | operator== (const ON_LinetypeSegment &src) const
 Static Public Member Functions
static ON_LinetypeSegment::eSegType  | SegmentTypeFromUnsigned (unsigned int segment_type_as_unsigned)
 Public Attributes
double  | m_length = 0.0
do not add read/write functions to this class More...
eSegType  | m_seg_type = ON_LinetypeSegment::eSegType::Unset
 Static Public Attributes
static const ON_LinetypeSegment  | OneMillimeterLine
static const ON_LinetypeSegment  | Unset
Detailed Description
class ON_LinetypeSegment
Member Enumeration Documentation
◆ eSegType
 enum ON_LinetypeSegment::eSegType : unsigned int
strong
For a curve to be drawn starting at the start point and ending at the endpoint, the first segment in the pattern must be a stLine type
Enumerator
Unset
stLine
stSpace
Constructor & Destructor Documentation
◆ ON_LinetypeSegment() [1/3]
 ON_LinetypeSegment::ON_LinetypeSegment  |  ( |   | )
default
◆ ~ON_LinetypeSegment()
 ON_LinetypeSegment::~ON_LinetypeSegment  |  ( |   | )
default
◆ ON_LinetypeSegment() [2/3]
 ON_LinetypeSegment::ON_LinetypeSegment  |  ( |  const ON_LinetypeSegment &  |   | )
default
◆ ON_LinetypeSegment() [3/3]
 ON_LinetypeSegment::ON_LinetypeSegment  |  ( |  double  |  segment_length,
|  ON_LinetypeSegment::eSegType  |  segment_type
)
Member Function Documentation
◆ Dump()
 void ON_LinetypeSegment::Dump  |  ( |  class ON_TextLog &  |   | ) |   const
◆ operator!=()
 bool ON_LinetypeSegment::operator!=  |  ( |  const ON_LinetypeSegment &  |  src | ) |   const
◆ operator=()
 ON_LinetypeSegment& ON_LinetypeSegment::operator=  |  ( |  const ON_LinetypeSegment &  |   | )
default
◆ operator==()
 bool ON_LinetypeSegment::operator==  |  ( |  const ON_LinetypeSegment &  |  src | ) |   const
◆ SegmentTypeFromUnsigned()
 static ON_LinetypeSegment::eSegType ON_LinetypeSegment::SegmentTypeFromUnsigned  |  ( |  unsigned int  |  segment_type_as_unsigned | )
static
Member Data Documentation
◆ m_length
 double ON_LinetypeSegment::m_length = 0.0
do not add read/write functions to this class
length in millimeters on printed output
◆ m_seg_type
 eSegType ON_LinetypeSegment::m_seg_type = ON_LinetypeSegment::eSegType::Unset
◆ OneMillimeterLine
 const ON_LinetypeSegment ON_LinetypeSegment::OneMillimeterLine
static
◆ Unset
 const ON_LinetypeSegment ON_LinetypeSegment::Unset
static