Public Member Functions | List of all members
CRhinoTempAttachCMenu Class Reference
Rhino
#include <RhinoSdkContextMenu.h>
 Inheritance diagram for CRhinoTempAttachCMenu:
 Public Member Functions
CRhinoTempAttachCMenu (HMENU hMenu)
virtual  | ~CRhinoTempAttachCMenu ()
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: Helper class used to temporarily attached a CMenu to a HMENU then detach when done.
Constructor & Destructor Documentation
◆ CRhinoTempAttachCMenu()
 CRhinoTempAttachCMenu::CRhinoTempAttachCMenu  |  ( |  HMENU  |  hMenu | )
Description: Class constructor Parameters: hMenu [in] Menu to attach to
◆ ~CRhinoTempAttachCMenu()
 virtual CRhinoTempAttachCMenu::~CRhinoTempAttachCMenu  |  ( |   | )
virtual