Public Member Functions | Protected Attributes | List of all members
CRhRdkImageAdjust Class Reference
RDK
#include <IRhRdkDithering.h>
 Inheritance diagram for CRhRdkImageAdjust:
 Public Member Functions
CRhRdkImageAdjust ()
CRhRdkImageAdjust (const CRhRdkImageAdjust &a)
virtual  | ~CRhRdkImageAdjust ()
virtual IRhRdkDithering::Methods  | Dither (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
virtual float  | Gamma (void) const override
virtual bool  | IsEqual (const IRhRdkImageAdjust &a) const override
bool  | operator!= (const CRhRdkImageAdjust &a) const
const CRhRdkImageAdjust &  | operator= (const CRhRdkImageAdjust &a)
const CRhRdkImageAdjust &  | operator= (const IRhRdkImageAdjust &a)
bool  | operator== (const CRhRdkImageAdjust &a) const
bool  | operator== (const IRhRdkImageAdjust &a) const
virtual void  | SetDither (IRhRdkDithering::Methods dm) override
virtual void  | SetGamma (float f) override
virtual IRhRdkToneMapping &  | ToneMapping (void) const override
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Attributes
CImpl *  | m_pImpl
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from IRhRdkImageAdjust
virtual  | ~IRhRdkImageAdjust ()
Detailed Description
This class is obsolete and only kept for SDK backward compatibility. It is not implemented.
Constructor & Destructor Documentation
◆ CRhRdkImageAdjust() [1/2]
 CRhRdkImageAdjust::CRhRdkImageAdjust  |  ( |   | )
◆ CRhRdkImageAdjust() [2/2]
 CRhRdkImageAdjust::CRhRdkImageAdjust  |  ( |  const CRhRdkImageAdjust &  |  a | )
◆ ~CRhRdkImageAdjust()
 virtual CRhRdkImageAdjust::~CRhRdkImageAdjust  |  ( |   | )
virtual
Member Function Documentation
◆ Dither()
 virtual IRhRdkDithering::Methods CRhRdkImageAdjust::Dither  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkImageAdjust.
◆ EVF()
 virtual void* CRhRdkImageAdjust::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
inlineoverridevirtual
Implements IRhRdkImageAdjust.
◆ Gamma()
 virtual float CRhRdkImageAdjust::Gamma  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkImageAdjust.
◆ IsEqual()
 virtual bool CRhRdkImageAdjust::IsEqual  |  ( |  const IRhRdkImageAdjust &  |  a | ) |   const
overridevirtual
Implements IRhRdkImageAdjust.
◆ operator!=()
 bool CRhRdkImageAdjust::operator!=  |  ( |  const CRhRdkImageAdjust &  |  a | ) |   const
◆ operator=() [1/2]
 const CRhRdkImageAdjust& CRhRdkImageAdjust::operator=  |  ( |  const CRhRdkImageAdjust &  |  a | )
◆ operator=() [2/2]
 const CRhRdkImageAdjust& CRhRdkImageAdjust::operator=  |  ( |  const IRhRdkImageAdjust &  |  a | )
◆ operator==() [1/2]
 bool CRhRdkImageAdjust::operator==  |  ( |  const CRhRdkImageAdjust &  |  a | ) |   const
◆ operator==() [2/2]
 bool CRhRdkImageAdjust::operator==  |  ( |  const IRhRdkImageAdjust &  |  a | ) |   const
◆ SetDither()
 virtual void CRhRdkImageAdjust::SetDither  |  ( |  IRhRdkDithering::Methods  |  dm | )
overridevirtual
Implements IRhRdkImageAdjust.
◆ SetGamma()
 virtual void CRhRdkImageAdjust::SetGamma  |  ( |  float  |  f | )
overridevirtual
Implements IRhRdkImageAdjust.
◆ ToneMapping()
 virtual IRhRdkToneMapping& CRhRdkImageAdjust::ToneMapping  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkImageAdjust.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkImageAdjust::m_pImpl
protected