Public Types | Public Member Functions | Static Public Member Functions | List of all members
ON_ClippingArrowhead Class Reference
OpenNURBS
#include <opennurbs_dimensionstyle.h>
 Public Types
enum  | arrow_type : unsigned int {
 arrow_type::None = 0, arrow_type::Triangle = 1, arrow_type::OffsetTriangle = 2, arrow_type::Arrow = 3,
 arrow_type::OffsetArrow = 4, arrow_type::OpenArrow = 5, arrow_type::Rectangle = 6, arrow_type::Ribbon = 7,
 arrow_type::Line = 8
 }
Defines enumerated values for arrowhead shapes. More...
 Public Member Functions
ON_ClippingArrowhead ()=default
ON_ClippingArrowhead (const ON_ClippingArrowhead &)=default
~ON_ClippingArrowhead ()=default
arrow_type  | ArrowheadType () const
bool  | operator!= (const ON_ClippingArrowhead &other) const
ON_ClippingArrowhead &  | operator= (const ON_ClippingArrowhead &)=default
bool  | operator== (const ON_ClippingArrowhead &other) const
void  | SetArrowheadType (arrow_type type)
 Static Public Member Functions
static ON_ClippingArrowhead::arrow_type  | ArrowTypeFromUnsigned (unsigned int type_as_unsigned)
static ON_ClippingArrowhead::arrow_type  | DefaultArrowType ()
static bool  | GetArrowheadBoundingBox (ON_ClippingArrowhead::arrow_type arrow_type, ON_UUID arrow_block_id, ON_Xform xform, ON_BoundingBox &bbox, bool grow)
static ON__UINT32  | GetPoints (arrow_type type, const double *&points)
static ON__UINT32  | GetPoints (arrow_type type, ON_2dPointArray &points)
Member Enumeration Documentation
◆ arrow_type
 enum ON_ClippingArrowhead::arrow_type : unsigned int
strong
Defines enumerated values for arrowhead shapes.
Enumerator
None
Triangle
OffsetTriangle
2:1
Arrow
OffsetArrow
OpenArrow
1:1
Rectangle
Ribbon
Line
4:1
Constructor & Destructor Documentation
◆ ON_ClippingArrowhead() [1/2]
 ON_ClippingArrowhead::ON_ClippingArrowhead  |  ( |   | )
default
◆ ~ON_ClippingArrowhead()
 ON_ClippingArrowhead::~ON_ClippingArrowhead  |  ( |   | )
default
◆ ON_ClippingArrowhead() [2/2]
 ON_ClippingArrowhead::ON_ClippingArrowhead  |  ( |  const ON_ClippingArrowhead &  |   | )
default
Member Function Documentation
◆ ArrowheadType()
 arrow_type ON_ClippingArrowhead::ArrowheadType  |  ( |   | ) |   const
◆ ArrowTypeFromUnsigned()
 static ON_ClippingArrowhead::arrow_type ON_ClippingArrowhead::ArrowTypeFromUnsigned  |  ( |  unsigned int  |  type_as_unsigned | )
static
◆ DefaultArrowType()
 static ON_ClippingArrowhead::arrow_type ON_ClippingArrowhead::DefaultArrowType  |  ( |   | )
static
◆ GetArrowheadBoundingBox()
 static bool ON_ClippingArrowhead::GetArrowheadBoundingBox  |  ( |  ON_ClippingArrowhead::arrow_type  |  arrow_type,
|  ON_UUID  |  arrow_block_id,
|  ON_Xform  |  xform,
|  ON_BoundingBox &  |  bbox,
|  bool  |  grow
)
static
◆ GetPoints() [1/2]
 static ON__UINT32 ON_ClippingArrowhead::GetPoints  |  ( |  arrow_type  |  type,
|  const double *&  |  points
)
static
ON_UUID ArrowBlockId() const; void SetArrowBlockId(ON_UUID id);
◆ GetPoints() [2/2]
 static ON__UINT32 ON_ClippingArrowhead::GetPoints  |  ( |  arrow_type  |  type,
|  ON_2dPointArray &  |  points
)
static
◆ operator!=()
 bool ON_ClippingArrowhead::operator!=  |  ( |  const ON_ClippingArrowhead &  |  other | ) |   const
◆ operator=()
 ON_ClippingArrowhead& ON_ClippingArrowhead::operator=  |  ( |  const ON_ClippingArrowhead &  |   | )
default
◆ operator==()
 bool ON_ClippingArrowhead::operator==  |  ( |  const ON_ClippingArrowhead &  |  other | ) |   const
◆ SetArrowheadType()
 void ON_ClippingArrowhead::SetArrowheadType  |  ( |  arrow_type  |  type | )