Public Member Functions | List of all members
CRhRdkTaskOrigin Class Referenceabstract
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkTaskOrigin:
 Public Member Functions
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const =0
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const =0
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | SupportsTask (const CRhRdkTask &t) const
virtual const wchar_t *  | TopLevelKind (void) const =0
virtual UUID  | Uuid (void) const =0
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkTaskOrigin()
 CRhRdkTaskOrigin::CRhRdkTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con
)
◆ ~CRhRdkTaskOrigin()
 virtual CRhRdkTaskOrigin::~CRhRdkTaskOrigin  |  ( |   | )
virtual
Member Function Documentation
◆ Control()
 virtual IRhRdkTaskCollection::Control CRhRdkTaskOrigin::Control  |  ( |  void  |   | ) |   const
pure virtual
Implemented in CRhRdkColorButtonTaskOrigin, CRhRdkSubNodeTaskOrigin, CRhRdkBreadcrumbTaskOrigin, CRhRdkEditorPreviewTaskOrigin, CRhRdkFloatingPreviewTaskOrigin, CRhRdkContentInstanceBrowserTaskOrigin, CRhRdkContentTypeBrowserTaskOrigin_Existing, CRhRdkContentTypeBrowserTaskOrigin_New, CRhRdkContentTreeTaskOrigin, and CRhRdkThumbnailTaskOrigin.
◆ Controller()
 CRhRdkControllerPtr CRhRdkTaskOrigin::Controller  |  ( |  void  |   | ) |   const
◆ GetSelectedCount()
 virtual int CRhRdkTaskOrigin::GetSelectedCount  |  ( |  void  |   | ) |   const
virtual
◆ GetSelection()
 void CRhRdkTaskOrigin::GetSelection  |  ( |  CRhRdkContentArray &  |  aContentOut,
|  bool  |  bForModify = false
) |   |  const
Get the contents that have been selected by the user.
Parameters
aContentOut | accepts the selected contents.
bForModify | indicates if the operation is planning to modify the contents.
◆ GetSelectionImpl()
 virtual void CRhRdkTaskOrigin::GetSelectionImpl  |  ( |  CRhRdkContentArray &  |  aContentOut | ) |   const
pure virtual
Implement this to get the contents that have been selected by the user.
Parameters
aContentOut | accepts the selected contents.
Implemented in CRhRdkBreadcrumbTaskOrigin, CRhRdkSubNodeTaskOrigin, CRhRdkSingleSelectionTaskOrigin, CRhRdkContentTreeTaskOrigin, and CRhRdkThumbnailTaskOrigin.
◆ GetState()
 virtual int CRhRdkTaskOrigin::GetState  |  ( |  void  |   | ) |   const
virtual
TODO: Docs INTERNAL
◆ IsAmbivalent()
 virtual bool CRhRdkTaskOrigin::IsAmbivalent  |  ( |  void  |   | ) |   const
virtual
A task origin is 'ambivalent' when it wants to show tasks for both top-level and child contents on the same menu. This is a special quirk of the spanner menu.
◆ OnBeginAskUserSure()
 virtual void CRhRdkTaskOrigin::OnBeginAskUserSure  |  ( |  const UUID &  |  uuidTask | ) |   const
virtual
◆ OnBeginExecuteTask()
 virtual void CRhRdkTaskOrigin::OnBeginExecuteTask  |  ( |  const UUID &  |  uuidTask | ) |   const
virtual
Reimplemented in CRhRdkSubNodeTaskOrigin.
◆ OnEndAskUserSure()
 virtual void CRhRdkTaskOrigin::OnEndAskUserSure  |  ( |  const UUID &  |  uuidTask,
|  RhRdkMbResult
) |   |  const
virtual
◆ OnEndExecuteTask()
 virtual void CRhRdkTaskOrigin::OnEndExecuteTask  |  ( |  const UUID &  |  uuidTask,
|  CRhRdkTask::Result
) |   |  const
virtual
Reimplemented in CRhRdkSubNodeTaskOrigin.
◆ PreviewAppearance()
 virtual const CRhRdkPreviewAppearance* CRhRdkTaskOrigin::PreviewAppearance  |  ( |  void  |   | ) |   const
virtual
TODO: Docs
Reimplemented in CRhRdkSingleSelectionTaskOrigin, and CRhRdkContextTaskOriginWithCEC.
◆ PreviewMetaData()
 virtual const CRhRdkPreviewMetaData* CRhRdkTaskOrigin::PreviewMetaData  |  ( |  void  |   | ) |   const
virtual
TODO: Docs
Reimplemented in CRhRdkContextTaskOriginWithCEC.
◆ RdkDocument()
 virtual CRhRdkDocument* CRhRdkTaskOrigin::RdkDocument  |  ( |  void  |   | ) |   const
virtual
◆ RhinoDoc()
 virtual CRhinoDoc* CRhRdkTaskOrigin::RhinoDoc  |  ( |  void  |   | ) |   const
virtual
◆ SupportsTask()
 virtual bool CRhRdkTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  t | ) |   const
virtual
Reimplemented in CRhRdkBreadcrumbTaskOrigin, CRhRdkSubNodeTaskOrigin, CRhRdkFloatingPreviewTaskOrigin, CRhRdkContentInstanceBrowserTaskOrigin, CRhRdkContentTypeBrowserTaskOrigin, CRhRdkSingleSelectionTaskOrigin, and CRhRdkContextTaskOrigin.
◆ TopLevelKind()
 virtual const wchar_t* CRhRdkTaskOrigin::TopLevelKind  |  ( |  void  |   | ) |   const
pure virtual
TODO: Docs
Implemented in CRhRdkSubNodeTaskOrigin, CRhRdkSingleSelectionTaskOrigin, and CRhRdkContextTaskOriginWithCEC.
◆ Uuid()
 virtual UUID CRhRdkTaskOrigin::Uuid  |  ( |  void  |   | ) |   const
pure virtual
TODO: Docs
Implemented in CRhRdkSubNodeTaskOrigin, CRhRdkSingleSelectionTaskOrigin, and CRhRdkContextTaskOriginWithCEC.
◆ WillReplaceContent()
 virtual bool CRhRdkTaskOrigin::WillReplaceContent  |  ( |  void  |   | ) |   const
virtual
TODO: Docs
Reimplemented in CRhRdkContentTreeSelTaskOrigin, and CRhRdkThumbnailSelTaskOrigin.