Static Public Member Functions | List of all members
CRhinoGetDimAngular Class Reference
Rhino
Class to interactively get user input for angular dimensions. More...
#include <RhinoSdkDimAngular.h>
 Static Public Member Functions
static bool  | DragDimAngleArc (ON_DimAngular *&output_dimension)
static CRhinoCommand::result  | GetDimAngular (const unsigned int doc_sn, ON_DimAngular *&output_dimension, bool bInteractive, CRhinoDimAngular::definition_mode &def_mode, bool picked_ob[3], CRhinoObjRef objrefs[3], ON_Line lines[2], ON_3dPoint pickpoints[2], ON_3dPoint &centerpoint, ON_3dPoint &arcpoint)
Pick point on arc. More...
Detailed Description
Class to interactively get user input for angular dimensions.
Member Function Documentation
◆ DragDimAngleArc()
 static bool CRhinoGetDimAngular::DragDimAngleArc  |  ( |  ON_DimAngular *&  |  output_dimension | )
static
Description: Drag the dimension arc of an angular dimension and draw the dynamic feedback Parameters: output_dimension [in/out] - Pointer to an allocated dimension to drag and update. The dimension must be created with the proper dimstyle and plane If the dragging is successful, the dimension will be updated Returns:
 true - Dragging worked false - Dragging failed
◆ GetDimAngular()
 static CRhinoCommand::result CRhinoGetDimAngular::GetDimAngular  |  ( |  const unsigned int  |  doc_sn,
|  ON_DimAngular *&  |  output_dimension,
|  bool  |  bInteractive,
|  CRhinoDimAngular::definition_mode &  |  def_mode,
|  bool  |  picked_ob[3],
|  CRhinoObjRef  |  objrefs[3],
|  ON_Line  |  lines[2],
|  ON_3dPoint  |  pickpoints[2],
|  ON_3dPoint &  |  centerpoint,
|  ON_3dPoint &  |  arcpoint
)
static
Pick point on arc.
Description: Gets an angular dimension from user input Will allocate dim_out memory which caller must delete Parameters: doc_sn, [in] Serial no of the document for annotation styles output_dimension [out] Resulting dimension objrefs[3], [out] ObjRefs of objects osnapped to or object picked to dimension bInteractive, [in] true: run in interactive mode false - run in script mode def_mode, [out] Lines - picked lines or line segments Arc - picked an arc Points - picked three 3d points picked_ob[3], [out] If picked_ob[i] is true, objref[i] has information about the object picked lines[2] [out] If lines or line segments were picked, their endpoints are here pickpoints[2] [out] If lines or line segments were picked, this is where they were picked centerpoint [out] Center of the dimension arcpoint [out] Point on the dimension arc
Returns: Failure: No dimension gotten Success: Got a dimension
Parameters
picked_ob | Set true if objects are picked in point mode
pickpoints | Pick points on lines
centerpoint | Apex of the dimension