Public Member Functions | List of all members
CRhRdkExtraRequirements Class Reference
RDK
#include <RhRdkExtraRequirements.h>
 Inheritance diagram for CRhRdkExtraRequirements:
 Public Member Functions
CRhRdkExtraRequirements ()
virtual  | ~CRhRdkExtraRequirements ()
virtual void  | AddItem (const ON_wString &sName, const CRhRdkVariant &vValue)
virtual int  | Count (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual bool  | FindValue (const wchar_t *wszName, CRhRdkVariant &vValueOut) const
virtual ON_wString  | Name (int iIndex) const
virtual CRhRdkVariant  | Value (int iIndex) const
 Public Member Functions inherited from IRhRdk_XMLSection::IExtraRequirements
virtual  | ~IExtraRequirements ()
Constructor & Destructor Documentation
◆ CRhRdkExtraRequirements()
 CRhRdkExtraRequirements::CRhRdkExtraRequirements  |  ( |   | )
◆ ~CRhRdkExtraRequirements()
 virtual CRhRdkExtraRequirements::~CRhRdkExtraRequirements  |  ( |   | )
virtual
Member Function Documentation
◆ AddItem()
 virtual void CRhRdkExtraRequirements::AddItem  |  ( |  const ON_wString &  |  sName,
|  const CRhRdkVariant &  |  vValue
)
virtual
◆ Count()
 virtual int CRhRdkExtraRequirements::Count  |  ( |  void  |   | ) |   const
virtual
Implements IRhRdk_XMLSection::IExtraRequirements.
◆ EVF()
 virtual void* CRhRdkExtraRequirements::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Implements IRhRdk_XMLSection::IExtraRequirements.
◆ FindValue()
 virtual bool CRhRdkExtraRequirements::FindValue  |  ( |  const wchar_t *  |  wszName,
|  CRhRdkVariant &  |  vValueOut
) |   |  const
virtual
Implements IRhRdk_XMLSection::IExtraRequirements.
◆ Name()
 virtual ON_wString CRhRdkExtraRequirements::Name  |  ( |  int  |  iIndex | ) |   const
virtual
Implements IRhRdk_XMLSection::IExtraRequirements.
◆ Value()
 virtual CRhRdkVariant CRhRdkExtraRequirements::Value  |  ( |  int  |  iIndex | ) |   const
virtual
Implements IRhRdk_XMLSection::IExtraRequirements.