Public Types | Public Member Functions | Static Public Member Functions | List of all members
ON_RdkUserData Class Reference
OpenNURBS
#include <opennurbs_xml.h>
 Inheritance diagram for ON_RdkUserData:
 Public Types
typedef bool(*  | ReadCallback) (ON_RdkUserData &ud)
typedef bool(*  | TransformCallback) (ON_RdkUserData &ud, const ON_Xform &xform)
typedef bool(*  | WriteCallback) (const ON_RdkUserData &ud)
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
ON_RdkUserData ()
ON_RdkUserData (const ON_RdkUserData &ud)
virtual  | ~ON_RdkUserData ()
virtual bool  | DeleteAfterRead (const ON_BinaryArchive &archive, ON_Object *parent_object) const override
virtual bool  | DeleteAfterWrite (const ON_BinaryArchive &archive, const ON_Object *parent_object) const override
virtual bool  | GetDescription (ON_wString &s) override
const ON_RdkUserData &  | operator= (const ON_RdkUserData &ud)
virtual bool  | Read (ON_BinaryArchive &) override
virtual void  | ReportVersionError (void) const override
virtual void  | SetToDefaults (void) const override
virtual bool  | Transform (const ON_Xform &xform) override
virtual bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_XMLUserData
ON_XMLUserData ()
ON_XMLUserData (const ON_XMLUserData &ud)
virtual  | ~ON_XMLUserData ()
virtual void  | _Dump (const wchar_t *wszFileName) const
virtual bool  | Archive (void) const override
virtual void  | Clear (void) const
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
const ON_XMLUserData &  | operator= (const ON_XMLUserData &ud)
virtual ON_XMLProperty *  | Property (const wchar_t *xml_path, const wchar_t *prop_name) const
virtual void  | SetToDefaultsImpl (int) const
virtual void  | SetValue (const wchar_t *xml_path, const ON_XMLVariant &value)
virtual bool  | SetValue (const wchar_t *xml_path, const wchar_t *prop_name, const ON_XMLVariant &value)
virtual ON_XMLVariant  | Value (const wchar_t *xml_path, const wchar_t *prop_name=L"") const
virtual int  | Version (void) const
virtual const ON_XMLRootNode &  | XMLRootForRead (void) const
virtual ON_XMLRootNode &  | XMLRootForWrite (void) const
 Public Member Functions inherited from ON_UserData
ON_UserData ()
ON_UserData (const ON_UserData &src)
The copy constructor copies every ON_UserData member variable except the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next and m_userdata_copycount. the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next are set to nullptr; in particular, the new instance of ON_UserData is not attached to any object immediately after copy constrtuction. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. More...
ON_UserData (ON_UUID userdata_uuid, ON_UUID application_uuid, unsigned int userdata_copycount)
~ON_UserData ()
virtual bool  | DeleteAfterRead (const class ON_BinaryArchive &archive, class ON_Object *parent_object) const
virtual bool  | DeleteAfterWrite (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
void  | Dump (ON_TextLog &text_log) const override
bool  | IsUnknownUserData () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UserData *  | Next () const
ON_UserData &  | operator= (const ON_UserData &src)
The operator= copies m_userdata_xform. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. All other ON_UserData member variables (m_userdata_uuid, m_application_uuid, m_userdata_owner, and m_userdata_next) are not changed. In particular, operator= does not change the parent object nor does it change the ids that specify what the user data is (m_userdata_uuid) and what appication is using it (m_application_uuid). More...
ON_Object *  | Owner () const
Returns object that owns the user data. More...
unsigned int  | SizeOf () const override
ON_UUID  | UserDataClassUuid () const
virtual bool  | WriteToArchive (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static void  | SetCallbacks (ReadCallback rc, WriteCallback wc, TransformCallback tc)
static ON_UUID  | Uuid (void)
 Additional Inherited Members
 Public Attributes inherited from ON_UserData
ON_UUID  | m_application_uuid
unsigned int  | m_userdata_copycount
ON_UUID  | m_userdata_uuid
ON_Xform  | m_userdata_xform
 Protected Member Functions inherited from ON_XMLUserData
ON_XMLProperty *  | InternalProperty (const wchar_t *xml_path, const wchar_t *prop_name) const
Detailed Description
ON_RdkUserData is for internal use only and is not intended for use by SDK clients.
Member Typedef Documentation
◆ ReadCallback
 typedef bool(* ON_RdkUserData::ReadCallback) (ON_RdkUserData &ud)
◆ TransformCallback
 typedef bool(* ON_RdkUserData::TransformCallback) (ON_RdkUserData &ud, const ON_Xform &xform)
◆ WriteCallback
 typedef bool(* ON_RdkUserData::WriteCallback) (const ON_RdkUserData &ud)
Constructor & Destructor Documentation
◆ ON_RdkUserData() [1/2]
 ON_RdkUserData::ON_RdkUserData  |  ( |   | )
◆ ON_RdkUserData() [2/2]
 ON_RdkUserData::ON_RdkUserData  |  ( |  const ON_RdkUserData &  |  ud | )
◆ ~ON_RdkUserData()
 virtual ON_RdkUserData::~ON_RdkUserData  |  ( |   | )
virtual
Member Function Documentation
◆ DeleteAfterRead()
 virtual bool ON_RdkUserData::DeleteAfterRead  |  ( |  const ON_BinaryArchive &  |  archive,
|  ON_Object *  |  parent_object
) |   |  const
overridevirtual
◆ DeleteAfterWrite()
 virtual bool ON_RdkUserData::DeleteAfterWrite  |  ( |  const ON_BinaryArchive &  |  archive,
|  const ON_Object *  |  parent_object
) |   |  const
overridevirtual
◆ GetDescription()
 virtual bool ON_RdkUserData::GetDescription  |  ( |  ON_wString &  |  description | )
overridevirtual
Parameters: description - [out] description of user data shown in object properties dump. Returns: True if user data class is ready.
Reimplemented from ON_UserData.
◆ operator=()
 const ON_RdkUserData& ON_RdkUserData::operator=  |  ( |  const ON_RdkUserData &  |  ud | )
◆ Read()
 virtual bool ON_RdkUserData::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_XMLUserData.
◆ ReportVersionError()
 virtual void ON_RdkUserData::ReportVersionError  |  ( |  void  |   | ) |   const
overridevirtual
Implements ON_XMLUserData.
◆ SetCallbacks()
 static void ON_RdkUserData::SetCallbacks  |  ( |  ReadCallback  |  rc,
|  WriteCallback  |  wc,
|  TransformCallback  |  tc
)
static
◆ SetToDefaults()
 virtual void ON_RdkUserData::SetToDefaults  |  ( |  void  |   | ) |   const
overridevirtual
Implements ON_XMLUserData.
◆ Transform()
 virtual bool ON_RdkUserData::Transform  |  ( |  const ON_Xform &  |   | )
overridevirtual
Description: If Transform() return false, then the userdata is destroyed when its parent object is transformed. The default Transform() updates m_userdata_xform and returns true. Carefully read the comments above m_userdata_xform
Reimplemented from ON_UserData.
◆ Uuid()
 static ON_UUID ON_RdkUserData::Uuid  |  ( |  void  |   | )
static
◆ Write()
 virtual bool ON_RdkUserData::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_XMLUserData.