Public Member Functions | List of all members
CRhinoUiGridListCombo Class Reference
RhinoUI
#include <RhinoSdkUiGridListCombo.h>
 Inheritance diagram for CRhinoUiGridListCombo:
 Public Member Functions
CRhinoUiGridListCombo (long iItem, int iSubItem, CStringList *plstItems, int nSel, BOOL32 bChanged)
virtual  | ~CRhinoUiGridListCombo ()
afx_msg void  | OnCbnCloseup ()
afx_msg void  | OnChar (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
afx_msg void  | OnNcDestroy ()
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
Constructor & Destructor Documentation
◆ CRhinoUiGridListCombo()
 CRhinoUiGridListCombo::CRhinoUiGridListCombo  |  ( |  long  |  iItem,
|  int  |  iSubItem,
|  CStringList *  |  plstItems,
|  int  |  nSel,
|  BOOL32  |  bChanged
)
Edit Row Edit Column List strings Default Notify only if selection changes | | | | | V V V V V
◆ ~CRhinoUiGridListCombo()
 virtual CRhinoUiGridListCombo::~CRhinoUiGridListCombo  |  ( |   | )
virtual
Member Function Documentation
◆ OnCbnCloseup()
 afx_msg void CRhinoUiGridListCombo::OnCbnCloseup  |  ( |   | )
◆ OnChar()
 afx_msg void CRhinoUiGridListCombo::OnChar  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnCreate()
 afx_msg int CRhinoUiGridListCombo::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnKillFocus()
 afx_msg void CRhinoUiGridListCombo::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnNcDestroy()
 afx_msg void CRhinoUiGridListCombo::OnNcDestroy  |  ( |   | )
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiGridListCombo::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual