Public Member Functions | List of all members
CRhRdkSingleSelectionTaskOrigin Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkSingleSelectionTaskOrigin:
 Public Member Functions
CRhRdkSingleSelectionTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const UUID &uuidInstance, const CRhRdkPreviewAppearance *pAppearance, const UUID &uuidEditor)
virtual  | ~CRhRdkSingleSelectionTaskOrigin ()
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const final override
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const final override
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
virtual const wchar_t *  | TopLevelKind (void) const final override
virtual UUID  | Uuid (void) const final override
 Public Member Functions inherited from CRhRdkContextTaskOrigin
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const =0
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Used when task origin is something with a single selected content. This is typically used by the floating preview and editor preview thumbnails. Its special quirk is that it makes menus work as if the content is not part of a hierarchy.
Constructor & Destructor Documentation
◆ CRhRdkSingleSelectionTaskOrigin()
 CRhRdkSingleSelectionTaskOrigin::CRhRdkSingleSelectionTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con,
|  const UUID &  |  uuidInstance,
|  const CRhRdkPreviewAppearance *  |  pAppearance,
|  const UUID &  |  uuidEditor
)
◆ ~CRhRdkSingleSelectionTaskOrigin()
 virtual CRhRdkSingleSelectionTaskOrigin::~CRhRdkSingleSelectionTaskOrigin  |  ( |   | )
virtual
Member Function Documentation
◆ GetSelectionImpl()
 virtual void CRhRdkSingleSelectionTaskOrigin::GetSelectionImpl  |  ( |  CRhRdkContentArray &  |  aContentOut | ) |   const
finaloverridevirtual
Implement this to get the contents that have been selected by the user.
Parameters
aContentOut | accepts the selected contents.
Implements CRhRdkTaskOrigin.
◆ PreviewAppearance()
 virtual const CRhRdkPreviewAppearance* CRhRdkSingleSelectionTaskOrigin::PreviewAppearance  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Reimplemented from CRhRdkTaskOrigin.
◆ SupportsTask()
 virtual bool CRhRdkSingleSelectionTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  task | ) |   const
overridevirtual
Reimplemented from CRhRdkContextTaskOrigin.
Reimplemented in CRhRdkFloatingPreviewTaskOrigin, CRhRdkContentInstanceBrowserTaskOrigin, and CRhRdkContentTypeBrowserTaskOrigin.
◆ TopLevelKind()
 virtual const wchar_t* CRhRdkSingleSelectionTaskOrigin::TopLevelKind  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.
◆ Uuid()
 virtual UUID CRhRdkSingleSelectionTaskOrigin::Uuid  |  ( |  void  |   | ) |   const
finaloverridevirtual
TODO: Docs
Implements CRhRdkTaskOrigin.