Public Types | Public Member Functions | Protected Member Functions | List of all members
ON_XMLVariant Class Reference
OpenNURBS
#include <opennurbs_xml.h>
 Public Types
enum  | ArrayTypes : unsigned int { ArrayTypes::Array2, ArrayTypes::Array3, ArrayTypes::Array4, ArrayTypes::Array16 }
enum  | Types : unsigned int {
 Types::Null, Types::Bool, Types::Integer, Types::Float,
 Types::Double, Types::String, Types::DoubleArray2, Types::DoubleArray3,
 Types::DoubleArray4, Types::DoubleColor4, Types::Matrix, Types::Uuid,
 Types::Time, Types::Buffer
 }
 Public Member Functions
ON_XMLVariant ()
Creates an empty string type. More...
ON_XMLVariant (bool value)
ON_XMLVariant (const double *point, ArrayTypes at=ArrayTypes::Array3)
ON_XMLVariant (const float *point, ArrayTypes at=ArrayTypes::Array3)
ON_XMLVariant (const ON_2dPoint &p)
ON_XMLVariant (const ON_3dPoint &p)
ON_XMLVariant (const ON_4fColor &c)
ON_XMLVariant (const ON_Buffer &buffer)
ON_XMLVariant (const ON_UUID &uuid)
ON_XMLVariant (const ON_wString &value)
ON_XMLVariant (const ON_Xform &xform)
ON_XMLVariant (const ON_XMLVariant &src)
ON_XMLVariant (const void *buffer, size_t size)
ON_XMLVariant (const wchar_t *wsz)
ON_XMLVariant (double value)
ON_XMLVariant (float value)
ON_XMLVariant (int value)
ON_XMLVariant (time_t time)
virtual  | ~ON_XMLVariant ()
virtual ON_2dPoint  | As2dPoint (void) const
virtual ON_3dPoint  | As3dPoint (void) const
virtual ON_4dPoint  | As4dPoint (void) const
virtual bool  | AsBool (void) const
virtual void *  | AsBuffer (size_t &size_out) const
virtual ON_Buffer  | AsBuffer (void) const
virtual ON_4fColor  | AsColor (void) const
virtual double  | AsDouble (void) const
virtual float  | AsFloat (void) const
virtual int  | AsInteger (void) const
virtual ON_wString  | AsString (void) const
virtual time_t  | AsTime (void) const
virtual ON_UUID  | AsUuid (void) const
virtual ON_Xform  | AsXform (void) const
virtual void  | ClearBuffers (void)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual void  | Format (ON_wString &s) const
Format string as type and value. Useful for debugging. More...
virtual ON_Buffer &  | GetBuffer (void) const
virtual bool  | IsEmpty (void) const
virtual bool  | IsNull (void) const
virtual bool  | NeedsXMLEncode (void) const
operator bool () const
operator double () const
operator float () const
operator int () const
operator ON_2dPoint () const
operator ON_3dPoint () const
operator ON_4dPoint () const
operator ON_4fColor () const
operator ON_Buffer () const
operator ON_UUID () const
operator ON_wString () const
operator time_t () const
bool  | operator!= (const ON_XMLVariant &v) const
const ON_XMLVariant &  | operator= (const ON_XMLVariant &src)
bool  | operator== (const ON_XMLVariant &v) const
virtual void  | SetNull (void)
virtual void  | SetTypePendingFlag (bool bTypePending) const
virtual void  | SetUnits (ON::LengthUnitSystem units)
virtual void  | SetValue (bool b)
virtual void  | SetValue (const double *p, ArrayTypes at)
virtual void  | SetValue (const float *p, ArrayTypes at)
virtual void  | SetValue (const ON_2dPoint &p)
virtual void  | SetValue (const ON_3dPoint &p)
virtual void  | SetValue (const ON_4dPoint &p)
virtual void  | SetValue (const ON_4fColor &c)
virtual void  | SetValue (const ON_Buffer &buffer)
virtual void  | SetValue (const ON_UUID &uuid)
virtual void  | SetValue (const ON_wString &s)
virtual void  | SetValue (const ON_Xform &xform)
virtual void  | SetValue (const void *buffer, size_t size)
virtual void  | SetValue (const wchar_t *s)
virtual void  | SetValue (double v)
virtual void  | SetValue (float v)
virtual void  | SetValue (int v)
virtual void  | SetValue (time_t time)
virtual void  | SetVaries (void)
virtual Types  | Type (void) const
virtual ON_wString  | TypeAsString (void) const
virtual bool  | TypePending (void) const
virtual ON::LengthUnitSystem  | Units (void) const
virtual bool  | Varies (void) const
 Protected Member Functions
virtual void  | StringToPoint (int iValues) const
Member Enumeration Documentation
◆ ArrayTypes
 enum ON_XMLVariant::ArrayTypes : unsigned int
strong
Enumerator
Array2
Array3
Array4
Array16
◆ Types
 enum ON_XMLVariant::Types : unsigned int
strong
Enumerator
Null
Bool
Integer
Float
Double
String
DoubleArray2
DoubleArray3
DoubleArray4
DoubleColor4
Matrix
Uuid
Time
Buffer
Constructor & Destructor Documentation
◆ ON_XMLVariant() [1/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |   | )
Creates an empty string type.
◆ ON_XMLVariant() [2/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  bool  |  value | )
◆ ON_XMLVariant() [3/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  int  |  value | )
◆ ON_XMLVariant() [4/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  float  |  value | )
◆ ON_XMLVariant() [5/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  double  |  value | )
◆ ON_XMLVariant() [6/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  time_t  |  time | )
◆ ON_XMLVariant() [7/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_wString &  |  value | )
◆ ON_XMLVariant() [8/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_UUID &  |  uuid | )
◆ ON_XMLVariant() [9/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_2dPoint &  |  p | )
◆ ON_XMLVariant() [10/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_3dPoint &  |  p | )
◆ ON_XMLVariant() [11/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_4fColor &  |  c | )
◆ ON_XMLVariant() [12/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_Xform &  |  xform | )
◆ ON_XMLVariant() [13/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const double *  |  point,
|  ArrayTypes  |  at = ArrayTypes::Array3
)
◆ ON_XMLVariant() [14/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const float *  |  point,
|  ArrayTypes  |  at = ArrayTypes::Array3
)
◆ ON_XMLVariant() [15/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const wchar_t *  |  wsz | )
◆ ON_XMLVariant() [16/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const void *  |  buffer,
|  size_t  |  size
)
◆ ON_XMLVariant() [17/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_Buffer &  |  buffer | )
◆ ON_XMLVariant() [18/18]
 ON_XMLVariant::ON_XMLVariant  |  ( |  const ON_XMLVariant &  |  src | )
◆ ~ON_XMLVariant()
 virtual ON_XMLVariant::~ON_XMLVariant  |  ( |   | )
virtual
Member Function Documentation
◆ As2dPoint()
 virtual ON_2dPoint ON_XMLVariant::As2dPoint  |  ( |  void  |   | ) |   const
virtual
◆ As3dPoint()
 virtual ON_3dPoint ON_XMLVariant::As3dPoint  |  ( |  void  |   | ) |   const
virtual
◆ As4dPoint()
 virtual ON_4dPoint ON_XMLVariant::As4dPoint  |  ( |  void  |   | ) |   const
virtual
◆ AsBool()
 virtual bool ON_XMLVariant::AsBool  |  ( |  void  |   | ) |   const
virtual
◆ AsBuffer() [1/2]
 virtual void* ON_XMLVariant::AsBuffer  |  ( |  size_t &  |  size_out | ) |   const
virtual
◆ AsBuffer() [2/2]
 virtual ON_Buffer ON_XMLVariant::AsBuffer  |  ( |  void  |   | ) |   const
virtual
◆ AsColor()
 virtual ON_4fColor ON_XMLVariant::AsColor  |  ( |  void  |   | ) |   const
virtual
◆ AsDouble()
 virtual double ON_XMLVariant::AsDouble  |  ( |  void  |   | ) |   const
virtual
◆ AsFloat()
 virtual float ON_XMLVariant::AsFloat  |  ( |  void  |   | ) |   const
virtual
◆ AsInteger()
 virtual int ON_XMLVariant::AsInteger  |  ( |  void  |   | ) |   const
virtual
◆ AsString()
 virtual ON_wString ON_XMLVariant::AsString  |  ( |  void  |   | ) |   const
virtual
◆ AsTime()
 virtual time_t ON_XMLVariant::AsTime  |  ( |  void  |   | ) |   const
virtual
◆ AsUuid()
 virtual ON_UUID ON_XMLVariant::AsUuid  |  ( |  void  |   | ) |   const
virtual
◆ AsXform()
 virtual ON_Xform ON_XMLVariant::AsXform  |  ( |  void  |   | ) |   const
virtual
◆ ClearBuffers()
 virtual void ON_XMLVariant::ClearBuffers  |  ( |  void  |   | )
virtual
◆ DataCRC()
 virtual ON__UINT32 ON_XMLVariant::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
virtual
◆ Format()
 virtual void ON_XMLVariant::Format  |  ( |  ON_wString &  |  s | ) |   const
virtual
Format string as type and value. Useful for debugging.
◆ GetBuffer()
 virtual ON_Buffer& ON_XMLVariant::GetBuffer  |  ( |  void  |   | ) |   const
virtual
◆ IsEmpty()
 virtual bool ON_XMLVariant::IsEmpty  |  ( |  void  |   | ) |   const
virtual
◆ IsNull()
 virtual bool ON_XMLVariant::IsNull  |  ( |  void  |   | ) |   const
virtual
◆ NeedsXMLEncode()
 virtual bool ON_XMLVariant::NeedsXMLEncode  |  ( |  void  |   | ) |   const
virtual
Optimized version of ON_wString::NeedsXMLEncode(). Always use this if possible because it knows from the type of the variant whether entity ref encoded output is even possible.
◆ operator bool()
 ON_XMLVariant::operator bool  |  ( |   | ) |   const
◆ operator double()
 ON_XMLVariant::operator double  |  ( |   | ) |   const
◆ operator float()
 ON_XMLVariant::operator float  |  ( |   | ) |   const
◆ operator int()
 ON_XMLVariant::operator int  |  ( |   | ) |   const
◆ operator ON_2dPoint()
 ON_XMLVariant::operator ON_2dPoint  |  ( |   | ) |   const
◆ operator ON_3dPoint()
 ON_XMLVariant::operator ON_3dPoint  |  ( |   | ) |   const
◆ operator ON_4dPoint()
 ON_XMLVariant::operator ON_4dPoint  |  ( |   | ) |   const
◆ operator ON_4fColor()
 ON_XMLVariant::operator ON_4fColor  |  ( |   | ) |   const
◆ operator ON_Buffer()
 ON_XMLVariant::operator ON_Buffer  |  ( |   | ) |   const
◆ operator ON_UUID()
 ON_XMLVariant::operator ON_UUID  |  ( |   | ) |   const
◆ operator ON_wString()
 ON_XMLVariant::operator ON_wString  |  ( |   | ) |   const
◆ operator time_t()
 ON_XMLVariant::operator time_t  |  ( |   | ) |   const
◆ operator!=()
 bool ON_XMLVariant::operator!=  |  ( |  const ON_XMLVariant &  |  v | ) |   const
◆ operator=()
 const ON_XMLVariant& ON_XMLVariant::operator=  |  ( |  const ON_XMLVariant &  |  src | )
◆ operator==()
 bool ON_XMLVariant::operator==  |  ( |  const ON_XMLVariant &  |  v | ) |   const
◆ SetNull()
 virtual void ON_XMLVariant::SetNull  |  ( |  void  |   | )
virtual
◆ SetTypePendingFlag()
 virtual void ON_XMLVariant::SetTypePendingFlag  |  ( |  bool  |  bTypePending | ) |   const
virtual
◆ SetUnits()
 virtual void ON_XMLVariant::SetUnits  |  ( |  ON::LengthUnitSystem  |  units | )
virtual
◆ SetValue() [1/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  bool  |  b | )
virtual
◆ SetValue() [2/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const double *  |  p,
|  ArrayTypes  |  at
)
virtual
◆ SetValue() [3/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const float *  |  p,
|  ArrayTypes  |  at
)
virtual
◆ SetValue() [4/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_2dPoint &  |  p | )
virtual
◆ SetValue() [5/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_3dPoint &  |  p | )
virtual
◆ SetValue() [6/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_4dPoint &  |  p | )
virtual
◆ SetValue() [7/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_4fColor &  |  c | )
virtual
◆ SetValue() [8/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_Buffer &  |  buffer | )
virtual
◆ SetValue() [9/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_UUID &  |  uuid | )
virtual
◆ SetValue() [10/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_wString &  |  s | )
virtual
◆ SetValue() [11/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const ON_Xform &  |  xform | )
virtual
◆ SetValue() [12/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const void *  |  buffer,
|  size_t  |  size
)
virtual
◆ SetValue() [13/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  const wchar_t *  |  s | )
virtual
◆ SetValue() [14/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  double  |  v | )
virtual
◆ SetValue() [15/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  float  |  v | )
virtual
◆ SetValue() [16/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  int  |  v | )
virtual
◆ SetValue() [17/17]
 virtual void ON_XMLVariant::SetValue  |  ( |  time_t  |  time | )
virtual
◆ SetVaries()
 virtual void ON_XMLVariant::SetVaries  |  ( |  void  |   | )
virtual
◆ StringToPoint()
 virtual void ON_XMLVariant::StringToPoint  |  ( |  int  |  iValues | ) |   const
protectedvirtual
◆ Type()
 virtual Types ON_XMLVariant::Type  |  ( |  void  |   | ) |   const
virtual
◆ TypeAsString()
 virtual ON_wString ON_XMLVariant::TypeAsString  |  ( |  void  |   | ) |   const
virtual
◆ TypePending()
 virtual bool ON_XMLVariant::TypePending  |  ( |  void  |   | ) |   const
virtual
◆ Units()
 virtual ON::LengthUnitSystem ON_XMLVariant::Units  |  ( |  void  |   | ) |   const
virtual
◆ Varies()
 virtual bool ON_XMLVariant::Varies  |  ( |  void  |   | ) |   const
virtual