Public Member Functions | List of all members
ON_2dVectorArray Class Reference
OpenNURBS
#include <opennurbs_point.h>
 Inheritance diagram for ON_2dVectorArray:
 Public Member Functions
ON_2dVectorArray ()
see ON_SimpleArray class definition comments for constructor documentation More...
ON_2dVectorArray (const ON_2dVectorArray &)
ON_2dVectorArray (int)
bool  | GetBBox (double boxmin[2], double boxmax[2], bool bGrowBox=false) const
ON_2dVectorArray &  | operator= (const ON_2dVectorArray &)
bool  | SwapCoordinates (int, int)
bool  | Transform (const ON_Xform &)
 Public Member Functions inherited from ON_SimpleArray< ON_2dVector >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_2dVector > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
ON_SimpleArray (size_t, ON_2dVector)
create an array of given size and initialize all items to the given value More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_2dVector &)
void  | Append (int, const ON_2dVector *)
Append copy of an array T[count]. More...
ON_2dVector &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_2dVector *  | Array ()
The Array() function return the. More...
const ON_2dVector *  | Array () const
m_a pointer value. More...
ON_2dVector *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_2dVector *  | At (int) const
ON_2dVector *  | At (ON__INT64)
const ON_2dVector *  | At (ON__INT64) const
ON_2dVector *  | At (ON__UINT64)
const ON_2dVector *  | At (ON__UINT64) const
ON_2dVector *  | At (unsigned int)
const ON_2dVector *  | At (unsigned int) const
ON_2dVector *  | begin ()
Support STL iterators and algorithms. More...
ON_2dVector const *  | begin () const
int  | BinarySearch (const ON_2dVector *, int(*compar)(const ON_2dVector *, const ON_2dVector *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_2dVector *, int(*compar)(const ON_2dVector *, const ON_2dVector *), int) const
const ON_2dVector *  | BinarySearchPtr (const ON_2dVector *, int(*compar)(const ON_2dVector *, const ON_2dVector *)) const
const ON_2dVector *  | BinarySearchPtr (const ON_2dVector *, int(*compar)(const ON_2dVector *, const ON_2dVector *), int) const
int  | Capacity () const
capacity of array More...
ON_2dVector const *  | cbegin () const
ON_2dVector const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_2dVector *  | end ()
ON_2dVector const *  | end () const
ON_2dVector *  | First ()
const ON_2dVector *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*compar)(const ON_2dVector *, const ON_2dVector *))
void  | Insert (int, const ON_2dVector &)
int  | InsertInSortedList (const ON_2dVector &, int(*compar)(const ON_2dVector *, const ON_2dVector *))
int  | InsertInSortedList (const ON_2dVector &, int(*compar)(const ON_2dVector *, const ON_2dVector *), int)
ON_2dVector *  | KeepArray ()
ON_2dVector *  | Last ()
const ON_2dVector *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_2dVector * () const
operator ON_2dVector * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_SimpleArray< ON_2dVector > &other) const=delete
ON_SimpleArray< ON_2dVector > &  | operator= (const ON_SimpleArray< ON_2dVector > &)
bool  | operator== (const ON_SimpleArray< ON_2dVector > &other) const=delete
ON_2dVector &  | operator[] (int)
const ON_2dVector &  | operator[] (int) const
ON_2dVector &  | operator[] (ON__INT64)
const ON_2dVector &  | operator[] (ON__INT64) const
ON_2dVector &  | operator[] (ON__UINT64)
const ON_2dVector &  | operator[] (ON__UINT64) const
ON_2dVector &  | operator[] (unsigned int)
const ON_2dVector &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Prepend (int, const ON_2dVector *)
Prepend copy of an array T[count]. More...
bool  | QuickSort (int(*compar)(const ON_2dVector *, const ON_2dVector *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
bool  | QuickSortAndRemoveDuplicates (int(*compar)(const ON_2dVector *, const ON_2dVector *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
virtual ON_2dVector *  | Realloc (ON_2dVector *, int)
low level memory management ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
void  | RemoveIf (bool(*predicate)(const ON_2dVector &key))
void  | RemoveValue (const ON_2dVector &)
ON_2dVector *  | Reserve (size_t)
memory management //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_2dVector &) const
int  | Search (const ON_2dVector *, int(*compar)(const ON_2dVector *, const ON_2dVector *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
void  | SetArray (ON_2dVector *p)
void  | SetArray (ON_2dVector *p, int count, int capacity)
ON_2dVector *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | SetRange (int from, int count, ON_2dVector)
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_2dVector *, const ON_2dVector *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_2dVector *, const ON_2dVector *, void *), void *) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_2dVector *, const ON_2dVector *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_2dVector *, const ON_2dVector *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_2dVector >
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_2dVector >
ON_2dVector *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_2dVectorArray() [1/3]
 ON_2dVectorArray::ON_2dVectorArray  |  ( |   | )
see ON_SimpleArray class definition comments for constructor documentation
◆ ON_2dVectorArray() [2/3]
 ON_2dVectorArray::ON_2dVectorArray  |  ( |  int  |   | )
◆ ON_2dVectorArray() [3/3]
 ON_2dVectorArray::ON_2dVectorArray  |  ( |  const ON_2dVectorArray &  |   | )
Member Function Documentation
◆ GetBBox()
 bool ON_2dVectorArray::GetBBox  |  ( |  double  |  boxmin[2],
|  double  |  boxmax[2],
|  bool  |  bGrowBox = false
) |   |  const
◆ operator=()
 ON_2dVectorArray& ON_2dVectorArray::operator=  |  ( |  const ON_2dVectorArray &  |   | )
◆ SwapCoordinates()
 bool ON_2dVectorArray::SwapCoordinates  |  ( |  int  |  ,
|  int
)
◆ Transform()
 bool ON_2dVectorArray::Transform  |  ( |  const ON_Xform &  |   | )