Public Member Functions | List of all members
CRhRdkEventSink Class Reference
RDK
#include <RhRdkEventSink.h>
 Inheritance diagram for CRhRdkEventSink:
 Public Member Functions
CRhRdkEventSink ()
virtual  | ~CRhRdkEventSink ()
virtual void  | Enable (bool bEnable) const
virtual bool  | IsEnabled (void) const
 Additional Inherited Members
 Protected Types inherited from CRhRdkEventSinkBase
enum  | {
 rendering = 0x0001, safe_frame = 0x0002, document_sun = 0x0004, post_effects = 0x0008,
 ground_plane = 0x0010, content_filter = 0x0020, custom_render_mesh = 0x0040, unspecified = 0x8000,
 all = 0xFFFF, force32bit_flags1 = 0xFFFFFFFF
 }
enum  | rendering_info {
 save_support_files = 1, dithering = 2, gamma = 3, use_linear_workflow = 4,
 tone_mapping = 5, tone_mapper_params = 6, reflective_refractive_environment = 7, force32bit_flags2 = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhRdkEventSinkBase
CRhRdkEventSinkBase ()
virtual  | ~CRhRdkEventSinkBase ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual void  | OnAddRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnAllFactoriesAdded (void)
virtual void  | OnCacheImageChanged (void)
virtual void  | OnClientPlugInUnloading (const UUID &)
virtual void  | OnContentAdded (const CRhRdkContent *)
virtual void  | OnContentChanged (const CRhRdkContent *, RhRdkChangeContext)
virtual void  | OnContentCurrencyChanged (const wchar_t *, const CRhRdkContent *)
virtual void  | OnContentDeleted (void)
virtual void  | OnContentDeleting (const CRhRdkContent *)
virtual void  | OnContentEditorActivated (const IRhRdkContentEditor &)
virtual void  | OnContentEditorExtended (bool)
virtual void  | OnContentFilterChanged (const CRhRdkUuidCollection &)
virtual void  | OnContentListCleared (const IRhRdkContentList &)
virtual void  | OnContentListClearing (const IRhRdkContentList &)
virtual void  | OnContentListLoaded (const IRhRdkContentList &)
virtual void  | OnContentMoved (const CRhRdkContent *, const CRhRdkContent *, const IRhRdkContentEditor *)
virtual void  | OnContentRenamed (const CRhRdkContent *)
virtual void  | OnContentReplaced (CRhRdkContent *)
virtual void  | OnContentReplacing (const CRhRdkContent *)
virtual void  | OnContentSelected (const CRhRdkContent *, const IRhRdkContentEditor &)
virtual void  | OnContentUpdateMarkers (const CRhRdkContent *)
virtual void  | OnContentUpdatePreview (const CRhRdkContent *)
virtual void  | OnCustomEvent (const UUID &, void *)
virtual void  | OnCustomRenderMeshesChanged (void)
virtual void  | OnDeleteRhinoObject (CRhinoDoc &, CRhinoObject &)
virtual void  | OnDocumentSettingsChanged (UINT, UINT_PTR)
virtual void  | OnFactoryAdded (const IRhRdkContentFactory &)
virtual void  | OnFactoryDeleted (const wchar_t *)
virtual void  | OnFactoryDeleting (const IRhRdkContentFactory &)
virtual void  | OnGlobalSettingsChanged (void)
virtual void  | OnLazyTimer (void)
virtual void  | OnModifyObjectTextureMapping (CRhinoDoc &, const CRhinoObject &)
virtual void  | OnNewRdkDocument (void)
virtual void  | OnRenderEngineStateChanged (bool)
virtual void  | OnRendererChanged (void)
virtual void  | OnReplaceRhinoObject (CRhinoDoc &, CRhinoObject &, CRhinoObject &)
virtual void  | OnSelectionChanged (CRhinoDoc &)
virtual void  | OnUpdateAllPreviews (void)
virtual void  | TextureMappingTableEvent (const ON_TextureMapping &)
Detailed Description
Deprecated:
OBSOLETE - Please use CRhRdkEventWatcher instead
See also
CRhRdkEventWatcher
Constructor & Destructor Documentation
◆ CRhRdkEventSink()
 CRhRdkEventSink::CRhRdkEventSink  |  ( |   | )
◆ ~CRhRdkEventSink()
 virtual CRhRdkEventSink::~CRhRdkEventSink  |  ( |   | )
virtual
Member Function Documentation
◆ Enable()
 virtual void CRhRdkEventSink::Enable  |  ( |  bool  |  bEnable | ) |   const
virtual
◆ IsEnabled()
 virtual bool CRhRdkEventSink::IsEnabled  |  ( |  void  |   | ) |   const
virtual