Public Member Functions | List of all members
CRhRdkLatePostEffect Class Reference
RDK
#include <RhRdkNewPostEffectPlugIn.h>
 Inheritance diagram for CRhRdkLatePostEffect:
 Public Member Functions
CRhRdkLatePostEffect ()
virtual  | ~CRhRdkLatePostEffect ()
 Public Member Functions inherited from CRhRdkPostEffect
CRhRdkPostEffect (IRhRdkPostEffect::Types type)
virtual  | ~CRhRdkPostEffect ()
virtual IRhRdkPostEffect &  | BeginChange (RhRdkChangeContext cc) const override
virtual bool  | CanExecute (const IRhRdkPostEffectPipeline &) const override
virtual void  | Changed (void) override
virtual_su void  | CopyParamsFrom (const ON_3dmRenderSettings &rs)
virtual_su void  | CopyParamsTo (ON_3dmRenderSettings &rs) const
virtual ON__UINT32  | CRC (void) const final override
virtual bool  | EndChange (void) override
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual int  | ExecuteWhileRenderingDelayMS (void) const override
virtual bool  | IsActive (void) const final override
virtual bool  | IsSelected (void) const final override
virtual bool  | IsVisible (void) const override
virtual const IRhRdkListablePostEffect *  | Listable (void) const override
virtual IRhRdkListablePostEffect *  | Listable (void) override
virtual bool  | ReadFromDocumentDefaults (const CRhinoDoc &doc) override
virtual_su bool  | ReadFromRenderSettings (const ON_3dmRenderSettings &rs) override _su
virtual void  | RequiredChannels (OUT ON_SimpleArray< UUID > &aChan) const override
virtual void  | SetManager (class CRhRdkPostEffectManager &man) final override
virtual Types  | Type (void) const final override
virtual bool  | WriteToDocumentDefaults (CRhinoDoc &doc) const override
virtual_su bool  | WriteToRenderSettings (ON_3dmRenderSettings &rs) const override_su
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkPostEffect
virtual  | ~IRhRdkPostEffect ()
virtual void  | AddUISections (class IRhRdkPostEffectUI &ui)=0
virtual unsigned int  | BitFlags (void) const =0
virtual bool  | CanDisplayHelp (void) const =0
virtual bool  | CanExecute (const class IRhRdkPostEffectPipeline &pepl) const =0
virtual bool  | DisplayHelp (void) const =0
virtual bool  | Execute (IRhRdkPostEffectPipeline &pepl, const ON_4iRect &rect) const =0
virtual ExecuteWhileRenderingOptions  | GetExecuteWhileRenderingOption (void) const =0
virtual bool  | GetParameter (const wchar_t *wszName, OUT CRhRdkVariant &vValue) const =0
virtual UUID  | Id (void) const =0
virtual ON_wString  | LocalName (void) const =0
virtual_su bool  | ReadFromRenderSettings (const ON_3dmRenderSettings &rs)
virtual bool  | ReadState (const IState &state)=0
virtual void  | ResetToFactoryDefaults (void)=0
virtual bool  | SetParameter (const wchar_t *wszName, const CRhRdkVariant &vValue)=0
virtual bool  | WriteState (IState &state) const =0
virtual_su bool  | WriteToRenderSettings (ON_3dmRenderSettings &rs) const
 Additional Inherited Members
 Public Types inherited from IRhRdkPostEffect
enum  | : unsigned int {
 uf_ExecuteForProductionRendering = 0x0001, uf_ExecuteForRealtimeRendering = 0x0002, uf_ExecuteForViewportDisplay = 0x0004, uf_Fixed = 0x0100,
 uf_DefaultShown = 0x0200, uf_DefaultOn = 0x0400, uf_UsesRenderingSettings = 0x0800
 }
enum  | ExecuteWhileRenderingOptions { ExecuteWhileRenderingOptions::Never, ExecuteWhileRenderingOptions::Always, ExecuteWhileRenderingOptions::UseDelay, ExecuteWhileRenderingOptions::UseExecutionControl }
enum  | Types : int { Types::Early, Types::ToneMapping, Types::Late }
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Public Attributes inherited from CRhRdkPostEffect
CImpl *  | m_pImpl
 Protected Member Functions inherited from CRhRdkPostEffect
CImpl *  | Impl (void)
const CImpl *  | Impl (void) const
Detailed Description
3rd-party late post effects should subclass this class.
Late post effects can assume that the channel data was normalized to 0..1 by the previous tone mapping or clamp operation. If no tone mapping or clamping was done (such as when creating a HDR result), then the late post effects are not executed.
Constructor & Destructor Documentation
◆ CRhRdkLatePostEffect()
 CRhRdkLatePostEffect::CRhRdkLatePostEffect  |  ( |   | )
◆ ~CRhRdkLatePostEffect()
 virtual CRhRdkLatePostEffect::~CRhRdkLatePostEffect  |  ( |   | )
virtual