Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
CRhRdkUuid Class Referencefinal
RDK
#include <RhRdkUuid.h>
 Public Member Functions
CRhRdkUuid ()
CRhRdkUuid (const char *sz)
CRhRdkUuid (const CRhRdkUuid &uuid)
CRhRdkUuid (const UUID &uuid)
CRhRdkUuid (const wchar_t *wsz)
~CRhRdkUuid ()
void  | Create (void)
DWORD  | Hash (void) const
bool  | IsNil (void) const
operator UUID (void) const
bool  | operator!= (const UUID &uuid) const
CRhRdkUuid &  | operator= (const CRhRdkUuid &uuid)
CRhRdkUuid &  | operator= (const UUID &uuid)
bool  | operator== (const UUID &uuid) const
ON_wString  | RegistryFormat (int numChars=ciNumChars) const
ON_wString  | String (int numChars=ciNumChars) const
 Static Public Member Functions
static bool  | IsValidUuid (const wchar_t *wsz)
 Static Public Attributes
static const int  | ciNumChars = 36
Constructor & Destructor Documentation
◆ CRhRdkUuid() [1/5]
 CRhRdkUuid::CRhRdkUuid  |  ( |   | )
◆ CRhRdkUuid() [2/5]
 CRhRdkUuid::CRhRdkUuid  |  ( |  const CRhRdkUuid &  |  uuid | )
◆ CRhRdkUuid() [3/5]
 CRhRdkUuid::CRhRdkUuid  |  ( |  const UUID &  |  uuid | )
◆ CRhRdkUuid() [4/5]
 CRhRdkUuid::CRhRdkUuid  |  ( |  const char *  |  sz | )
◆ CRhRdkUuid() [5/5]
 CRhRdkUuid::CRhRdkUuid  |  ( |  const wchar_t *  |  wsz | )
◆ ~CRhRdkUuid()
 CRhRdkUuid::~CRhRdkUuid  |  ( |   | )
Member Function Documentation
◆ Create()
 void CRhRdkUuid::Create  |  ( |  void  |   | )
◆ Hash()
 DWORD CRhRdkUuid::Hash  |  ( |  void  |   | ) |   const
◆ IsNil()
 bool CRhRdkUuid::IsNil  |  ( |  void  |   | ) |   const
◆ IsValidUuid()
 static bool CRhRdkUuid::IsValidUuid  |  ( |  const wchar_t *  |  wsz | )
static
Returns
true if string is a valid UUID, else false.
◆ operator UUID()
 CRhRdkUuid::operator UUID  |  ( |  void  |   | ) |   const
◆ operator!=()
 bool CRhRdkUuid::operator!=  |  ( |  const UUID &  |  uuid | ) |   const
◆ operator=() [1/2]
 CRhRdkUuid& CRhRdkUuid::operator=  |  ( |  const CRhRdkUuid &  |  uuid | )
◆ operator=() [2/2]
 CRhRdkUuid& CRhRdkUuid::operator=  |  ( |  const UUID &  |  uuid | )
◆ operator==()
 bool CRhRdkUuid::operator==  |  ( |  const UUID &  |  uuid | ) |   const
◆ RegistryFormat()
 ON_wString CRhRdkUuid::RegistryFormat  |  ( |  int  |  numChars = ciNumChars | ) |   const
◆ String()
 ON_wString CRhRdkUuid::String  |  ( |  int  |  numChars = ciNumChars | ) |   const
Member Data Documentation
◆ ciNumChars
 const int CRhRdkUuid::ciNumChars = 36
static