Public Member Functions | Public Attributes | List of all members
CRhinoUiColorComboBoxItem Class Reference
RhinoUI
CRhinoUiColorComboBoxItem. More...
#include <RhinoSdkUiColorComboBox.h>
 Inheritance diagram for CRhinoUiColorComboBoxItem:
 Public Member Functions
CRhinoUiColorComboBoxItem ()
CRhinoUiColorComboBoxItem (const CRhinoUiColorComboBoxItem &)
CRhinoUiColorComboBoxItem (LPCTSTR lpsColor, COLORREF color)
CRhinoUiColorComboBoxItem &  | operator= (const CRhinoUiColorComboBoxItem &)
 Public Attributes
COLORREF  | m_color
CString  | m_string
Detailed Description
CRhinoUiColorComboBoxItem.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiColorComboBoxItem() [1/3]
 CRhinoUiColorComboBoxItem::CRhinoUiColorComboBoxItem  |  ( |   | )
◆ CRhinoUiColorComboBoxItem() [2/3]
 CRhinoUiColorComboBoxItem::CRhinoUiColorComboBoxItem  |  ( |  LPCTSTR  |  lpsColor,
|  COLORREF  |  color
)
◆ CRhinoUiColorComboBoxItem() [3/3]
 CRhinoUiColorComboBoxItem::CRhinoUiColorComboBoxItem  |  ( |  const CRhinoUiColorComboBoxItem &  |   | )
Member Function Documentation
◆ operator=()
 CRhinoUiColorComboBoxItem& CRhinoUiColorComboBoxItem::operator=  |  ( |  const CRhinoUiColorComboBoxItem &  |   | )
Member Data Documentation
◆ m_color
 COLORREF CRhinoUiColorComboBoxItem::m_color
◆ m_string
 CString CRhinoUiColorComboBoxItem::m_string