Public Member Functions | Protected Attributes | List of all members
CRhinoUiGridListHeaderCtrl Class Reference
RhinoUI
CRhinoUiGridListHeaderCtrl. More...
#include <RhinoSdkUiGridListHeaderCtrl.h>
 Inheritance diagram for CRhinoUiGridListHeaderCtrl:
 Public Member Functions
CRhinoUiGridListHeaderCtrl ()
virtual  | ~CRhinoUiGridListHeaderCtrl ()
bool  | AllowColumnResizing ()
void  | AllowColumnResizing (bool b)
int  | ColumnFromPoint (CPoint point)
bool  | ColumnResizable (int nColumn)
int  | CursorColumnFromPoint (CPoint point)
void  | DisableColumResizing (int nInColumn)
LPARAM  | GetColumnLParam (int nCol)
CListCtrl *  | ListCtrl ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg BOOL32  | OnSetCursor (CWnd *pWnd, UINT nHitTest, UINT message)
 Protected Attributes
bool  | m_bAllowColumnResizing
CUIntArray  | m_DisableColumnSizingList
int  | m_nCursorColumn
Detailed Description
CRhinoUiGridListHeaderCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiGridListHeaderCtrl()
 CRhinoUiGridListHeaderCtrl::CRhinoUiGridListHeaderCtrl  |  ( |   | )
◆ ~CRhinoUiGridListHeaderCtrl()
 virtual CRhinoUiGridListHeaderCtrl::~CRhinoUiGridListHeaderCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AllowColumnResizing() [1/2]
 bool CRhinoUiGridListHeaderCtrl::AllowColumnResizing  |  ( |   | )
◆ AllowColumnResizing() [2/2]
 void CRhinoUiGridListHeaderCtrl::AllowColumnResizing  |  ( |  bool  |  b | )
◆ ColumnFromPoint()
 int CRhinoUiGridListHeaderCtrl::ColumnFromPoint  |  ( |  CPoint  |  point | )
◆ ColumnResizable()
 bool CRhinoUiGridListHeaderCtrl::ColumnResizable  |  ( |  int  |  nColumn | )
◆ CursorColumnFromPoint()
 int CRhinoUiGridListHeaderCtrl::CursorColumnFromPoint  |  ( |  CPoint  |  point | )
◆ DisableColumResizing()
 void CRhinoUiGridListHeaderCtrl::DisableColumResizing  |  ( |  int  |  nInColumn | )
◆ GetColumnLParam()
 LPARAM CRhinoUiGridListHeaderCtrl::GetColumnLParam  |  ( |  int  |  nCol | )
◆ ListCtrl()
 CListCtrl* CRhinoUiGridListHeaderCtrl::ListCtrl  |  ( |   | )
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiGridListHeaderCtrl::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnNcHitTest()
 afx_msg LRESULT CRhinoUiGridListHeaderCtrl::OnNcHitTest  |  ( |  CPoint  |  point | )
◆ OnSetCursor()
 afx_msg BOOL32 CRhinoUiGridListHeaderCtrl::OnSetCursor  |  ( |  CWnd *  |  pWnd,
|  UINT  |  nHitTest,
|  UINT  |  message
)
Member Data Documentation
◆ m_bAllowColumnResizing
 bool CRhinoUiGridListHeaderCtrl::m_bAllowColumnResizing
protected
◆ m_DisableColumnSizingList
 CUIntArray CRhinoUiGridListHeaderCtrl::m_DisableColumnSizingList
protected
◆ m_nCursorColumn
 int CRhinoUiGridListHeaderCtrl::m_nCursorColumn
protected