Static Public Member Functions | List of all members
ON_ShutLining::Curve::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static bool  | Enabled (void)
static bool  | IsBump (void)
static int  | Profile (void)
static bool  | Pull (void)
static double  | Radius (void)
Member Function Documentation
◆ Enabled()
 static bool ON_ShutLining::Curve::Defaults::Enabled  |  ( |  void  |   | )
static
◆ IsBump()
 static bool ON_ShutLining::Curve::Defaults::IsBump  |  ( |  void  |   | )
static
◆ Profile()
 static int ON_ShutLining::Curve::Defaults::Profile  |  ( |  void  |   | )
static
◆ Pull()
 static bool ON_ShutLining::Curve::Defaults::Pull  |  ( |  void  |   | )
static
◆ Radius()
 static double ON_ShutLining::Curve::Defaults::Radius  |  ( |  void  |   | )
static