Static Public Member Functions | Static Public Attributes | List of all members
ON_StandardDisplayModeId Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Static Public Member Functions
static ON_UUID  | FromV3DisplayMode (ON::v3_display_mode dm)
static bool  | IsStandardDisplayModeId (ON_UUID id)
static ON::v3_display_mode  | ToV3DisplayMode (ON_UUID id)
 Static Public Attributes
static const ON_UUID  | AmbientOcclusion
{C32B72C3-41BD-4ADC-82A8-B7AEF4456A37} More...
static const ON_UUID  | Architecture
{881F20DD-A78E-4930-A7C3-690E5E6B0927} More...
static const ON_UUID  | Artistic
{B46AB226-05A0-4568-B454-4B1AB721C675} More...
static const ON_UUID  | Ghosted
{FF608B97-81D3-4186-831C-41F7DC140881} More...
static const ON_UUID  | Monochrome
{E1B5C8A2-ED43-4872-9A01-814E612D5363} More...
static const ON_UUID  | Pen
{F4616FA5-A831-4620-A97E-9B807D5EC376} More...
static const ON_UUID  | Raytraced
{69E0C7A5-1C6A-46C8-B98B-8779686CD181} More...
static const ON_UUID  | Rendered
{CAE60BAE-2D51-4299-ABF7-A339FCA86F3B} More...
static const ON_UUID  | RenderedShadows
{A5545314-9D87-428d-95AE-91052EEAD0FA} More...
static const ON_UUID  | Shaded
{8BC8DEBE-C83B-4c47-B13C-9DB074510CAC} More...
static const ON_UUID  | Technical
{63612C72-778F-4afd-B81B-17426FDFE8A6} More...
static const ON_UUID  | Wireframe
{1311ADCB-D89E-4051-A3F0-F64441FB8EC6} More...
static const ON_UUID  | XrayShade
{B5C19D5D-0AEC-4ff7-A10E-E052E660263A} More...
Member Function Documentation
◆ FromV3DisplayMode()
 static ON_UUID ON_StandardDisplayModeId::FromV3DisplayMode  |  ( |  ON::v3_display_mode  |  dm | )
static
Parameters: dm - [in] v3 display mode enum value Returns: display mode id that corresponds to the enum value.
◆ IsStandardDisplayModeId()
 static bool ON_StandardDisplayModeId::IsStandardDisplayModeId  |  ( |  ON_UUID  |  id | )
static
Parameters: id - [in] Returns: True if id is one of the standard display modes listed above.
◆ ToV3DisplayMode()
 static ON::v3_display_mode ON_StandardDisplayModeId::ToV3DisplayMode  |  ( |  ON_UUID  |  id | )
static
Parameters: id - [in] Returns: The legacy V3 display mode enum that is the closest match to the display mode id.
Member Data Documentation
◆ AmbientOcclusion
 const ON_UUID ON_StandardDisplayModeId::AmbientOcclusion
static
{C32B72C3-41BD-4ADC-82A8-B7AEF4456A37}
◆ Architecture
 const ON_UUID ON_StandardDisplayModeId::Architecture
static
{881F20DD-A78E-4930-A7C3-690E5E6B0927}
◆ Artistic
 const ON_UUID ON_StandardDisplayModeId::Artistic
static
{B46AB226-05A0-4568-B454-4B1AB721C675}
◆ Ghosted
 const ON_UUID ON_StandardDisplayModeId::Ghosted
static
{FF608B97-81D3-4186-831C-41F7DC140881}
◆ Monochrome
 const ON_UUID ON_StandardDisplayModeId::Monochrome
static
{E1B5C8A2-ED43-4872-9A01-814E612D5363}
◆ Pen
 const ON_UUID ON_StandardDisplayModeId::Pen
static
{F4616FA5-A831-4620-A97E-9B807D5EC376}
◆ Raytraced
 const ON_UUID ON_StandardDisplayModeId::Raytraced
static
{69E0C7A5-1C6A-46C8-B98B-8779686CD181}
◆ Rendered
 const ON_UUID ON_StandardDisplayModeId::Rendered
static
{CAE60BAE-2D51-4299-ABF7-A339FCA86F3B}
◆ RenderedShadows
 const ON_UUID ON_StandardDisplayModeId::RenderedShadows
static
{A5545314-9D87-428d-95AE-91052EEAD0FA}
◆ Shaded
 const ON_UUID ON_StandardDisplayModeId::Shaded
static
{8BC8DEBE-C83B-4c47-B13C-9DB074510CAC}
◆ Technical
 const ON_UUID ON_StandardDisplayModeId::Technical
static
{63612C72-778F-4afd-B81B-17426FDFE8A6}
◆ Wireframe
 const ON_UUID ON_StandardDisplayModeId::Wireframe
static
{1311ADCB-D89E-4051-A3F0-F64441FB8EC6}
◆ XrayShade
 const ON_UUID ON_StandardDisplayModeId::XrayShade
static
{B5C19D5D-0AEC-4ff7-A10E-E052E660263A}