Public Member Functions | List of all members
CRhRdkCustomContentUI Class Reference
RDK
#include <IRhRdkContentUI.h>
 Inheritance diagram for CRhRdkCustomContentUI:
 Public Member Functions
CRhRdkCustomContentUI (const UUID &uuidEditor, const UUID &uuidUI)
virtual  | ~CRhRdkCustomContentUI ()
virtual void  | AddClient (const CRhRdkContent &c) override
virtual int  | ClientCount (void) const override
virtual IRhinoUiHolder *  | ContentUIHolder (void) const override
virtual RDK_INTERNAL CRhRdkControllerPtr  | Controller (void) const override
virtual ON_wString  | DebugString (void) const override
virtual UUID  | EditorUuid (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
const CRhRdkContent *  | GetClient (int index) const
void  | GetSelection (CRhRdkContentArray &aOut) const
virtual void  | ReleaseAllClients (void) override
virtual void  | RemClient (const CRhRdkContent &c) override
virtual RDK_INTERNAL void  | SetController (CRhRdkControllerPtr con) override
virtual void  | SetSelection (const CRhRdkContentArray &aContent) override
virtual void  | Show (bool bShow) override
virtual UUID  | Uuid (void) const override
 Public Member Functions inherited from IRhRdkContentUI
RDK_DEPRECATED void  | AddClient (CRhRdkCoreContent &c)
virtual RDK_DEPRECATED void  | AddSection (class CRhRdkExpandingSection *pSection, int dummy=0)
virtual void  | DeleteThis (void)=0
virtual void  | Destroy (void)=0
virtual void  | DisplayData (void)=0
virtual void  | Enable (bool bEnable)=0
virtual void  | EnableDisableControls (void)=0
virtual RhRdkUiFrameworks  | Framework (void) const =0
virtual RDK_DEPRECATED class IRhinoUiHolder &  | Holder (void) const
virtual bool  | IsCreated (void) const =0
virtual bool  | IsShown (void) const =0
RDK_DEPRECATED void  | RemClient (CRhRdkCoreContent &c)
virtual void  | SetPositionAndSize (const ON_4iRect &rect)=0
 Additional Inherited Members
 Static Public Member Functions inherited from IRhRdkContentUI
static RDK_DEPRECATED IRhRdkContentUI *  | Get (const UUID &)
 Protected Member Functions inherited from IRhRdkContentUI
virtual  | ~IRhRdkContentUI ()
Detailed Description
This is the base class for custom content user interfaces. If you want to override CRhRdkCoreContent::CreateUI() to create your own custom UI, you must derive your UI from this class. This ensures that your custom UI is properly registered with the RDK, and it also implements some of the IRhRdkContentUI methods for you. Please do not try to directly implement IRhRdkContentUI. This approach will not work.
Also, please note that as of Rhino 8, your CRhRdkCustomContentUI derived class must also be inherited from CWnd. If this is not the case, you will need to update your plug-in.
See also
CRhRdkContent::CreateUI()
 CRhRdkCoreContent::CreateUI()
 IRhRdkContentUI
Constructor & Destructor Documentation
◆ CRhRdkCustomContentUI()
 CRhRdkCustomContentUI::CRhRdkCustomContentUI  |  ( |  const UUID &  |  uuidEditor,
|  const UUID &  |  uuidUI
)
◆ ~CRhRdkCustomContentUI()
 virtual CRhRdkCustomContentUI::~CRhRdkCustomContentUI  |  ( |   | )
virtual
Member Function Documentation
◆ AddClient()
 virtual void CRhRdkCustomContentUI::AddClient  |  ( |  const CRhRdkContent &  |  c | )
overridevirtual
Called when a client is added to the UI. Your implementation should remember this client, perhaps in a CRhRdkContentArray. Implemented by CRhRdkCustomContentUI.
See also
ClientCount()
Implements IRhRdkContentUI.
◆ ClientCount()
 virtual int CRhRdkCustomContentUI::ClientCount  |  ( |  void  |   | ) |   const
overridevirtual
Returns
the number of clients using the UI. Implemented by CRhRdkCustomContentUI.
See also
AddClient()
 RemClient()
Implements IRhRdkContentUI.
◆ ContentUIHolder()
 virtual IRhinoUiHolder* CRhRdkCustomContentUI::ContentUIHolder  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The holder that contains the UI sections, if this is an expandable content UI with sections inside holders. Returns null for custom UIs.
Implements IRhRdkContentUI.
◆ Controller()
 virtual RDK_INTERNAL CRhRdkControllerPtr CRhRdkCustomContentUI::Controller  |  ( |  void  |   | ) |   const
overridevirtual
Implements IRhRdkContentUI.
◆ DebugString()
 virtual ON_wString CRhRdkCustomContentUI::DebugString  |  ( |  void  |   | ) |   const
overridevirtual
Returns
UI information for debugging.
Implements IRhRdkContentUI.
◆ EditorUuid()
 virtual UUID CRhRdkCustomContentUI::EditorUuid  |  ( |  void  |   | ) |   const
overridevirtual
Get the unique identifier of the editor that the UI is being displayed in. Implemented by CRhRdkCustomContentUI.
Implements IRhRdkContentUI.
◆ EVF()
 virtual void* CRhRdkCustomContentUI::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridevirtual
Emergency virtual function for future expansion.
Implements IRhRdkContentUI.
◆ GetClient()
 const CRhRdkContent* CRhRdkCustomContentUI::GetClient  |  ( |  int  |  index | ) |   const
Get the client at an index.
See also
ClientCount().
◆ GetSelection()
 void CRhRdkCustomContentUI::GetSelection  |  ( |  CRhRdkContentArray &  |  aOut | ) |   const
Helper function to get the selected content.
◆ ReleaseAllClients()
 virtual void CRhRdkCustomContentUI::ReleaseAllClients  |  ( |  void  |   | )
overridevirtual
Implements IRhRdkContentUI.
◆ RemClient()
 virtual void CRhRdkCustomContentUI::RemClient  |  ( |  const CRhRdkContent &  |  c | )
overridevirtual
Called when a client is removed from the UI. Your implementation should remove the client from its client list or array. When the last client is removed, you must hide the entire UI. Implemented by CRhRdkCustomContentUI.
See also
ClientCount().
Implements IRhRdkContentUI.
◆ SetController()
 virtual RDK_INTERNAL void CRhRdkCustomContentUI::SetController  |  ( |  CRhRdkControllerPtr  |  con | )
overridevirtual
Implements IRhRdkContentUI.
◆ SetSelection()
 virtual void CRhRdkCustomContentUI::SetSelection  |  ( |  const CRhRdkContentArray &  |  aContent | )
overridevirtual
Called when the user selects content in the editor.
Parameters
aContent | is the content being selected. Your UI should 'remember' the instance ids of the contents so that it can look them up again and transfer their state to the controls in DisplayData().
See also
DisplayData().
Implements IRhRdkContentUI.
◆ Show()
 virtual void CRhRdkCustomContentUI::Show  |  ( |  bool  |  bShow | )
overridevirtual
Show/Hide the UI. Your implementation must respond to this by showing or hiding the entire UI. Please call the base class.
Implements IRhRdkContentUI.
◆ Uuid()
 virtual UUID CRhRdkCustomContentUI::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Get the unique identifier of the UI. Implemented by CRhRdkCustomContentUI.
Implements IRhRdkContentUI.