Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentCreatorLoad Class Reference
RDK
#include <RhRdkContentCreator.h>
 Inheritance diagram for CRhRdkContentCreatorLoad:
 Public Member Functions
CRhRdkContentCreatorLoad (const CRhRdkDocument &rdkDoc, CRhRdkContent::Kinds topLevelKind)
virtual  | ~CRhRdkContentCreatorLoad ()
void  | SetFilenameOverride (const wchar_t *wsz)
 Public Member Functions inherited from CRhRdkContentCreator
CRhRdkContentCreator (const CRhRdkDocument &rdkDoc)
virtual  | ~CRhRdkContentCreator ()
const CRhRdkContent *  | AddContent (const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
bool  | AddContent (OUT CRhRdkContentArray &aContent, const CRhRdkContent *pParentContent=nullptr, const wchar_t *wszChildSlotName=nullptr) const
virtual_su bool  | AutoEditChild (void) const
const CRhRdkContent *  | ChangeContentType (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
const CRhRdkContent *  | ChangeContentTypeEx (const CRhRdkContent *&pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild, unsigned int ic_flags) const
const wchar_t *  | ErrorString (void) const
const CRhRdkContent *  | FindChildAddOrChange (const CRhRdkContent &parentContent, const wchar_t *wszChildSlotName, bool bPreserveOldChild) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Member Functions
virtual bool  | CreateNewContent (CRhRdkContentArrayNC &aContentOut, const CRhRdkContent *pOldContent, const CRhRdkContent *pParentContent, const wchar_t *wszChildSlotName) const override
virtual bool  | IsCopy (void) const override
virtual const CRhRdkContentArray *  | OriginalContent (void) const override
 Protected Member Functions inherited from CRhRdkContentCreator
virtual void *  | EVF (const wchar_t *, void *) override
const CRhRdkDocument *  | RdkDocument (void) const
void  | SetErrorString (const wchar_t *wsz) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkContentCreatorLoad()
 CRhRdkContentCreatorLoad::CRhRdkContentCreatorLoad  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkContent::Kinds  |  topLevelKind
)
◆ ~CRhRdkContentCreatorLoad()
 virtual CRhRdkContentCreatorLoad::~CRhRdkContentCreatorLoad  |  ( |   | )
virtual
Member Function Documentation
◆ CreateNewContent()
 virtual bool CRhRdkContentCreatorLoad::CreateNewContent  |  ( |  CRhRdkContentArrayNC &  |  aContentOut,
|  const CRhRdkContent *  |  pOldContent,
|  const CRhRdkContent *  |  pParentContent,
|  const wchar_t *  |  wszChildSlotName
) |   |  const
overrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ IsCopy()
 virtual bool CRhRdkContentCreatorLoad::IsCopy  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ OriginalContent()
 virtual const CRhRdkContentArray* CRhRdkContentCreatorLoad::OriginalContent  |  ( |  void  |   | ) |   const
inlineoverrideprotectedvirtual
Implements CRhRdkContentCreator.
◆ SetFilenameOverride()
 void CRhRdkContentCreatorLoad::SetFilenameOverride  |  ( |  const wchar_t *  |  wsz | )