Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoOpenGLSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoOpenGLSettings ()
CRhinoOpenGLSettings (const CRhinoOpenGLSettings &)
~CRhinoOpenGLSettings ()
bool  | AllowGpuProcedurals () const
bool  | DefaultDisplayOpenGL () const
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoOpenGLSettings &other) const
CRhinoOpenGLSettings &  | operator= (const CRhinoOpenGLSettings &)
bool  | operator== (const CRhinoOpenGLSettings &other) const
const wchar_t *  | ProfileKey () const
bool  | QuadBuffering () const
void  | SaveProfile (CRhinoProfileContext &) const
void  | SetAllowGpuProcedurals (bool allow_gpu_procedurals)
void  | SetOpenGLAsDefaultDisplay (bool enable)
void  | SetQuadBuffering (bool)
void  | SetSkylightShadowResolutionScale (int scale)
void  | SetSkylightShadowResolutionScaleDynamic (int scale)
void  | SetWireThicknessScale (float scale)
unsigned int  | SkylightShadowResolutionScale () const
unsigned int  | SkylightShadowResolutionScaleDynamic () const
void  | Validate ()
clamp settings to valid values More...
float  | WireThicknessScale () const
 Public Attributes
bool  | m_bLineSmoothing = true
bool  | m_bRegenBufferOnHardwareSwap = true
Some cards can't reproduce the backbuffer in certain situations. More...
bool  | m_bUseHardwareDriverModes = true
Try to use non-generic modes... More...
bool  | m_bUseTessellationShaders = true
use tessellation shaders when available More...
bool  | m_bUseTextureCompression = false
int  | m_max_gl_level = 46
int  | m_nAnisotropicMode = 3
0 = none, 1 = Low, 2 = Medium, 3 = High More...
int  | m_nAntialiasMode = 2
0 = none, 1 = Low, 2 = Medium, 3 = High More...
int  | m_nMipMapMode = 2
0 = none, 1 = Nearest, 2 = Linear More...
bool  | m_use_core_profile = false
 Static Public Attributes
static const CRhinoOpenGLSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoOpenGLSettings() [1/2]
 CRhinoOpenGLSettings::CRhinoOpenGLSettings  |  ( |   | )
◆ CRhinoOpenGLSettings() [2/2]
 CRhinoOpenGLSettings::CRhinoOpenGLSettings  |  ( |  const CRhinoOpenGLSettings &  |   | )
◆ ~CRhinoOpenGLSettings()
 CRhinoOpenGLSettings::~CRhinoOpenGLSettings  |  ( |   | )
Member Function Documentation
◆ AllowGpuProcedurals()
 bool CRhinoOpenGLSettings::AllowGpuProcedurals  |  ( |   | ) |   const
◆ DefaultDisplayOpenGL()
 bool CRhinoOpenGLSettings::DefaultDisplayOpenGL  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoOpenGLSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoOpenGLSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoOpenGLSettings::operator!=  |  ( |  const CRhinoOpenGLSettings &  |  other | ) |   const
◆ operator=()
 CRhinoOpenGLSettings& CRhinoOpenGLSettings::operator=  |  ( |  const CRhinoOpenGLSettings &  |   | )
◆ operator==()
 bool CRhinoOpenGLSettings::operator==  |  ( |  const CRhinoOpenGLSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoOpenGLSettings::ProfileKey  |  ( |   | ) |   const
◆ QuadBuffering()
 bool CRhinoOpenGLSettings::QuadBuffering  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoOpenGLSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ SetAllowGpuProcedurals()
 void CRhinoOpenGLSettings::SetAllowGpuProcedurals  |  ( |  bool  |  allow_gpu_procedurals | )
◆ SetOpenGLAsDefaultDisplay()
 void CRhinoOpenGLSettings::SetOpenGLAsDefaultDisplay  |  ( |  bool  |  enable | )
◆ SetQuadBuffering()
 void CRhinoOpenGLSettings::SetQuadBuffering  |  ( |  bool  |   | )
◆ SetSkylightShadowResolutionScale()
 void CRhinoOpenGLSettings::SetSkylightShadowResolutionScale  |  ( |  int  |  scale | )
◆ SetSkylightShadowResolutionScaleDynamic()
 void CRhinoOpenGLSettings::SetSkylightShadowResolutionScaleDynamic  |  ( |  int  |  scale | )
◆ SetWireThicknessScale()
 void CRhinoOpenGLSettings::SetWireThicknessScale  |  ( |  float  |  scale | )
◆ SkylightShadowResolutionScale()
 unsigned int CRhinoOpenGLSettings::SkylightShadowResolutionScale  |  ( |   | ) |   const
◆ SkylightShadowResolutionScaleDynamic()
 unsigned int CRhinoOpenGLSettings::SkylightShadowResolutionScaleDynamic  |  ( |   | ) |   const
◆ Validate()
 void CRhinoOpenGLSettings::Validate  |  ( |   | )
clamp settings to valid values
◆ WireThicknessScale()
 float CRhinoOpenGLSettings::WireThicknessScale  |  ( |   | ) |   const
Member Data Documentation
◆ Default
 const CRhinoOpenGLSettings CRhinoOpenGLSettings::Default
static
◆ m_bLineSmoothing
 bool CRhinoOpenGLSettings::m_bLineSmoothing = true
alpha blend wires out from the edge of the curve. No line smoothing will have higher performance, but lower quality
◆ m_bRegenBufferOnHardwareSwap
 bool CRhinoOpenGLSettings::m_bRegenBufferOnHardwareSwap = true
Some cards can't reproduce the backbuffer in certain situations.
◆ m_bUseHardwareDriverModes
 bool CRhinoOpenGLSettings::m_bUseHardwareDriverModes = true
Try to use non-generic modes...
◆ m_bUseTessellationShaders
 bool CRhinoOpenGLSettings::m_bUseTessellationShaders = true
use tessellation shaders when available
18 July 2020 S. Baer (RH-58768) Mac drivers still have issues with tessellation shaders. Turning them off by default on Macand users can opt in to this feature in case it works well for a specific set up
◆ m_bUseTextureCompression
 bool CRhinoOpenGLSettings::m_bUseTextureCompression = false
◆ m_max_gl_level
 int CRhinoOpenGLSettings::m_max_gl_level = 46
used to cap the OpenGL operating level (40 would mean only use OpenGL 4.0 functionality and below)
◆ m_nAnisotropicMode
 int CRhinoOpenGLSettings::m_nAnisotropicMode = 3
0 = none, 1 = Low, 2 = Medium, 3 = High
◆ m_nAntialiasMode
 int CRhinoOpenGLSettings::m_nAntialiasMode = 2
0 = none, 1 = Low, 2 = Medium, 3 = High
◆ m_nMipMapMode
 int CRhinoOpenGLSettings::m_nMipMapMode = 2
0 = none, 1 = Nearest, 2 = Linear
◆ m_use_core_profile
 bool CRhinoOpenGLSettings::m_use_core_profile = false