Public Member Functions | Public Attributes | List of all members
ON_MaterialRef Class Reference
OpenNURBS
#include <opennurbs_mapchan.h>
 Public Member Functions
ON_MaterialRef ()
int  | Compare (const ON_MaterialRef &other) const
void  | Default ()
ON::object_material_source  | MaterialSource () const
bool  | Read (ON_BinaryArchive &archive)
void  | SetMaterialSource (ON::object_material_source)
bool  | Write (ON_BinaryArchive &archive) const
 Public Attributes
ON_UUID  | m_material_backface_id
If nil, then m_material_id is used for front and back faces. More...
int  | m_material_backface_index
ON_UUID  | m_material_id
Identifies an ON_Material. More...
int  | m_material_index
unsigned char  | m_material_source
ON::object_material_source values. More...
ON_UUID  | m_plugin_id
Identifies a rendering plugin. More...
unsigned char  | m_reserved1
unsigned char  | m_reserved2
unsigned char  | m_reserved3
Constructor & Destructor Documentation
◆ ON_MaterialRef()
 ON_MaterialRef::ON_MaterialRef  |  ( |   | )
If m_material_id = ON_MaterialRef::material_from_layer, then the object's layer determine the material. See ON::material_from_layer. static const ON_UUID material_from_layer; ///< TOD0 - remove this If m_material_id = ON_MaterialRef::material_from_layer, then the object's parent determine the material. See ON::material_from_parent. static const ON_UUID material_from_parent; ///< TODO - remove this
Member Function Documentation
◆ Compare()
 int ON_MaterialRef::Compare  |  ( |  const ON_MaterialRef &  |  other | ) |   const
◆ Default()
 void ON_MaterialRef::Default  |  ( |   | )
◆ MaterialSource()
 ON::object_material_source ON_MaterialRef::MaterialSource  |  ( |   | ) |   const
◆ Read()
 bool ON_MaterialRef::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ SetMaterialSource()
 void ON_MaterialRef::SetMaterialSource  |  ( |  ON::object_material_source  |   | )
◆ Write()
 bool ON_MaterialRef::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ m_material_backface_id
 ON_UUID ON_MaterialRef::m_material_backface_id
If nil, then m_material_id is used for front and back faces.
Identifies an ON_Material
◆ m_material_backface_index
 int ON_MaterialRef::m_material_backface_index
RUNTIME material table index for m_material_id. This value is not saved in files. If -1, then it needs to be set.
◆ m_material_id
 ON_UUID ON_MaterialRef::m_material_id
Identifies an ON_Material.
◆ m_material_index
 int ON_MaterialRef::m_material_index
RUNTIME material table index for m_material_id. This value is not saved in files. If -1, then it needs to be set.
◆ m_material_source
 unsigned char ON_MaterialRef::m_material_source
ON::object_material_source values.
◆ m_plugin_id
 ON_UUID ON_MaterialRef::m_plugin_id
Identifies a rendering plugin.
◆ m_reserved1
 unsigned char ON_MaterialRef::m_reserved1
◆ m_reserved2
 unsigned char ON_MaterialRef::m_reserved2
◆ m_reserved3
 unsigned char ON_MaterialRef::m_reserved3