Public Member Functions | Public Attributes | List of all members
CRhinoUiRichTextEditCtrl Class Reference
RhinoUI
#include <RhinoSdkUiRichEditCtrl.h>
 Inheritance diagram for CRhinoUiRichTextEditCtrl:
 Public Member Functions
CRhinoUiRichTextEditCtrl ()
virtual  | ~CRhinoUiRichTextEditCtrl ()
void  | DDX_RhinoRichText (CDataExchange *pDX, int nIDC, ON_wString &wValue)
void  | InitializeProperties (const LOGFONT &logfont)
ON_wString  | RmaGetRichText ()
void  | RmaGetRichText (ON_wString &str)
void  | RmaSetRichText (const wchar_t *sText, bool bAppend=false)
 Public Member Functions inherited from CRhinoUiRichEditCtrl
CRhinoUiRichEditCtrl ()
virtual  | ~CRhinoUiRichEditCtrl ()
bool  | ContextMenuEnabled () const
int  | CreateFrom (CEdit *CopyControl)
void  | DDX_Text (CDataExchange *pDX, int nIDC, ON_wString &wValue)
bool  | EnableContextMenu (bool b)
ON_wString  | GetText () const
For backwards compatibility. More...
afx_msg void  | OnContextMenu (CWnd *pWnd, CPoint pt)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
LRESULT  | OnPaste (WPARAM wParam, LPARAM lParam)
afx_msg void  | OnSetFocus (CWnd *pOldWnd)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual int  | printf (const wchar_t *format,...)
ON_wString  | RmaGetUnicodeText () const
int  | RmaGetUnicodeText (ON_wString &wText) const
int  | RmaGetUnicodeText (wchar_t *psText, int nSize) const
int  | RmaGetUnicodeTextLength () const
void  | RmaSetUnicodeText (const wchar_t *sText, bool bAppend=false)
int  | RmaUnicodeGetSelText (ON_wString &wText) const
int  | RmaUnicodeGetSelText (wchar_t *sText, int nSize) const
void  | RmaUnicodeReplaceSel (const wchar_t *sText)
 Public Attributes
CHARFORMAT  | m_charformat
 Additional Inherited Members
 Protected Attributes inherited from CRhinoUiRichEditCtrl
bool  | m_bContextMenu
CHARRANGE  | m_SelRange
Constructor & Destructor Documentation
◆ CRhinoUiRichTextEditCtrl()
 CRhinoUiRichTextEditCtrl::CRhinoUiRichTextEditCtrl  |  ( |   | )
◆ ~CRhinoUiRichTextEditCtrl()
 virtual CRhinoUiRichTextEditCtrl::~CRhinoUiRichTextEditCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ DDX_RhinoRichText()
 void CRhinoUiRichTextEditCtrl::DDX_RhinoRichText  |  ( |  CDataExchange *  |  pDX,
|  int  |  nIDC,
|  ON_wString &  |  wValue
)
Description: DoDataExchange method Replace the DDX_Text(....) function call in your dialog class Use as CRhinoUiRichEditCtrl::DDX_Text above but for Rhino Rich Text strings.
◆ InitializeProperties()
 void CRhinoUiRichTextEditCtrl::InitializeProperties  |  ( |  const LOGFONT &  |  logfont | )
Set the default properties to use for RichText display The height and width factors are relative to the parent object's text height and since text has only one basic height in the dialog, that doesn't get considered here.
◆ RmaGetRichText() [1/2]
 ON_wString CRhinoUiRichTextEditCtrl::RmaGetRichText  |  ( |   | )
◆ RmaGetRichText() [2/2]
 void CRhinoUiRichTextEditCtrl::RmaGetRichText  |  ( |  ON_wString &  |  str | )
◆ RmaSetRichText()
 void CRhinoUiRichTextEditCtrl::RmaSetRichText  |  ( |  const wchar_t *  |  sText,
|  bool  |  bAppend = false
)
Member Data Documentation
◆ m_charformat
 CHARFORMAT CRhinoUiRichTextEditCtrl::m_charformat