Public Member Functions | Public Attributes | List of all members
CRhRdkContentFilterInfo Class Referencefinal
RDK
#include <RhRdkDocument.h>
 Public Member Functions
CRhRdkContentFilterInfo ()
~CRhRdkContentFilterInfo ()
 Public Attributes
bool  | m_bNameFilterInvert
bool  | m_bShowHidden
bool  | m_bShowReference
bool  | m_bShowUnassigned
bool  | m_bShowV4
void *  | m_pReserved
ON_wString  | m_sExcluded
ON_wString  | m_sNameFilter
Constructor & Destructor Documentation
◆ CRhRdkContentFilterInfo()
 CRhRdkContentFilterInfo::CRhRdkContentFilterInfo  |  ( |   | )
◆ ~CRhRdkContentFilterInfo()
 CRhRdkContentFilterInfo::~CRhRdkContentFilterInfo  |  ( |   | )
Member Data Documentation
◆ m_bNameFilterInvert
 bool CRhRdkContentFilterInfo::m_bNameFilterInvert
◆ m_bShowHidden
 bool CRhRdkContentFilterInfo::m_bShowHidden
◆ m_bShowReference
 bool CRhRdkContentFilterInfo::m_bShowReference
◆ m_bShowUnassigned
 bool CRhRdkContentFilterInfo::m_bShowUnassigned
◆ m_bShowV4
 bool CRhRdkContentFilterInfo::m_bShowV4
◆ m_pReserved
 void* CRhRdkContentFilterInfo::m_pReserved
◆ m_sExcluded
 ON_wString CRhRdkContentFilterInfo::m_sExcluded
◆ m_sNameFilter
 ON_wString CRhRdkContentFilterInfo::m_sNameFilter