Public Member Functions | List of all members
CRhinoPlugInCommandRecord Class Reference
Rhino
#include <RhinoSdkPlugInManager.h>
 Public Member Functions
CRhinoPlugInCommandRecord ()=default
CRhinoPlugInCommandRecord (const CRhinoPlugInCommandRecord &)
CRhinoPlugInCommandRecord (const wchar_t *lpsEnglishCommandName, const wchar_t *lpsRegistryLocalCommandName, int nFlags)
const wchar_t *  | EnglishCommandName () const
int  | Flags () const
bool  | IsAlphaCommand () const
Returns true if a command is an "alpha" command. More...
bool  | IsRepeatable () const
bool  | IsScriptRunnerCommand () const
bool  | IsSystem () const
bool  | IsTestCommand () const
bool  | IsTransparent () const
bool  | IsUndoable () const
const wchar_t *  | LocalizedCommandName () const
const CRhinoPlugInCommandRecord &  | operator= (const CRhinoPlugInCommandRecord &)
void  | SetFlags (int nFlags)
Detailed Description
This class is used to describe commands associated with a unloaded plug-in. These commands are listed in the registry.
Constructor & Destructor Documentation
◆ CRhinoPlugInCommandRecord() [1/3]
 CRhinoPlugInCommandRecord::CRhinoPlugInCommandRecord  |  ( |   | )
default
◆ CRhinoPlugInCommandRecord() [2/3]
 CRhinoPlugInCommandRecord::CRhinoPlugInCommandRecord  |  ( |  const wchar_t *  |  lpsEnglishCommandName,
|  const wchar_t *  |  lpsRegistryLocalCommandName,
|  int  |  nFlags
)
Description: Constructor
Parameters: lpsEnglishCommandName - [in] English command name. lpsLocalizedCommandName - [in] Localized command name (may be same as English if not localized) nFlags - [in] See CRhinoCommand::m_cmd_flags for a description of flags.
See Also: CRhinoCommand::m_cmd_flags
◆ CRhinoPlugInCommandRecord() [3/3]
 CRhinoPlugInCommandRecord::CRhinoPlugInCommandRecord  |  ( |  const CRhinoPlugInCommandRecord &  |   | )
Member Function Documentation
◆ EnglishCommandName()
 const wchar_t* CRhinoPlugInCommandRecord::EnglishCommandName  |  ( |   | ) |   const
Description: Return English command name.
◆ Flags()
 int CRhinoPlugInCommandRecord::Flags  |  ( |   | ) |   const
Description: Return command flags.
◆ IsAlphaCommand()
 bool CRhinoPlugInCommandRecord::IsAlphaCommand  |  ( |   | ) |   const
Returns true if a command is an "alpha" command.
◆ IsRepeatable()
 bool CRhinoPlugInCommandRecord::IsRepeatable  |  ( |   | ) |   const
Description: Returns true if a command is "repeatable"; i.e., the command can be repeated by pressing ENTER immediately after the command finishes.
◆ IsScriptRunnerCommand()
 bool CRhinoPlugInCommandRecord::IsScriptRunnerCommand  |  ( |   | ) |   const
Description: Returns: True if the command is a script runner command like "ReadCommandFile" or the RhinoScript plug-in's "ReadScript". Remarks: In the depths of the Rhino core, "ordinary" commands and "script running" commands need to be treated a little differently so that commands run in a script behave exactly as if they were being run from the command line.
◆ IsSystem()
 bool CRhinoPlugInCommandRecord::IsSystem  |  ( |   | ) |   const
Description: Returns true if a command is a system command. (Most commands are not and SDK developers can ignore this field.)
◆ IsTestCommand()
 bool CRhinoPlugInCommandRecord::IsTestCommand  |  ( |   | ) |   const
Description: Returns true if a command is a "test" command that is not available in the commercial release. All commands derived from CRhinoTestCommand are "test" commands.
◆ IsTransparent()
 bool CRhinoPlugInCommandRecord::IsTransparent  |  ( |   | ) |   const
Description: Returns true if a command is "transparent"; i.e., the command does not modify the contents of the model's geometry in any way. Examples of transparent commands include commands that change views and toggle snap states. Any command that adds or deletes, a view cannot be transparent.
◆ IsUndoable()
 bool CRhinoPlugInCommandRecord::IsUndoable  |  ( |   | ) |   const
Description: Returns true if this command's actions can be undone by the Rhino "Undo" command. See Also: CRhinoCommand::EnableUndo
◆ LocalizedCommandName()
 const wchar_t* CRhinoPlugInCommandRecord::LocalizedCommandName  |  ( |   | ) |   const
Description: Return localized command name.
◆ operator=()
 const CRhinoPlugInCommandRecord& CRhinoPlugInCommandRecord::operator=  |  ( |  const CRhinoPlugInCommandRecord &  |   | )
◆ SetFlags()
 void CRhinoPlugInCommandRecord::SetFlags  |  ( |  int  |  nFlags | )
Description: Set command flags
Parameters: nFlags - [in] See CRhinoCommand::m_cmd_flags for a description of flags.
See Also: CRhinoCommand::m_cmd_flags