Public Types | Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppViewSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | rotate_to_view { rotate_around_world_axes = 0, rotate_relative_to_view = 1, rotate_relative_to_view_v2_style = 2, rotate_around_cplane_zaxis = 3 }
 Public Member Functions
CRhinoAppViewSettings ()
CRhinoAppViewSettings (const CRhinoAppViewSettings &)
~CRhinoAppViewSettings ()
bool  | AutoAdjustTargetDepth () const
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | NamedViewsSetClippingPlanes () const
bool  | NamedViewsSetDisplayMode () const
bool  | operator!= (const CRhinoAppViewSettings &src) const
CRhinoAppViewSettings &  | operator= (const CRhinoAppViewSettings &)
bool  | operator== (const CRhinoAppViewSettings &src) const
bool  | PanPlanParallelViewsWithControlShiftRMB () const
bool  | RotateAroundCPlaneZaxis () const
bool  | RotateRelativeToView () const
bool  | RotateViewAroundAutogumball () const
bool  | RotateViewAroundObjectAtMouseCursor () const
bool  | RotateViewAroundSelectedObjects () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetAutoAdjustTargetDepth (bool)
void  | SetNamedViewsSetClippingPlanes (bool)
void  | SetNamedViewsSetDisplayMode (bool)
void  | SetPanPlanParallelViewsWithControlShiftRMB (bool)
void  | SetRotateToView (int)
void  | SetRotateViewAroundAutogumball (bool)
void  | SetRotateViewAroundObjectAtMouseCursor (bool)
void  | SetRotateViewAroundSelectedObjects (bool)
void  | SetZoomExtentsParallelViewBorder (double val)
void  | SetZoomExtentsPerspectiveViewBorder (double val)
double  | ThreePointPerspectiveLensLength () const
default is 50 mm More...
double  | TwoPointPerspectiveLensLength () const
default is 20 mm More...
double  | ZoomExtentsParallelViewBorder () const
double  | ZoomExtentsPerspectiveViewBorder () const
 Public Attributes
bool  | m_always_pan_parallel_views
unsigned char  | m_bits
double  | m_camera_lense_length
bool  | m_defined_view_set_cplane
what happens when defined view are loaded More...
bool  | m_defined_view_set_projection
double  | m_fast_regen_frames_per_second
speedy redraw settings More...
bool  | m_linked_viewports
double  | m_pan_increment
pan More...
bool  | m_pan_reverse_keyboard
int  | m_rotate_circle_increment
rotate More...
bool  | m_rotate_reverse_keyboard
rotate_to_view  | m_rotate_to_view
bool  | m_single_click_maximize
view-port More...
bool  | m_viewport_cursor_wrap
double  | m_zoom_scale
zoom More...
 Static Public Attributes
static const CRhinoAppViewSettings  | Default
Detailed Description
Member Enumeration Documentation
◆ rotate_to_view
 enum CRhinoAppViewSettings::rotate_to_view
Enumerator
rotate_around_world_axes
rotate_relative_to_view
rotate_relative_to_view_v2_style
rotate_around_cplane_zaxis
Constructor & Destructor Documentation
◆ CRhinoAppViewSettings() [1/2]
 CRhinoAppViewSettings::CRhinoAppViewSettings  |  ( |   | )
◆ CRhinoAppViewSettings() [2/2]
 CRhinoAppViewSettings::CRhinoAppViewSettings  |  ( |  const CRhinoAppViewSettings &  |   | )
◆ ~CRhinoAppViewSettings()
 CRhinoAppViewSettings::~CRhinoAppViewSettings  |  ( |   | )
Member Function Documentation
◆ AutoAdjustTargetDepth()
 bool CRhinoAppViewSettings::AutoAdjustTargetDepth  |  ( |   | ) |   const
◆ Defaults()
 void CRhinoAppViewSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppViewSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ NamedViewsSetClippingPlanes()
 bool CRhinoAppViewSettings::NamedViewsSetClippingPlanes  |  ( |   | ) |   const
◆ NamedViewsSetDisplayMode()
 bool CRhinoAppViewSettings::NamedViewsSetDisplayMode  |  ( |   | ) |   const
◆ operator!=()
 bool CRhinoAppViewSettings::operator!=  |  ( |  const CRhinoAppViewSettings &  |  src | ) |   const
◆ operator=()
 CRhinoAppViewSettings& CRhinoAppViewSettings::operator=  |  ( |  const CRhinoAppViewSettings &  |   | )
◆ operator==()
 bool CRhinoAppViewSettings::operator==  |  ( |  const CRhinoAppViewSettings &  |  src | ) |   const
◆ PanPlanParallelViewsWithControlShiftRMB()
 bool CRhinoAppViewSettings::PanPlanParallelViewsWithControlShiftRMB  |  ( |   | ) |   const
◆ RotateAroundCPlaneZaxis()
 bool CRhinoAppViewSettings::RotateAroundCPlaneZaxis  |  ( |   | ) |   const
◆ RotateRelativeToView()
 bool CRhinoAppViewSettings::RotateRelativeToView  |  ( |   | ) |   const
◆ RotateViewAroundAutogumball()
 bool CRhinoAppViewSettings::RotateViewAroundAutogumball  |  ( |   | ) |   const
◆ RotateViewAroundObjectAtMouseCursor()
 bool CRhinoAppViewSettings::RotateViewAroundObjectAtMouseCursor  |  ( |   | ) |   const
◆ RotateViewAroundSelectedObjects()
 bool CRhinoAppViewSettings::RotateViewAroundSelectedObjects  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoAppViewSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetAutoAdjustTargetDepth()
 void CRhinoAppViewSettings::SetAutoAdjustTargetDepth  |  ( |  bool  |   | )
◆ SetNamedViewsSetClippingPlanes()
 void CRhinoAppViewSettings::SetNamedViewsSetClippingPlanes  |  ( |  bool  |   | )
◆ SetNamedViewsSetDisplayMode()
 void CRhinoAppViewSettings::SetNamedViewsSetDisplayMode  |  ( |  bool  |   | )
◆ SetPanPlanParallelViewsWithControlShiftRMB()
 void CRhinoAppViewSettings::SetPanPlanParallelViewsWithControlShiftRMB  |  ( |  bool  |   | )
◆ SetRotateToView()
 void CRhinoAppViewSettings::SetRotateToView  |  ( |  int  |   | )
◆ SetRotateViewAroundAutogumball()
 void CRhinoAppViewSettings::SetRotateViewAroundAutogumball  |  ( |  bool  |   | )
◆ SetRotateViewAroundObjectAtMouseCursor()
 void CRhinoAppViewSettings::SetRotateViewAroundObjectAtMouseCursor  |  ( |  bool  |   | )
◆ SetRotateViewAroundSelectedObjects()
 void CRhinoAppViewSettings::SetRotateViewAroundSelectedObjects  |  ( |  bool  |   | )
◆ SetZoomExtentsParallelViewBorder()
 void CRhinoAppViewSettings::SetZoomExtentsParallelViewBorder  |  ( |  double  |  val | )
◆ SetZoomExtentsPerspectiveViewBorder()
 void CRhinoAppViewSettings::SetZoomExtentsPerspectiveViewBorder  |  ( |  double  |  val | )
◆ ThreePointPerspectiveLensLength()
 double CRhinoAppViewSettings::ThreePointPerspectiveLensLength  |  ( |   | ) |   const
default is 50 mm
◆ TwoPointPerspectiveLensLength()
 double CRhinoAppViewSettings::TwoPointPerspectiveLensLength  |  ( |   | ) |   const
default is 20 mm
◆ ZoomExtentsParallelViewBorder()
 double CRhinoAppViewSettings::ZoomExtentsParallelViewBorder  |  ( |   | ) |   const
◆ ZoomExtentsPerspectiveViewBorder()
 double CRhinoAppViewSettings::ZoomExtentsPerspectiveViewBorder  |  ( |   | ) |   const
Member Data Documentation
◆ Default
 const CRhinoAppViewSettings CRhinoAppViewSettings::Default
static
◆ m_always_pan_parallel_views
 bool CRhinoAppViewSettings::m_always_pan_parallel_views
◆ m_bits
 unsigned char CRhinoAppViewSettings::m_bits
Andy le Bihan - 2010.12.09 - added 4 bytes to fill structure padding. Reserved bytes are initialized to 0. m_bits is used for 0x01: NamedViewsSetClippingPlanes (true by default) 0x02: NamedViewsSetDisplayMode (true by default) 0x04: AutoAdjustTargetDepth (true by default) 1 Feb 2011, Mikko 0x08: RotateViewAroundAutogumball (true by default) 14 Feb 2011, Mikko 0x10: Pan plan parallel views with Control+Shift+RMB 0x20: RotateViewAroundObjectAtMouseCursor (false by default) 23 May 2023, Mikko 0x40: RotateViewAroundSelectedObjects (false by default) 29 Jan 2025, Mikko
◆ m_camera_lense_length
 double CRhinoAppViewSettings::m_camera_lense_length
◆ m_defined_view_set_cplane
 bool CRhinoAppViewSettings::m_defined_view_set_cplane
what happens when defined view are loaded
◆ m_defined_view_set_projection
 bool CRhinoAppViewSettings::m_defined_view_set_projection
◆ m_fast_regen_frames_per_second
 double CRhinoAppViewSettings::m_fast_regen_frames_per_second
speedy redraw settings
must be a number >= 0
◆ m_linked_viewports
 bool CRhinoAppViewSettings::m_linked_viewports
◆ m_pan_increment
 double CRhinoAppViewSettings::m_pan_increment
pan
◆ m_pan_reverse_keyboard
 bool CRhinoAppViewSettings::m_pan_reverse_keyboard
◆ m_rotate_circle_increment
 int CRhinoAppViewSettings::m_rotate_circle_increment
rotate
◆ m_rotate_reverse_keyboard
 bool CRhinoAppViewSettings::m_rotate_reverse_keyboard
◆ m_rotate_to_view
 rotate_to_view CRhinoAppViewSettings::m_rotate_to_view
◆ m_single_click_maximize
 bool CRhinoAppViewSettings::m_single_click_maximize
view-port
◆ m_viewport_cursor_wrap
 bool CRhinoAppViewSettings::m_viewport_cursor_wrap
◆ m_zoom_scale
 double CRhinoAppViewSettings::m_zoom_scale
zoom