Public Member Functions | Public Attributes | List of all members
ON_UserString Class Reference
OpenNURBS
#include <opennurbs_object.h>
 Public Member Functions
ON_UserString ()
~ON_UserString ()
void  | Dump (ON_TextLog &text_log) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_wString  | m_key
ON_wString  | m_string_value
Constructor & Destructor Documentation
◆ ON_UserString()
 ON_UserString::ON_UserString  |  ( |   | )
◆ ~ON_UserString()
 ON_UserString::~ON_UserString  |  ( |   | )
Member Function Documentation
◆ Dump()
 void ON_UserString::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Read()
 bool ON_UserString::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_UserString::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_key
 ON_wString ON_UserString::m_key
◆ m_string_value
 ON_wString ON_UserString::m_string_value