Public Member Functions | Protected Member Functions | Protected Attributes | Static Protected Attributes | Friends | List of all members
CRhinoUiPopDownLayerWnd Class Reference
RhinoUI
CRhinoUiPopDownLayerWnd. More...
#include <rhinoSdkUiLayerListCtrl.h>
 Inheritance diagram for CRhinoUiPopDownLayerWnd:
 Public Member Functions
CRhinoUiPopDownLayerWnd (CComboBox &cb)
virtual  | ~CRhinoUiPopDownLayerWnd ()
CComboBox &  | ComboBox ()
bool  | CreatePopDownWnd ()
void  | HidePopUpWindow ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnShowWindow (BOOL32 bShow, UINT nStatus)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
CRhinoUiPopDownLayerListCtrl &  | PopDownList ()
class CRhinoUiComboBox *  | RhinoUiComboBox ()
bool  | ShowPopDownWnd (HWND hWnd, bool bShow, bool bShowReference)
 Protected Member Functions
void  | SynchPopDownListWithCombo (bool bShow, bool bShowReference)
 Protected Attributes
CComboBox &  | m_ComboBox
CRhinoUiPopDownLayerListCtrl  | m_PopDownList
 Static Protected Attributes
static CString  | m_sWndClass
 Friends
class  | CRhinoUiPopDownLayerListCtrl
Detailed Description
CRhinoUiPopDownLayerWnd.
Constructor & Destructor Documentation
◆ CRhinoUiPopDownLayerWnd()
 CRhinoUiPopDownLayerWnd::CRhinoUiPopDownLayerWnd  |  ( |  CComboBox &  |  cb | )
◆ ~CRhinoUiPopDownLayerWnd()
 virtual CRhinoUiPopDownLayerWnd::~CRhinoUiPopDownLayerWnd  |  ( |   | )
virtual
Member Function Documentation
◆ ComboBox()
 CComboBox& CRhinoUiPopDownLayerWnd::ComboBox  |  ( |   | )
inline
◆ CreatePopDownWnd()
 bool CRhinoUiPopDownLayerWnd::CreatePopDownWnd  |  ( |   | )
◆ HidePopUpWindow()
 void CRhinoUiPopDownLayerWnd::HidePopUpWindow  |  ( |   | )
◆ OnCreate()
 afx_msg int CRhinoUiPopDownLayerWnd::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnShowWindow()
 afx_msg void CRhinoUiPopDownLayerWnd::OnShowWindow  |  ( |  BOOL32  |  bShow,
|  UINT  |  nStatus
)
◆ OnSize()
 afx_msg void CRhinoUiPopDownLayerWnd::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ PopDownList()
 CRhinoUiPopDownLayerListCtrl& CRhinoUiPopDownLayerWnd::PopDownList  |  ( |   | )
inline
◆ RhinoUiComboBox()
 class CRhinoUiComboBox* CRhinoUiPopDownLayerWnd::RhinoUiComboBox  |  ( |   | )
◆ ShowPopDownWnd()
 bool CRhinoUiPopDownLayerWnd::ShowPopDownWnd  |  ( |  HWND  |  hWnd,
|  bool  |  bShow,
|  bool  |  bShowReference
)
◆ SynchPopDownListWithCombo()
 void CRhinoUiPopDownLayerWnd::SynchPopDownListWithCombo  |  ( |  bool  |  bShow,
|  bool  |  bShowReference
)
protected
Friends And Related Function Documentation
◆ CRhinoUiPopDownLayerListCtrl
 friend class CRhinoUiPopDownLayerListCtrl
friend
Member Data Documentation
◆ m_ComboBox
 CComboBox& CRhinoUiPopDownLayerWnd::m_ComboBox
protected
◆ m_PopDownList
 CRhinoUiPopDownLayerListCtrl CRhinoUiPopDownLayerWnd::m_PopDownList
protected
◆ m_sWndClass
 CString CRhinoUiPopDownLayerWnd::m_sWndClass
staticprotected