Public Member Functions | Public Attributes | List of all members
CRhRdkRenderingFileInfo Class Reference
RDK
#include <RhRdkDeprecated.h>
 Public Member Functions
CRhRdkRenderingFileInfo ()
 Public Attributes
int  | m_iElapsedSeconds
UINT_PTR  | m_Reserved
ON_wString  | m_sFilename
ON_wString  | m_sRenderer
UUID  | m_uuidRenderEngine
UUID  | m_uuidRenderSession
Constructor & Destructor Documentation
◆ CRhRdkRenderingFileInfo()
 CRhRdkRenderingFileInfo::CRhRdkRenderingFileInfo  |  ( |   | )
Member Data Documentation
◆ m_iElapsedSeconds
 int CRhRdkRenderingFileInfo::m_iElapsedSeconds
◆ m_Reserved
 UINT_PTR CRhRdkRenderingFileInfo::m_Reserved
◆ m_sFilename
 ON_wString CRhRdkRenderingFileInfo::m_sFilename
◆ m_sRenderer
 ON_wString CRhRdkRenderingFileInfo::m_sRenderer
◆ m_uuidRenderEngine
 UUID CRhRdkRenderingFileInfo::m_uuidRenderEngine
◆ m_uuidRenderSession
 UUID CRhRdkRenderingFileInfo::m_uuidRenderSession