Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoGumballColors Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoGumballColors ()
bool  | operator!= (const CRhinoGumballColors &) const
bool  | operator== (const CRhinoGumballColors &) const
bool  | Read (LPCTSTR lpszSection, CRhinoProfileContext &pc)
bool  | Read (ON_BinaryArchive &binary_archive)
void  | Reset ()
void  | SetToDefaultColors ()
void  | SetToFactoryColors ()
bool  | Write (LPCTSTR lpszSection, CRhinoProfileContext &pc) const
bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static int  | Compare (const CRhinoGumballColors &a, const CRhinoGumballColors &b)
 Public Attributes
ON_Color  | m_menubuttoncolor
ON_Color  | m_xcolor
default is red More...
ON_Color  | m_ycolor
default is green More...
ON_Color  | m_zcolor
default is blue More...
 Static Public Attributes
static ON_Color  | default_menubuttoncolor
static ON_Color  | default_xcolor
default is red More...
static ON_Color  | default_ycolor
default is green More...
static ON_Color  | default_zcolor
default is blue More...
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoGumballColors()
 CRhinoGumballColors::CRhinoGumballColors  |  ( |   | )
Member Function Documentation
◆ Compare()
 static int CRhinoGumballColors::Compare  |  ( |  const CRhinoGumballColors &  |  a,
|  const CRhinoGumballColors &  |  b
)
static
◆ operator!=()
 bool CRhinoGumballColors::operator!=  |  ( |  const CRhinoGumballColors &  |   | ) |   const
◆ operator==()
 bool CRhinoGumballColors::operator==  |  ( |  const CRhinoGumballColors &  |   | ) |   const
◆ Read() [1/2]
 bool CRhinoGumballColors::Read  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
)
Description: Reads the CRhinoGumballColors settings from a CRhinoProfileContext. Any settings that are not in the profile context are set to the default values. Parameters: lpszSection - [in] pc - [in]; Returns: True if the read was successful.
◆ Read() [2/2]
 bool CRhinoGumballColors::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
Description: Reads the CRhinoGumballColors from an ON_BinaryArchive. Parameters: binary_archive - [in] The CRhinoGumballColors information is read from the archive. Reading begins at the current location in the archive. Returns: True if the read was successful.
◆ Reset()
 void CRhinoGumballColors::Reset  |  ( |   | )
Description: Set members to true built in original default gumball colors.
◆ SetToDefaultColors()
 void CRhinoGumballColors::SetToDefaultColors  |  ( |   | )
Description: Set members to default gumball colors. These are the current settings, not the built in defaults.
◆ SetToFactoryColors()
 void CRhinoGumballColors::SetToFactoryColors  |  ( |   | )
Description: Set members to factory gumball colors.
Deprecated:
use CRhinoGumballColors::Reset
◆ Write() [1/2]
 bool CRhinoGumballColors::Write  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
) |   |  const
Description: Saves the CRhinoGumballColors settings to a CRhinoProfileContext. Parameters: lpszSection - [in] pc - [in]; Returns: True if the write was successful.
◆ Write() [2/2]
 bool CRhinoGumballColors::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
Description: Saves the CRhinoGumballColors in an ON_BinaryArchive. This Write function includes a versioned chunk wrapper. Parameters: binary_archive - [in/out] The CRhinoGumballColors information is appended to this archive. Returns: True if the write was successful.
Member Data Documentation
◆ default_menubuttoncolor
 ON_Color CRhinoGumballColors::default_menubuttoncolor
static
◆ default_xcolor
 ON_Color CRhinoGumballColors::default_xcolor
static
default is red
These static values are used by the constructor. They are set by CRhinoApp.AppSettings().SetGumballColors().
◆ default_ycolor
 ON_Color CRhinoGumballColors::default_ycolor
static
default is green
◆ default_zcolor
 ON_Color CRhinoGumballColors::default_zcolor
static
default is blue
◆ m_menubuttoncolor
 ON_Color CRhinoGumballColors::m_menubuttoncolor
◆ m_xcolor
 ON_Color CRhinoGumballColors::m_xcolor
default is red
◆ m_ycolor
 ON_Color CRhinoGumballColors::m_ycolor
default is green
◆ m_zcolor
 ON_Color CRhinoGumballColors::m_zcolor
default is blue