Classes | Public Types | Public Member Functions | Static Public Member Functions | List of all members
CRhRdkTexture Class Referenceabstract
RDK
#include <RhRdkTexture.h>
 Inheritance diagram for CRhRdkTexture:
 Classes
class  | IColorAdjuster
 Public Types
enum  | eBitFormat : int {
 eBitFormat::k32_bpc_RGB, eBitFormat::k32_bpc_BGR, eBitFormat::k32_bpc_RGBA, eBitFormat::k32_bpc_BGRA,
 eBitFormat::k8_bpc_RGB, eBitFormat::k8_bpc_BGR, eBitFormat::k8_bpc_RGBA, eBitFormat::k8_bpc_BGRA
 }
enum  | eLocalMappingType { lmt_none, lmt_2D, lmt_3D, lmt_force32bit = 0xFFFFFFFF }
enum  | EnvironmentMappingModes : unsigned int {
 EnvironmentMappingModes::Automatic = 0, EnvironmentMappingModes::Spherical = 1, EnvironmentMappingModes::Emap = 2, EnvironmentMappingModes::Box = 3,
 EnvironmentMappingModes::Lightprobe = 5, EnvironmentMappingModes::Cubemap = 6, EnvironmentMappingModes::VerticalCrossCubemap = 7, EnvironmentMappingModes::HorizontalCrossCubemap = 8,
 EnvironmentMappingModes::Hemispherical = 9
 }
enum  | ProjectionModes : int {
 ProjectionModes::Unset =-1, ProjectionModes::MappingChannel = 0, ProjectionModes::Wcs = 2, ProjectionModes::Emap = 3,
 ProjectionModes::WcsBox = 4, ProjectionModes::Screen = 5
 }
enum  | RDK_DEPRECATED {
 efNormal = 0, efDisableFiltering = 1, efDisableLocalMapping = 2, efDisableAdjustment = 4,
 efDisableProjectionChange = 8
 }
enum  | TextureGeneration : int { TextureGeneration::Allow = 1, TextureGeneration::Disallow = 2, TextureGeneration::Skip = 3 }
enum  | WrapTypes : unsigned int { WrapTypes::Clamped, WrapTypes::Repeating }
 Public Types inherited from CRhRdkCoreContent
enum  | SectionId : int { TextureSummary = 0x8000, NotUsed = 0x8001 }
 Public Types inherited from CRhRdkContent
enum  | : unsigned int {
 bfTextureSummary = 0x0001, bfQuickPreview = 0x0002, bfPreviewCache = 0x0004, bfLocalTextureMapping = 0x0010,
 bfGraphDisplay = 0x0020, bfAdjustment = 0x0080, bfFields = 0x0100, bfNameTypeSection = 0x0800
 }
enum  | {
 pg_unused = 0x00000000, pg_sphere = 0x00000001, pg_cube = 0x00000002, pg_cone = 0x00000004,
 pg_pyramid = 0x00000008, pg_torus = 0x00000010, pg_plane = 0x00000020, pg_cone_sphere = 0x00010000,
 pg_scene = 0x00020000, pg_default_mat = pg_sphere | pg_cube | pg_cone | pg_pyramid | pg_torus | pg_plane | pg_scene, pg_default_env = pg_cone_sphere, pg_default_tex = pg_unused,
 pg_mat_scene = pg_scene, force32bit_pgflags = 0xFFFFFFFF
 }
enum  | {
 pb_unused = 0x00000000, pb_none = 0x00000001, pb_checker = 0x00000002, pb_custom = 0x00000004,
 pb_scene = 0x00000008, pb_default_mat = pb_none | pb_checker | pb_custom | pb_scene, pb_default_env = pb_unused, pb_default_tex = pb_unused,
 force32bit_pbflags = 0xFFFFFFFF
 }
enum  | {
 pl_unused = 0x00000000, pl_simple = 0x00000001, pl_sky = 0x00000002, pl_default_mat = pl_simple | pl_sky,
 pl_default_env = pl_unused, pl_default_tex = pl_unused, force32bit_plflags = 0xFFFFFFFF
 }
enum  | CopyMethods : unsigned int { CopyMethods::Normal, CopyMethods::Transient }
enum  | CSIContext : unsigned int { CSIContext::All = 0, CSIContext::TextureSummary = 1, CSIContext::Private1 = 2, CSIContext::Private2 = 3 }
enum  | DupOpt { DupOpt::Attach, DupOpt::NoAttach }
enum  | DynamicIconUsage : unsigned int { DynamicIconUsage::TreeControl, DynamicIconUsage::SubnodeControl, DynamicIconUsage::ContentControl, DynamicIconUsage::General }
enum  | EmbedFilesChoice : unsigned int { EmbedFilesChoice::kNeverEmbed = 0, EmbedFilesChoice::kAlwaysEmbed = 1, EmbedFilesChoice::kAskUser = 2, EmbedFilesChoice::kRepeatLast = 3 }
enum  | ePreviewSceneType { preview_scene_server = 0, texture_2d_image = 1, force32_bit_sceneType = 0xFFFFFFFF }
enum  | GDS_Flags : UINT_PTR {
 gds_Normal = 0x00000, gds_KindPrefix = 0x00001, gds_UppercasePropNames = 0x00002, gds_AbbreviatePropNames = 0x00004,
 gds_NameAndIdFirst = 0x00008, gds_ShortUuids = 0x00010, gds_SuppressDocumentId = 0x00020, gds_SuppressGroupId = 0x00040,
 gds_SuppressKind = 0x00080, gds_SuppressTags = 0x00100, gds_SuppressUsage = 0x00200, gds_SuppressSerialNumber = 0x00400,
 gds_SuppressCRCs = 0x00800, gds_SuppressChildSlotName = 0x01000, gds_SuppressRegistration = 0x02000, gds_SuppressAttributes = 0x04000,
 gds_SuppressCustomUserData = 0x08000, gds_SuppressTextureProxy = 0x10000
 }
enum  | Harvested : unsigned int { Harvested::None = 0, Harvested::Some = 1, Harvested::All = 2 }
enum  | Kinds : unsigned int { Kinds::Unset, Kinds::Material, Kinds::Environment, Kinds::Texture }
enum  | ParamSerialMethod : unsigned int { ParamSerialMethod::GetSet, ParamSerialMethod::XmlStream }
enum  | ProxyTypes : unsigned int { ProxyTypes::None, ProxyTypes::Single, ProxyTypes::Multi, ProxyTypes::Texture }
enum  | ReadParamsContext : unsigned int { ReadParamsContext::Serialization = 0, ReadParamsContext::Harvesting = 1, ReadParamsContext::Rendering = 2 }
enum  | WriteParamsContext : unsigned int { WriteParamsContext::Serialization = 0, WriteParamsContext::Harvesting = 1, WriteParamsContext::Rendering = 2, WriteParamsContext::DragDrop = 3 }
 Public Types inherited from IAutoUIExtraRequirements
enum  | SetContext : unsigned int { SetContext::UI, SetContext::Drop, SetContext::Program }
 Public Member Functions
CRhRdkTexture ()
CRhRdkTexture (bool bAutoGlobalRegister)
virtual  | ~CRhRdkTexture ()
virtual RDK_DEPRECATED void  | AddGraphSection (void)
virtual RDK_DEPRECATED void  | AddLocalMappingSection (void)
virtual void  | AddTwoColorSection (IRhRdkExpandableContentUI &ui)
virtual RDK_DEPRECATED void  | AddTwoColorSection (void)
virtual void  | AddUISections (IRhRdkExpandableContentUI &ui) override
virtual RDK_DEPRECATED void  | AddUISections (void) override
virtual bool  | AdjustmentClamp (void) const
virtual double  | AdjustmentClampMax (void) const
virtual double  | AdjustmentClampMin (void) const
virtual double  | AdjustmentGain (void) const
virtual double  | AdjustmentGamma (void) const
virtual bool  | AdjustmentGrayscale (void) const
virtual double  | AdjustmentHueShift (void) const
virtual bool  | AdjustmentInvert (void) const
virtual double  | AdjustmentMultiplier (void) const
virtual double  | AdjustmentSaturation (void) const
virtual bool  | AdjustmentScaleToClamp (void) const
virtual EnvironmentMappingModes  | AutomaticEnvironmentMappingMode (void) const
virtual unsigned int  | BitFlags (void) const override
virtual void  | ConvertMetersToUnits (void) override
virtual void  | ConvertUnitsToMeters (void) override
virtual bool  | CreateLibraryPreview (const ON_2iSize &sizeImage, const IRhRdkPreviewSceneServer *pSceneServer, CRhinoDib &dibOut) const override
virtual bool  | CreatePreview (CRhRdkRenderPlugIn &plugIn, const ON_2iSize &sizeImage, RhRdkPreviewQuality qual, const IRhRdkPreviewSceneServer *pSceneServer, IRhRdkPreviewCallbacks *pNotify, CRhinoDib &dibOut) const override
virtual bool  | DisplayInViewport (void) const
virtual bool  | DynamicIcon (const ON_2iSize &size, CRhinoDib &dibOut, DynamicIconUsage usage) const override
virtual EnvironmentMappingModes  | EnvironmentMappingMode (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual bool  | GenerateRawBuffer (ON_2iSize &sizeOut, eBitFormat &bfOut, CRhRdkVariant &vOut) const
virtual bool  | GenerateTextureSimulation (CRhinoDib &dibOut, IRhRdkTextureEvaluator::CEvalFlags ef) const
virtual bool  | GetFilenameUI (ON_wString &sFilenameOut) const
virtual CRhRdkVariant  | GetParameter (const wchar_t *) const override
virtual void  | GraphInfo (CRhRdkTextureGraphInfo &infoOut) const
virtual Harvested  | HarvestData (const CRhRdkContent &oldContent) override
virtual bool  | Icon (const ON_2iSize &size, CRhinoDib &dibOut) const override
virtual bool  | Initialize (void) override
virtual EnvironmentMappingModes  | InternalEnvironmentMappingMode (void) const
virtual bool  | IsCachedTextureFileInUse (const wchar_t *wszTextureFile) const
virtual bool  | IsHDRCapable (void) const
virtual bool  | IsImageBased (void) const =0
virtual bool  | IsLinear (void) const
virtual_su bool  | IsNormalMap (void) const
virtual Kinds  | Kind (void) const final override
virtual const wchar_t *  | LibraryFileExtension (void) const override
virtual ON_Xform  | LocalMappingTransform (void) const
virtual eLocalMappingType  | LocalMappingType (void) const
virtual int  | MappingChannel (void) const
virtual double  | MetersToUnits (double dMeters) const
virtual_su bool  | NeedsBaking (const ON_UUID &rendererId) const
virtual_su bool  | NeedsBaking (void) const
virtual IColorAdjuster *  | NewColorAdjuster (void) const
virtual CRhRdkPreviewBackground *  | NewPreviewBackground (void) const override
virtual CRhRdkPreviewGeometry *  | NewPreviewGeometry (void) const override
virtual IRhRdkPreviewSceneServer *  | NewPreviewSceneServer (const CRhRdkSSData &data) const override
virtual IRhRdkTextureEvaluator *  | NewSimulatedTextureEvaluator (int iBaseSize=-1) const
virtual IRhRdkTextureEvaluator *  | NewTextureEvaluator (IRhRdkTextureEvaluator::CEvalFlags ef) const
virtual RDK_DEPRECATED IRhRdkTextureEvaluator *  | NewTextureEvaluator (void) const
virtual ON_3dVector  | Offset (void) const
virtual bool  | OffsetLocked (void) const
virtual ParamSerialMethod  | ParameterSerializationMethod (void) const override
virtual bool  | PixelSize (int &widthOut, int &heightOut, int &depthOut) const
virtual UINT  | PreviewBackgroundFlags (void) const override
virtual UINT  | PreviewGeometryFlags (void) const override
virtual bool  | PreviewIn3D (void) const
virtual UINT  | PreviewLightingFlags (void) const override
virtual bool  | PreviewLocalMapping (void) const
virtual ePreviewSceneType  | PreviewSceneType (void) const override
virtual int  | PreviewUpdateDelay (void) const override
virtual ProjectionModes  | ProjectionMode (void) const
virtual bool  | ReadParametersFromSection (const IRhRdk_XMLSection &section, ReadParamsContext context) override
virtual RDK_DEPRECATED bool  | RecreateLocalMapping (void)
virtual ON_3dVector  | Repeat (void) const
virtual bool  | RepeatLocked (void) const
virtual ON_3dVector  | Rotation (void) const
bool  | SaveAsImage (const wchar_t *wszFilename, int width, int height, int depth) const
virtual void  | SetAdjustmentClamp (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentClamp (bool, eChangeContext cc)
virtual void  | SetAdjustmentClampMax (double)
virtual RDK_DEPRECATED void  | SetAdjustmentClampMax (double, eChangeContext cc)
virtual void  | SetAdjustmentClampMin (double)
virtual RDK_DEPRECATED void  | SetAdjustmentClampMin (double, eChangeContext cc)
virtual void  | SetAdjustmentGain (double)
virtual RDK_DEPRECATED void  | SetAdjustmentGain (double, eChangeContext cc)
virtual void  | SetAdjustmentGamma (double)
virtual RDK_DEPRECATED void  | SetAdjustmentGamma (double, eChangeContext cc)
virtual void  | SetAdjustmentGrayscale (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentGrayscale (bool, eChangeContext cc)
virtual void  | SetAdjustmentHueShift (double dShift)
virtual RDK_DEPRECATED void  | SetAdjustmentHueShift (double dShift, eChangeContext cc)
virtual void  | SetAdjustmentInvert (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentInvert (bool, eChangeContext cc)
virtual void  | SetAdjustmentMultiplier (double)
virtual RDK_DEPRECATED void  | SetAdjustmentMultiplier (double, eChangeContext cc)
virtual void  | SetAdjustmentSaturation (double)
virtual RDK_DEPRECATED void  | SetAdjustmentSaturation (double, eChangeContext cc)
virtual void  | SetAdjustmentScaleToClamp (bool)
virtual RDK_DEPRECATED void  | SetAdjustmentScaleToClamp (bool, eChangeContext cc)
virtual void  | SetDisplayInViewport (bool b)
virtual RDK_DEPRECATED void  | SetDisplayInViewport (bool b, eChangeContext cc)
virtual RDK_DEPRECATED void  | SetEnvironmentMappingMode (eEnvironmentMappingMode e, eChangeContext cc)
virtual void  | SetEnvironmentMappingMode (EnvironmentMappingModes emm)
virtual void  | SetGraphInfo (const CRhRdkTextureGraphInfo &info)
void  | SetIsNormalMap (bool bIsNormalMap)
virtual void  | SetMappingChannel (int iMappingChannel)
virtual RDK_DEPRECATED void  | SetMappingChannel (int iMappingChannel, eChangeContext cc)
virtual void  | SetOffset (const ON_3dVector &vecOffset)
virtual RDK_DEPRECATED void  | SetOffset (const ON_3dVector &vecOffset, eChangeContext cc)
virtual void  | SetOffsetLocked (bool bLocked)
virtual RDK_DEPRECATED void  | SetOffsetLocked (bool bLocked, eChangeContext cc)
virtual bool  | SetParameter (const wchar_t *, const CRhRdkVariant &) override
virtual void  | SetPreviewIn3D (bool b)
virtual RDK_DEPRECATED void  | SetPreviewIn3D (bool b, eChangeContext cc)
virtual void  | SetPreviewLocalMapping (bool b)
virtual RDK_DEPRECATED void  | SetPreviewLocalMapping (bool b, eChangeContext cc)
virtual RDK_DEPRECATED void  | SetProjectionMode (eProjectionMode pm, eChangeContext cc)
virtual void  | SetProjectionMode (ProjectionModes pm)
virtual void  | SetRepeat (const ON_3dVector &vecRepeat)
virtual RDK_DEPRECATED void  | SetRepeat (const ON_3dVector &vecRepeat, eChangeContext cc)
virtual void  | SetRepeatLocked (bool bLocked)
virtual RDK_DEPRECATED void  | SetRepeatLocked (bool bLocked, eChangeContext cc)
virtual void  | SetRotation (const ON_3dVector &vecRotation)
virtual RDK_DEPRECATED void  | SetRotation (const ON_3dVector &vecRotation, eChangeContext cc)
virtual bool  | SetSimulation (IRhRdk_XMLSection &section) const override
virtual RDK_DEPRECATED void  | SetWrapType (eWrapType wt, eChangeContext cc)
virtual void  | SetWrapType (WrapTypes wt)
virtual RDK_DEPRECATED void  | SimulateTexture (CRhRdkSimulatedTexture &texOut, bool bForDataOnly) const
virtual void  | SimulateTexture (CRhRdkSimulatedTexture &texOut, TextureGeneration tg=TextureGeneration::Allow, int iSimulatedTextureSize=-1, const CRhinoObject *pObject=NULL) const
virtual_su bool  | SupportedByRenderer (const ON_UUID &rendererId) const
virtual double  | UnitsToMeters (double dUnits) const
virtual bool  | UpdateDocumentTables (void) const override
virtual WrapTypes  | WrapType (void) const
virtual bool  | WriteParametersToSection (IRhRdk_XMLSection &section, WriteParamsContext context) const override
 Public Member Functions inherited from CRhRdkCoreContent
CRhRdkCoreContent ()
CRhRdkCoreContent (bool bAutoGlobalRegister)
virtual  | ~CRhRdkCoreContent ()
virtual RDK_DEPRECATED bool  | AddAutomaticUISection (const wchar_t *wszCaption, int id=0)
virtual bool  | AddAutomaticUISection (IRhRdkExpandableContentUI &ui, const wchar_t *wszLocalCaption, const wchar_t *wszEnglishCaption, int id=0)
virtual void  | AddUI (IRhRdkContentUI &ui) const override
virtual IRhRdkContentUI *  | CreateUI (IRhRdkContentEditor &e, const UUID &uuidUI, const CRhRdkContentArray &aInitialClients, void *pReserved) override
virtual IRhRdkCustomCurveGraphSectionCallback *  | CustomCurveGraphSectionCallback (void)
virtual void  | GetUIs (ON_SimpleArray< IRhRdkContentUI * > &aOut) const override
virtual RDK_DEPRECATED bool  | RecreateTextureSummary (void)
virtual void  | ReleaseAllEditorUIs (const UUID &uuidEditor, bool bIncludeChildren) const override
virtual void  | ReleaseAllUIs (bool bIncludeChildren) const override
virtual void  | TransferUIsFrom (const CRhRdkContent &c) override
virtual RDK_DEPRECATED IRhRdkExpandableContentUI *  | UI (void) const override
 Public Member Functions inherited from CRhRdkContent
CRhRdkContent ()
CRhRdkContent (bool bAutoGlobalRegister)
virtual  | ~CRhRdkContent ()
virtual RDK_DEPRECATED void  | AddAutoParameters (class IRhRdkParamBlock &paramBlock, int id)
virtual void  | AddAutoParameters (class IRhRdkParamBlock &paramBlock, int id) const
virtual RDK_DEPRECATED bool  | AddChild (CRhRdkContent *pChild, const wchar_t *wszChildSlotName)
virtual bool  | AddToDocumentList (CRhRdkDocument &rdkDoc)
virtual const class IRhRdkPreviewAppearanceDefaults *  | AppearanceDefaults (void) const
virtual bool  | AttachCustomUserData (ICustomUserData *data)
virtual bool  | AutoDelete (void) const
virtual ON_wString  | AutomaticInstanceName (void) const
virtual CRhRdkContent &  | BeginChange (RhRdkChangeContext cc) const
virtual bool  | CanBeEdited (void) const
virtual const wchar_t *  | Category (void) const =0
virtual bool  | ChangeChild (CRhRdkContent *pOldChild, CRhRdkContent *pNewChild)
virtual RDK_DEPRECATED void  | Changed (eChangeContext cc)
virtual void  | Changed (void)
virtual_su bool  | CheckComplete (ON_wString &sReason) const
virtual RDK_DEPRECATED DWORD  | ChildrenRenderCRC (void) const
virtual CRhRdkVariant  | ChildSlotAmount (const wchar_t *wszChildSlotName) const
virtual_su ON_wString  | ChildSlotDisplayName (void) const
virtual ON_wString  | ChildSlotName (void) const
virtual ON_wString  | ChildSlotNameFromParamName (const wchar_t *wszParamName) const
virtual CRhRdkVariant  | ChildSlotOn (const wchar_t *wszChildSlotName) const
CRhRdkContent *  | Clone (CopyMethods m=CopyMethods::Normal) const
void  | CommonCtor (bool b)
virtual bool  | ContentNameTakenFromFileName (void) const
virtual bool  | CreatedByLoading (void) const
virtual RDK_DEPRECATED HBITMAP  | CreateLibraryPreview (const class CSize &sizeImage, const IRhRdkPreviewSceneServer *pSceneServer) const
virtual RDK_DEPRECATED HBITMAP  | CreatePreview (class CRhRdkRenderPlugIn &plugIn, const class CSize &sizeImage, eRhRdkRenderQuality qual, const class IRhRdkPreviewSceneServer *pSceneServer) const
virtual class IRhRdkContentUI *  | CreateUI (class IRhRdkContentEditor &e, const UUID &uuidUI, const class CRhRdkContentArray &aInitialClients, void *pReserved)=0
virtual const ICustomUserData *  | CustomUserData (const UUID &uuidDataId) const
virtual RDK_DEPRECATED void  | DecrementUseCount (void) const
virtual void  | DeleteAllChildren (void)
virtual bool  | DeleteChild (const wchar_t *wszChildSlotName)
virtual RDK_DEPRECATED void  | DestroyChildContent (const UUID &uuidPlugIn)
virtual void  | DestroyChildContent (const UUID &uuidPlugIn) const
virtual bool  | DetachCustomUserData (ICustomUserData *pUD)
virtual void  | DisplayContextHelp (HWND hwndParent) const
virtual void  | DisplayDebugString (const wchar_t *wszTitle=L"") const
virtual_su ON_wString  | DisplayName (void) const
virtual RDK_DEPRECATED CRhinoDoc *  | Document (void) const
virtual_su CRhinoDoc *  | DocumentAssoc (void)
virtual const CRhinoDoc *  | DocumentAssoc (void) const
virtual ON_wString  | DragText (const UUID &uuidSource) const
ON_wString  | DragTextEx (const UUID &uuidSource, int version, void *) const
virtual_su void  | Dump (const DumpContext &dc, unsigned int gds_flags, int indent=0) const
virtual const RDK_DEPRECATED CRhRdkContent *  | Duplicate (void) const
const RDK_DEPRECATED CRhRdkContent *  | DuplicateEx (bool reserved) const
const CRhRdkContent *  | DuplicateEx (DupOpt d) const
virtual IAutoUIExtraRequirements *  | DuplicateExtraRequirementsInterface (void) const
virtual bool  | DuplicationInProgress (void) const
virtual CRhRdkContent *  | Edit (void) const
virtual ON_wString  | EmbeddedFiles (void) const
virtual ON_wString  | EmbeddedFilesRecursive (void) const
void  | EmergencyUnregister (void) const
virtual bool  | EndChange (void)
virtual void  | ExecuteCommand (UUID uuidCommand, void *pvData) const
virtual const CRhRdkContentFactory *  | Factory (void) const
virtual CRhRdkContent *  | FastMakeCopy (CopyMethods m) const
class CRhRdkContentFields &  | Fields (void) const
virtual const CRhRdkContent *  | FindChild (const wchar_t *wszChildSlotName) const
virtual const CRhRdkContent *  | FindInstance (const UUID &uuidInstance) const
virtual RDK_DEPRECATED CRhRdkContent *  | FindInstance (const wchar_t *wszName) const
virtual void  | FindInstanceByName (const wchar_t *wszName, bool bCaseSensitive, bool bRecurse, OUT CRhRdkContentArray &aContent) const
virtual const CRhRdkContent *  | FirstChild (void) const
virtual const CRhRdkContent *  | ForDisplay (void) const
virtual void  | GetAutoParameters (const IRhRdkParamBlock &paramBlock, int id)
virtual RhRdkChangeContext  | GetChangeContext (void) const
virtual CChildIterator  | GetChildIterator (void) const
virtual ON_wString  | GetDebugString (const wchar_t *sep, UINT_PTR flags) const
virtual RDK_DEPRECATED bool  | GetDefaultsFromUser (HWND)
virtual bool  | GetDefaultsFromUser (void)
virtual ON_wString  | GetEnglishParamName (const wchar_t *wszParamName) const
virtual bool  | GetExtraRequirementParameter (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, CRhRdkVariant &vValueOut) const
virtual void  | GetInstanceIdsRecursive (class CRhRdkInstanceIdArray &aOut) const
virtual ON_wString  | GetLocalizedParamName (const wchar_t *wszParamName) const
virtual RDK_DEPRECATED bool  | GetParameters (const class IRhRdk_XMLSection &section, eGetParamsContext context)
virtual void *  | GetShader (const UUID &uuidRenderEngine, void *pvData) const
virtual bool  | GetSimulation (const IRhRdk_XMLSection &section)
void  | GetSortedChildren (OUT CRhRdkContentArray &aChild) const
virtual_su bool  | GetUnderlyingInstances (OUT CRhRdkContentArray &a) const
virtual bool  | GlobalRegister (bool bRegister=true)
virtual const UUID &  | GroupId (void) const
virtual RDK_DEPRECATED HICON  | Icon (void) const
CImpl &  | Imp (void) const
virtual RDK_DEPRECATED void  | IncrementUseCount (void) const
virtual const UUID &  | InstanceId (void) const
virtual ON_wString  | InstanceName (void) const
virtual void  | InternalChanged (RhRdkChangeContext, const CRhRdkContent *)
virtual ON_wString  | InternalName (void) const =0
virtual bool  | IsBasicType (void) const
virtual bool  | IsBuiltIn (void) const
virtual_su bool  | IsChild (void) const
virtual bool  | IsCompatible (const UUID &uuidRenderEngine) const
virtual bool  | IsContentTypeAcceptableAsChild (const UUID &uuidType, const wchar_t *wszChildSlotName) const
virtual RDK_DEPRECATED bool  | IsCRCCached (void) const
virtual bool  | IsDefaultInstance (void) const
virtual bool  | IsFactoryProductAcceptableAsChild (const class CRhRdkContentFactory &f, const wchar_t *wszChildSlotName) const
virtual RDK_DEPRECATED bool  | IsFactoryProductAcceptableAsChild (const class CRhRdkContentFactory *pFactory, const wchar_t *wszChildSlotName) const
virtual bool  | IsHidden (void) const
virtual bool  | IsHiddenByAutoDelete (void) const
virtual RDK_DEPRECATED bool  | IsInDocument (void) const
virtual bool  | IsKind (CRhRdkContent::Kinds kind) const
virtual bool  | IsLocked (void) const
virtual bool  | IsOwnedByDocument (void) const
virtual bool  | IsPerObject (void) const
virtual bool  | IsPrivate (void) const
virtual bool  | IsReference (void) const
virtual bool  | IsRhinoObjectSelected (void) const
virtual bool  | IsSurrogate (void) const
virtual bool  | IsTopLevel (void) const
virtual bool  | IsUniversal (void) const
virtual bool  | IsV4Material (void) const
virtual ON_wString  | LibraryFileName (void) const
virtual CRhRdkContent *  | MakeCopy (CopyMethods m=CopyMethods::Normal) const
virtual_su CRhRdkContent *  | MakeCopyForPreview (void) const
virtual RDK_DEPRECATED CRhRdkContent *  | MakeGroupInstance (void)
virtual CRhRdkContent *  | MakeGroupInstance (void) const
virtual CChildSlotIterator *  | NewChildSlotIterator (CSIContext context) const
virtual class IRhRdkPreviewSceneServer *  | NewPreviewSceneServer (const class CRhRdkSSData &data) const =0
virtual const CRhRdkContent *  | NextSibling (void) const
virtual ON_wString  | Notes (void) const
virtual bool  | OnChildChanging (const CRhRdkContent *pOldChild, const CRhRdkContent *pNewChild) const
virtual bool  | OnChildSlotChanged (const wchar_t *wszChildSlotName) const
virtual bool  | OnChildSlotChanging (const wchar_t *wszChildSlotName) const
virtual void  | OnDocumentRegister (void) const
virtual void  | OnDocumentUnregister (void) const
virtual bool  | OnExtraRequirementButtonClicked (const wchar_t *wszParamName, const wchar_t *wszButtonName)
virtual void  | OnFieldChanged (const class CRhRdkContentField &field, const CRhRdkVariant &vOldValue, RhRdkChangeContext cc, void *pReserved)
virtual_su bool  | OpenInFirstMainModelessEditor (void) const
virtual bool  | OpenInMainEditor (void) const
virtual RDK_DEPRECATED bool  | OpenInModalEditor (UINT uFlags=0)
virtual ON_wString  | ParamNameFromChildSlotName (const wchar_t *wszChildSlotName) const
virtual const CRhRdkContent *  | Parent (void) const
virtual UUID  | PlugInId (void) const =0
virtual_su void  | Promote (void)
virtual ProxyTypes  | ProxyType (void) const
virtual const CRhRdkDocument *  | RdkDocumentAssoc (void) const
virtual UUID  | RdkDocumentId (void) const
virtual const CRhRdkDocument *  | RdkDocumentOwner (void) const
virtual const RDK_DEPRECATED CRhRdkDocument *  | RdkDocumentRegistered (void) const
virtual RDK_DEPRECATED bool  | ReadParameterXMLStream (const wchar_t *wszStream, eGetParamsContext context)
virtual bool  | ReadParameterXMLStream (const wchar_t *wszStream, ReadParamsContext context)
virtual RDK_DEPRECATED bool  | ReadSimulationXMLStream (wchar_t *wszStream)
RDK_DEPRECATED bool  | ReadXMLStream (const wchar_t *wszStream)
virtual bool  | ReadXMLStream (const wchar_t *wszStream, const CRhinoFileReadOptions *pOptions)
virtual bool  | RemoveFromDocumentList (CRhRdkDocument &rdkDoc)
virtual bool  | RemoveRdkDocumentAssoc (void)
virtual unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags) const
RDK_DEPRECATED unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags, const IRhRdkLinearWorkflow &lw) const
unsigned int  | RenderCRC (const CRenderCRCFlags &rcrcFlags, const ON_LinearWorkflow &lw) const
virtual UUID  | RenderEngineId (void) const =0
virtual void  | ResetParametersToDefaults (const ON_ClassArray< ON_wString > &aParams)
virtual RDK_DEPRECATED void  | ResetUseCount (void) const
virtual void  | ResolveRelativePaths (const wchar_t *wszPathToFile)
virtual void  | ResolveURLPaths (bool bForceDownload=false)
ON_wString  | SavedCSN (void) const
virtual RDK_DEPRECATED bool  | SaveToLibraryFile (const ON_wString &sFullPath, const IRhRdkPreviewSceneServer *pSceneServer) const
virtual bool  | SaveToLibraryFile (const ON_wString &sFullPath, const IRhRdkPreviewSceneServer *pSceneServer, EmbedFilesChoice c) const
virtual bool  | SaveToLibraryFile_Internal (const wchar_t *wszFullPath, const IRhRdkPreviewSceneServer *pSceneServer, bool bEmbedFiles) const
virtual void  | SetAutoDelete (bool bAutoDelete)
virtual bool  | SetChild (const CRhRdkContent *pChild, const wchar_t *wszChildSlotName)
virtual bool  | SetChildSlotAmount (const wchar_t *wszChildSlotName, double dPercent)
virtual void  | SetChildSlotName (const wchar_t *wszChildSlotName)
virtual bool  | SetChildSlotOn (const wchar_t *wszChildSlotName, bool bOn)
virtual RDK_DEPRECATED void  | SetCRCCache (DWORD dwCRC) const
virtual bool  | SetDocumentAssoc (const CRhinoDoc &doc) const
virtual_su bool  | SetDocumentAssoc (const CRhRdkContent &source) const
virtual bool  | SetExtraRequirementParameter (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, const CRhRdkVariant &vValue, SetContext sc)
virtual void  | SetGroupId (const UUID &uuidGroup) const
virtual void  | SetHidden (bool bHidden)
RDK_DEPRECATED void  | SetHidden (bool bHidden, eChangeContext cc)
virtual void  | SetInstanceId (UUID uuidInstance)
virtual void  | SetInstanceName (const wchar_t *wszName)
virtual_su void  | SetInstanceName (const wchar_t *wszName, bool bRenameEvents, bool bEnsureNameUnique)
virtual void  | SetInstanceNameImpl (const wchar_t *wszName, bool bRenameEvents)
virtual_su void  | SetInstanceNameImpl (const wchar_t *wszName, bool bRenameEvents, bool bEnsureNameUnique)
virtual void  | SetIsReference (bool b)
void  | SetIsRenderCRCRecursive (bool bRecursive)
virtual void  | SetIsRhinoObjectSelected (bool bSelected) const
virtual void  | SetLocked (void)
virtual void  | SetNotes (const wchar_t *wszNotes)
RDK_DEPRECATED void  | SetNotes (const wchar_t *wszNotes, bool bSendEvents)
virtual RDK_DEPRECATED bool  | SetParameter (const wchar_t *wszName, const CRhRdkVariant &vValue, eChangeContext cc)
virtual RDK_DEPRECATED bool  | SetParameters (class IRhRdk_XMLSection &section, eSetParamsContext context) const
virtual bool  | SetRdkDocumentAssoc (const CRhRdkDocument &rdkDoc)
virtual bool  | SetRdkDocumentOwner (CRhRdkDocument *pRdkDoc)
virtual void  | SetTags (const wchar_t *wszTags, bool bSendEvents=true)
virtual_su void  | SetWorkSessionReferenceModelSerialNumber (unsigned int sn)
virtual bool  | SmartUngroupRecursive (void)
virtual bool  | SupportsCommand (UUID uuidCommand) const
virtual bool  | SupportsContextHelp (void) const
virtual ON_wString  | Tags (void) const
ON_RenderContent *  | ToON_RenderContent (bool bRecursive=true) const
virtual CRhRdkContent &  | TopLevel (void)
virtual const CRhRdkContent &  | TopLevel (void) const
virtual CRhRdkContent *  | TopLevelParent (void)
virtual const CRhRdkContent *  | TopLevelParent (void) const
virtual ON_wString  | TypeDescription (void) const =0
virtual UUID  | TypeId (void) const =0
virtual ON_wString  | TypeName (void) const =0
virtual RDK_DEPRECATED bool  | Ungroup (void)
virtual bool  | Ungroup (void) const
virtual RDK_DEPRECATED bool  | UngroupRecursive (void)
virtual bool  | UngroupRecursive (void) const
virtual void  | Uninitialize (void)
ON_UnitSystem  | UnitSystem () const
virtual void  | UpdatePreview (void) const
virtual RDK_DEPRECATED void  | UpdateUI (void) const
virtual int  | UseCount (void) const
virtual void  | VerifyCopy (const CRhRdkContent *pCopy) const
virtual RDK_DEPRECATED const class IRhRdkThumbViewDefaults *  | ViewDefaults (void) const
virtual_su unsigned int  | WorkSessionReferenceModelSerialNumber (void) const
virtual RDK_DEPRECATED DWORD  | WriteParameterXMLStream (wchar_t *wszStream, DWORD dwMaxChars, eSetParamsContext context) const
virtual size_t  | WriteParameterXMLStream (wchar_t *wszStream, size_t maxChars, WriteParamsContext context) const
virtual size_t  | WriteSimulationXMLStream (wchar_t *wszStream, size_t maxChars) const
virtual RDK_DEPRECATED DWORD  | WriteXMLStream (wchar_t *wszStream, DWORD dwMaxChars, eSetParamsContext context) const
virtual size_t  | WriteXMLStream (wchar_t *wszStream, size_t maxChars, WriteParamsContext context, const CRhinoFileWriteOptions *pOptions) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IAutoUIExtraRequirements
virtual  | ~IAutoUIExtraRequirements ()
 Static Public Member Functions
static void  | ClearIconCache (void)
static bool  | EnvironmentMappingProjection (EnvironmentMappingModes emm, const ON_3dVector &reflection_vector, float &u, float &v)
static ON_3dPoint  | WcsBoxMapping (const ON_3dPoint &world_xyz, const ON_3dVector &normal)
 Static Public Member Functions inherited from CRhRdkContent
static RhRdkChangeContext  | ChangeContextFromSetContext (SetContext sc)
static RDK_DEPRECATED CRhRdkContent *  | CreateObjectFromType (UUID uuidType)
static CRhRdkContent *  | FromON_RenderContent (const class ON_RenderContent &rc, const CRhinoDoc *pDocAssoc, bool bRecursive)
static RDK_DEPRECATED CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML)
static RDK_DEPRECATED CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML, const CRhinoDoc *pDocAssoc)
static CRhRdkContent *  | FromXMLStream (const wchar_t *wszXML, const CRhinoDoc *pDocAssoc, bool bUseXMLInstanceId)
static bool  | IsChangeContextUIBased (RhRdkChangeContext cc)
static CRhRdkContent *  | LoadFromLibraryFile (const wchar_t *sFullPath)
static SetContext  | SetContextFromChangeContext (RhRdkChangeContext cc)
static void  | UninitializeAndDelete (CRhRdkContent *pContent)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Additional Inherited Members
 Protected Member Functions inherited from CRhRdkContent
virtual unsigned int  | ComputeRenderCRC (const CRenderCRCFlags &rcrcFlags) const
Detailed Description
This is an abstract base class for all kinds of textures.
Member Enumeration Documentation
◆ eBitFormat
 enum CRhRdkTexture::eBitFormat : int
strong
Enumerator
k32_bpc_RGB
k32_bpc_BGR
k32_bpc_RGBA
k32_bpc_BGRA
k8_bpc_RGB
k8_bpc_BGR
k8_bpc_RGBA
k8_bpc_BGRA
◆ eLocalMappingType
 enum CRhRdkTexture::eLocalMappingType
Enumerator
lmt_none
lmt_2D
lmt_3D
lmt_force32bit
◆ EnvironmentMappingModes
 enum CRhRdkTexture::EnvironmentMappingModes : unsigned int
strong
Enumerator
Automatic
Spherical
Emap
Box
Lightprobe
Cubemap
VerticalCrossCubemap
HorizontalCrossCubemap
Hemispherical
◆ ProjectionModes
 enum CRhRdkTexture::ProjectionModes : int
strong
Enumerator
Unset
MappingChannel
Wcs
Emap
WcsBox
Screen
◆ RDK_DEPRECATED
 enum CRhRdkTexture::RDK_DEPRECATED
This enum is deprecated in favor of IRhRdkTextureEvaluator::CEvalFlags
Enumerator
efNormal
efDisableFiltering
efDisableLocalMapping
efDisableAdjustment
efDisableProjectionChange
◆ TextureGeneration
 enum CRhRdkTexture::TextureGeneration : int
strong
is used by CRhRdkMaterial::SimulateMaterial(), CRhRdkTexture::SimulateTexture() and CRhRdkEnvironment::SimulateEnvironment()
Enumerator
Allow
Disallow
Skip
◆ WrapTypes
 enum CRhRdkTexture::WrapTypes : unsigned int
strong
Enumerator
Clamped
Repeating
Constructor & Destructor Documentation
◆ CRhRdkTexture() [1/2]
 CRhRdkTexture::CRhRdkTexture  |  ( |   | )
◆ CRhRdkTexture() [2/2]
 CRhRdkTexture::CRhRdkTexture  |  ( |  bool  |  bAutoGlobalRegister | )
◆ ~CRhRdkTexture()
 virtual CRhRdkTexture::~CRhRdkTexture  |  ( |   | )
virtual
Member Function Documentation
◆ AddGraphSection()
 virtual RDK_DEPRECATED void CRhRdkTexture::AddGraphSection  |  ( |  void  |   | )
virtual
◆ AddLocalMappingSection()
 virtual RDK_DEPRECATED void CRhRdkTexture::AddLocalMappingSection  |  ( |  void  |   | )
virtual
◆ AddTwoColorSection() [1/2]
 virtual void CRhRdkTexture::AddTwoColorSection  |  ( |  IRhRdkExpandableContentUI &  |  ui | )
virtual
If your texture needs a two-color UI section, it should usually be derived from CRhRdkTwoColorTextureBase. Then a two-color section will automatically be provided by the RDK. However, if you are willing to provide your own fields to support the two-color UI, you can derive your texture directly from CRhRdkTexture and call this method from your override of AddUISections().
◆ AddTwoColorSection() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::AddTwoColorSection  |  ( |  void  |   | )
virtual
This method is deprecated in favor of the one below.
◆ AddUISections() [1/2]
 virtual void CRhRdkTexture::AddUISections  |  ( |  IRhRdkExpandableContentUI &  |  ui | )
overridevirtual
This is called by the default implementation of CreateUI. You should create each of your UI sections using 'new' and then call ui.AddSection() on them. Please be sure to call the base class after adding your sections.
Reimplemented from CRhRdkCoreContent.
Reimplemented in CRhRdkTwoColorTextureBase.
◆ AddUISections() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::AddUISections  |  ( |  void  |   | )
overridevirtual
This method is deprecated in favor of the one below.
Reimplemented from CRhRdkCoreContent.
◆ AdjustmentClamp()
 virtual bool CRhRdkTexture::AdjustmentClamp  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentClampMax()
 virtual double CRhRdkTexture::AdjustmentClampMax  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentClampMin()
 virtual double CRhRdkTexture::AdjustmentClampMin  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentGain()
 virtual double CRhRdkTexture::AdjustmentGain  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentGamma()
 virtual double CRhRdkTexture::AdjustmentGamma  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentGrayscale()
 virtual bool CRhRdkTexture::AdjustmentGrayscale  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentHueShift()
 virtual double CRhRdkTexture::AdjustmentHueShift  |  ( |  void  |   | ) |   const
virtual
Returns
Adjustment hue shift in radians.
◆ AdjustmentInvert()
 virtual bool CRhRdkTexture::AdjustmentInvert  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentMultiplier()
 virtual double CRhRdkTexture::AdjustmentMultiplier  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentSaturation()
 virtual double CRhRdkTexture::AdjustmentSaturation  |  ( |  void  |   | ) |   const
virtual
◆ AdjustmentScaleToClamp()
 virtual bool CRhRdkTexture::AdjustmentScaleToClamp  |  ( |  void  |   | ) |   const
virtual
◆ AutomaticEnvironmentMappingMode()
 virtual EnvironmentMappingModes CRhRdkTexture::AutomaticEnvironmentMappingMode  |  ( |  void  |   | ) |   const
virtual
◆ BitFlags()
 virtual unsigned int CRhRdkTexture::BitFlags  |  ( |  void  |   | ) |   const
overridevirtual
Optionally override this method to modify the content's bit-flags. You should first call the base class and then modify the resulting value before finally returning it. This will ensure that you get the correct default behavior before modifying it.
Returns
The bit-coded flags for this content.
Reimplemented from CRhRdkContent.
Reimplemented in CRhRdkOneColorTextureBase.
◆ ClearIconCache()
 static void CRhRdkTexture::ClearIconCache  |  ( |  void  |   | )
static
◆ ConvertMetersToUnits()
 virtual void CRhRdkTexture::ConvertMetersToUnits  |  ( |  void  |   | )
overridevirtual
Reimplemented from CRhRdkContent.
◆ ConvertUnitsToMeters()
 virtual void CRhRdkTexture::ConvertUnitsToMeters  |  ( |  void  |   | )
overridevirtual
Reimplemented from CRhRdkContent.
◆ CreateLibraryPreview()
 virtual bool CRhRdkTexture::CreateLibraryPreview  |  ( |  const ON_2iSize &  |  sizeImage,
|  const IRhRdkPreviewSceneServer *  |  pSceneServer,
|  CRhinoDib &  |  dibOut
) |   |  const
overridevirtual
Create a preview bitmap for use when saving the content to the content library.
Parameters
sizeImage | The size of the image to render.
pSceneServer | A scene server that defines the scene for the preview rendering. This parameter will be null if the content is a texture.
dibOut | accepts the rendered preview if the method returns true.
Returns
true if successful, else false.
Reimplemented from CRhRdkContent.
◆ CreatePreview()
 virtual bool CRhRdkTexture::CreatePreview  |  ( |  CRhRdkRenderPlugIn &  |  plugIn,
|  const ON_2iSize &  |  sizeImage,
|  RhRdkPreviewQuality  |  qual,
|  const IRhRdkPreviewSceneServer *  |  pSceneServer,
|  IRhRdkPreviewCallbacks *  |  pNotify,
|  CRhinoDib &  |  dibOut
) |   |  const
overridevirtual
Create a preview of the content for use in the content editor thumbnail display.
Parameters
plugIn | The render plug-in to use to render the preview.
sizeImage | The size of the image to render.
qual | The quality of the preview.
pSceneServer | A pointer to a scene server that defines the scene for the preview rendering. This can be null in which case a default scene is used.
dibOut | A dib containing the rendered image if the method returns true.
Returns
true if successful, else false.
Reimplemented from CRhRdkCoreContent.
◆ DisplayInViewport()
 virtual bool CRhRdkTexture::DisplayInViewport  |  ( |  void  |   | ) |   const
virtual
◆ DynamicIcon()
 virtual bool CRhRdkTexture::DynamicIcon  |  ( |  const ON_2iSize &  |  size,
|  CRhinoDib &  |  dibOut,
|  DynamicIconUsage  |  usage
) |   |  const
overridevirtual
Creates imagery (AKA an 'icon') to represent the content's appearance. This imagery is dynamic, i.e., it changes depending on the content's state (parameters). It is similar to a quick preview and may be implemented in a similar way to CreatePreview().
Parameters
size | is the desired physical size of the imagery, in pixels.
dibOut | is a DIB that accepts the created imagery.
usage | specifies how the icon will be used.
Returns
true if successful, else false.
Implements CRhRdkContent.
◆ EnvironmentMappingMode()
 virtual EnvironmentMappingModes CRhRdkTexture::EnvironmentMappingMode  |  ( |  void  |   | ) |   const
virtual
◆ EnvironmentMappingProjection()
 static bool CRhRdkTexture::EnvironmentMappingProjection  |  ( |  EnvironmentMappingModes  |  emm,
|  const ON_3dVector &  |  reflection_vector,
|  float &  |  u,
|  float &  |  v
)
static
◆ EVF()
 virtual void* CRhRdkTexture::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkCoreContent.
◆ GenerateRawBuffer()
 virtual bool CRhRdkTexture::GenerateRawBuffer  |  ( |  ON_2iSize &  |  sizeOut,
|  eBitFormat &  |  bfOut,
|  CRhRdkVariant &  |  vOut
) |   |  const
virtual
Optionally override this method to generate a texture buffer. This should be used to provide pixel data for bitmap types very quickly. Do not override if your texture does not have a discrete representation or if the values differ outside of the 0.0-1.0 UV range. This function is not implemented by default.
Parameters
sizeOut | is the size of the image in the buffer.
bfOut | is the bit format in the buffer as given above.
vOut | should be of type vt_Buffer, and will contain the raw data. There will be sizeOut.cx * sizeOut.cy pixels in the form x0y0,x1y0...xMaxXyMaxy
Returns
true if successful, else false.
◆ GenerateTextureSimulation()
 virtual bool CRhRdkTexture::GenerateTextureSimulation  |  ( |  CRhinoDib &  |  dibOut,
|  IRhRdkTextureEvaluator::CEvalFlags  |  ef
) |   |  const
virtual
Optionally override this method to generate a texture simulation in a way that is different to the default implementation.
Parameters
dibOut | is a DIB that receives the simulated texture pixels.
ef | can optionally be used to pass flags that control creation of a texture evaluator.
Returns
true if successful, else false.
◆ GetFilenameUI()
 virtual bool CRhRdkTexture::GetFilenameUI  |  ( |  ON_wString &  |  sFilenameOut | ) |   const
virtual
◆ GetParameter()
 virtual CRhRdkVariant CRhRdkTexture::GetParameter  |  ( |  const wchar_t *  |  wszName | ) |   const
overridevirtual
Optionally override this method to get a specific parameter from the content. Use of content fields causes this method to be automatically implemented. The default implementation checks if fields are in use and if so, it returns the field value.
Reimplemented from CRhRdkContent.
◆ GraphInfo()
 virtual void CRhRdkTexture::GraphInfo  |  ( |  CRhRdkTextureGraphInfo &  |  infoOut | ) |   const
virtual
◆ HarvestData()
 virtual Harvested CRhRdkTexture::HarvestData  |  ( |  const CRhRdkContent &  |  oldContent | )
overridevirtual
Implement this to transfer data from another content to this content during creation.
Parameters
oldContent | is an old content from which the implementation may harvest data.
Implements CRhRdkContent.
◆ Icon()
 virtual bool CRhRdkTexture::Icon  |  ( |  const ON_2iSize &  |  size,
|  CRhinoDib &  |  dibOut
) |   |  const
overridevirtual
Creates imagery (AKA an 'icon') to represent the content's type. This imagery is static, i.e., it does not change.
Parameters
size | is the desired physical size of the imagery, in pixels.
dibOut | is a DIB that accepts the created imagery.
Returns
true if successful, else false.
Implements CRhRdkContent.
◆ Initialize()
 virtual bool CRhRdkTexture::Initialize  |  ( |  void  |   | )
overridevirtual
Override this to initialize your content. Please be sure to call the base class before calling any other methods in your override.
Note
If you create a content using 'new' or the low-level factory methods NewContent(), NewMaterial(), NewEnvironment(), or NewTexture(), then you must call this method on your new content. If, however, you create the content by calling the higher-level methods NewContentFromType() or CreateContentByType() then you must not call this method because RDK calls it automatically.
See also
CRhRdkContentFactory::NewContent()
 CRhRdkMaterialFactory::NewMaterial()
 CRhRdkEnvironmentFactory::NewEnvironment()
 CRhRdkTextureFactory::NewTexture()
 IRhRdkContentFactories::NewContentFromType()
 CRhRdkDocument::CreateContentByType()
Returns
true if successful, else false.
Reimplemented from CRhRdkContent.
◆ InternalEnvironmentMappingMode()
 virtual EnvironmentMappingModes CRhRdkTexture::InternalEnvironmentMappingMode  |  ( |  void  |   | ) |   const
virtual
◆ IsCachedTextureFileInUse()
 virtual bool CRhRdkTexture::IsCachedTextureFileInUse  |  ( |  const wchar_t *  |  wszTextureFile | ) |   const
virtual
◆ IsHDRCapable()
 virtual bool CRhRdkTexture::IsHDRCapable  |  ( |  void  |   | ) |   const
virtual
Call this method to determine whether the texture is capable of providing a high dynamic range image. The default implementation returns false.
◆ IsImageBased()
 virtual bool CRhRdkTexture::IsImageBased  |  ( |  void  |   | ) |   const
pure virtual
Call this method to determine whether the texture is, at heart, an image. Generally it will be more efficient to call SimulateTexture in this case than using a texture evaluator, since all that really happens inside the evaluator is that the image is loaded and sampled.
Implemented in CRhRdkOneColorTextureBase.
◆ IsLinear()
 virtual bool CRhRdkTexture::IsLinear  |  ( |  void  |   | ) |   const
virtual
Call this method to determine whether the texture should be treated as gamma packed (usually to 2.2) The default implementation returns false. Bitmap textures will return true as long as they are not in the child slot designated as requiring linear workflow adjustment by the host material. See CRhRdkMaterial::TextureRequiresLinearWorkflowAdjustment().
◆ IsNormalMap()
 virtual_su bool CRhRdkTexture::IsNormalMap  |  ( |  void  |   | ) |   const
Call this method to determine if the texture appears to be a normal map.
◆ Kind()
 virtual Kinds CRhRdkTexture::Kind  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns
The kind of the content.
Implements CRhRdkContent.
◆ LibraryFileExtension()
 virtual const wchar_t* CRhRdkTexture::LibraryFileExtension  |  ( |  void  |   | ) |   const
overridevirtual
Returns
A pointer to a fixed string giving the library file extension of the content.
Implements CRhRdkContent.
◆ LocalMappingTransform()
 virtual ON_Xform CRhRdkTexture::LocalMappingTransform  |  ( |  void  |   | ) |   const
virtual
Get the transformation that can be applied to the UVW vector to convert it from normalized texture space into locally mapped space (ie - with repeat, offset and rotation applied.)
◆ LocalMappingType()
 virtual eLocalMappingType CRhRdkTexture::LocalMappingType  |  ( |  void  |   | ) |   const
virtual
◆ MappingChannel()
 virtual int CRhRdkTexture::MappingChannel  |  ( |  void  |   | ) |   const
virtual
◆ MetersToUnits()
 virtual double CRhRdkTexture::MetersToUnits  |  ( |  double  |  dMeters | ) |   const
virtual
◆ NeedsBaking() [1/2]
 virtual_su bool CRhRdkTexture::NeedsBaking  |  ( |  const ON_UUID &  |  rendererId | ) |   const
Call this method to determine whether Advanced Texture Preview will do a better job of displaying this texture than standard mapping. Further, the function will use the rendererId parameter to determine whether the renderer is capable of rendering the texture by itself. If that is the case, this function will return false. Implemented using EVF(L"NeedsBaking", &rendererId)
◆ NeedsBaking() [2/2]
 virtual_su bool CRhRdkTexture::NeedsBaking  |  ( |  void  |   | ) |   const
◆ NewColorAdjuster()
 virtual IColorAdjuster* CRhRdkTexture::NewColorAdjuster  |  ( |  void  |   | ) |   const
virtual
Returns
a color adjuster object that can be used to modify evaluated colors.
◆ NewPreviewBackground()
 virtual CRhRdkPreviewBackground* CRhRdkTexture::NewPreviewBackground  |  ( |  void  |   | ) |   const
overridevirtual
Reimplemented from CRhRdkCoreContent.
◆ NewPreviewGeometry()
 virtual CRhRdkPreviewGeometry* CRhRdkTexture::NewPreviewGeometry  |  ( |  void  |   | ) |   const
overridevirtual
Reimplemented from CRhRdkCoreContent.
◆ NewPreviewSceneServer()
 virtual IRhRdkPreviewSceneServer* CRhRdkTexture::NewPreviewSceneServer  |  ( |  const CRhRdkSSData &  |  data | ) |   const
overridevirtual
◆ NewSimulatedTextureEvaluator()
 virtual IRhRdkTextureEvaluator* CRhRdkTexture::NewSimulatedTextureEvaluator  |  ( |  int  |  iBaseSize = -1 | ) |   const
virtual
Create a texture evaluator that mimics the simulated version of this texture. In most cases, this will simply be a pixelated version of the texture, but in the case of high dynamic range textures, the resultant evaluator will be tone-mapped. The function is implemented to cache the tone-mapped results to a bitmap, so the actual evaluator you will be returned will be a bitmap texture evaluator.
Parameters
iBaseSize | is the simulation size - generally square, but for projection specific images this may be modified to a larger size by the framework. Input -1 means "use the pixel-height parameter if available, otherwise use the simulation size".
◆ NewTextureEvaluator() [1/2]
 virtual IRhRdkTextureEvaluator* CRhRdkTexture::NewTextureEvaluator  |  ( |  IRhRdkTextureEvaluator::CEvalFlags  |  ef | ) |   const
virtual
Create a texture evaluator. This is an independent lightweight object capable of evaluating texture color throughout uvw space. May be called from within a rendering shade pipeline. The caller shall delete the texture evaluator by calling DeleteThis(). The default implementation returns null.
Parameters
ef | can optionally be used to pass flags that control creation of the evaluator.
◆ NewTextureEvaluator() [2/2]
 virtual RDK_DEPRECATED IRhRdkTextureEvaluator* CRhRdkTexture::NewTextureEvaluator  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of the one below.
◆ Offset()
 virtual ON_3dVector CRhRdkTexture::Offset  |  ( |  void  |   | ) |   const
virtual
Get offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
◆ OffsetLocked()
 virtual bool CRhRdkTexture::OffsetLocked  |  ( |  void  |   | ) |   const
virtual
◆ ParameterSerializationMethod()
 virtual ParamSerialMethod CRhRdkTexture::ParameterSerializationMethod  |  ( |  void  |   | ) |   const
overridevirtual
Implement this method to indicate which serialization method your content uses. If you return GetSet then you must implement the ReadParametersFromSection() and WriteParametersToSection() methods to serialize the parameters. If you return XmlStream then you must implement the low-level ReadParameterXMLStream() and WriteParameterXMLStream() methods to serialize the parameters.
Note
Using GetSet is the easiest and preferred way to serialize the parameters, and it is required if you want your content to animate in Bongo 2.
Reimplemented from CRhRdkCoreContent.
◆ PixelSize()
 virtual bool CRhRdkTexture::PixelSize  |  ( |  int &  |  widthOut,
|  int &  |  heightOut,
|  int &  |  depthOut
) |   |  const
virtual
Call this method to determine the dimensions of the image in pixels.
Parameters
widthOut | receives the width (along U) of the texture in pixels if supported.
heightOut | receives the height (along V) of the texture in pixels if supported.
depthOut | receives the depth (along W) of the texture in pixels if supported.
Returns
true if the texture is image-based (i.e., a bitmap of some sort), else false. When returning false, the output values do not have to be filled in.
Note
When implementing a class derived from CRhRdkTexture, if your texture is image-based you must override this method to return the dimensions of your texture. Please make sure you do not call the base class as the only thing it does is flag an error to say that the method has not been correctly overridden.
See also
IsImageBased().
◆ PreviewBackgroundFlags()
 virtual UINT CRhRdkTexture::PreviewBackgroundFlags  |  ( |  void  |   | ) |   const
overridevirtual
Returns
Bit-flags denoting supported preview background types.
Implements CRhRdkContent.
◆ PreviewGeometryFlags()
 virtual UINT CRhRdkTexture::PreviewGeometryFlags  |  ( |  void  |   | ) |   const
overridevirtual
Returns
Bit-flags denoting supported preview geometry types.
Implements CRhRdkContent.
◆ PreviewIn3D()
 virtual bool CRhRdkTexture::PreviewIn3D  |  ( |  void  |   | ) |   const
virtual
◆ PreviewLightingFlags()
 virtual UINT CRhRdkTexture::PreviewLightingFlags  |  ( |  void  |   | ) |   const
overridevirtual
Returns
Bit-flags denoting supported preview lighting types.
Implements CRhRdkContent.
◆ PreviewLocalMapping()
 virtual bool CRhRdkTexture::PreviewLocalMapping  |  ( |  void  |   | ) |   const
virtual
◆ PreviewSceneType()
 virtual ePreviewSceneType CRhRdkTexture::PreviewSceneType  |  ( |  void  |   | ) |   const
overridevirtual
This is an advanced method which you can override in exceptional circumstances.
Returns
texture_2d_image if you want RDK to produce a texture preview from the texture evaluator or preview_scene_server to cause RDK to call NewPreviewSceneServer().
Implements CRhRdkContent.
◆ PreviewUpdateDelay()
 virtual int CRhRdkTexture::PreviewUpdateDelay  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The delay before the thumbnail preview is updated. Override this to change the time it takes before a new preview is generated after a change to the content.
Reimplemented from CRhRdkContent.
◆ ProjectionMode()
 virtual ProjectionModes CRhRdkTexture::ProjectionMode  |  ( |  void  |   | ) |   const
virtual
◆ ReadParametersFromSection()
 virtual bool CRhRdkTexture::ReadParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  ReadParamsContext  |  context
)
overridevirtual
Please be sure to call the base class if you override this function.
Reimplemented from CRhRdkCoreContent.
Reimplemented in CRhRdkTwoColorTextureBase, and CRhRdkOneColorTextureBase.
◆ RecreateLocalMapping()
 virtual RDK_DEPRECATED bool CRhRdkTexture::RecreateLocalMapping  |  ( |  void  |   | )
virtual
This method is deprecated - obsolete.
◆ Repeat()
 virtual ON_3dVector CRhRdkTexture::Repeat  |  ( |  void  |   | ) |   const
virtual
Get repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
◆ RepeatLocked()
 virtual bool CRhRdkTexture::RepeatLocked  |  ( |  void  |   | ) |   const
virtual
◆ Rotation()
 virtual ON_3dVector CRhRdkTexture::Rotation  |  ( |  void  |   | ) |   const
virtual
◆ SaveAsImage()
 bool CRhRdkTexture::SaveAsImage  |  ( |  const wchar_t *  |  wszFilename,
|  int  |  width,
|  int  |  height,
|  int  |  depth
) |   |  const
Save the texture as an image file.
Parameters
wszFilename | is the file name to save to.
width | is the pixel width to save the image at.
height | is the pixel height to save the image at.
depth | is the bit-depth to save the image at.
Returns
true if successful, else false.
◆ SetAdjustmentClamp() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentClamp  |  ( |  bool  |   | )
virtual
◆ SetAdjustmentClamp() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentClamp  |  ( |  bool  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentClampMax() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentClampMax  |  ( |  double  |   | )
virtual
◆ SetAdjustmentClampMax() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentClampMax  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentClampMin() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentClampMin  |  ( |  double  |   | )
virtual
◆ SetAdjustmentClampMin() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentClampMin  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentGain() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentGain  |  ( |  double  |   | )
virtual
◆ SetAdjustmentGain() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentGain  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentGamma() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentGamma  |  ( |  double  |   | )
virtual
◆ SetAdjustmentGamma() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentGamma  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentGrayscale() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentGrayscale  |  ( |  bool  |   | )
virtual
◆ SetAdjustmentGrayscale() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentGrayscale  |  ( |  bool  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentHueShift() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentHueShift  |  ( |  double  |  dShift | )
virtual
◆ SetAdjustmentHueShift() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentHueShift  |  ( |  double  |  dShift,
|  eChangeContext  |  cc
)
virtual
Set adjustment hue shift.
Parameters
dShift | is the hue shift in radians.
cc | is the context of the change.
◆ SetAdjustmentInvert() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentInvert  |  ( |  bool  |   | )
virtual
◆ SetAdjustmentInvert() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentInvert  |  ( |  bool  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentMultiplier() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentMultiplier  |  ( |  double  |   | )
virtual
◆ SetAdjustmentMultiplier() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentMultiplier  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentSaturation() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentSaturation  |  ( |  double  |   | )
virtual
◆ SetAdjustmentSaturation() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentSaturation  |  ( |  double  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetAdjustmentScaleToClamp() [1/2]
 virtual void CRhRdkTexture::SetAdjustmentScaleToClamp  |  ( |  bool  |   | )
virtual
◆ SetAdjustmentScaleToClamp() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetAdjustmentScaleToClamp  |  ( |  bool  |  ,
|  eChangeContext  |  cc
)
virtual
◆ SetDisplayInViewport() [1/2]
 virtual void CRhRdkTexture::SetDisplayInViewport  |  ( |  bool  |  b | )
virtual
◆ SetDisplayInViewport() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetDisplayInViewport  |  ( |  bool  |  b,
|  eChangeContext  |  cc
)
virtual
◆ SetEnvironmentMappingMode() [1/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetEnvironmentMappingMode  |  ( |  eEnvironmentMappingMode  |  e,
|  eChangeContext  |  cc
)
virtual
◆ SetEnvironmentMappingMode() [2/2]
 virtual void CRhRdkTexture::SetEnvironmentMappingMode  |  ( |  EnvironmentMappingModes  |  emm | )
virtual
◆ SetGraphInfo()
 virtual void CRhRdkTexture::SetGraphInfo  |  ( |  const CRhRdkTextureGraphInfo &  |  info | )
virtual
◆ SetIsNormalMap()
 void CRhRdkTexture::SetIsNormalMap  |  ( |  bool  |  bIsNormalMap | )
◆ SetMappingChannel() [1/2]
 virtual void CRhRdkTexture::SetMappingChannel  |  ( |  int  |  iMappingChannel | )
virtual
◆ SetMappingChannel() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetMappingChannel  |  ( |  int  |  iMappingChannel,
|  eChangeContext  |  cc
)
virtual
◆ SetOffset() [1/2]
 virtual void CRhRdkTexture::SetOffset  |  ( |  const ON_3dVector &  |  vecOffset | )
virtual
◆ SetOffset() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetOffset  |  ( |  const ON_3dVector &  |  vecOffset,
|  eChangeContext  |  cc
)
virtual
Set offset value across UVW space. If the projection type is WCS or other type specified in model units, then this is the offset in meters.
◆ SetOffsetLocked() [1/2]
 virtual void CRhRdkTexture::SetOffsetLocked  |  ( |  bool  |  bLocked | )
virtual
◆ SetOffsetLocked() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetOffsetLocked  |  ( |  bool  |  bLocked,
|  eChangeContext  |  cc
)
virtual
◆ SetParameter()
 virtual bool CRhRdkTexture::SetParameter  |  ( |  const wchar_t *  |  ,
|  const CRhRdkVariant &
)
overridevirtual
Reimplemented from CRhRdkContent.
Reimplemented in CRhRdkTwoColorTextureBase, and CRhRdkOneColorTextureBase.
◆ SetPreviewIn3D() [1/2]
 virtual void CRhRdkTexture::SetPreviewIn3D  |  ( |  bool  |  b | )
virtual
◆ SetPreviewIn3D() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetPreviewIn3D  |  ( |  bool  |  b,
|  eChangeContext  |  cc
)
virtual
◆ SetPreviewLocalMapping() [1/2]
 virtual void CRhRdkTexture::SetPreviewLocalMapping  |  ( |  bool  |  b | )
virtual
◆ SetPreviewLocalMapping() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetPreviewLocalMapping  |  ( |  bool  |  b,
|  eChangeContext  |  cc
)
virtual
◆ SetProjectionMode() [1/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetProjectionMode  |  ( |  eProjectionMode  |  pm,
|  eChangeContext  |  cc
)
virtual
◆ SetProjectionMode() [2/2]
 virtual void CRhRdkTexture::SetProjectionMode  |  ( |  ProjectionModes  |  pm | )
virtual
◆ SetRepeat() [1/2]
 virtual void CRhRdkTexture::SetRepeat  |  ( |  const ON_3dVector &  |  vecRepeat | )
virtual
◆ SetRepeat() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetRepeat  |  ( |  const ON_3dVector &  |  vecRepeat,
|  eChangeContext  |  cc
)
virtual
Set repeat value across UVW space. If the projection type is WCS or other type specified in model units, then this is the repeat across 1 meter of the model.
◆ SetRepeatLocked() [1/2]
 virtual void CRhRdkTexture::SetRepeatLocked  |  ( |  bool  |  bLocked | )
virtual
◆ SetRepeatLocked() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetRepeatLocked  |  ( |  bool  |  bLocked,
|  eChangeContext  |  cc
)
virtual
◆ SetRotation() [1/2]
 virtual void CRhRdkTexture::SetRotation  |  ( |  const ON_3dVector &  |  vecRotation | )
virtual
◆ SetRotation() [2/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetRotation  |  ( |  const ON_3dVector &  |  vecRotation,
|  eChangeContext  |  cc
)
virtual
◆ SetSimulation()
 virtual bool CRhRdkTexture::SetSimulation  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
overridevirtual
Optionally override this method to add the content's simulation to an XML section. This is needed if you want to avoid having to use WriteSimulationXMLStream() for serialization. For this to work you must return true. The default implementation is a no-op that returns false. This is the easiest and preferred way to serialize the simulation.
Reimplemented from CRhRdkContent.
◆ SetWrapType() [1/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SetWrapType  |  ( |  eWrapType  |  wt,
|  eChangeContext  |  cc
)
virtual
◆ SetWrapType() [2/2]
 virtual void CRhRdkTexture::SetWrapType  |  ( |  WrapTypes  |  wt | )
virtual
◆ SimulateTexture() [1/2]
 virtual RDK_DEPRECATED void CRhRdkTexture::SimulateTexture  |  ( |  CRhRdkSimulatedTexture &  |  texOut,
|  bool  |  bForDataOnly
) |   |  const
virtual
This method is deprecated in favor of the one below. bForDataOnly becomes true=TextureGeneration::Disallow, false=TextureGeneration::Allow
◆ SimulateTexture() [2/2]
 virtual void CRhRdkTexture::SimulateTexture  |  ( |  CRhRdkSimulatedTexture &  |  texOut,
|  TextureGeneration  |  tg = TextureGeneration::Allow,
|  int  |  iSimulatedTextureSize = -1,
|  const CRhinoObject *  |  pObject = NULL
) |   |  const
virtual
Modify an CRhRdkSimulatedTexture to simulate this texture as best you can. The default implementation attempts to create a temporary bitmap from the texture evaluator.
Parameters
texOut | accepts the simulation.
tg | determines the extent of texture generation performed by the default implementation.
See also
TextureGeneration
Parameters
pObject | is an optional object pointer (usually CRhinoObject or CRhinoLayer).
Note
If the default implementation is overridden, no guarantee can be made that the override will respect the TextureGeneration requirements, but clients should attempt to do so.
◆ SupportedByRenderer()
 virtual_su bool CRhRdkTexture::SupportedByRenderer  |  ( |  const ON_UUID &  |  rendererId | ) |   const
Call this method to determine whether the provided renderer supports rendering this texture natively without the need to first bake this texture into a bitmap. Implemented using EVF(L"SupportedByRenderer", &rendererId)
◆ UnitsToMeters()
 virtual double CRhRdkTexture::UnitsToMeters  |  ( |  double  |  dUnits | ) |   const
virtual
◆ UpdateDocumentTables()
 virtual bool CRhRdkTexture::UpdateDocumentTables  |  ( |  void  |   | ) |   const
overridevirtual
Called by Changed() to update Rhino document tables.
Returns
true if successful, else false.
Implements CRhRdkContent.
◆ WcsBoxMapping()
 static ON_3dPoint CRhRdkTexture::WcsBoxMapping  |  ( |  const ON_3dPoint &  |  world_xyz,
|  const ON_3dVector &  |  normal
)
static
◆ WrapType()
 virtual WrapTypes CRhRdkTexture::WrapType  |  ( |  void  |   | ) |   const
virtual
◆ WriteParametersToSection()
 virtual bool CRhRdkTexture::WriteParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section,
|  WriteParamsContext  |  context
) |   |  const
overridevirtual
Please be sure to call the base class if you override this function.
Reimplemented from CRhRdkCoreContent.
Reimplemented in CRhRdkTwoColorTextureBase, and CRhRdkOneColorTextureBase.