Public Member Functions | List of all members
CRhinoInferredCurveArray Class Reference
Rhino
#include <rhinoSdkSnap.h>
 Inheritance diagram for CRhinoInferredCurveArray:
 Public Member Functions
CRhinoInferredCurveArray ()
~CRhinoInferredCurveArray ()
void  | Append (const CRhinoInferredCurve &c)
 Public Member Functions inherited from ON_ClassArray< CRhinoInferredCurve >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< CRhinoInferredCurve > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const CRhinoInferredCurve &)
void  | Append (int, const CRhinoInferredCurve *)
Append copy of an array T[count]. More...
CRhinoInferredCurve &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
CRhinoInferredCurve *  | Array ()
The Array() function return the. More...
const CRhinoInferredCurve *  | Array () const
m_a pointer value. More...
CRhinoInferredCurve *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const CRhinoInferredCurve *  | At (int) const
CRhinoInferredCurve *  | At (ON__INT64)
const CRhinoInferredCurve *  | At (ON__INT64) const
CRhinoInferredCurve *  | At (ON__UINT64)
const CRhinoInferredCurve *  | At (ON__UINT64) const
CRhinoInferredCurve *  | At (unsigned int)
const CRhinoInferredCurve *  | At (unsigned int) const
CRhinoInferredCurve *  | begin ()
Support STL iterators and algorithms. More...
CRhinoInferredCurve const *  | begin () const
int  | BinarySearch (const CRhinoInferredCurve *, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const CRhinoInferredCurve *, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *), int) const
int  | Capacity () const
capacity of array More...
CRhinoInferredCurve const *  | cbegin () const
CRhinoInferredCurve const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
CRhinoInferredCurve *  | end ()
CRhinoInferredCurve const *  | end () const
CRhinoInferredCurve *  | First ()
const CRhinoInferredCurve *  | First () const
returns nullptr if count = 0 More...
virtual bool  | HeapSort (int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *))
QuickSort() is generally the better choice. More...
void  | Insert (int, const CRhinoInferredCurve &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const CRhinoInferredCurve &, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *))
int  | InsertInSortedList (const CRhinoInferredCurve &, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *), int)
CRhinoInferredCurve *  | KeepArray ()
CRhinoInferredCurve *  | Last ()
const CRhinoInferredCurve *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const CRhinoInferredCurve * () const
operator CRhinoInferredCurve * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< CRhinoInferredCurve > &other) const=delete
ON_ClassArray< CRhinoInferredCurve > &  | operator= (const ON_ClassArray< CRhinoInferredCurve > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< CRhinoInferredCurve > &other) const=delete
CRhinoInferredCurve &  | operator[] (int)
const CRhinoInferredCurve &  | operator[] (int) const
CRhinoInferredCurve &  | operator[] (ON__INT64)
const CRhinoInferredCurve &  | operator[] (ON__INT64) const
CRhinoInferredCurve &  | operator[] (ON__UINT64)
const CRhinoInferredCurve &  | operator[] (ON__UINT64) const
CRhinoInferredCurve &  | operator[] (unsigned int)
const CRhinoInferredCurve &  | operator[] (unsigned int) const
bool  | Permute (const int *)
virtual bool  | QuickSort (int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *))
Sorts the array using the heap sort algorithm. More...
virtual CRhinoInferredCurve *  | Realloc (CRhinoInferredCurve *, int)
low level memory management /////////////////////////////////////// More...
void  | Remove ()
void  | Remove (int)
CRhinoInferredCurve *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const CRhinoInferredCurve *, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *)) const
void  | SetArray (CRhinoInferredCurve *p)
void  | SetArray (CRhinoInferredCurve *p, int count, int capacity)
CRhinoInferredCurve *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhinoInferredCurve *, const CRhinoInferredCurve *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< CRhinoInferredCurve >
void  | ConstructDefaultElement (CRhinoInferredCurve *)
void  | DestroyElement (CRhinoInferredCurve &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< CRhinoInferredCurve >
CRhinoInferredCurve *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ CRhinoInferredCurveArray()
 CRhinoInferredCurveArray::CRhinoInferredCurveArray  |  ( |   | )
◆ ~CRhinoInferredCurveArray()
 CRhinoInferredCurveArray::~CRhinoInferredCurveArray  |  ( |   | )
Member Function Documentation
◆ Append()
 void CRhinoInferredCurveArray::Append  |  ( |  const CRhinoInferredCurve &  |  c | )
A special version of the array appender that checks if a line you are trying to add overlaps a line already on the array. That way Int snapping will work right because parallel overlapping lines will never end up being the ones that get tested for intersection.