Public Member Functions | Friends | List of all members
ON_SubDVertexIdIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDVertexIdIterator:
 Public Member Functions
ON_SubDVertexIdIterator ()=default
ON_SubDVertexIdIterator (const ON_SubD &subd)
ON_SubDVertexIdIterator (const ON_SubDRef &subd_ref)
ON_SubDVertexIdIterator (const ON_SubDVertexIdIterator &)=default
~ON_SubDVertexIdIterator ()=default
const ON_SubDVertex *  | CurrentVertex () const
const ON_SubDVertex *  | FirstVertex ()
const ON_SubDVertex *  | FirstVertexOnLevel (unsigned int level_index)
const ON_SubDVertex *  | NextVertex ()
const ON_SubDVertex *  | NextVertexOnLevel (unsigned int level_index)
ON_SubDVertexIdIterator &  | operator= (const ON_SubDVertexIdIterator &)=default
 Friends
class  | ON_SubDHeap
Detailed Description
ON_SubDVertexIdIterator
Constructor & Destructor Documentation
◆ ON_SubDVertexIdIterator() [1/4]
 ON_SubDVertexIdIterator::ON_SubDVertexIdIterator  |  ( |   | )
default
◆ ~ON_SubDVertexIdIterator()
 ON_SubDVertexIdIterator::~ON_SubDVertexIdIterator  |  ( |   | )
default
◆ ON_SubDVertexIdIterator() [2/4]
 ON_SubDVertexIdIterator::ON_SubDVertexIdIterator  |  ( |  const ON_SubDVertexIdIterator &  |   | )
default
◆ ON_SubDVertexIdIterator() [3/4]
 ON_SubDVertexIdIterator::ON_SubDVertexIdIterator  |  ( |  const ON_SubDRef &  |  subd_ref | )
◆ ON_SubDVertexIdIterator() [4/4]
 ON_SubDVertexIdIterator::ON_SubDVertexIdIterator  |  ( |  const ON_SubD &  |  subd | )
Member Function Documentation
◆ CurrentVertex()
 const ON_SubDVertex* ON_SubDVertexIdIterator::CurrentVertex  |  ( |   | ) |   const
Returns: The most recently returned vertex from a call to FirstVertex() or NextVertex().
◆ FirstVertex()
 const ON_SubDVertex* ON_SubDVertexIdIterator::FirstVertex  |  ( |   | )
Description: In general, you want to use a ON_SubDVertexIterator to loop through SubD vertices. This is a special tool for unusual sitiations when it is necessary to iteratate through every vertex on every level of a SubD in order of increasing m_id value. Returns: The vertex with the smallest id.
◆ FirstVertexOnLevel()
 const ON_SubDVertex* ON_SubDVertexIdIterator::FirstVertexOnLevel  |  ( |  unsigned int  |  level_index | )
◆ NextVertex()
 const ON_SubDVertex* ON_SubDVertexIdIterator::NextVertex  |  ( |   | )
Description: In general, you want to use a ON_SubDVertexIterator to loop through SubD vertices. This is a special tool for unusual sitiations when it is necessary to iteratate through every vertex on every level of a SubD in order of increasing m_id value. Returns: The vertex in order of increasing id.
◆ NextVertexOnLevel()
 const ON_SubDVertex* ON_SubDVertexIdIterator::NextVertexOnLevel  |  ( |  unsigned int  |  level_index | )
◆ operator=()
 ON_SubDVertexIdIterator& ON_SubDVertexIdIterator::operator=  |  ( |  const ON_SubDVertexIdIterator &  |   | )
default
Friends And Related Function Documentation
◆ ON_SubDHeap
 friend class ON_SubDHeap
friend