Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
ON_XMeshComponent Class Referenceabstract
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Inheritance diagram for ON_XMeshComponent:
 Public Member Functions
virtual  | ~ON_XMeshComponent ()
bool  | AddEvent (ON_XMeshEvent *pX)
virtual void  | CreateComponentString (ON_wString &S) const
ON_XMeshEdge *  | Edge ()
const ON_XMeshEdge *  | Edge () const
virtual void  | Edges (ON_SimpleArray< const ON_XMeshEdge * > &Edges) const =0
virtual void  | Edges (ON_SimpleArray< ON_XMeshEdge * > &Edges)=0
ON_XMeshEvent *  | Event (int xid)
const ON_XMeshEvent *  | Event (int xid) const
int  | EventCount () const
Look through the event list. More...
ON_XMeshFace *  | Face ()
const ON_XMeshFace *  | Face () const
virtual void  | Faces (ON_SimpleArray< const ON_XMeshFace * > &Faces) const =0
Appends to array. More...
virtual void  | Faces (ON_SimpleArray< ON_XMeshFace * > &Faces)=0
Appends to array. More...
const ON_XMeshEvent *  | FindEvent (const ON_XMeshComponent *pC) const
ON_XMeshEvent *  | FindEvent (ON_XMeshComponent *pC)
bool  | HasEvent (const ON_XMeshComponent *pC) const
Does m_X have a member with component? More...
bool  | IsEdge () const
bool  | IsFace () const
virtual bool  | IsValid () const
bool  | IsVertex () const
What is this thing? More...
void  | RemoveEvent (ON_XMeshEvent *pX)
ON_XMeshVertex *  | Vertex ()
Cast. More...
const ON_XMeshVertex *  | Vertex () const
virtual void  | Vertices (ON_SimpleArray< const ON_XMeshVertex * > &Vertices) const =0
virtual void  | Vertices (ON_SimpleArray< ON_XMeshVertex * > &Vertices)=0
Whatever it is, what are the components that involve it? More...
 Protected Member Functions
ON_XMeshComponent ()
ON_XMeshComponent (const ON_XMeshComponent &C)
Not implemented. More...
virtual void  | Destroy ()
ON_XMeshComponent &  | operator= (const ON_XMeshComponent &src)
Not implemented. More...
 Protected Attributes
bool  | m_bIsValid
const ON_XMesh *  | m_pM
used by fixed pool stuff More...
eXMeshPoolStatus  | m_status
ON_XMeshEventList *  | m_X
events not managed here More...
Constructor & Destructor Documentation
◆ ~ON_XMeshComponent()
 virtual ON_XMeshComponent::~ON_XMeshComponent  |  ( |   | )
virtual
◆ ON_XMeshComponent() [1/2]
 ON_XMeshComponent::ON_XMeshComponent  |  ( |   | )
protected
◆ ON_XMeshComponent() [2/2]
 ON_XMeshComponent::ON_XMeshComponent  |  ( |  const ON_XMeshComponent &  |  C | )
protected
Not implemented.
Member Function Documentation
◆ AddEvent()
 bool ON_XMeshComponent::AddEvent  |  ( |  ON_XMeshEvent *  |  pX | )
◆ CreateComponentString()
 virtual void ON_XMeshComponent::CreateComponentString  |  ( |  ON_wString &  |  S | ) |   const
virtual
Reimplemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ Destroy()
 virtual void ON_XMeshComponent::Destroy  |  ( |   | )
protectedvirtual
◆ Edge() [1/2]
 ON_XMeshEdge* ON_XMeshComponent::Edge  |  ( |   | )
◆ Edge() [2/2]
 const ON_XMeshEdge* ON_XMeshComponent::Edge  |  ( |   | ) |   const
◆ Edges() [1/2]
 virtual void ON_XMeshComponent::Edges  |  ( |  ON_SimpleArray< const ON_XMeshEdge * > &  |  Edges | ) |   const
pure virtual
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ Edges() [2/2]
 virtual void ON_XMeshComponent::Edges  |  ( |  ON_SimpleArray< ON_XMeshEdge * > &  |  Edges | )
pure virtual
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ Event() [1/2]
 ON_XMeshEvent* ON_XMeshComponent::Event  |  ( |  int  |  xid | )
◆ Event() [2/2]
 const ON_XMeshEvent* ON_XMeshComponent::Event  |  ( |  int  |  xid | ) |   const
◆ EventCount()
 int ON_XMeshComponent::EventCount  |  ( |   | ) |   const
Look through the event list.
◆ Face() [1/2]
 ON_XMeshFace* ON_XMeshComponent::Face  |  ( |   | )
◆ Face() [2/2]
 const ON_XMeshFace* ON_XMeshComponent::Face  |  ( |   | ) |   const
◆ Faces() [1/2]
 virtual void ON_XMeshComponent::Faces  |  ( |  ON_SimpleArray< const ON_XMeshFace * > &  |  Faces | ) |   const
pure virtual
Appends to array.
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ Faces() [2/2]
 virtual void ON_XMeshComponent::Faces  |  ( |  ON_SimpleArray< ON_XMeshFace * > &  |  Faces | )
pure virtual
Appends to array.
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ FindEvent() [1/2]
 const ON_XMeshEvent* ON_XMeshComponent::FindEvent  |  ( |  const ON_XMeshComponent *  |  pC | ) |   const
◆ FindEvent() [2/2]
 ON_XMeshEvent* ON_XMeshComponent::FindEvent  |  ( |  ON_XMeshComponent *  |  pC | )
◆ HasEvent()
 bool ON_XMeshComponent::HasEvent  |  ( |  const ON_XMeshComponent *  |  pC | ) |   const
Does m_X have a member with component?
◆ IsEdge()
 bool ON_XMeshComponent::IsEdge  |  ( |   | ) |   const
◆ IsFace()
 bool ON_XMeshComponent::IsFace  |  ( |   | ) |   const
◆ IsValid()
 virtual bool ON_XMeshComponent::IsValid  |  ( |   | ) |   const
virtual
Reimplemented in ON_XMeshFace, and ON_XMeshEdge.
◆ IsVertex()
 bool ON_XMeshComponent::IsVertex  |  ( |   | ) |   const
What is this thing?
◆ operator=()
 ON_XMeshComponent& ON_XMeshComponent::operator=  |  ( |  const ON_XMeshComponent &  |  src | )
protected
Not implemented.
◆ RemoveEvent()
 void ON_XMeshComponent::RemoveEvent  |  ( |  ON_XMeshEvent *  |  pX | )
◆ Vertex() [1/2]
 ON_XMeshVertex* ON_XMeshComponent::Vertex  |  ( |   | )
Cast.
◆ Vertex() [2/2]
 const ON_XMeshVertex* ON_XMeshComponent::Vertex  |  ( |   | ) |   const
◆ Vertices() [1/2]
 virtual void ON_XMeshComponent::Vertices  |  ( |  ON_SimpleArray< const ON_XMeshVertex * > &  |  Vertices | ) |   const
pure virtual
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
◆ Vertices() [2/2]
 virtual void ON_XMeshComponent::Vertices  |  ( |  ON_SimpleArray< ON_XMeshVertex * > &  |  Vertices | )
pure virtual
Whatever it is, what are the components that involve it?
Implemented in ON_XMeshFace, ON_XMeshEdge, and ON_XMeshVertex.
Member Data Documentation
◆ m_bIsValid
 bool ON_XMeshComponent::m_bIsValid
protected
false if any allocation failures for m_X or other
◆ m_pM
 const ON_XMesh* ON_XMeshComponent::m_pM
protected
used by fixed pool stuff
◆ m_status
 eXMeshPoolStatus ON_XMeshComponent::m_status
protected
◆ m_X
 ON_XMeshEventList* ON_XMeshComponent::m_X
protected
events not managed here