Public Member Functions | List of all members
CRhRdkContentUndoBlocker Class Referencefinal
RDK
#include <RhRdkContentUndo.h>
 Public Member Functions
CRhRdkContentUndoBlocker ()
~CRhRdkContentUndoBlocker ()
Detailed Description
This is a stack object that prevents content undo records from being created. Sometimes it is necessary to change the state of a content without creating an undo record. This can be achieved by putting one of these on the stack just before making the change.
See also
CRhRdkContentUndo
Constructor & Destructor Documentation
◆ CRhRdkContentUndoBlocker()
 CRhRdkContentUndoBlocker::CRhRdkContentUndoBlocker  |  ( |   | )
◆ ~CRhRdkContentUndoBlocker()
 CRhRdkContentUndoBlocker::~CRhRdkContentUndoBlocker  |  ( |   | )