Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoDisplaySettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoDisplaySettings ()
CRhinoDisplaySettings (const CRhinoDisplaySettings &)
~CRhinoDisplaySettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoDisplaySettings &other) const
CRhinoDisplaySettings &  | operator= (const CRhinoDisplaySettings &)
bool  | operator== (const CRhinoDisplaySettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
double  | SolidHatchMeshingTolerance () const
void  | Validate ()
 Public Attributes
int  | m_advanced_texture_preview_max_resolution
int  | m_advanced_texture_preview_min_resolution
ON_Color  | m_ambient_light_color_in_rendered_views
ON_Color  | m_background_color_in_rendered_views
bool  | m_bRenderedViewsShowLights
bool  | m_display_curves_and_isocurves_in_rendered_views
bool  | m_display_text_and_dimensions_in_rendered_views
bool  | m_get_rendered_view_settings_from_doc
bool  | m_use_hidden_lights_in_rendered_views
 Static Public Attributes
static const CRhinoDisplaySettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoDisplaySettings() [1/2]
 CRhinoDisplaySettings::CRhinoDisplaySettings  |  ( |   | )
◆ CRhinoDisplaySettings() [2/2]
 CRhinoDisplaySettings::CRhinoDisplaySettings  |  ( |  const CRhinoDisplaySettings &  |   | )
◆ ~CRhinoDisplaySettings()
 CRhinoDisplaySettings::~CRhinoDisplaySettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoDisplaySettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoDisplaySettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoDisplaySettings::operator!=  |  ( |  const CRhinoDisplaySettings &  |  other | ) |   const
◆ operator=()
 CRhinoDisplaySettings& CRhinoDisplaySettings::operator=  |  ( |  const CRhinoDisplaySettings &  |   | )
◆ operator==()
 bool CRhinoDisplaySettings::operator==  |  ( |  const CRhinoDisplaySettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoDisplaySettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoDisplaySettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SolidHatchMeshingTolerance()
 double CRhinoDisplaySettings::SolidHatchMeshingTolerance  |  ( |   | ) |   const
◆ Validate()
 void CRhinoDisplaySettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoDisplaySettings CRhinoDisplaySettings::Default
static
◆ m_advanced_texture_preview_max_resolution
 int CRhinoDisplaySettings::m_advanced_texture_preview_max_resolution
◆ m_advanced_texture_preview_min_resolution
 int CRhinoDisplaySettings::m_advanced_texture_preview_min_resolution
◆ m_ambient_light_color_in_rendered_views
 ON_Color CRhinoDisplaySettings::m_ambient_light_color_in_rendered_views
◆ m_background_color_in_rendered_views
 ON_Color CRhinoDisplaySettings::m_background_color_in_rendered_views
◆ m_bRenderedViewsShowLights
 bool CRhinoDisplaySettings::m_bRenderedViewsShowLights
◆ m_display_curves_and_isocurves_in_rendered_views
 bool CRhinoDisplaySettings::m_display_curves_and_isocurves_in_rendered_views
◆ m_display_text_and_dimensions_in_rendered_views
 bool CRhinoDisplaySettings::m_display_text_and_dimensions_in_rendered_views
◆ m_get_rendered_view_settings_from_doc
 bool CRhinoDisplaySettings::m_get_rendered_view_settings_from_doc
◆ m_use_hidden_lights_in_rendered_views
 bool CRhinoDisplaySettings::m_use_hidden_lights_in_rendered_views