Public Member Functions | Public Attributes | Friends | List of all members
ON_BrepRegionTopology Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Public Member Functions
ON_BrepRegionTopology ()
ON_BrepRegionTopology (const ON_BrepRegionTopology &src)
~ON_BrepRegionTopology ()
const ON_Brep *  | Brep () const
bool  | Create (const ON_Brep *brep)
bool  | IsValid (ON_TextLog *text_log=0) const
ON_BrepRegionTopology &  | operator= (const ON_BrepRegionTopology &)
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Transform (const ON_Xform &xform)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_BrepFaceSideArray  | m_FS
ON_BrepRegionArray  | m_R
 Friends
class  | ON_Brep
class  | ON_V5_BrepRegionTopologyUserData
Constructor & Destructor Documentation
◆ ON_BrepRegionTopology() [1/2]
 ON_BrepRegionTopology::ON_BrepRegionTopology  |  ( |   | )
◆ ON_BrepRegionTopology() [2/2]
 ON_BrepRegionTopology::ON_BrepRegionTopology  |  ( |  const ON_BrepRegionTopology &  |  src | )
◆ ~ON_BrepRegionTopology()
 ON_BrepRegionTopology::~ON_BrepRegionTopology  |  ( |   | )
Member Function Documentation
◆ Brep()
 const ON_Brep* ON_BrepRegionTopology::Brep  |  ( |   | ) |   const
◆ Create()
 bool ON_BrepRegionTopology::Create  |  ( |  const ON_Brep *  |  brep | )
◆ IsValid()
 bool ON_BrepRegionTopology::IsValid  |  ( |  ON_TextLog *  |  text_log = 0 | ) |   const
◆ operator=()
 ON_BrepRegionTopology& ON_BrepRegionTopology::operator=  |  ( |  const ON_BrepRegionTopology &  |   | )
◆ Read()
 bool ON_BrepRegionTopology::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepRegionTopology::SizeOf  |  ( |   | ) |   const
◆ Transform()
 bool ON_BrepRegionTopology::Transform  |  ( |  const ON_Xform &  |  xform | )
◆ Write()
 bool ON_BrepRegionTopology::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Friends And Related Function Documentation
◆ ON_Brep
 friend class ON_Brep
friend
◆ ON_V5_BrepRegionTopologyUserData
 friend class ON_V5_BrepRegionTopologyUserData
friend
Member Data Documentation
◆ m_FS
 ON_BrepFaceSideArray ON_BrepRegionTopology::m_FS
◆ m_R
 ON_BrepRegionArray ON_BrepRegionTopology::m_R