Public Member Functions | Public Attributes | List of all members
ON_ObjRef_IRefID Class Reference
OpenNURBS
#include <opennurbs_objref.h>
 Public Member Functions
ON_ObjRef_IRefID ()=default
ON_ObjRef_IRefID (const ON_ObjRef_IRefID &)=default
~ON_ObjRef_IRefID ()=default
void  | Default ()
ON_ObjRef_IRefID &  | operator= (const ON_ObjRef_IRefID &)=default
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_COMPONENT_INDEX  | m_component_index
ON_ObjRefEvaluationParameter  | m_evp
ON_Xform  | m_geometry_xform = ON_Xform::ZeroTransformation
int  | m_idef_geometry_index = 0
ON_UUID  | m_idef_uuid = ON_nil_uuid
ON_UUID  | m_iref_uuid = ON_nil_uuid
ON_Xform  | m_iref_xform = ON_Xform::ZeroTransformation
m_iref_xform is the value stored in ON_InstanceRef.m_xform. More...
Constructor & Destructor Documentation
◆ ON_ObjRef_IRefID() [1/2]
 ON_ObjRef_IRefID::ON_ObjRef_IRefID  |  ( |   | )
default
◆ ~ON_ObjRef_IRefID()
 ON_ObjRef_IRefID::~ON_ObjRef_IRefID  |  ( |   | )
default
◆ ON_ObjRef_IRefID() [2/2]
 ON_ObjRef_IRefID::ON_ObjRef_IRefID  |  ( |  const ON_ObjRef_IRefID &  |   | )
default
Member Function Documentation
◆ Default()
 void ON_ObjRef_IRefID::Default  |  ( |   | )
◆ operator=()
 ON_ObjRef_IRefID& ON_ObjRef_IRefID::operator=  |  ( |  const ON_ObjRef_IRefID &  |   | )
default
◆ Read()
 bool ON_ObjRef_IRefID::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_ObjRef_IRefID::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_component_index
 ON_COMPONENT_INDEX ON_ObjRef_IRefID::m_component_index
If this ON_ObjRef_IRefID is the first entry in the ON_ObjRef.m__iref[] array, then it references a "real" piece of geometry (not a nested instance reference).
 If the reference is to a subobject of the real piece of geometry, then m_component_index records the subobject index. In all other cases, m_component_index is not set.
◆ m_evp
 ON_ObjRefEvaluationParameter ON_ObjRef_IRefID::m_evp
If this ON_ObjRef_IRefID is the first entry in the ON_ObjRef.m__iref[] array, then it references a "real" piece of geometry (not a nested instance reference).
 If there is an evaluation parameter for the geometry, it is saved in m_evp. In all other cases, m_evp is not set.
◆ m_geometry_xform
 ON_Xform ON_ObjRef_IRefID::m_geometry_xform = ON_Xform::ZeroTransformation
m_geometry_xform is the transformation to map the base geometry to world coordinates. If the instance reference is not nested, then m_geometry_xform = m_iref_xform. If the instance reference is nested, then m_geometry_xform = m_iref_xform * .... * T1 where the Ts are the transformations from the children.
◆ m_idef_geometry_index
 int ON_ObjRef_IRefID::m_idef_geometry_index = 0
m_geometry_index is the index of the uuid of the pertinent piece of geometry in the ON_InstanceRef.m_object_uuid[] array. This index is identical to the index of the geometry's CRhinoObject in the CRhinoInstanceDefinition.m_objects[] array.
◆ m_idef_uuid
 ON_UUID ON_ObjRef_IRefID::m_idef_uuid = ON_nil_uuid
m_idef_uuid is the instance definition id stored in ON_InstanceRef.m_instance_definition_uuid and ON_InstanceDefinition.m_uuid.
◆ m_iref_uuid
 ON_UUID ON_ObjRef_IRefID::m_iref_uuid = ON_nil_uuid
m_iref_uuid is the CRhinoInstanceObject's uuid stored in its ON_3dmObjectAttributes.m_uuid.
◆ m_iref_xform
 ON_Xform ON_ObjRef_IRefID::m_iref_xform = ON_Xform::ZeroTransformation
m_iref_xform is the value stored in ON_InstanceRef.m_xform.