Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_ModelGeometryComponent Class Reference
OpenNURBS
#include <opennurbs_model_geometry.h>
 Inheritance diagram for ON_ModelGeometryComponent:
 Public Member Functions
ON_ModelGeometryComponent () ON_NOEXCEPT
ON_ModelGeometryComponent (const ON_ModelGeometryComponent &)
ON_ModelGeometryComponent (ON_ModelComponent::Type type) ON_NOEXCEPT
~ON_ModelGeometryComponent ()
const ON_3dmObjectAttributes *  | Attributes (const ON_3dmObjectAttributes *no_attributes_return_value) const
void  | Dump (ON_TextLog &text_log) const override
class ON_3dmObjectAttributes *  | ExclusiveAttributes () const
class ON_Geometry *  | ExclusiveGeometry () const
const class ON_Geometry *  | Geometry (const class ON_Geometry *no_geometry_return_value) const
bool  | IsEmpty () const
bool  | IsInstanceDefinitionGeometry () const
ON_ModelGeometryComponent &  | operator= (const ON_ModelGeometryComponent &)
bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map) override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static ON_ModelGeometryComponent *  | Create (const class ON_Object &model_geometry, const class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static ON_ModelGeometryComponent *  | CreateForExperts (bool bManageGeometry, class ON_Object *geometry_object, bool bManageAttributes, class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static ON_ModelGeometryComponent *  | CreateManaged (class ON_Object *geometry_object, class ON_3dmObjectAttributes *attributes, ON_ModelGeometryComponent *model_geometry_component)
static const ON_ModelGeometryComponent *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_ModelGeometryComponent *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_ModelGeometryComponent  | Unset
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Description: Used to store geometry table object definition and attributes in an ONX_Model.
Constructor & Destructor Documentation
◆ ON_ModelGeometryComponent() [1/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |   | )
◆ ON_ModelGeometryComponent() [2/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |  ON_ModelComponent::Type  |  type | )
◆ ~ON_ModelGeometryComponent()
 ON_ModelGeometryComponent::~ON_ModelGeometryComponent  |  ( |   | )
◆ ON_ModelGeometryComponent() [3/3]
 ON_ModelGeometryComponent::ON_ModelGeometryComponent  |  ( |  const ON_ModelGeometryComponent &  |   | )
Member Function Documentation
◆ Attributes()
 const ON_3dmObjectAttributes* ON_ModelGeometryComponent::Attributes  |  ( |  const ON_3dmObjectAttributes *  |  no_attributes_return_value | ) |   const
Description: Get a pointer to attributes. The returned pointer may be shared and should not be used to modify the attributes. Parameters: no_attributes_return_value - [in] This value is returned if no attributes have been set. A good choices for this parameter's value depends on the context. Common options are nullptr, &ON_3dmObjectAttributes::Unset, &ON_3dmObjectAttributes::Default, or the model's current default attributes. Returns: The layer, rendering and other attributes for this element, or no_attributes_return_value if the attributes have not been set. See Also: ON_ModelGeometryComponent::Attributes() ON_ModelGeometryComponent::Geometry() ON_ModelGeometryComponent::ExclusiveAttributes() ON_ModelGeometryComponent::ExclusiveGeometry(); ON_ModelComponentRef::ExclusiveModelComponent(); ONX_Model::ComponentFromRuntimeSerialNumber()
◆ Create()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::Create  |  ( |  const class ON_Object &  |  model_geometry,
|  const class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters: geometry - [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ... A new copy of the geometry is managed by the ON_ModelGeometryComponent class. attributes - [in] nullptr if not available. A new copy of the attributes is managed by the ON_ModelGeometryComponent class. model_geometry_component - [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class. Remarks: The returned ON_ModelGeometryComponent manages geometry and attributes and will eventually delete them.
◆ CreateForExperts()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::CreateForExperts  |  ( |  bool  |  bManageGeometry,
|  class ON_Object *  |  geometry_object,
|  bool  |  bManageAttributes,
|  class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters: bManageGeometry - [in] If true, geometry_object was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete geometry_object. Otherwise the expert caller is carefully managing the geometry_object instance and memory. geometry_object - [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ... bManageAttributes - [in] If true, attributes is nullptr or was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete attributes. Otherwise the expert caller is carefully managing the attributes instance and memory. attributes - [in] nullptr if not available model_geometry_component - [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class.
◆ CreateManaged()
 static ON_ModelGeometryComponent* ON_ModelGeometryComponent::CreateManaged  |  ( |  class ON_Object *  |  geometry_object,
|  class ON_3dmObjectAttributes *  |  attributes,
|  ON_ModelGeometryComponent *  |  model_geometry_component
)
static
Parameters: geometry_object - [in] ON_Curve, ON_Surface, ON_Brep, ON_Mesh, ON_Light, annotation, detail, ... geometry_object was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete geometry_object. attributes - [in] attributes is nullptr or was created on the heap using operator new and the ON_ModelGeometryComponent destructor will delete attributes. model_geometry - [in] If not nullptr, this class is set. Otherwise operator new allocates an ON_ModelGeometryComponent class. Remarks: The returned ON_ModelGeometryComponent manages geometry_object and attributes and will eventually delete them.
◆ Dump()
 void ON_ModelGeometryComponent::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Description: Creates a text dump of the object. Remarks: Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_ModelComponent.
◆ ExclusiveAttributes()
 class ON_3dmObjectAttributes* ON_ModelGeometryComponent::ExclusiveAttributes  |  ( |   | ) |   const
Description: Get a pointer to attributes that can be used to modify the attributes. The returned pointer is not shared at the time it is returned and will not be shared until a copy of this ON_ModelGeometryComponent is created. Returns: If this ON_ModelGeometryComponent is the only reference to the attributes, then a pointer to the attributes is returned. Otherwise, nullptr is returned. See Also: ON_ModelGeometryComponent::Attributes() ON_ModelGeometryComponent::Geometry() ON_ModelGeometryComponent::ExclusiveAttributes() ON_ModelGeometryComponent::ExclusiveGeometry(); ON_ModelComponentRef::ExclusiveModelComponent(); ONX_Model::ComponentFromRuntimeSerialNumber()
◆ ExclusiveGeometry()
 class ON_Geometry* ON_ModelGeometryComponent::ExclusiveGeometry  |  ( |   | ) |   const
Description: Get a pointer to geometry that can be used to modify the geometry. The returned pointer is not shared at the time it is returned and will not be shared until a copy of this ON_ModelGeometryComponent is created. Returns: If this ON_ModelGeometryComponent is the only reference to the geometry, then a pointer to the geometry is returned. Otherwise, nullptr is returned. See Also: ON_ModelGeometryComponent::Attributes() ON_ModelGeometryComponent::Geometry() ON_ModelGeometryComponent::ExclusiveAttributes() ON_ModelGeometryComponent::ExclusiveGeometry(); ON_ModelComponentRef::ExclusiveModelComponent(); ONX_Model::ComponentFromRuntimeSerialNumber()
◆ FromModelComponentRef()
 static const ON_ModelGeometryComponent* ON_ModelGeometryComponent::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_ModelGeometryComponent *  |  none_return_value
)
static
◆ Geometry()
 const class ON_Geometry* ON_ModelGeometryComponent::Geometry  |  ( |  const class ON_Geometry *  |  no_geometry_return_value | ) |   const
Description: Get a pointer to geometry. The returned pointer may be shared and should not be used to modify the geometry. Parameters: no_geometry_return_value - [in] This value is returned if no geometric object has been set. A good choices for this parameter's value depends on the context. Common options are nullptr. Returns: The curve, surface, annotation, detail, light, ... geometry, or no_geometry_return_value if the geometry has not been set.
 If the geometry is a light, then ComponentType() will return ON_ModelComponent::Type::RenderLight.
 If the geometry is set and something besides light, then ComponentType() will return ON_ModelComponent::Type::ModelGeometry. Otherwise, ComponentType() will return ON_ModelComponent::Type::ModelGeometry::Unset. See Also: ON_ModelGeometryComponent::Attributes() ON_ModelGeometryComponent::Geometry() ON_ModelGeometryComponent::ExclusiveAttributes() ON_ModelGeometryComponent::ExclusiveGeometry(); ON_ModelComponentRef::ExclusiveModelComponent(); ONX_Model::ComponentFromRuntimeSerialNumber()
◆ IsEmpty()
 bool ON_ModelGeometryComponent::IsEmpty  |  ( |   | ) |   const
◆ IsInstanceDefinitionGeometry()
 bool ON_ModelGeometryComponent::IsInstanceDefinitionGeometry  |  ( |   | ) |   const
◆ operator=()
 ON_ModelGeometryComponent& ON_ModelGeometryComponent::operator=  |  ( |  const ON_ModelGeometryComponent &  |   | )
◆ UpdateReferencedComponents()
 bool ON_ModelGeometryComponent::UpdateReferencedComponents  |  ( |  const class ON_ComponentManifest &  |  source_manifest,
|  const class ON_ComponentManifest &  |  destination_manifest,
|  const class ON_ManifestMap &  |  manifest_map
)
overridevirtual
Description: Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. Parameters: source_manifest - [in] A manifest of the source context with indices and ids corresponding to the current component references. If this manifest is not available, pass ON_ComponentManifest::Empty. destination_manifest - [in] A manifest of the destination context with indices and ids corresponding to the desired component references. If this manifest is not available, pass ON_ComponentManifest::Empty. manifest_map - [in] A map from the source (current) referenced component index/id values to the destination (desired) component index/id values. Returns: True if successful. False indicates a referenced component was not found in the manifest and the reference was changed to a default value. Example: If this object is an ON_Layer, the line pattern and render material references are updated. If this object is an ON_DimStyle, the text style reference is updated. If this object is an ON_3dmObjectAttributes, the layer, material, line pattern, and group references are updated.
Reimplemented from ON_Object.
Member Data Documentation
◆ Unset
 const ON_ModelGeometryComponent ON_ModelGeometryComponent::Unset
static