Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiDockBarTab Class Referenceabstract
RhinoUI
#include <RhinoSdkUiDockbarTab.h>
 Inheritance diagram for CRhinoUiDockBarTab:
 Public Member Functions
CRhinoUiDockBarTab ()
virtual ON_wString  | Caption (void) const =0
virtual bool  | Create (void)
virtual bool  | Created (void) const
virtual ON_UUID  | CurrentDockBarId (void) const
virtual void  | Delete (void)
NVM. More...
virtual void  | Destroy (void)
virtual class CRhinoUiDockBar *  | DockBar (void)
virtual void  | Help (void) const
virtual HICON  | Icon (const ON_2iSize &sizeInPixels) const =0
virtual UUID  | Id (void) const
virtual void  | Move (const ON_4iRect &rect)
virtual void  | SetCurrentDockBarId (const ON_UUID &uuid)
virtual void  | Show (UINT uState)
virtual void  | Switch (void)
virtual class ITabbedDockBarEventWatcher *  | TabbedDockBarEventWatcher (void) const =0
 Protected Member Functions
virtual  | ~CRhinoUiDockBarTab ()
virtual bool  | CreateWnd (void)=0
Call the implementation specific PanelHost function to find the parent. More...
virtual void  | DeleteThis (void)=0
Implement as delete this;. More...
virtual void  | DestroyWnd (void)=0
virtual void  | DoHelp (void) const =0
virtual bool  | IsCreated (void) const =0
virtual void  | MoveWnd (const ON_4iRect &rect)=0
virtual void  | ShowWnd (UINT uState)=0
virtual void  | SwitchDockBar (void)=0
Call the implementation specific PanelHost function to find the parent. More...
virtual UUID  | TabId (void) const =0
 Friends
class  | Impl
Detailed Description
Deprecated RHINO_SDK_DATA extern UUID uuidPanelGroundPlaneEto; RHINO_SDK_DATA extern UUID uuidPanelRenderSettingsEto; RHINO_SDK_DATA extern UUID uuidPanelSunEto;
Constructor & Destructor Documentation
◆ CRhinoUiDockBarTab()
 CRhinoUiDockBarTab::CRhinoUiDockBarTab  |  ( |   | )
◆ ~CRhinoUiDockBarTab()
 virtual CRhinoUiDockBarTab::~CRhinoUiDockBarTab  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ Caption()
 virtual ON_wString CRhinoUiDockBarTab::Caption  |  ( |  void  |   | ) |   const
pure virtual
Implemented in CRhinoUiPanel.
◆ Create()
 virtual bool CRhinoUiDockBarTab::Create  |  ( |  void  |   | )
virtual
◆ Created()
 virtual bool CRhinoUiDockBarTab::Created  |  ( |  void  |   | ) |   const
virtual
◆ CreateWnd()
 virtual bool CRhinoUiDockBarTab::CreateWnd  |  ( |  void  |   | )
protectedpure virtual
Call the implementation specific PanelHost function to find the parent.
◆ CurrentDockBarId()
 virtual ON_UUID CRhinoUiDockBarTab::CurrentDockBarId  |  ( |  void  |   | ) |   const
virtual
◆ Delete()
 virtual void CRhinoUiDockBarTab::Delete  |  ( |  void  |   | )
virtual
NVM.
◆ DeleteThis()
 virtual void CRhinoUiDockBarTab::DeleteThis  |  ( |  void  |   | )
protectedpure virtual
Implement as delete this;.
◆ Destroy()
 virtual void CRhinoUiDockBarTab::Destroy  |  ( |  void  |   | )
virtual
◆ DestroyWnd()
 virtual void CRhinoUiDockBarTab::DestroyWnd  |  ( |  void  |   | )
protectedpure virtual
◆ DockBar()
 virtual class CRhinoUiDockBar* CRhinoUiDockBarTab::DockBar  |  ( |  void  |   | )
virtual
◆ DoHelp()
 virtual void CRhinoUiDockBarTab::DoHelp  |  ( |  void  |   | ) |   const
protectedpure virtual
◆ Help()
 virtual void CRhinoUiDockBarTab::Help  |  ( |  void  |   | ) |   const
virtual
◆ Icon()
 virtual HICON CRhinoUiDockBarTab::Icon  |  ( |  const ON_2iSize &  |  sizeInPixels | ) |   const
pure virtual
Implemented in CRhinoUiPanel.
◆ Id()
 virtual UUID CRhinoUiDockBarTab::Id  |  ( |  void  |   | ) |   const
virtual
◆ IsCreated()
 virtual bool CRhinoUiDockBarTab::IsCreated  |  ( |  void  |   | ) |   const
protectedpure virtual
◆ Move()
 virtual void CRhinoUiDockBarTab::Move  |  ( |  const ON_4iRect &  |  rect | )
virtual
◆ MoveWnd()
 virtual void CRhinoUiDockBarTab::MoveWnd  |  ( |  const ON_4iRect &  |  rect | )
protectedpure virtual
◆ SetCurrentDockBarId()
 virtual void CRhinoUiDockBarTab::SetCurrentDockBarId  |  ( |  const ON_UUID &  |  uuid | )
virtual
◆ Show()
 virtual void CRhinoUiDockBarTab::Show  |  ( |  UINT  |  uState | )
virtual
◆ ShowWnd()
 virtual void CRhinoUiDockBarTab::ShowWnd  |  ( |  UINT  |  uState | )
protectedpure virtual
◆ Switch()
 virtual void CRhinoUiDockBarTab::Switch  |  ( |  void  |   | )
virtual
◆ SwitchDockBar()
 virtual void CRhinoUiDockBarTab::SwitchDockBar  |  ( |  void  |   | )
protectedpure virtual
Call the implementation specific PanelHost function to find the parent.
◆ TabbedDockBarEventWatcher()
 virtual class ITabbedDockBarEventWatcher* CRhinoUiDockBarTab::TabbedDockBarEventWatcher  |  ( |  void  |   | ) |   const
pure virtual
◆ TabId()
 virtual UUID CRhinoUiDockBarTab::TabId  |  ( |  void  |   | ) |   const
protectedpure virtual
Friends And Related Function Documentation
◆ Impl
 friend class Impl
friend