Public Types | Public Member Functions | List of all members
CRhinoDocumentPropertiesTabs Class Reference
Rhino
#include <rhinoSdkSystemDialogOptions.h>
 Public Types
enum  | document_property_tabs {
 render_tab = 0, render_mesh_tab, units_tab, page_units_tab,
 dimension_tab, notes_tab, summary_tab, grid_tab,
 linetype_tab, hatch_tab, text_tab, tab_count
 }
 Public Member Functions
CRhinoDocumentPropertiesTabs ()
void  | IncludeTab (document_property_tabs)
void  | RemoveTab (document_property_tabs)
BOOL32  | TabIncluded (document_property_tabs)
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. class CRhinoObjectPropertiesTabs
Description: Control class for writing plug-in that adds commands to Rhino.
Member Enumeration Documentation
◆ document_property_tabs
 enum CRhinoDocumentPropertiesTabs::document_property_tabs
Enumerator
render_tab
render_mesh_tab
units_tab
page_units_tab
dimension_tab
notes_tab
summary_tab
grid_tab
linetype_tab
hatch_tab
text_tab
tab_count
this is not a valid tab index, it is the number of tabs
Constructor & Destructor Documentation
◆ CRhinoDocumentPropertiesTabs()
 CRhinoDocumentPropertiesTabs::CRhinoDocumentPropertiesTabs  |  ( |   | )
Member Function Documentation
◆ IncludeTab()
 void CRhinoDocumentPropertiesTabs::IncludeTab  |  ( |  document_property_tabs  |   | )
◆ RemoveTab()
 void CRhinoDocumentPropertiesTabs::RemoveTab  |  ( |  document_property_tabs  |   | )
◆ TabIncluded()
 BOOL32 CRhinoDocumentPropertiesTabs::TabIncluded  |  ( |  document_property_tabs  |   | )