Public Member Functions | Friends | List of all members
CRhinoCoreAppActivity Class Reference
Rhino
#include <RhinoSdkWorkerThread.h>
 Public Member Functions
CRhinoCoreAppActivity ()
~CRhinoCoreAppActivity ()
 Friends
class  | CRhinoWorkerThread
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// Description: In any function that allocates memory use by the core Rhino application, create a CRhCoreAppActivity class on the first line and all memory will come from the correct pool and the function will work in both ordinary running and while a worker thread is running.
It is critical to make sure memory comes from the main pool in things that handle Windows events.
Constructor & Destructor Documentation
◆ CRhinoCoreAppActivity()
 CRhinoCoreAppActivity::CRhinoCoreAppActivity  |  ( |   | )
◆ ~CRhinoCoreAppActivity()
 CRhinoCoreAppActivity::~CRhinoCoreAppActivity  |  ( |   | )
Friends And Related Function Documentation
◆ CRhinoWorkerThread
 friend class CRhinoWorkerThread
friend