Public Member Functions | Protected Attributes | List of all members
CRhinoUiDockBarClientExpandableTabCtrl Class Reference
RhinoUI
#include <RhinoSdkUiDockBarExpandableTabCtrl.h>
 Inheritance diagram for CRhinoUiDockBarClientExpandableTabCtrl:
 Public Member Functions
CRhinoUiDockBarClientExpandableTabCtrl ()=default
virtual  | ~CRhinoUiDockBarClientExpandableTabCtrl ()=default
bool  | CreateExpandableTabCtrl (CRhinoUiDockBar *pCB, CWnd *pParent)
CRhinoUiDockBar *  | GetRhinoDockBar ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
 Public Member Functions inherited from CRhinoUiExpandableTabCtrl
CRhinoUiExpandableTabCtrl ()
virtual  | ~CRhinoUiExpandableTabCtrl ()
virtual bool  | AddPage (LPCTSTR lpszItem, int nImage, LPCTSTR lpszTemplateName, LPCTSTR szHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
virtual bool  | AddPage (LPCTSTR lpszItem, int nImage, UINT nIDTemplate, UINT nHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
CSize  | Borders () const
bool  | CreateExpandableTabCtrl (CWnd *pParent, UINT nID, LPRECT lpRect=NULL)
bool  | DeleteAllItems ()
bool  | DeleteItem (int nItem)
bool  | ExpandItem (int nItem, bool bExpand=true)
const CRhinoUiExpandableTabCtrlItem *  | GetActiveItem () const
int  | GetActiveItemIndex () const
const CRhinoUiExpandableTabCtrlItem *  | GetItem (const CDialog *pPage) const
const CRhinoUiExpandableTabCtrlItem *  | GetItem (int nItem) const
int  | GetItemCount () const
void  | GetScrolledTabClientRect (LPRECT lpR) const
const SCROLLINFO &  | GetTabCtrlScrollInfo (bool bVert) const
int  | GetTabGap () const
bool  | HideTab (int iIndex, bool bHide=true)
hit_test  | HitTest (CPoint pt, int *pItemIndex=NULL) const
bool  | IndexIsValid (int iIndex) const
virtual bool  | InsertItem (int nItem, LPCTSTR lpszItem, int nImage, LPCTSTR lpszTemplateName, LPCTSTR szHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
virtual bool  | InsertItem (int nItem, LPCTSTR lpszItem, int nImage, UINT nIDTemplate, UINT nHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
bool  | IsExpandableTabFlagFlagSet (expandable_tab_flags flag) const
bool  | IsTabHidden (int iIndex) const
int  | ItemIndex (const CDialog *pPage) const
int  | ItemIndex (CPoint pt, bool bCheckPageRect=false) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnHScroll (UINT nSBCode, UINT nPos, CScrollBar *pScrollBar)
virtual bool  | OnItemDroppedOnOtherWindow (int drag_item_index, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
afx_msg void  | OnSysColorChange ()
afx_msg void  | OnVScroll (UINT nSBCode, UINT nPos, CScrollBar *pScrollBar)
bool  | ReplaceDlgItem (CDialog *pParent, UINT nID)
void  | ScrollTabClientPoint (CPoint &pt) const
void  | ScrollTabClientRect (CRect &r) const
bool  | SetActiveItem (int nItem)
bool  | SetBorders (int cx, int cy)
bool  | SetExpandableTabFlag (expandable_tab_flags flag, bool b)
int  | SetTabGap (int nGap)
CRhinoUiThemeDraw *  | ThemeDraw () const
 Protected Attributes
CRhinoUiDockBar *  | m_pCB = nullptr
 Additional Inherited Members
 Public Types inherited from CRhinoUiExpandableTabCtrl
enum  | expandable_tab_flags {
 etf_vertical_tabs = 0, etf_allow_drag_drop, etf_user_1, etf_user_2,
 etf_user_3, etf_user_4, etf_user_5, etf_user_6,
 etf_user_7, etf_user_8, etf_user_9, etf_user_10,
 etf_invalid
 }
enum  | hit_test {
 ht_caption = 0, ht_expand_contract_button, ht_client, ht_item_stretch,
 ht_invalid, force_32bit_hit_test = 0xFFFFFFFF
 }
enum  | notification_ids { etcn_expand = 0, etcn_hide, force_32bit_notification_ids = 0xFFFFFFFF }
 Static Public Attributes inherited from CRhinoUiExpandableTabCtrl
static const UINT  | m_custom_win_msg_id
 Protected Member Functions inherited from CRhinoUiExpandableTabCtrl
CSize  | CalculateButtonRects ()
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
void  | RecalcLayout (bool bRepaint=true)
void  | SendParentNotification (int msg, int hiword, LPARAM lParam)
bool  | TearOffAndDockBar (int lmouse_down_on, CPoint point, CPoint screen_point, CWnd *mouse_over_window)
Constructor & Destructor Documentation
◆ CRhinoUiDockBarClientExpandableTabCtrl()
 CRhinoUiDockBarClientExpandableTabCtrl::CRhinoUiDockBarClientExpandableTabCtrl  |  ( |   | )
default
◆ ~CRhinoUiDockBarClientExpandableTabCtrl()
 virtual CRhinoUiDockBarClientExpandableTabCtrl::~CRhinoUiDockBarClientExpandableTabCtrl  |  ( |   | )
virtualdefault
Member Function Documentation
◆ CreateExpandableTabCtrl()
 bool CRhinoUiDockBarClientExpandableTabCtrl::CreateExpandableTabCtrl  |  ( |  CRhinoUiDockBar *  |  pCB,
|  CWnd *  |  pParent
)
Description: Create expandable tab control which may be embedded in a window or dialog which is in turn embedded in a dock bar. Parameters: pCB [in] Dock bar this control or its parent is embedded in. pParent [in] Window to embed this control in. Returns: Returns true if the tab control is successfully created or false on error.
◆ GetRhinoDockBar()
 CRhinoUiDockBar* CRhinoUiDockBarClientExpandableTabCtrl::GetRhinoDockBar  |  ( |   | )
Description: Get dock bar this control is embedded in.
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiDockBarClientExpandableTabCtrl::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiDockBarClientExpandableTabCtrl::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
Member Data Documentation
◆ m_pCB
 CRhinoUiDockBar* CRhinoUiDockBarClientExpandableTabCtrl::m_pCB = nullptr
protected