Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetPolygonExtra Class Reference
RhinoGet
#include <rhinoSdkGetPolygon.h>
 Inheritance diagram for CArgsRhinoGetPolygonExtra:
 Public Member Functions
CArgsRhinoGetPolygonExtra ()
CArgsRhinoGetPolygonExtra (const CArgsRhinoGetPolygonExtra &)
CArgsRhinoGetPolygonExtra(const CArgsRhinoGetPolygon&);. More...
virtual  | ~CArgsRhinoGetPolygonExtra ()
const bool  | AddBothSides () const
const bool  | BothSides () const
const CRhinoCommandOptionName &  | BothSidesOption () const
CArgsRhinoGetPolygonExtra &  | operator= (const CArgsRhinoGetPolygonExtra &)
void  | SetAddBothSides (const bool)
void  | SetBothSides (const bool)
void  | SetBothSidesOption (const CRhinoCommandOptionName &)
 Public Member Functions inherited from CArgsRhinoGetPolygon
CArgsRhinoGetPolygon ()
CArgsRhinoGetPolygon (const CArgsRhinoGetPolygon &)
~CArgsRhinoGetPolygon ()
const BOOL32  | AroundCurve () const
const ON_Circle &  | Circle () const
const ON_wString &  | CircumscribedAroundCurveCenterPrompt () const
const ON_wString &  | CircumscribedCenterPrompt () const
const ON_wString &  | CornerPrompt () const
const ON_Curve *  | Curve () const
const ON_wString &  | EdgeEndPrompt () const
const ON_wString &  | EdgeMidpointPrompt () const
const BOOL32  | EdgeMode () const
const ON_wString &  | EdgeStartPrompt () const
void  | EnablePyramidOption (bool=true)
void  | EnableVerticalPolygonOption (bool=true)
const ON_3dPoint &  | FirstPoint () const
const BOOL32  | Flip () const
unsigned int  | GetCap () const
const BOOL32  | GettingStarModePolygon () const
const BOOL32  | Inscribed () const
const ON_wString &  | InscribedAroundCurveCenterPrompt () const
const ON_wString &  | InscribedCenterPrompt () const
gets More...
const ON_3dVector &  | Normal () const
int  | NumSides () const
CArgsRhinoGetPolygon &  | operator= (const CArgsRhinoGetPolygon &)
const int  | PyramidConstraint () const
const bool  | PyramidOptionAvailable () const
const ON_3dPoint &  | SecondPoint () const
void  | SetAroundCurve (BOOL32)
void  | SetCap (unsigned int)
void  | SetCircle (const ON_Circle &)
void  | SetCircumscribedAroundCurveCenterPrompt (const wchar_t *)
void  | SetCircumscribedCenterPrompt (const wchar_t *)
void  | SetCornerPrompt (const wchar_t *)
void  | SetCurve (const ON_Curve *)
void  | SetEdgeEndPrompt (const wchar_t *)
void  | SetEdgeMidpointPrompt (const wchar_t *)
void  | SetEdgeMode (BOOL32)
void  | SetEdgeStartPrompt (const wchar_t *)
void  | SetFirstPoint (const ON_3dPoint &)
void  | SetFlip (BOOL32)
void  | SetGettingStarModePolygon (BOOL32)
void  | SetInscribed (BOOL32)
void  | SetInscribedAroundCurveCenterPrompt (const wchar_t *)
void  | SetInscribedCenterPrompt (const wchar_t *)
sets More...
void  | SetNormal (const ON_3dVector &)
void  | SetNumSides (int)
void  | SetPyramidConstraint (int)
void  | SetSecondPoint (const ON_3dPoint &)
void  | SetStarAroundCurveCenterPrompt (const wchar_t *)
void  | SetStarCenterPrompt (const wchar_t *)
void  | SetStarEndPrompt (const wchar_t *)
void  | SetStarMode (BOOL32)
void  | SetStarSecondRadius (double)
void  | SetStarSecondRadiusPrompt (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseFirstPoint (BOOL32)
void  | SetUseNormal (BOOL32)
void  | SetUseStarSecondRadius (BOOL32)
void  | SetVertical (BOOL32)
const ON_wString &  | StarAroundCurveCenterPrompt () const
const ON_wString &  | StarCenterPrompt () const
const ON_wString &  | StarEndPrompt () const
const BOOL32  | StarMode () const
double  | StarSecondRadius () const
const ON_wString &  | StarSecondRadiusPrompt () const
bool  | UseActiveLayerLinetype () const
const BOOL32  | UseFirstPoint () const
const BOOL32  | UseNormal () const
const BOOL32  | UseStarSecondRadius () const
const BOOL32  | Vertical () const
const bool  | VerticalPolygonOptionAvailable () const
 Protected Attributes
class CInternalArgsRhinoGetPolygonExtra *  | m_internal
 Protected Attributes inherited from CArgsRhinoGetPolygon
BOOL32  | m_AroundCurve
BOOL32  | m_bGettingStarModePolygon
bool  | m_bPyramidAvailable
int  | m_bPyramidConstraint
0 = None, 1 = Vertical, 2 = AroundCurve More...
bool  | m_bVerticalPolygonAvailable
ON_Circle  | m_Circle
ON_wString  | m_CircumscribedAroundCurveCenterPrompt
ON_wString  | m_CircumscribedCenterPrompt
ON_wString  | m_CornerPrompt
const ON_Curve *  | m_Curve
ON_wString  | m_EdgeEndPrompt
ON_wString  | m_EdgeMidpointPrompt
BOOL32  | m_EdgeMode
true=polygon by edge More...
ON_wString  | m_EdgeStartPrompt
ON_3dPoint  | m_FirstPoint
BOOL32  | m_Flip
BOOL32  | m_Inscribed
true=inscribed, false=circumscribed More...
ON_wString  | m_InscribedAroundCurveCenterPrompt
ON_wString  | m_InscribedCenterPrompt
ON_3dVector  | m_Normal
ON_3dPoint  | m_SecondPoint
ON_wString  | m_StarAroundCurveCenterPrompt
ON_wString  | m_StarCenterPrompt
ON_wString  | m_StarEndPrompt
BOOL32  | m_StarMode
true=star More...
double  | m_StarSecondRadius
ON_wString  | m_StarSecondRadiusPrompt
BOOL32  | m_UseFirstPoint
BOOL32  | m_UseNormal
BOOL32  | m_UseStarSecondRadius
BOOL32  | m_Vertical
 Additional Inherited Members
 Public Attributes inherited from CArgsRhinoGetPolygon
int  | m_NumSides
variables More...
Constructor & Destructor Documentation
◆ CArgsRhinoGetPolygonExtra() [1/2]
 CArgsRhinoGetPolygonExtra::CArgsRhinoGetPolygonExtra  |  ( |   | )
◆ ~CArgsRhinoGetPolygonExtra()
 virtual CArgsRhinoGetPolygonExtra::~CArgsRhinoGetPolygonExtra  |  ( |   | )
virtual
◆ CArgsRhinoGetPolygonExtra() [2/2]
 CArgsRhinoGetPolygonExtra::CArgsRhinoGetPolygonExtra  |  ( |  const CArgsRhinoGetPolygonExtra &  |   | )
CArgsRhinoGetPolygonExtra(const CArgsRhinoGetPolygon&);.
Member Function Documentation
◆ AddBothSides()
 const bool CArgsRhinoGetPolygonExtra::AddBothSides  |  ( |   | ) |   const
November 11, 2024 - Tim Partial fix (pyramid) for https://mcneel.myjetbrains.com/youtrack/issue/RH-63751 Add settings for bothsides.
◆ BothSides()
 const bool CArgsRhinoGetPolygonExtra::BothSides  |  ( |   | ) |   const
◆ BothSidesOption()
 const CRhinoCommandOptionName& CArgsRhinoGetPolygonExtra::BothSidesOption  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetPolygonExtra& CArgsRhinoGetPolygonExtra::operator=  |  ( |  const CArgsRhinoGetPolygonExtra &  |   | )
◆ SetAddBothSides()
 void CArgsRhinoGetPolygonExtra::SetAddBothSides  |  ( |  const bool  |   | )
◆ SetBothSides()
 void CArgsRhinoGetPolygonExtra::SetBothSides  |  ( |  const bool  |   | )
◆ SetBothSidesOption()
 void CArgsRhinoGetPolygonExtra::SetBothSidesOption  |  ( |  const CRhinoCommandOptionName &  |   | )
Member Data Documentation
◆ m_internal
 class CInternalArgsRhinoGetPolygonExtra* CArgsRhinoGetPolygonExtra::m_internal
protected