Public Attributes | List of all members
CRhinoKeyboardShortcut Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Attributes
unsigned int  | m_keycode = 0
ON_wString  | m_macro
RhinoKeyboardModifierKey  | m_modifier = RhinoKeyboardModifierKey::None
Member Data Documentation
◆ m_keycode
 unsigned int CRhinoKeyboardShortcut::m_keycode = 0
◆ m_macro
 ON_wString CRhinoKeyboardShortcut::m_macro
◆ m_modifier
 RhinoKeyboardModifierKey CRhinoKeyboardShortcut::m_modifier = RhinoKeyboardModifierKey::None