Public Member Functions | List of all members
CRhRdkDisableFileFinder Class Referencefinal
RDK
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkDisableFileFinder ()
~CRhRdkDisableFileFinder ()
Constructor & Destructor Documentation
◆ CRhRdkDisableFileFinder()
 CRhRdkDisableFileFinder::CRhRdkDisableFileFinder  |  ( |   | )
◆ ~CRhRdkDisableFileFinder()
 CRhRdkDisableFileFinder::~CRhRdkDisableFileFinder  |  ( |   | )