Public Member Functions | Protected Attributes | List of all members
CRhinoUiExpandableTabbedDockBar Class Reference
RhinoUI
CRhinoUiExpandableTabbedDockBar. More...
#include <RhinoSdkUiExpandableTabbedDockBar.h>
 Inheritance diagram for CRhinoUiExpandableTabbedDockBar:
 Public Member Functions
CRhinoUiExpandableTabbedDockBar ()
virtual  | ~CRhinoUiExpandableTabbedDockBar ()
 Public Member Functions inherited from CRhinoUiDockBar
CSize  | CalcDynamicLayout (int nLength, DWORD nMode) override
CSize  | CalcFixedLayout (BOOL32 bStretch, BOOL32 bHorz) override
sizing More...
CRect  | CalculateNCBorders (int dock_location, bool bResizable=true) const
CSize  | CalculateNCBorderSize (int dock_location, bool bResizable=true) const
virtual bool  | CanClose ()
bool  | CreateDockBarClientDialog (LPCTSTR lpszTemplateName, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
bool  | CreateDockBarClientDialog (UINT nIDTemplate, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
virtual bool  | CreateDockBarControls ()
const class CRhControlBarInfo *  | DelayFloatInfo () const
void  | DelayShow (BOOL32 bShow) override
BOOL32  | DestroyWindow () override
CWnd *  | DockBarClientWnd () const
virtual ON_UUID  | DockBarID () const
virtual const wchar_t *  | DockBarName (int languageId=1033) const
int  | DockLocation () const
virtual void  | DrawDockedCaption (CDC *pDC, const CRect &rect)
void  | DrawGripper (CDC *pDC, const CRect &rect) override
painting More...
void  | EnableDocking (DWORD dwDockStyle)
void  | ForceOnScreen ()
int  | GripperSize () const
CSize  | InitialSizeDockedHorz () const
CSize  | InitialSizeDockedVert () const
CSize  | InitialSizeFloating () const
bool  | IsCloseButtonVisible () const
BOOL32  | IsDockBar () const override
bool  | IsDockBarFlagSet (control_bar_flags flag) const
bool  | IsDocked () const
bool  | IsDockedBottom () const
bool  | IsDockedHoriz () const
bool  | IsDockedLeft () const
bool  | IsDockedRight () const
bool  | IsDockedTop () const
bool  | IsDockedVert () const
bool  | IsGearButtonVisible () const
BOOL32  | IsVisible () const override
virtual void  | LoadState (LPCTSTR lpszProfileName=NULL)
void  | OnBarStyleChange (DWORD dwOldStyle, DWORD dwNewStyle) override
virtual CSize  | OnCalcDynamicLayout (CSize size, int nLength, DWORD nMode)
virtual CSize  | OnCalcFixedLayout (CSize size, BOOL32 bStretch, BOOL32 bHorz)
virtual void  | OnDockBarPositionChanged (DWORD newLocation)
virtual bool  | OnDockContextStartDrag (bool dragActionStarting)
virtual void  | OnShowDockBar (bool show)
virtual void  | OnShowDockBar (IDockBarEventWatcher::ShowEventArgs args)
virtual void  | OnStartTracking (bool bDoneTracking)
virtual void  | OnToggleDocking (bool priorToStateChange)
void  | OnUpdateCmdUI (CFrameWnd *pTarget, BOOL32 bDisableIfNoHndler) override
CControlBar overrides. More...
ON_UUID  | PlugInID () const
void  | PostNcDestroy () override
BOOL32  | PreCreateWindow (CREATESTRUCT &cs) override
BOOL32  | PreTranslateMessage (MSG *pMsg) override
DWORD  | RecalcDelayShow (AFX_SIZEPARENTPARAMS *lpLayout) override
virtual void  | RhinoGetBarInfo (CControlBarInfo &cbi)
virtual void  | SaveState (LPCTSTR lpszProfileName=NULL)
void  | SetDockBarClientWnd (CWnd *pWnd)
bool  | SetDockBarFlag (control_bar_flags flag, bool b)
void  | SetInitialSizeDockedHorz (CSize size)
void  | SetInitialSizeDockedVert (CSize size)
void  | SetInitialSizeFloating (CSize size)
BOOL32  | SetStatusText (INT_PTR nHit) override
bool  | ShowCloseButton (bool show)
bool  | ShowGearButton (bool show)
int  | SortIndex () const
void  | ToggleDocking ()
LRESULT  | WindowProc (UINT nMsg, WPARAM wParam, LPARAM lParam) override
 Protected Attributes
UUID  | m_dock_bar_uuid
 Protected Attributes inherited from CRhinoUiDockBar
bool  | m_bActiveApp
bool  | m_bActiveFloating
bool  | m_bAutoDeleteRhinoDockBar
bool  | m_bDockBarMouseCaptured
int  | m_border_size
bool  | m_bReplaceDockContext
CWnd *  | m_client_window
int  | m_cx_edge
int  | m_dock_location
bool  | m_is_maximized
bool  | m_is_parent_sizing
bool  | m_is_single_in_row
bool  | m_keep_size
CSize  | m_max_tracking_size
CSize  | m_min_tracking_size
int  | m_over_button
UUID  | m_plug_in_id
WNDPROC  | m_pOldFloatFrameWndProc
int  | m_pushed_button
CRect  | m_redraw_rect
DWORD  | m_rhino_cb_style
BYTE  | m_rhino_flags [cbf_invalid]
CPoint  | m_save_point
CSize  | m_save_size
int  | m_sort_index
CSize  | m_szFloat
CSize  | m_szHorz
CSize  | m_szMaxFloat
CSize  | m_szMaxHorz
CSize  | m_szMaxVert
CSize  | m_szMinFloat
CSize  | m_szMinHorz
CSize  | m_szMinVert
CSize  | m_szVert
CSize  | m_track_max_size
CSize  | m_track_min_size
int  | m_tracking
 Additional Inherited Members
 Public Types inherited from CRhinoUiDockBar
enum  | caption_button_hit_test : int { cbht_close = HTCLOSE, cbht_expand = HTMAXBUTTON }
Used by OnNcHitTest to return custom caption button hit test ID's. More...
enum  | control_bar_flags : int {
 cbf_show_name_when_docked_vert = 0, cbf_draw_gripper_when_docked_horz, cbf_draw_gripper_when_docked_vert, cbf_forward_mouse_wheel_to_cursor_wnd,
 cbf_unused_1, cbf_unused_2, cbf_unused_3, cbf_unused_4,
 cbf_invalid
 }
enum  | RHINO_CONTROL_BAR_STYLES {
 RHCBS_EDGELEFT = 0x00000001, RHCBS_EDGERIGHT = 0x00000002, RHCBS_EDGETOP = 0x00000004, RHCBS_EDGEBOTTOM = 0x00000008,
 RHCBS_EDGEALL = 0x0000000F, RHCBS_SHOWEDGES = 0x00000010, RHCBS_GRIPPER = 0x00000020
 }
 Static Public Member Functions inherited from CRhinoUiDockBar
static bool  | IsHiding (IDockBarEventWatcher::ShowEventArgs args)
static bool  | IsShowing (IDockBarEventWatcher::ShowEventArgs args)
 Public Attributes inherited from CRhinoUiDockBar
class CRhDockBarExtension *  | m__control_bar_sdk_extension = nullptr
 Protected Types inherited from CRhinoUiDockBar
enum  | edge_hit_test_side : int {
 edge_ht_left = 0, edge_ht_top, edge_ht_right, edge_ht_bottom,
 edge_ht_invalid
 }
enum  | tracking : int {
 not_tracking = HTERROR, tracking_left = HTLEFT, tracking_right = HTRIGHT, tracking_top = HTTOP,
 tracking_bottom = HTBOTTOM
 }
Tracking modes when sizing a docked dock bar. More...
 Protected Member Functions inherited from CRhinoUiDockBar
CRhinoUiDockBar ()
virtual  | ~CRhinoUiDockBar ()
void  | AlignDockBars ()
bool  | CanStretch (UINT nHitTest) const
bool  | DelayFloat ()
virtual LRESULT CALLBACK  | DockBarFloatingFrameWndProc (HWND, UINT, WPARAM, LPARAM)
LRESULT CALLBACK  | DockBarFloatingFrameWndProcB (HWND, UINT, WPARAM, LPARAM)
void  | Expand (bool bToggle)
int  | GetDockSiteBars (ON_SimpleArray< CRhinoUiDockBar * > &bar_list) const
void  | GetDockSiteInfo (int &first_bar, int &last_bar, int &this_bar) const
bool  | GetEdgeRect (CRect rcWnd, UINT nHitTest, CRect &rcEdge) const
bool  | GetMinMaxSizes (LPSIZE szMin, LPSIZE szMax, int at_location) const
bool  | IsAlmostRight () const
bool  | IsDelayFloat () const
bool  | IsEdgeVisible (UINT hit_test) const
bool  | IsSideTracking () const
bool  | IsSizable (int at_location=-1) const
bool  | IsTracking () const
bool  | NegociateSpace (int length_available, bool is_horz)
afx_msg void  | OnActivateApp (BOOL32 bActive, DWORD dwThreadID)
afx_msg void  | OnCaptureChanged (CWnd *pWnd)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point) override
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point) override
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point) override
afx_msg void  | OnNcCalcSize (BOOL32 bCalcValidRects, NCCALCSIZE_PARAMS *lpncsp)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnNcLButtonDblClk (UINT nHitTest, CPoint point)
afx_msg void  | OnNcLButtonDown (UINT nHitTest, CPoint point)
afx_msg void  | OnNcLButtonUp (UINT nHitTest, CPoint point)
afx_msg void  | OnNcMouseMove (UINT nHitTest, CPoint point)
afx_msg void  | OnNcPaint ()
bool  | OnNcPaintFloat (HWND hwnd, WPARAM wParam, LPARAM lParam)
afx_msg void  | OnPaint ()
afx_msg void  | OnRButtonDown (UINT nFlags, CPoint point) override
afx_msg void  | OnRButtonUp (UINT nFlags, CPoint point) override
afx_msg BOOL32  | OnSetCursor (CWnd *pWnd, UINT nHitTest, UINT message)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
afx_msg void  | OnTimer (UINT_PTR nIDEvent) override
void  | OnTrackInvertTracker ()
void  | OnTrackUpdateSize (CPoint &point)
afx_msg void  | OnWindowPosChanged (WINDOWPOS *lpwndpos)
afx_msg void  | OnWindowPosChanging (WINDOWPOS *lpwndpos)
const CRhinoUiDockBar &  | operator= (const CRhinoUiDockBar &)
void  | PaintCaptionButtons (HWND hWnd)
void  | RedrawButton (const CRhinoUiDockBarCaptionButton &btn)
void  | ReleaseDockBarMouseCapture ()
void  | SetDelayFloatInfo (class CRhControlBarInfo *)
bool  | SetDockBarMouseCapture ()
void  | StartTracking (UINT nHitTest)
void  | StopTracking ()
void  | TrackButtons (CPoint ptScreen)
tracking  | TrackingLocation () const
 Static Protected Member Functions inherited from CRhinoUiDockBar
static UINT  | GetEdgeHTCode (edge_hit_test_side nEdge)
 Static Protected Attributes inherited from CRhinoUiDockBar
static ON_wString  | m_bogus_rhino_control_bar_name
static UUID  | m_bogus_rhino_control_bar_uuid
Detailed Description
CRhinoUiExpandableTabbedDockBar.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiExpandableTabbedDockBar()
 CRhinoUiExpandableTabbedDockBar::CRhinoUiExpandableTabbedDockBar  |  ( |   | )
◆ ~CRhinoUiExpandableTabbedDockBar()
 virtual CRhinoUiExpandableTabbedDockBar::~CRhinoUiExpandableTabbedDockBar  |  ( |   | )
virtual
Member Data Documentation
◆ m_dock_bar_uuid
 UUID CRhinoUiExpandableTabbedDockBar::m_dock_bar_uuid
protected