Public Member Functions | List of all members
CRhinoIsoDrawEffect Class Reference
Rhino
#include <rhinoSdkDisplayEngineAttributes.h>
 Public Member Functions
CRhinoIsoDrawEffect ()
CRhinoIsoDrawEffect (const CRhinoIsoDrawEffect &other)
~CRhinoIsoDrawEffect ()
bool  | DiscardGap () const
IsoDrawMode  | DrawMode () const
double  | Falloff () const
int  | Frequency () const
ON_Color  | GapColor () const
double  | GapSize () const
ON_Color  | GetBandColor (int index) const
ON_3dVector  | GetDirection () const
ON_3dPoint  | GetPoint () const
void  | LoadProfile (const wchar_t *section, class CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoIsoDrawEffect &other) const
CRhinoIsoDrawEffect &  | operator= (const CRhinoIsoDrawEffect &other)
bool  | operator== (const CRhinoIsoDrawEffect &other) const
double  | RotationRadians () const
void  | SaveProfile (const wchar_t *section, class CRhinoProfileContext &) const
bool  | SetBandColor (int index, const ON_Color &color)
void  | SetDirection (const ON_3dVector &direction)
void  | SetDiscardGap (bool discard)
void  | SetDrawMode (IsoDrawMode mode)
void  | SetFalloff (double falloff)
void  | SetFrequency (int count)
void  | SetGapColor (const ON_Color &color)
void  | SetGapSize (double size)
void  | SetPoint (const ON_3dPoint &point)
void  | SetRotation (double radians)
void  | SetUsedBandCount (int count)
int  | UsedBandCount () const
Constructor & Destructor Documentation
◆ CRhinoIsoDrawEffect() [1/2]
 CRhinoIsoDrawEffect::CRhinoIsoDrawEffect  |  ( |   | )
◆ CRhinoIsoDrawEffect() [2/2]
 CRhinoIsoDrawEffect::CRhinoIsoDrawEffect  |  ( |  const CRhinoIsoDrawEffect &  |  other | )
◆ ~CRhinoIsoDrawEffect()
 CRhinoIsoDrawEffect::~CRhinoIsoDrawEffect  |  ( |   | )
Member Function Documentation
◆ DiscardGap()
 bool CRhinoIsoDrawEffect::DiscardGap  |  ( |   | ) |   const
◆ DrawMode()
 IsoDrawMode CRhinoIsoDrawEffect::DrawMode  |  ( |   | ) |   const
◆ Falloff()
 double CRhinoIsoDrawEffect::Falloff  |  ( |   | ) |   const
◆ Frequency()
 int CRhinoIsoDrawEffect::Frequency  |  ( |   | ) |   const
◆ GapColor()
 ON_Color CRhinoIsoDrawEffect::GapColor  |  ( |   | ) |   const
◆ GapSize()
 double CRhinoIsoDrawEffect::GapSize  |  ( |   | ) |   const
◆ GetBandColor()
 ON_Color CRhinoIsoDrawEffect::GetBandColor  |  ( |  int  |  index | ) |   const
◆ GetDirection()
 ON_3dVector CRhinoIsoDrawEffect::GetDirection  |  ( |   | ) |   const
◆ GetPoint()
 ON_3dPoint CRhinoIsoDrawEffect::GetPoint  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoIsoDrawEffect::LoadProfile  |  ( |  const wchar_t *  |  section,
|  class CRhinoProfileContext &  |  pc
)
◆ operator!=()
 bool CRhinoIsoDrawEffect::operator!=  |  ( |  const CRhinoIsoDrawEffect &  |  other | ) |   const
◆ operator=()
 CRhinoIsoDrawEffect& CRhinoIsoDrawEffect::operator=  |  ( |  const CRhinoIsoDrawEffect &  |  other | )
◆ operator==()
 bool CRhinoIsoDrawEffect::operator==  |  ( |  const CRhinoIsoDrawEffect &  |  other | ) |   const
◆ RotationRadians()
 double CRhinoIsoDrawEffect::RotationRadians  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoIsoDrawEffect::SaveProfile  |  ( |  const wchar_t *  |  section,
|  class CRhinoProfileContext &
) |   |  const
◆ SetBandColor()
 bool CRhinoIsoDrawEffect::SetBandColor  |  ( |  int  |  index,
|  const ON_Color &  |  color
)
◆ SetDirection()
 void CRhinoIsoDrawEffect::SetDirection  |  ( |  const ON_3dVector &  |  direction | )
◆ SetDiscardGap()
 void CRhinoIsoDrawEffect::SetDiscardGap  |  ( |  bool  |  discard | )
◆ SetDrawMode()
 void CRhinoIsoDrawEffect::SetDrawMode  |  ( |  IsoDrawMode  |  mode | )
◆ SetFalloff()
 void CRhinoIsoDrawEffect::SetFalloff  |  ( |  double  |  falloff | )
◆ SetFrequency()
 void CRhinoIsoDrawEffect::SetFrequency  |  ( |  int  |  count | )
◆ SetGapColor()
 void CRhinoIsoDrawEffect::SetGapColor  |  ( |  const ON_Color &  |  color | )
◆ SetGapSize()
 void CRhinoIsoDrawEffect::SetGapSize  |  ( |  double  |  size | )
◆ SetPoint()
 void CRhinoIsoDrawEffect::SetPoint  |  ( |  const ON_3dPoint &  |  point | )
◆ SetRotation()
 void CRhinoIsoDrawEffect::SetRotation  |  ( |  double  |  radians | )
◆ SetUsedBandCount()
 void CRhinoIsoDrawEffect::SetUsedBandCount  |  ( |  int  |  count | )
◆ UsedBandCount()
 int CRhinoIsoDrawEffect::UsedBandCount  |  ( |   | ) |   const