Public Member Functions | Public Attributes | List of all members
ON_MeshPartition Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshPartition ()
~ON_MeshPartition ()
 Public Attributes
ON_SimpleArray< struct ON_MeshPart >  | m_part
int  | m_partition_max_triangle_count
maximum number of triangles in a partition (quads count as 2 triangles) More...
int  | m_partition_max_vertex_count
maximum number of vertices in a partition More...
Constructor & Destructor Documentation
◆ ON_MeshPartition()
 ON_MeshPartition::ON_MeshPartition  |  ( |   | )
◆ ~ON_MeshPartition()
 ON_MeshPartition::~ON_MeshPartition  |  ( |   | )
Member Data Documentation
◆ m_part
 ON_SimpleArray<struct ON_MeshPart> ON_MeshPartition::m_part
Partition i uses vertices m_V[j] where
m_part[i].vi[0] <= j < m_part[i].vi[1]
and uses faces m_F[k] where
m_part[i].fi[0] <= k < m_part[i].fi[1]
◆ m_partition_max_triangle_count
 int ON_MeshPartition::m_partition_max_triangle_count
maximum number of triangles in a partition (quads count as 2 triangles)
◆ m_partition_max_vertex_count
 int ON_MeshPartition::m_partition_max_vertex_count
maximum number of vertices in a partition