Public Member Functions | Friends | List of all members
ON_LinearWorkflow Class Reference
OpenNURBS
#include <opennurbs_linear_workflow.h>
 Public Member Functions
ON_LinearWorkflow ()
ON_LinearWorkflow (const ON_LinearWorkflow &lw)
ON_LinearWorkflow (ON_XMLNode &model_node)
virtual  | ~ON_LinearWorkflow ()
virtual void  | ApplyPreProcessGamma (ON_4fColor &col, bool for_texture) const
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns the CRC of gamma and linear workflow active state. More...
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual void  | OnInternalXmlChanged (const ON_LinearWorkflow *)
For internal use only. More...
virtual bool  | operator!= (const ON_LinearWorkflow &lw) const
virtual const ON_LinearWorkflow &  | operator= (const ON_LinearWorkflow &lw)
virtual bool  | operator== (const ON_LinearWorkflow &lw) const
virtual bool  | PostProcessFrameBufferOn (void) const
Get post-process frame buffer enabled state. More...
virtual float  | PostProcessGamma (void) const
Get the post-process gamma for the frame buffer. More...
virtual bool  | PostProcessGammaOn (void) const
Get post-process gamma enabled state. More...
virtual bool  | PreProcessColorsOn (void) const
Returns the linear workflow active state for individual colors. More...
virtual float  | PreProcessGamma (void) const
Get the pre-process gamma for input textures and colors. This is currently the same as the post-process gamma value. More...
virtual bool  | PreProcessGammaOn (void) const
Get pre-process gamma enabled state. This is the same as 'use linear workflow'. More...
virtual bool  | PreProcessTexturesOn (void) const
Returns the linear workflow (pre-process) active state for textures. More...
virtual void  | SetPostProcessFrameBufferOn (bool on)
Set post-process frame buffer enabled state. More...
virtual void  | SetPostProcessGamma (float gamma)
Set the post-process gamma for the frame buffer. More...
virtual void  | SetPostProcessGammaOn (bool on)
Set post-process gamma enabled state. More...
virtual void  | SetPreProcessColorsOn (bool b)
Sets the linear workflow (pre-process) active state for individual colors. More...
virtual void  | SetPreProcessGamma (float gamma)
Set the pre-process gamma for input textures and colors. This is currently the same as the post-process gamma value. More...
virtual void  | SetPreProcessGammaOn (bool on)
Set pre-process gamma enabled state. This is the same as 'use linear workflow'. More...
virtual void  | SetPreProcessTexturesOn (bool b)
Sets the linear workflow (pre-process) active state for textures. More...
 Friends
class  | ON_3dmRenderSettingsPrivate
< For internal use only. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_LinearWorkflow() [1/3]
 ON_LinearWorkflow::ON_LinearWorkflow  |  ( |   | )
◆ ON_LinearWorkflow() [2/3]
 ON_LinearWorkflow::ON_LinearWorkflow  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_LinearWorkflow() [3/3]
 ON_LinearWorkflow::ON_LinearWorkflow  |  ( |  const ON_LinearWorkflow &  |  lw | )
◆ ~ON_LinearWorkflow()
 virtual ON_LinearWorkflow::~ON_LinearWorkflow  |  ( |   | )
virtual
Member Function Documentation
◆ ApplyPreProcessGamma()
 virtual void ON_LinearWorkflow::ApplyPreProcessGamma  |  ( |  ON_4fColor &  |  col,
|  bool  |  for_texture
) |   |  const
virtual
Applies pre-process gamma correction to a color if linear workflow is active. for_texture is true if the color is part of a texture. *‍/
◆ DataCRC()
 virtual ON__UINT32 ON_LinearWorkflow::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
virtual
Returns the CRC of gamma and linear workflow active state.
◆ EVF()
 virtual void* ON_LinearWorkflow::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ OnInternalXmlChanged()
 virtual void ON_LinearWorkflow::OnInternalXmlChanged  |  ( |  const ON_LinearWorkflow *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_LinearWorkflow::operator!=  |  ( |  const ON_LinearWorkflow &  |  lw | ) |   const
virtual
◆ operator=()
 virtual const ON_LinearWorkflow& ON_LinearWorkflow::operator=  |  ( |  const ON_LinearWorkflow &  |  lw | )
virtual
◆ operator==()
 virtual bool ON_LinearWorkflow::operator==  |  ( |  const ON_LinearWorkflow &  |  lw | ) |   const
virtual
◆ PostProcessFrameBufferOn()
 virtual bool ON_LinearWorkflow::PostProcessFrameBufferOn  |  ( |  void  |   | ) |   const
virtual
Get post-process frame buffer enabled state.
◆ PostProcessGamma()
 virtual float ON_LinearWorkflow::PostProcessGamma  |  ( |  void  |   | ) |   const
virtual
Get the post-process gamma for the frame buffer.
◆ PostProcessGammaOn()
 virtual bool ON_LinearWorkflow::PostProcessGammaOn  |  ( |  void  |   | ) |   const
virtual
Get post-process gamma enabled state.
◆ PreProcessColorsOn()
 virtual bool ON_LinearWorkflow::PreProcessColorsOn  |  ( |  void  |   | ) |   const
virtual
Returns the linear workflow active state for individual colors.
◆ PreProcessGamma()
 virtual float ON_LinearWorkflow::PreProcessGamma  |  ( |  void  |   | ) |   const
virtual
Get the pre-process gamma for input textures and colors. This is currently the same as the post-process gamma value.
◆ PreProcessGammaOn()
 virtual bool ON_LinearWorkflow::PreProcessGammaOn  |  ( |  void  |   | ) |   const
virtual
Get pre-process gamma enabled state. This is the same as 'use linear workflow'.
◆ PreProcessTexturesOn()
 virtual bool ON_LinearWorkflow::PreProcessTexturesOn  |  ( |  void  |   | ) |   const
virtual
Returns the linear workflow (pre-process) active state for textures.
◆ SetPostProcessFrameBufferOn()
 virtual void ON_LinearWorkflow::SetPostProcessFrameBufferOn  |  ( |  bool  |  on | )
virtual
Set post-process frame buffer enabled state.
◆ SetPostProcessGamma()
 virtual void ON_LinearWorkflow::SetPostProcessGamma  |  ( |  float  |  gamma | )
virtual
Set the post-process gamma for the frame buffer.
◆ SetPostProcessGammaOn()
 virtual void ON_LinearWorkflow::SetPostProcessGammaOn  |  ( |  bool  |  on | )
virtual
Set post-process gamma enabled state.
◆ SetPreProcessColorsOn()
 virtual void ON_LinearWorkflow::SetPreProcessColorsOn  |  ( |  bool  |  b | )
virtual
Sets the linear workflow (pre-process) active state for individual colors.
◆ SetPreProcessGamma()
 virtual void ON_LinearWorkflow::SetPreProcessGamma  |  ( |  float  |  gamma | )
virtual
Set the pre-process gamma for input textures and colors. This is currently the same as the post-process gamma value.
◆ SetPreProcessGammaOn()
 virtual void ON_LinearWorkflow::SetPreProcessGammaOn  |  ( |  bool  |  on | )
virtual
Set pre-process gamma enabled state. This is the same as 'use linear workflow'.
◆ SetPreProcessTexturesOn()
 virtual void ON_LinearWorkflow::SetPreProcessTexturesOn  |  ( |  bool  |  b | )
virtual
Sets the linear workflow (pre-process) active state for textures.
Friends And Related Function Documentation
◆ ON_3dmRenderSettingsPrivate
 friend class ON_3dmRenderSettingsPrivate
friend
< For internal use only.