Public Member Functions | Static Public Attributes | List of all members
CRhRdkTextureCache::Location Class Reference
#include <RhRdkTextureCache.h>
 Public Member Functions
bool  | IncludeFiles (void) const
bool  | IncludeMemory (void) const
 Static Public Attributes
static Location  | Both
static Location  | FilesOnly
static Location  | MemoryOnly
Member Function Documentation
◆ IncludeFiles()
 bool CRhRdkTextureCache::Location::IncludeFiles  |  ( |  void  |   | ) |   const
◆ IncludeMemory()
 bool CRhRdkTextureCache::Location::IncludeMemory  |  ( |  void  |   | ) |   const
Member Data Documentation
◆ Both
 Location CRhRdkTextureCache::Location::Both
static
◆ FilesOnly
 Location CRhRdkTextureCache::Location::FilesOnly
static
◆ MemoryOnly
 Location CRhRdkTextureCache::Location::MemoryOnly
static