Public Member Functions | List of all members
CRhRdkDecalIterator Class Referenceabstract
RDK
#include <RhRdkObjectDataAccess.h>
 Inheritance diagram for CRhRdkDecalIterator:
 Public Member Functions
virtual  | ~CRhRdkDecalIterator ()
virtual RDK_DECAL_CRC  | CRC (void) const =0
virtual const RDK_DEPRECATED IRhRdkDecal *  | NextDecal (void)=0
virtual void  | Reset (void)=0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ ~CRhRdkDecalIterator()
 virtual CRhRdkDecalIterator::~CRhRdkDecalIterator  |  ( |   | )
inlinevirtual
Member Function Documentation
◆ CRC()
 virtual RDK_DECAL_CRC CRhRdkDecalIterator::CRC  |  ( |  void  |   | ) |   const
pure virtual
Returns
A CRC representing the combined, order-dependent CRC of this iterator's decals.
◆ NextDecal()
 virtual const RDK_DEPRECATED IRhRdkDecal* CRhRdkDecalIterator::NextDecal  |  ( |  void  |   | )
pure virtual
Retrieve the next decal.
Returns
A pointer to the next decal or null if no more decals.
◆ Reset()
 virtual void CRhRdkDecalIterator::Reset  |  ( |  void  |   | )
pure virtual
Reset the iterator to get the first decal again.