Public Types | Public Member Functions | Static Public Member Functions | List of all members
CRhinoUiDockBarCaptionButton Class Reference
RhinoUI
#include <RhinoSdkUiDockBarCaptionButton.h>
 Public Types
enum  | button_state {
 bs_pushed = 0, bs_focused, bs_hidden, bs_disabled,
 bs_count
 }
 Public Member Functions
CRhinoUiDockBarCaptionButton (bool closeButton)
bool  | ButtonState (button_state bs) const
CRect  | GetRect (const class CRhinoUiDockBar *pDockBar) const
UINT  | HitTest () const
bool  | IsButtonVisible () const
void  | Paint (CDC *pDC, const class CRhinoUiDockBar *pDockBar)
bool  | SetButtonState (button_state bs, bool b)
const wchar_t *  | ToolTipText () const
 Static Public Member Functions
static int  | Margin ()
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ button_state
 enum CRhinoUiDockBarCaptionButton::button_state
Description: Button state to check
Enumerator
bs_pushed
bs_focused
bs_hidden
bs_disabled
bs_count
not a state, this is used to size the state array
Constructor & Destructor Documentation
◆ CRhinoUiDockBarCaptionButton()
 CRhinoUiDockBarCaptionButton::CRhinoUiDockBarCaptionButton  |  ( |  bool  |  closeButton | )
Member Function Documentation
◆ ButtonState()
 bool CRhinoUiDockBarCaptionButton::ButtonState  |  ( |  button_state  |  bs | ) |   const
Description: Check to see if a current button state is set.
◆ GetRect()
 CRect CRhinoUiDockBarCaptionButton::GetRect  |  ( |  const class CRhinoUiDockBar *  |  pDockBar | ) |   const
Description: Return rectangle for button in parent window units. This will be an empty rectangle if the button is hidden.
◆ HitTest()
 UINT CRhinoUiDockBarCaptionButton::HitTest  |  ( |   | ) |   const
◆ IsButtonVisible()
 bool CRhinoUiDockBarCaptionButton::IsButtonVisible  |  ( |   | ) |   const
Description: Gets the button visibility state Returns: true if the button is visible otherwise; false if the button is hidden
◆ Margin()
 static int CRhinoUiDockBarCaptionButton::Margin  |  ( |   | )
static
Description: Call this method to get the space between caption buttons as well as the non client button margin. Returns: Returns the margin * the current DPI scale.
◆ Paint()
 void CRhinoUiDockBarCaptionButton::Paint  |  ( |  CDC *  |  pDC,
|  const class CRhinoUiDockBar *  |  pDockBar
)
Description: Paint button Parameters: pDC [in] Device context capable of painting in non client area of window hWnd [in] Window handle for painting to
◆ SetButtonState()
 bool CRhinoUiDockBarCaptionButton::SetButtonState  |  ( |  button_state  |  bs,
|  bool  |  b
)
Description: Change button state. Returns: true if the button state actually changed false if the current button state already has the same value
◆ ToolTipText()
 const wchar_t* CRhinoUiDockBarCaptionButton::ToolTipText  |  ( |   | ) |   const