Public Types | Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoGetLine Class Reference
RhinoGet
#include <rhinoSdkGetLine.h>
 Inheritance diagram for CArgsRhinoGetLine:
 Public Types
enum  | eLineMode {
 two_point, surface_normal, angled, vertical,
 four_point, bisector, perpendicular, tangent,
 curve_end, cpnormalvector
 }
 Public Member Functions
CArgsRhinoGetLine ()
CArgsRhinoGetLine (const CArgsRhinoGetLine &)
~CArgsRhinoGetLine ()
BOOL32  | AcceptZeroLengthLine () const
void  | EnableAcceptZeroLengthLine (BOOL32=TRUE)
void  | EnableFromMidPoint (BOOL32=TRUE)
If TRUE, then the user picks the midpoint and endpoint. More...
void  | EnableFromMidPointOption (BOOL32=TRUE)
void  | EnableShowVariations (BOOL32=FALSE)
If TRUE, then the all line variations are shown if the default line mode is used. More...
ON_Color  | FeedbackColor () const
const ON_3dPoint *  | FirstPoint () const
const wchar_t *  | FirstPointPrompt () const
prompt when getting first point More...
BOOL32  | FromMidPoint () const
If TRUE, then the user picked the midpoint and endpoint. More...
BOOL32  | HaveFeedbackColor () const
BOOL32  | IgnoreTrims ()
The current ignore trims state. More...
double  | Length () const
If Length() > 0, the line must have the specified length. More...
int  | LineMode () const
The current line mode. More...
BOOL32  | MidPointOption () const
const wchar_t *  | MidPointPrompt () const
prompt when getting midpoint More...
CArgsRhinoGetLine &  | operator= (const CArgsRhinoGetLine &)
const wchar_t *  | SecondPointPrompt () const
prompt when getting second point More...
void  | SetFeedbackColor (COLORREF)
void  | SetFirstPoint (const ON_3dPoint &)
void  | SetFirstPointPrompt (const wchar_t *)
void  | SetIgnoreTrims (BOOL32=TRUE)
Makes point picker ignore trims on trimmed surface when mode is surface_normal. More...
void  | SetLength (double)
If the line should have a fixed length, set that length here. More...
void  | SetLineMode (int=CArgsRhinoGetLine::two_point)
Set current line mode. More...
void  | SetMidPointPrompt (const wchar_t *)
void  | SetSecondPointPrompt (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
BOOL32  | ShowVariations () const
If TRUE, then showing line variations is enabled. More...
bool  | UseActiveLayerLinetype () const
 Public Attributes
CRhinoObjRef  | m_objref [2]
 Protected Attributes
BOOL32  | m_bAcceptZeroLengthLine
[in] More...
BOOL32  | m_bBothSides
BOOL32  | m_bEnableBothSidesOption
BOOL32  | m_bHaveStartPoint
BOOL32  | m_bIgnoreTrims
BOOL32  | m_bShowVariations
ON_Color  | m_dynamic_line_color
[in] color to use when drawing dynamic line while getting end point More...
ON_wString  | m_first_point_prompt
[in] prompt when getting start point More...
double  | m_fixed_length
int  | m_LineMode
ON_wString  | m_midpoint_prompt
[in] prompt when getting midpoint More...
ON_wString  | m_second_point_prompt
[in] prompt when getting end point More...
ON_3dPoint  | m_start_point
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: CArgsRhinoGetLine is used to pass input to RhinoGetLine().
Member Enumeration Documentation
◆ eLineMode
 enum CArgsRhinoGetLine::eLineMode
Enumerator
two_point
surface_normal
angled
vertical
four_point
bisector
perpendicular
tangent
curve_end
cpnormalvector
added 23 Aug 2011 - Lowell - to enable picking 1 point and pressing enter to use cplane normal direction
Constructor & Destructor Documentation
◆ CArgsRhinoGetLine() [1/2]
 CArgsRhinoGetLine::CArgsRhinoGetLine  |  ( |   | )
◆ ~CArgsRhinoGetLine()
 CArgsRhinoGetLine::~CArgsRhinoGetLine  |  ( |   | )
◆ CArgsRhinoGetLine() [2/2]
 CArgsRhinoGetLine::CArgsRhinoGetLine  |  ( |  const CArgsRhinoGetLine &  |   | )
Member Function Documentation
◆ AcceptZeroLengthLine()
 BOOL32 CArgsRhinoGetLine::AcceptZeroLengthLine  |  ( |   | ) |   const
Description: Controls whither or not a zero length line is acceptable. The default is to require the user to keep picking the end point until we get a point different than the start point. See Also: CArgsRhinoGetLine::EnableAcceptZeroLengthLine
◆ EnableAcceptZeroLengthLine()
 void CArgsRhinoGetLine::EnableAcceptZeroLengthLine  |  ( |  BOOL32  |   = TRUE | )
Description: Controls whither or not a zero length line is acceptable. The default is to require the user to keep picking the end point until we get a point different than the start point. See Also: CArgsRhinoGetLine::AcceptZeroLengthLine
◆ EnableFromMidPoint()
 void CArgsRhinoGetLine::EnableFromMidPoint  |  ( |  BOOL32  |   = TRUE | )
If TRUE, then the user picks the midpoint and endpoint.
◆ EnableFromMidPointOption()
 void CArgsRhinoGetLine::EnableFromMidPointOption  |  ( |  BOOL32  |   = TRUE | )
If TRUE, then the "BothSides" option shows up when the start point is inteactively picked.
◆ EnableShowVariations()
 void CArgsRhinoGetLine::EnableShowVariations  |  ( |  BOOL32  |   = FALSE | )
If TRUE, then the all line variations are shown if the default line mode is used.
◆ FeedbackColor()
 ON_Color CArgsRhinoGetLine::FeedbackColor  |  ( |   | ) |   const
Description: If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used. Returns: TRUE if line feedback color has been set. See Also: CArgsRhinoGetLine::HaveFeedbackColor CArgsRhinoGetLine::FeedbackColor
◆ FirstPoint()
 const ON_3dPoint* CArgsRhinoGetLine::FirstPoint  |  ( |   | ) |   const
If FirstPoint() returns NULL, then the user interactively picks the starting point. If FirstPoint() is not NULL, then that point is used as the first point.
◆ FirstPointPrompt()
 const wchar_t* CArgsRhinoGetLine::FirstPointPrompt  |  ( |   | ) |   const
prompt when getting first point
◆ FromMidPoint()
 BOOL32 CArgsRhinoGetLine::FromMidPoint  |  ( |   | ) |   const
If TRUE, then the user picked the midpoint and endpoint.
◆ HaveFeedbackColor()
 BOOL32 CArgsRhinoGetLine::HaveFeedbackColor  |  ( |   | ) |   const
Description: If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used. Returns: TRUE if line feedback color has been set. See Also: CArgsRhinoGetLine::SetFeedbackColor CArgsRhinoGetLine::FeedbackColor
◆ IgnoreTrims()
 BOOL32 CArgsRhinoGetLine::IgnoreTrims  |  ( |   | )
The current ignore trims state.
◆ Length()
 double CArgsRhinoGetLine::Length  |  ( |   | ) |   const
If Length() > 0, the line must have the specified length.
◆ LineMode()
 int CArgsRhinoGetLine::LineMode  |  ( |   | ) |   const
The current line mode.
◆ MidPointOption()
 BOOL32 CArgsRhinoGetLine::MidPointOption  |  ( |   | ) |   const
◆ MidPointPrompt()
 const wchar_t* CArgsRhinoGetLine::MidPointPrompt  |  ( |   | ) |   const
prompt when getting midpoint
◆ operator=()
 CArgsRhinoGetLine& CArgsRhinoGetLine::operator=  |  ( |  const CArgsRhinoGetLine &  |   | )
◆ SecondPointPrompt()
 const wchar_t* CArgsRhinoGetLine::SecondPointPrompt  |  ( |   | ) |   const
prompt when getting second point
◆ SetFeedbackColor()
 void CArgsRhinoGetLine::SetFeedbackColor  |  ( |  COLORREF  |   | )
Description: If set, the feedback color is used to draw the dynamic line when the second point is begin picked. If not set, the active layer color is used. Returns: TRUE if line feedback color has been set. See Also: CArgsRhinoGetLine::HaveFeedbackColor CArgsRhinoGetLine::FeedbackColor
◆ SetFirstPoint()
 void CArgsRhinoGetLine::SetFirstPoint  |  ( |  const ON_3dPoint &  |   | )
Use SetFirstPoint() to specify the line's starting point and skip the start point interactive picking.
◆ SetFirstPointPrompt()
 void CArgsRhinoGetLine::SetFirstPointPrompt  |  ( |  const wchar_t *  |   | )
◆ SetIgnoreTrims()
 void CArgsRhinoGetLine::SetIgnoreTrims  |  ( |  BOOL32  |   = TRUE | )
Makes point picker ignore trims on trimmed surface when mode is surface_normal.
◆ SetLength()
 void CArgsRhinoGetLine::SetLength  |  ( |  double  |   | )
If the line should have a fixed length, set that length here.
◆ SetLineMode()
 void CArgsRhinoGetLine::SetLineMode  |  ( |  int  |   = CArgsRhinoGetLine::two_point | )
Set current line mode.
◆ SetMidPointPrompt()
 void CArgsRhinoGetLine::SetMidPointPrompt  |  ( |  const wchar_t *  |   | )
◆ SetSecondPointPrompt()
 void CArgsRhinoGetLine::SetSecondPointPrompt  |  ( |  const wchar_t *  |   | )
◆ SetUseActiveLayerLinetype()
 void CArgsRhinoGetLine::SetUseActiveLayerLinetype  |  ( |  bool  |  on | )
When true the linetype of the active layer is used for dynamic drawing.
◆ ShowVariations()
 BOOL32 CArgsRhinoGetLine::ShowVariations  |  ( |   | ) |   const
If TRUE, then showing line variations is enabled.
◆ UseActiveLayerLinetype()
 bool CArgsRhinoGetLine::UseActiveLayerLinetype  |  ( |   | ) |   const
Member Data Documentation
◆ m_bAcceptZeroLengthLine
 BOOL32 CArgsRhinoGetLine::m_bAcceptZeroLengthLine
protected
[in]
◆ m_bBothSides
 BOOL32 CArgsRhinoGetLine::m_bBothSides
protected
[in/out] If m_bFromMidpoint is TRUE, then the user picked the midpoint and endpoint
◆ m_bEnableBothSidesOption
 BOOL32 CArgsRhinoGetLine::m_bEnableBothSidesOption
protected
◆ m_bHaveStartPoint
 BOOL32 CArgsRhinoGetLine::m_bHaveStartPoint
protected
◆ m_bIgnoreTrims
 BOOL32 CArgsRhinoGetLine::m_bIgnoreTrims
protected
◆ m_bShowVariations
 BOOL32 CArgsRhinoGetLine::m_bShowVariations
protected
◆ m_dynamic_line_color
 ON_Color CArgsRhinoGetLine::m_dynamic_line_color
protected
[in] color to use when drawing dynamic line while getting end point
◆ m_first_point_prompt
 ON_wString CArgsRhinoGetLine::m_first_point_prompt
protected
[in] prompt when getting start point
◆ m_fixed_length
 double CArgsRhinoGetLine::m_fixed_length
protected
◆ m_LineMode
 int CArgsRhinoGetLine::m_LineMode
protected
◆ m_midpoint_prompt
 ON_wString CArgsRhinoGetLine::m_midpoint_prompt
protected
[in] prompt when getting midpoint
◆ m_objref
 CRhinoObjRef CArgsRhinoGetLine::m_objref[2]
RhinoGetLine() returns GetPoint object references to picked points here.
◆ m_second_point_prompt
 ON_wString CArgsRhinoGetLine::m_second_point_prompt
protected
[in] prompt when getting end point
◆ m_start_point
 ON_3dPoint CArgsRhinoGetLine::m_start_point
protected
[in] If m_bHaveStartPoint is TRUE, then m_start_point is used as the starting point and the