Public Types | Public Member Functions | Friends | List of all members
CRhinoUiDirDialog Class Reference
RhinoUI
CRhinoUiDirDialog dialog. More...
#include <RhinoSdkUiDirDialog.h>
 Public Types
enum  | ErrorCodes { eFolderDoesNotExist, eInvalidPath, eCreatePath, force_32bit_error_codes = 0xFFFFFFFF }
 Public Member Functions
CRhinoUiDirDialog (LPCTSTR lpszCaption=NULL, LPCTSTR lpszTitle=NULL, LPCTSTR lpszInitialPath=NULL, CWnd *pParent=NULL)
Construction. More...
virtual  | ~CRhinoUiDirDialog ()
virtual int  | DoModal ()
virtual int  | ErrorMessage (ErrorCodes ec, LPCTSTR lpsFileName) const
Override the following to localize error messages. More...
CString  | GetPathName ()
 Friends
class  | CRhinoUiDialogSub
Detailed Description
CRhinoUiDirDialog dialog.
Member Enumeration Documentation
◆ ErrorCodes
 enum CRhinoUiDirDialog::ErrorCodes
Enumerator
eFolderDoesNotExist
eInvalidPath
eCreatePath
return IDYES to create folder
force_32bit_error_codes
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiDirDialog()
 CRhinoUiDirDialog::CRhinoUiDirDialog  |  ( |  LPCTSTR  |  lpszCaption = NULL,
|  LPCTSTR  |  lpszTitle = NULL,
|  LPCTSTR  |  lpszInitialPath = NULL,
|  CWnd *  |  pParent = NULL
)
Construction.
◆ ~CRhinoUiDirDialog()
 virtual CRhinoUiDirDialog::~CRhinoUiDirDialog  |  ( |   | )
virtual
Member Function Documentation
◆ DoModal()
 virtual int CRhinoUiDirDialog::DoModal  |  ( |   | )
virtual
◆ ErrorMessage()
 virtual int CRhinoUiDirDialog::ErrorMessage  |  ( |  ErrorCodes  |  ec,
|  LPCTSTR  |  lpsFileName
) |   |  const
virtual
Override the following to localize error messages.
◆ GetPathName()
 CString CRhinoUiDirDialog::GetPathName  |  ( |   | )
Friends And Related Function Documentation
◆ CRhinoUiDialogSub
 friend class CRhinoUiDialogSub
friend