Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_HistoryRecord Class Reference
OpenNURBS
#include <opennurbs_object_history.h>
 Inheritance diagram for ON_HistoryRecord:
 Public Types
enum  | RECORD_TYPE : unsigned int { RECORD_TYPE::history_parameters = 0, RECORD_TYPE::feature_parameters = 1 }
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
ON_HistoryRecord () ON_NOEXCEPT
ON_HistoryRecord (const ON_HistoryRecord &src)
~ON_HistoryRecord ()
bool  | CopyOnReplaceObject () const
void  | DestroyValue (int value_id)
void  | Dump (ON_TextLog &) const override
bool  | GetBoolValue (int value_id, bool *b) const
int  | GetBoolValues (int value_id, ON_SimpleArray< bool > &) const
bool  | GetBrepValue (int value_id, const ON_Brep *&) const
bool  | GetColorValue (int value_id, ON_Color *color) const
int  | GetColorValues (int value_id, ON_SimpleArray< ON_Color > &) const
bool  | GetCurveValue (int value_id, const ON_Curve *&) const
bool  | GetDoubleValue (int value_id, double *number) const
int  | GetDoubleValues (int value_id, ON_SimpleArray< double > &) const
bool  | GetGeometryValue (int value_id, const ON_Geometry *&) const
int  | GetGeometryValues (int value_id, ON_SimpleArray< const ON_Geometry * > &) const
bool  | GetIntValue (int value_id, int *i) const
int  | GetIntValues (int value_id, ON_SimpleArray< int > &) const
bool  | GetMeshValue (int value_id, const ON_Mesh *&) const
bool  | GetObjRefValue (int value_id, ON_ObjRef &oref) const
int  | GetObjRefValues (int value_id, ON_ClassArray< ON_ObjRef > &objects) const
bool  | GetPointOnObjectValue (int value_id, ON_ObjRef &oref) const
bool  | GetPointValue (int value_id, ON_3dPoint &point) const
int  | GetPointValues (int value_id, ON_SimpleArray< ON_3dPoint > &) const
bool  | GetPolyEdgeValue (int value_id, const ON_PolyEdgeHistory *&polyedge) const
int  | GetPolyEdgeValues (int value_id, ON_SimpleArray< const ON_PolyEdgeHistory * > &) const
bool  | GetStringValue (int value_id, ON_wString &str) const
int  | GetStringValues (int value_id, ON_ClassArray< ON_wString > &string) const
bool  | GetSubDEdgeChainValue (int value_id, const ON_SubDEdgeChain *&edge_chain) const
int  | GetSubDEdgeChainValues (int value_id, ON_SimpleArray< const ON_SubDEdgeChain * > &edge_chains) const
bool  | GetSurfaceValue (int value_id, const ON_Surface *&) const
bool  | GetUuidValue (int value_id, ON_UUID *uuid) const
int  | GetUuidValues (int value_id, ON_SimpleArray< ON_UUID > &) const
bool  | GetVectorValue (int value_id, ON_3dVector &point) const
int  | GetVectorValues (int value_id, ON_SimpleArray< ON_3dVector > &) const
bool  | GetXformValue (int value_id, ON_Xform &point) const
int  | GetXformValues (int value_id, ON_SimpleArray< ON_Xform > &) const
bool  | IsAntecedent (ON_UUID object_uuid) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_HistoryRecord &  | operator= (const ON_HistoryRecord &src)
bool  | Read (ON_BinaryArchive &binary_archive) override
void  | RemapObjectIds (const ON_SimpleArray< ON_UuidPair > &uuid_remap)
bool  | SetBoolValue (int value_id, bool b)
bool  | SetBoolValues (int value_id, int count, const bool *b)
bool  | SetColorValue (int value_id, ON_Color c)
bool  | SetColorValues (int value_id, int count, const ON_Color *c)
void  | SetCopyOnReplaceObject (bool bCopyOnReplaceObject)
bool  | SetDoubleValue (int value_id, double x)
bool  | SetDoubleValues (int value_id, int count, const double *x)
bool  | SetGeometryValue (int value_id, ON_Geometry *g)
bool  | SetGeometryValues (int value_id, const ON_SimpleArray< ON_Geometry * > a)
bool  | SetIntValue (int value_id, int i)
bool  | SetIntValues (int value_id, int count, const int *i)
bool  | SetObjRefValue (int value_id, const ON_ObjRef &oref)
bool  | SetObjRefValues (int value_id, int count, const ON_ObjRef *oref)
bool  | SetPointOnObjectValue (int value_id, const ON_ObjRef &oref, ON_3dPoint point)
bool  | SetPointValue (int value_id, ON_3dPoint p)
bool  | SetPointValues (int value_id, int count, const ON_3dPoint *P)
bool  | SetPolyEdgeValue (int value_id, const ON_PolyEdgeHistory &polyedge)
bool  | SetPolyEdgeValues (int value_id, int count, const ON_PolyEdgeHistory *a)
bool  | SetStringValue (int value_id, const wchar_t *s)
bool  | SetStringValues (int value_id, const ON_ClassArray< ON_wString > &s)
bool  | SetStringValues (int value_id, int count, const wchar_t *const *s)
bool  | SetSubDEdgeChainValue (int value_id, const ON_SubDEdgeChain &edge_chain)
bool  | SetSubDEdgeChainValues (int value_id, const ON_ClassArray< ON_SubDEdgeChain > &edge_chains)
bool  | SetSubDEdgeChainValues (int value_id, const ON_SimpleArray< const ON_SubDEdgeChain * > &edge_chains)
bool  | SetUuidValue (int value_id, ON_UUID uuid)
bool  | SetUuidValues (int value_id, int count, const ON_UUID *u)
bool  | SetVectorValue (int value_id, ON_3dVector v)
bool  | SetVectorValues (int value_id, int count, const ON_3dVector *V)
bool  | SetXformValue (int value_id, ON_Xform xform)
bool  | SetXformValues (int value_id, int count, const ON_Xform *xform)
int  | ValueReport (ON_TextLog &text_log) const
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static ON_HistoryRecord::RECORD_TYPE  | RecordType (int i)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Public Attributes
ON_UuidList  | m_antecedents
ON_UUID  | m_command_id = ON_nil_uuid
ON_UuidList  | m_descendants
RECORD_TYPE  | m_record_type = ON_HistoryRecord::RECORD_TYPE::history_parameters
ON_SimpleArray< class ON_Value * >  | m_value
int  | m_version = 0
 Static Public Attributes
static const ON_HistoryRecord  | Empty
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Member Enumeration Documentation
◆ RECORD_TYPE
 enum ON_HistoryRecord::RECORD_TYPE : unsigned int
strong
Enumerator
history_parameters
parameters for UpdateHistory
feature_parameters
parameters for a feature
Constructor & Destructor Documentation
◆ ON_HistoryRecord() [1/2]
 ON_HistoryRecord::ON_HistoryRecord  |  ( |   | )
◆ ~ON_HistoryRecord()
 ON_HistoryRecord::~ON_HistoryRecord  |  ( |   | )
◆ ON_HistoryRecord() [2/2]
 ON_HistoryRecord::ON_HistoryRecord  |  ( |  const ON_HistoryRecord &  |  src | )
Member Function Documentation
◆ CopyOnReplaceObject()
 bool ON_HistoryRecord::CopyOnReplaceObject  |  ( |   | ) |   const
12 May, 2015 - Lowell When an object is replaced and the old object has a history record with CopyOnReplaceObject() set to tru, then history record is copied and attached to the new object. That allows a descendant object to continue the history linkage after it is edited.
 See http://mcneel.myjetbrains.com/youtrack/issue/RH-30399
◆ DestroyValue()
 void ON_HistoryRecord::DestroyValue  |  ( |  int  |  value_id | )
◆ Dump()
 void ON_HistoryRecord::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
Description: Creates a text dump of the object. Remarks: Dump() is intended for debugging and is not suitable for creating high quality text descriptions of an object.
The default implementations of this virtual function prints the class's name.
Reimplemented from ON_ModelComponent.
◆ GetBoolValue()
 bool ON_HistoryRecord::GetBoolValue  |  ( |  int  |  value_id,
|  bool *  |  b
) |   |  const
◆ GetBoolValues()
 int ON_HistoryRecord::GetBoolValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< bool > &
) |   |  const
◆ GetBrepValue()
 bool ON_HistoryRecord::GetBrepValue  |  ( |  int  |  value_id,
|  const ON_Brep *&
) |   |  const
◆ GetColorValue()
 bool ON_HistoryRecord::GetColorValue  |  ( |  int  |  value_id,
|  ON_Color *  |  color
) |   |  const
◆ GetColorValues()
 int ON_HistoryRecord::GetColorValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< ON_Color > &
) |   |  const
◆ GetCurveValue()
 bool ON_HistoryRecord::GetCurveValue  |  ( |  int  |  value_id,
|  const ON_Curve *&
) |   |  const
◆ GetDoubleValue()
 bool ON_HistoryRecord::GetDoubleValue  |  ( |  int  |  value_id,
|  double *  |  number
) |   |  const
◆ GetDoubleValues()
 int ON_HistoryRecord::GetDoubleValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< double > &
) |   |  const
◆ GetGeometryValue()
 bool ON_HistoryRecord::GetGeometryValue  |  ( |  int  |  value_id,
|  const ON_Geometry *&
) |   |  const
◆ GetGeometryValues()
 int ON_HistoryRecord::GetGeometryValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< const ON_Geometry * > &
) |   |  const
◆ GetIntValue()
 bool ON_HistoryRecord::GetIntValue  |  ( |  int  |  value_id,
|  int *  |  i
) |   |  const
◆ GetIntValues()
 int ON_HistoryRecord::GetIntValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< int > &
) |   |  const
◆ GetMeshValue()
 bool ON_HistoryRecord::GetMeshValue  |  ( |  int  |  value_id,
|  const ON_Mesh *&
) |   |  const
◆ GetObjRefValue()
 bool ON_HistoryRecord::GetObjRefValue  |  ( |  int  |  value_id,
|  ON_ObjRef &  |  oref
) |   |  const
◆ GetObjRefValues()
 int ON_HistoryRecord::GetObjRefValues  |  ( |  int  |  value_id,
|  ON_ClassArray< ON_ObjRef > &  |  objects
) |   |  const
◆ GetPointOnObjectValue()
 bool ON_HistoryRecord::GetPointOnObjectValue  |  ( |  int  |  value_id,
|  ON_ObjRef &  |  oref
) |   |  const
◆ GetPointValue()
 bool ON_HistoryRecord::GetPointValue  |  ( |  int  |  value_id,
|  ON_3dPoint &  |  point
) |   |  const
◆ GetPointValues()
 int ON_HistoryRecord::GetPointValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< ON_3dPoint > &
) |   |  const
◆ GetPolyEdgeValue()
 bool ON_HistoryRecord::GetPolyEdgeValue  |  ( |  int  |  value_id,
|  const ON_PolyEdgeHistory *&  |  polyedge
) |   |  const
◆ GetPolyEdgeValues()
 int ON_HistoryRecord::GetPolyEdgeValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< const ON_PolyEdgeHistory * > &
) |   |  const
◆ GetStringValue()
 bool ON_HistoryRecord::GetStringValue  |  ( |  int  |  value_id,
|  ON_wString &  |  str
) |   |  const
Description: For retrieving values.
◆ GetStringValues()
 int ON_HistoryRecord::GetStringValues  |  ( |  int  |  value_id,
|  ON_ClassArray< ON_wString > &  |  string
) |   |  const
◆ GetSubDEdgeChainValue()
 bool ON_HistoryRecord::GetSubDEdgeChainValue  |  ( |  int  |  value_id,
|  const ON_SubDEdgeChain *&  |  edge_chain
) |   |  const
◆ GetSubDEdgeChainValues()
 int ON_HistoryRecord::GetSubDEdgeChainValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< const ON_SubDEdgeChain * > &  |  edge_chains
) |   |  const
◆ GetSurfaceValue()
 bool ON_HistoryRecord::GetSurfaceValue  |  ( |  int  |  value_id,
|  const ON_Surface *&
) |   |  const
◆ GetUuidValue()
 bool ON_HistoryRecord::GetUuidValue  |  ( |  int  |  value_id,
|  ON_UUID *  |  uuid
) |   |  const
◆ GetUuidValues()
 int ON_HistoryRecord::GetUuidValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< ON_UUID > &
) |   |  const
◆ GetVectorValue()
 bool ON_HistoryRecord::GetVectorValue  |  ( |  int  |  value_id,
|  ON_3dVector &  |  point
) |   |  const
◆ GetVectorValues()
 int ON_HistoryRecord::GetVectorValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< ON_3dVector > &
) |   |  const
◆ GetXformValue()
 bool ON_HistoryRecord::GetXformValue  |  ( |  int  |  value_id,
|  ON_Xform &  |  point
) |   |  const
◆ GetXformValues()
 int ON_HistoryRecord::GetXformValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< ON_Xform > &
) |   |  const
◆ IsAntecedent()
 bool ON_HistoryRecord::IsAntecedent  |  ( |  ON_UUID  |  object_uuid | ) |   const
Description: Determine if object is an antecedent (input) in this history record. Parameters: object_uuid - [in] Returns: Returns true if object_uuid is the id of an input object.
◆ IsValid()
 bool ON_HistoryRecord::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_ModelComponent.
◆ operator=()
 ON_HistoryRecord& ON_HistoryRecord::operator=  |  ( |  const ON_HistoryRecord &  |  src | )
◆ Read()
 bool ON_HistoryRecord::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ RecordType()
 static ON_HistoryRecord::RECORD_TYPE ON_HistoryRecord::RecordType  |  ( |  int  |  i | )
static
Description: Convert integer into an ON_HistoryRecord::RECORD_TYPE. Parameters: i - [in] Returns: ON_HistoryRecord::RECORD_TYPE enum with same value as i.
◆ RemapObjectIds()
 void ON_HistoryRecord::RemapObjectIds  |  ( |  const ON_SimpleArray< ON_UuidPair > &  |  uuid_remap | )
Description: This tool is used in rare situations when the object ids stored in the uuid list need to be remapped. Parameters: uuid_remap - [in] Is it critical that uuid_remap[] be sorted with respect to ON_UuidPair::CompareFirstUuid.
◆ SetBoolValue()
 bool ON_HistoryRecord::SetBoolValue  |  ( |  int  |  value_id,
|  bool  |  b
)
Description: For setting values. Parameters: value_id - [in] If there a value with the same input id exists, the old value is replaced. count - [in] Number of values b - [in] array of count bools i - [in] array of count ints x - [in] array of count doubles p - [in] array of count 3d points v - [in] array of count 3d vectors xform - [in] array of count xforms c - [in] array of count colors or - [in] array of count object references g - [in] array of count geometry pointers u - [in] array of uuids s - [in] string
◆ SetBoolValues()
 bool ON_HistoryRecord::SetBoolValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const bool *  |  b
)
Description: For setting values. Parameters: value_id - [in] If there a value with the same input id exists, the old value is replaced. count - [in] Number of values b - [in] array of count bools i - [in] array of count ints x - [in] array of count doubles P - [in] array of count 3d points V - [in] array of count 3d vectors xform - [in] array of count xforms c - [in] array of count colors or - [in] array of count object references g - [in] array of count geometry pointers u - [in] array of uuids s - [in] array of strings
◆ SetColorValue()
 bool ON_HistoryRecord::SetColorValue  |  ( |  int  |  value_id,
|  ON_Color  |  c
)
◆ SetColorValues()
 bool ON_HistoryRecord::SetColorValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_Color *  |  c
)
◆ SetCopyOnReplaceObject()
 void ON_HistoryRecord::SetCopyOnReplaceObject  |  ( |  bool  |  bCopyOnReplaceObject | )
◆ SetDoubleValue()
 bool ON_HistoryRecord::SetDoubleValue  |  ( |  int  |  value_id,
|  double  |  x
)
◆ SetDoubleValues()
 bool ON_HistoryRecord::SetDoubleValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const double *  |  x
)
◆ SetGeometryValue()
 bool ON_HistoryRecord::SetGeometryValue  |  ( |  int  |  value_id,
|  ON_Geometry *  |  g
)
◆ SetGeometryValues()
 bool ON_HistoryRecord::SetGeometryValues  |  ( |  int  |  value_id,
|  const ON_SimpleArray< ON_Geometry * >  |  a
)
◆ SetIntValue()
 bool ON_HistoryRecord::SetIntValue  |  ( |  int  |  value_id,
|  int  |  i
)
◆ SetIntValues()
 bool ON_HistoryRecord::SetIntValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const int *  |  i
)
◆ SetObjRefValue()
 bool ON_HistoryRecord::SetObjRefValue  |  ( |  int  |  value_id,
|  const ON_ObjRef &  |  oref
)
◆ SetObjRefValues()
 bool ON_HistoryRecord::SetObjRefValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_ObjRef *  |  oref
)
◆ SetPointOnObjectValue()
 bool ON_HistoryRecord::SetPointOnObjectValue  |  ( |  int  |  value_id,
|  const ON_ObjRef &  |  oref,
|  ON_3dPoint  |  point
)
◆ SetPointValue()
 bool ON_HistoryRecord::SetPointValue  |  ( |  int  |  value_id,
|  ON_3dPoint  |  p
)
◆ SetPointValues()
 bool ON_HistoryRecord::SetPointValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_3dPoint *  |  P
)
◆ SetPolyEdgeValue()
 bool ON_HistoryRecord::SetPolyEdgeValue  |  ( |  int  |  value_id,
|  const ON_PolyEdgeHistory &  |  polyedge
)
◆ SetPolyEdgeValues()
 bool ON_HistoryRecord::SetPolyEdgeValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_PolyEdgeHistory *  |  a
)
◆ SetStringValue()
 bool ON_HistoryRecord::SetStringValue  |  ( |  int  |  value_id,
|  const wchar_t *  |  s
)
◆ SetStringValues() [1/2]
 bool ON_HistoryRecord::SetStringValues  |  ( |  int  |  value_id,
|  const ON_ClassArray< ON_wString > &  |  s
)
◆ SetStringValues() [2/2]
 bool ON_HistoryRecord::SetStringValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const wchar_t *const *  |  s
)
◆ SetSubDEdgeChainValue()
 bool ON_HistoryRecord::SetSubDEdgeChainValue  |  ( |  int  |  value_id,
|  const ON_SubDEdgeChain &  |  edge_chain
)
Parameters: edge_chain - [in] edge_chain.PersistentSubDId() must be non-nil and identify the parent subd in the model. If the model is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If the model is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
◆ SetSubDEdgeChainValues() [1/2]
 bool ON_HistoryRecord::SetSubDEdgeChainValues  |  ( |  int  |  value_id,
|  const ON_ClassArray< ON_SubDEdgeChain > &  |  edge_chains
)
Parameters: edge_chain - [in] edge_chain.PersistentSubDId() must be non-nil and identify the parent subd in the model. If the model is an ONX_Model, then the persistent id is the ON_ModelGeometryComponent.Id(). If the model is a CRhinoDoc, then the persistent id is CRhinoObject.ModelObjectId().
◆ SetSubDEdgeChainValues() [2/2]
 bool ON_HistoryRecord::SetSubDEdgeChainValues  |  ( |  int  |  value_id,
|  const ON_SimpleArray< const ON_SubDEdgeChain * > &  |  edge_chains
)
◆ SetUuidValue()
 bool ON_HistoryRecord::SetUuidValue  |  ( |  int  |  value_id,
|  ON_UUID  |  uuid
)
◆ SetUuidValues()
 bool ON_HistoryRecord::SetUuidValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_UUID *  |  u
)
◆ SetVectorValue()
 bool ON_HistoryRecord::SetVectorValue  |  ( |  int  |  value_id,
|  ON_3dVector  |  v
)
◆ SetVectorValues()
 bool ON_HistoryRecord::SetVectorValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_3dVector *  |  V
)
◆ SetXformValue()
 bool ON_HistoryRecord::SetXformValue  |  ( |  int  |  value_id,
|  ON_Xform  |  xform
)
◆ SetXformValues()
 bool ON_HistoryRecord::SetXformValues  |  ( |  int  |  value_id,
|  int  |  count,
|  const ON_Xform *  |  xform
)
◆ ValueReport()
 int ON_HistoryRecord::ValueReport  |  ( |  ON_TextLog &  |  text_log | ) |   const
Description: Print a list of the values in text_log. Parameters: text_log - [in] Returns: Number of values listed.
◆ Write()
 bool ON_HistoryRecord::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ Empty
 const ON_HistoryRecord ON_HistoryRecord::Empty
static
◆ m_antecedents
 ON_UuidList ON_HistoryRecord::m_antecedents
List of object id values of antecedent objects that are referenced in the list of input events in m_value[]. These were the command's "input" objects.
◆ m_command_id
 ON_UUID ON_HistoryRecord::m_command_id = ON_nil_uuid
CRhinoCommand::CommandId() value of the command that created this history record. Each time the command is run, it can create a history record.
◆ m_descendants
 ON_UuidList ON_HistoryRecord::m_descendants
List of object id values of descendant objects that were created. These were the command's "output" objects
◆ m_record_type
 RECORD_TYPE ON_HistoryRecord::m_record_type = ON_HistoryRecord::RECORD_TYPE::history_parameters
◆ m_value
 ON_SimpleArray< class ON_Value* > ON_HistoryRecord::m_value
Information needed to update the descendant objects when an antecedent object is modified.
◆ m_version
 int ON_HistoryRecord::m_version = 0
A YYYYMMDDn version number that gets updated when a command changes. This version is checked so that new versions of a command's ReplayHistory don't attempt to use information saved in old files.