Public Member Functions | Protected Attributes | List of all members
CArgsRhinoGetFrame Class Reference
RhinoGet
#include <rhinoSdkGetFrame.h>
 Public Member Functions
CArgsRhinoGetFrame ()
CArgsRhinoGetFrame (const CArgsRhinoGetFrame &src)
~CArgsRhinoGetFrame ()
ON_Plane &  | Frame () const
const wchar_t *  | FramePrompt () const
prompt when dragging the frame on the object More...
BOOL32  | HaveObjectOn () const
ON_Object *  | ObjectOn () const
Set or get the object on which the frame will be gotten. More...
const wchar_t *  | ObjectPrompt () const
prompt when the object on which the frame is gotten More...
CArgsRhinoGetFrame &  | operator= (const CArgsRhinoGetFrame &src)
void  | SetFramePrompt (const wchar_t *prompt)
void  | SetObjectOn (ON_Object *pObj)
void  | SetObjectPrompt (const wchar_t *prompt)
 Protected Attributes
ON_Color  | m_dynamic_line_color
[in] color to use when drawing dynamic lines while getting the frame More...
ON_Plane  | m_frame
[out] Return the frame More...
ON_wString  | m_frame_prompt
[in] prompt when getting frame More...
ON_wString  | m_object_prompt
[in] prompt when getting object on which the frame will be More...
ON_Object *  | m_pObject
[in/out] Object on which the frame is gotten More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. CLASS CArgsRhinoGetPlane Input to the RhinoGetFrame() function
Constructor & Destructor Documentation
◆ CArgsRhinoGetFrame() [1/2]
 CArgsRhinoGetFrame::CArgsRhinoGetFrame  |  ( |   | )
◆ ~CArgsRhinoGetFrame()
 CArgsRhinoGetFrame::~CArgsRhinoGetFrame  |  ( |   | )
◆ CArgsRhinoGetFrame() [2/2]
 CArgsRhinoGetFrame::CArgsRhinoGetFrame  |  ( |  const CArgsRhinoGetFrame &  |  src | )
Member Function Documentation
◆ Frame()
 ON_Plane& CArgsRhinoGetFrame::Frame  |  ( |   | ) |   const
◆ FramePrompt()
 const wchar_t* CArgsRhinoGetFrame::FramePrompt  |  ( |   | ) |   const
prompt when dragging the frame on the object
◆ HaveObjectOn()
 BOOL32 CArgsRhinoGetFrame::HaveObjectOn  |  ( |   | ) |   const
◆ ObjectOn()
 ON_Object* CArgsRhinoGetFrame::ObjectOn  |  ( |   | ) |   const
Set or get the object on which the frame will be gotten.
◆ ObjectPrompt()
 const wchar_t* CArgsRhinoGetFrame::ObjectPrompt  |  ( |   | ) |   const
prompt when the object on which the frame is gotten
◆ operator=()
 CArgsRhinoGetFrame& CArgsRhinoGetFrame::operator=  |  ( |  const CArgsRhinoGetFrame &  |  src | )
◆ SetFramePrompt()
 void CArgsRhinoGetFrame::SetFramePrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetObjectOn()
 void CArgsRhinoGetFrame::SetObjectOn  |  ( |  ON_Object *  |  pObj | )
◆ SetObjectPrompt()
 void CArgsRhinoGetFrame::SetObjectPrompt  |  ( |  const wchar_t *  |  prompt | )
Member Data Documentation
◆ m_dynamic_line_color
 ON_Color CArgsRhinoGetFrame::m_dynamic_line_color
protected
[in] color to use when drawing dynamic lines while getting the frame
◆ m_frame
 ON_Plane CArgsRhinoGetFrame::m_frame
protected
[out] Return the frame
◆ m_frame_prompt
 ON_wString CArgsRhinoGetFrame::m_frame_prompt
protected
[in] prompt when getting frame
◆ m_object_prompt
 ON_wString CArgsRhinoGetFrame::m_object_prompt
protected
[in] prompt when getting object on which the frame will be
◆ m_pObject
 ON_Object* CArgsRhinoGetFrame::m_pObject
protected
[in/out] Object on which the frame is gotten