Public Member Functions | List of all members
CRhinoDrawFancyAttributes Class Reference
Rhino
#include <rhinoSdkDraw.h>
 Public Member Functions
CRhinoDrawFancyAttributes () RHINO_NOEXCEPT
CRhinoDrawFancyAttributes (const CRhinoDrawFancyAttributes &) RHINO_NOEXCEPT
CRhinoDrawFancyAttributes (CRhinoDrawFancyAttributes &&) RHINO_NOEXCEPT
~CRhinoDrawFancyAttributes () RHINO_NOEXCEPT
const ON_Mesh *  | FancyMesh () const RHINO_NOEXCEPT
CRhinoDrawFancyAttributes &  | operator= (const CRhinoDrawFancyAttributes &) RHINO_NOEXCEPT
CRhinoDrawFancyAttributes &  | operator= (CRhinoDrawFancyAttributes &&) RHINO_NOEXCEPT
void  | SetFancyMesh (ON_Mesh *fancy_mesh) RHINO_NOEXCEPT
Constructor & Destructor Documentation
◆ CRhinoDrawFancyAttributes() [1/3]
 CRhinoDrawFancyAttributes::CRhinoDrawFancyAttributes  |  ( |   | )
◆ ~CRhinoDrawFancyAttributes()
 CRhinoDrawFancyAttributes::~CRhinoDrawFancyAttributes  |  ( |   | )
The following are here to demonstrate how to handle parameters that are pointers to classes that need to be managed by this class.
◆ CRhinoDrawFancyAttributes() [2/3]
 CRhinoDrawFancyAttributes::CRhinoDrawFancyAttributes  |  ( |  const CRhinoDrawFancyAttributes &  |   | )
◆ CRhinoDrawFancyAttributes() [3/3]
 CRhinoDrawFancyAttributes::CRhinoDrawFancyAttributes  |  ( |  CRhinoDrawFancyAttributes &&  |   | )
Member Function Documentation
◆ FancyMesh()
 const ON_Mesh* CRhinoDrawFancyAttributes::FancyMesh  |  ( |   | ) |   const
The mesh that is pointed to will be deleted by ~CRhinoDrawFancyAttributes() and any future calls to SetFancyMeshManaged().
◆ operator=() [1/2]
 CRhinoDrawFancyAttributes& CRhinoDrawFancyAttributes::operator=  |  ( |  const CRhinoDrawFancyAttributes &  |   | )
◆ operator=() [2/2]
 CRhinoDrawFancyAttributes& CRhinoDrawFancyAttributes::operator=  |  ( |  CRhinoDrawFancyAttributes &&  |   | )
◆ SetFancyMesh()
 void CRhinoDrawFancyAttributes::SetFancyMesh  |  ( |  ON_Mesh *  |  fancy_mesh | )
fancy_mesh will be managed by this class. It will be deleted by ~CRhinoDrawFancyAttributes() or by any future calls to SetFancyMeshManaged().