Public Member Functions | Public Attributes | List of all members
ON_CageMorph Class Reference
OpenNURBS
#include <opennurbs_nurbssurface.h>
 Inheritance diagram for ON_CageMorph:
 Public Member Functions
ON_CageMorph ()
virtual  | ~ON_CageMorph ()
bool  | IsIdentity (const ON_BoundingBox &bbox) const override
ON_3dPoint  | MorphPoint (ON_3dPoint point) const override
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
const ON_MorphControl *  | m_control
Constructor & Destructor Documentation
◆ ON_CageMorph()
 ON_CageMorph::ON_CageMorph  |  ( |   | )
◆ ~ON_CageMorph()
 virtual ON_CageMorph::~ON_CageMorph  |  ( |   | )
virtual
Member Function Documentation
◆ IsIdentity()
 bool ON_CageMorph::IsIdentity  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
overridevirtual
Description: Provides a quick way to determine if a morph function is the identity (doesn't move the points) on a region of space. Parameters: bbox - [in] region of space to test. Returns: The default always returns false. If you override this function, then return true when every point in the bounding box is fixed by the morph.
Reimplemented from ON_SpaceMorph.
◆ MorphPoint()
 ON_3dPoint ON_CageMorph::MorphPoint  |  ( |  ON_3dPoint  |  point | ) |   const
overridevirtual
Description: Morphs euclidean point. Parameters: point - [in] Returns: Morphed point.
 Remarks: If you are morphing simple objects like points and meshes, then you can simply morph the locations. If you are morphing more complicated objects like NURBS geometry, then your override should pay attention to the values of m_bQuickPreview, m_bPreserveStructure, and m_tolerance.
Implements ON_SpaceMorph.
Member Data Documentation
◆ m_control
 const ON_MorphControl* ON_CageMorph::m_control