Public Member Functions | Public Attributes | List of all members
CRhinoCommandOptionValue Class Reference
Rhino
#include <rhinoSdkCommandOptionName.h>
 Public Member Functions
CRhinoCommandOptionValue ()
Sets both string pointers to NULL. More...
CRhinoCommandOptionValue (const wchar_t *english_option_value, const wchar_t *local_option_value)
 Public Attributes
const wchar_t *  | m_english_option_value
The default copy constructor, destructor, and operator= are sufficient. More...
const wchar_t *  | m_local_option_value
localized command option value (can be NULL if m_english_option_value is set) More...
Detailed Description
Description: CRhinoCommandOptionValue classes are used to pass command toggle option and list option values to CRhinoGet::AddCommandOptionToggle() and CRhinoGet::AddCommandOptionList(). Use the RHCMDOPTVALUE() macro to quickly create these.
Constructor & Destructor Documentation
◆ CRhinoCommandOptionValue() [1/2]
 CRhinoCommandOptionValue::CRhinoCommandOptionValue  |  ( |   | )
Sets both string pointers to NULL.
◆ CRhinoCommandOptionValue() [2/2]
 CRhinoCommandOptionValue::CRhinoCommandOptionValue  |  ( |  const wchar_t *  |  english_option_value,
|  const wchar_t *  |  local_option_value
)
Sets m_english_option_value = english_option_value and m_local_option_value = local__option_value.
Member Data Documentation
◆ m_english_option_value
 const wchar_t* CRhinoCommandOptionValue::m_english_option_value
The default copy constructor, destructor, and operator= are sufficient.
english command option value (can be NULL if m_local_option_value is set)
◆ m_local_option_value
 const wchar_t* CRhinoCommandOptionValue::m_local_option_value
localized command option value (can be NULL if m_english_option_value is set)