Public Member Functions | List of all members
CRhRdkBreadcrumbTaskOrigin Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkBreadcrumbTaskOrigin:
 Public Member Functions
CRhRdkBreadcrumbTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const IRhRdkContentEditingContext &cec, const UUID &uuidInstance)
virtual  | ~CRhRdkBreadcrumbTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const final override
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const final override
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
 Public Member Functions inherited from CRhRdkContextTaskOriginWithCEC
CRhRdkContextTaskOriginWithCEC (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con, const IRhRdkContentEditingContext &cec)
virtual  | ~CRhRdkContextTaskOriginWithCEC ()
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const final override
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const final override
virtual const wchar_t *  | TopLevelKind (void) const final override
virtual UUID  | Uuid (void) const final override
 Public Member Functions inherited from CRhRdkContextTaskOrigin
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkContextTaskOriginWithCEC
const IRhRdkContentEditingContext &  | CEC (void) const
 Protected Attributes inherited from CRhRdkContextTaskOriginWithCEC
CImpl *  | m_pImpl
Detailed Description
Used when task origin is the breadcrumb control.
Constructor & Destructor Documentation
◆ CRhRdkBreadcrumbTaskOrigin()
 CRhRdkBreadcrumbTaskOrigin::CRhRdkBreadcrumbTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con,
|  const IRhRdkContentEditingContext &  |  cec,
|  const UUID &  |  uuidInstance
)
◆ ~CRhRdkBreadcrumbTaskOrigin()
 virtual CRhRdkBreadcrumbTaskOrigin::~CRhRdkBreadcrumbTaskOrigin  |  ( |   | )
virtual
Member Function Documentation
◆ Control()
 virtual IRhRdkTaskCollection::Control CRhRdkBreadcrumbTaskOrigin::Control  |  ( |  void  |   | ) |   const
finaloverridevirtual
Implements CRhRdkTaskOrigin.
◆ GetSelectionImpl()
 virtual void CRhRdkBreadcrumbTaskOrigin::GetSelectionImpl  |  ( |  CRhRdkContentArray &  |  aContentOut | ) |   const
finaloverridevirtual
Implement this to get the contents that have been selected by the user.
Parameters
aContentOut | accepts the selected contents.
Implements CRhRdkTaskOrigin.
◆ SupportsTask()
 virtual bool CRhRdkBreadcrumbTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  task | ) |   const
overridevirtual
Reimplemented from CRhRdkContextTaskOrigin.