Public Member Functions | List of all members
CRhRdkAutomaticUIRow Class Reference
RDK
#include <RhRdkAutomaticUI.h>
 Inheritance diagram for CRhRdkAutomaticUIRow:
 Public Member Functions
CRhRdkAutomaticUIRow ()
virtual  | ~CRhRdkAutomaticUIRow ()
void  | AddTexturingDS (IRhinoUiDataSource &ds)
CRhRdkAutoUIContext *  | AutoUIContext (void) const
const wchar_t *  | ChildSlotName (void) const
const wchar_t *  | DisplayName (void) const
const wchar_t *  | ExtraReqs (void) const
bool  | FromParam (const IRhRdkParamBlock::IParam &param)
bool  | IsEnabled (void) const
const CRhRdkVariant &  | MaxValue (void) const
const CRhRdkVariant &  | MinValue (void) const
const wchar_t *  | ParamName (void) const
void  | SetValue (const CRhRdkVariant &v)
IRhRdkParamBlock::UiHints  | UiHint (void) const
const wchar_t *  | ValidValues (void) const
const CRhRdkVariant &  | Value (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkAutomaticUIRow()
 CRhRdkAutomaticUIRow::CRhRdkAutomaticUIRow  |  ( |   | )
◆ ~CRhRdkAutomaticUIRow()
 virtual CRhRdkAutomaticUIRow::~CRhRdkAutomaticUIRow  |  ( |   | )
virtual
Member Function Documentation
◆ AddTexturingDS()
 void CRhRdkAutomaticUIRow::AddTexturingDS  |  ( |  IRhinoUiDataSource &  |  ds | )
◆ AutoUIContext()
 CRhRdkAutoUIContext* CRhRdkAutomaticUIRow::AutoUIContext  |  ( |  void  |   | ) |   const
◆ ChildSlotName()
 const wchar_t* CRhRdkAutomaticUIRow::ChildSlotName  |  ( |  void  |   | ) |   const
◆ DisplayName()
 const wchar_t* CRhRdkAutomaticUIRow::DisplayName  |  ( |  void  |   | ) |   const
◆ ExtraReqs()
 const wchar_t* CRhRdkAutomaticUIRow::ExtraReqs  |  ( |  void  |   | ) |   const
◆ FromParam()
 bool CRhRdkAutomaticUIRow::FromParam  |  ( |  const IRhRdkParamBlock::IParam &  |  param | )
◆ IsEnabled()
 bool CRhRdkAutomaticUIRow::IsEnabled  |  ( |  void  |   | ) |   const
◆ MaxValue()
 const CRhRdkVariant& CRhRdkAutomaticUIRow::MaxValue  |  ( |  void  |   | ) |   const
◆ MinValue()
 const CRhRdkVariant& CRhRdkAutomaticUIRow::MinValue  |  ( |  void  |   | ) |   const
◆ ParamName()
 const wchar_t* CRhRdkAutomaticUIRow::ParamName  |  ( |  void  |   | ) |   const
◆ SetValue()
 void CRhRdkAutomaticUIRow::SetValue  |  ( |  const CRhRdkVariant &  |  v | )
◆ UiHint()
 IRhRdkParamBlock::UiHints CRhRdkAutomaticUIRow::UiHint  |  ( |  void  |   | ) |   const
◆ ValidValues()
 const wchar_t* CRhRdkAutomaticUIRow::ValidValues  |  ( |  void  |   | ) |   const
◆ Value()
 const CRhRdkVariant& CRhRdkAutomaticUIRow::Value  |  ( |  void  |   | ) |   const