Public Member Functions | List of all members
CRhRdkRenderWindowMainSidePaneTabFactory Class Referenceabstract
RDK
#include <RhRdkRenderWindowEventSink.h>
 Inheritance diagram for CRhRdkRenderWindowMainSidePaneTabFactory:
 Public Member Functions
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData) override
virtual bool  | Icon (const ON_2iSize &size, CRhinoDib &dib, void *reserved) const =0
virtual ON_UUID  | InterfaceId (void) const final override
virtual IRhinoWindowOnTab *  | NewTabPage (CRhRdkControllerPtr con, const ON_UUID &uuidSidePaneUI, void *reserved) const =0
virtual ON_UUID  | RenderEngineId (void) const =0
virtual ON_UUID  | TabId (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
RDK provides 3 tabs on the Render Window's main side pane for 'Early', 'Tone Mapping' and 'Late' Post-Effects. This class is an RDK extension which allows users to add their own tabs to this pane. It supersedes CRhRdkRenderFrameTabFactory and CRhRdkRenderFrameTabFactoryEx in Rhino 8 upwards.
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkRenderWindowMainSidePaneTabFactory::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
◆ Icon()
 virtual bool CRhRdkRenderWindowMainSidePaneTabFactory::Icon  |  ( |  const ON_2iSize &  |  size,
|  CRhinoDib &  |  dib,
|  void *  |  reserved
) |   |  const
pure virtual
Get an icon to be drawn on the tab.
Parameters
size | is the required size of the icon. This is typically 16x16.
dib | accepts the icon imagery.
◆ InterfaceId()
 virtual ON_UUID CRhRdkRenderWindowMainSidePaneTabFactory::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ NewTabPage()
 virtual IRhinoWindowOnTab* CRhRdkRenderWindowMainSidePaneTabFactory::NewTabPage  |  ( |  CRhRdkControllerPtr  |  con,
|  const ON_UUID &  |  uuidSidePaneUI,
|  void *  |  reserved
) |   |  const
pure virtual
Create a new tab page. This must create the window object but not the actual window handle.
Parameters
con | is a controller. TODO: Elaborate.
uuidSidePaneUI | is the unique identifier of the side-pane UI. This is typically the same as the render session id, but in some cases (e.g., Rhino Options), it is not.
reserved | is reserved for future use.
Returns
The new tab page or null on failure.
◆ RenderEngineId()
 virtual ON_UUID CRhRdkRenderWindowMainSidePaneTabFactory::RenderEngineId  |  ( |  void  |   | ) |   const
pure virtual
Returns
the render engine id of your renderer.
◆ TabId()
 virtual ON_UUID CRhRdkRenderWindowMainSidePaneTabFactory::TabId  |  ( |  void  |   | ) |   const
pure virtual
Returns
the tab id. This identifies the tab in the row of tabs.