Public Member Functions | List of all members
CRhinoAnnotationSettings Class Reference
Rhino
CRhinoAnnotationSettings class Note: Dimscale is now part of the DimStyles class and this class property is obsolete. Also, much of the CRhinoAnnotationSettings class has been replaced with CRhinoAnnotationSettingsEx. More...
#include <rhinoSdkDocProperties.h>
 Public Member Functions
CRhinoAnnotationSettings ()=default
CRhinoAnnotationSettings (const ON_3dmAnnotationSettings &src)
~CRhinoAnnotationSettings ()
ON_UUID  | DimensionLayerId () const
double  | DimScale () const
void  | EnableUseDimensionLayer (bool bEnable)
double  | ModelSpaceHatchScale () const
double  | ModelSpaceTextScale () const
BOOL32  | operator!= (const CRhinoAnnotationSettings &other)
CRhinoAnnotationSettings &  | operator= (const ON_3dmAnnotationSettings &src)
BOOL32  | operator== (const CRhinoAnnotationSettings &other)
the compare operators are used to test for changed settings More...
void  | SetDimensionLayerId (const ON_UUID &dimension_layer_id)
void  | SetDimScale (double scale)
void  | SetModelSpaceHatchScale (double scale)
void  | SetModelSpaceTextScale (double scale)
bool  | UseDimensionLayer () const
Detailed Description
CRhinoAnnotationSettings class Note: Dimscale is now part of the DimStyles class and this class property is obsolete. Also, much of the CRhinoAnnotationSettings class has been replaced with CRhinoAnnotationSettingsEx.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoAnnotationSettings() [1/2]
 CRhinoAnnotationSettings::CRhinoAnnotationSettings  |  ( |   | )
default
◆ ~CRhinoAnnotationSettings()
 CRhinoAnnotationSettings::~CRhinoAnnotationSettings  |  ( |   | )
◆ CRhinoAnnotationSettings() [2/2]
 CRhinoAnnotationSettings::CRhinoAnnotationSettings  |  ( |  const ON_3dmAnnotationSettings &  |  src | )
Member Function Documentation
◆ DimensionLayerId()
 ON_UUID CRhinoAnnotationSettings::DimensionLayerId  |  ( |   | ) |   const
◆ DimScale()
 double CRhinoAnnotationSettings::DimScale  |  ( |   | ) |   const
Deprecated:
Dim scale property moved from document to a per ON_DimStyle property.
◆ EnableUseDimensionLayer()
 void CRhinoAnnotationSettings::EnableUseDimensionLayer  |  ( |  bool  |  bEnable | )
◆ ModelSpaceHatchScale()
 double CRhinoAnnotationSettings::ModelSpaceHatchScale  |  ( |   | ) |   const
◆ ModelSpaceTextScale()
 double CRhinoAnnotationSettings::ModelSpaceTextScale  |  ( |   | ) |   const
◆ operator!=()
 BOOL32 CRhinoAnnotationSettings::operator!=  |  ( |  const CRhinoAnnotationSettings &  |  other | )
◆ operator=()
 CRhinoAnnotationSettings& CRhinoAnnotationSettings::operator=  |  ( |  const ON_3dmAnnotationSettings &  |  src | )
◆ operator==()
 BOOL32 CRhinoAnnotationSettings::operator==  |  ( |  const CRhinoAnnotationSettings &  |  other | )
the compare operators are used to test for changed settings
◆ SetDimensionLayerId()
 void CRhinoAnnotationSettings::SetDimensionLayerId  |  ( |  const ON_UUID &  |  dimension_layer_id | )
◆ SetDimScale()
 void CRhinoAnnotationSettings::SetDimScale  |  ( |  double  |  scale | )
Deprecated:
Dim scale property moved from document to a per ON_DimStyle property.
◆ SetModelSpaceHatchScale()
 void CRhinoAnnotationSettings::SetModelSpaceHatchScale  |  ( |  double  |  scale | )
◆ SetModelSpaceTextScale()
 void CRhinoAnnotationSettings::SetModelSpaceTextScale  |  ( |  double  |  scale | )
◆ UseDimensionLayer()
 bool CRhinoAnnotationSettings::UseDimensionLayer  |  ( |   | ) |   const