Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoUiPrintWidthListCtrl Class Reference
RhinoUI
CRhinoUiPrintWidthListCtrl. More...
#include <RhinoSdkUiPrintWidthListCtrl.h>
 Inheritance diagram for CRhinoUiPrintWidthListCtrl:
 Public Types
enum  | columns { name_column = 0, appearance_column, column_count }
 Public Member Functions
CRhinoUiPrintWidthListCtrl ()
virtual  | ~CRhinoUiPrintWidthListCtrl ()
int  | AppendPrintWidth (double print_width)
ON::LengthUnitSystem  | DisplayUnits () const
int  | FindPrintWidth (double print_width) const
void  | Initialize ()
int  | InsertPrintWidth (int item, double print_width)
afx_msg void  | OnCustomDraw (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnHeaderEndTrack (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
bool  | SelectedPrintWidth (double &print_width)
void  | SetDisplayUnits (ON::LengthUnitSystem display_units)
void  | SetSelectedPrintWidth (double print_width)
void  | SizeAppearanceColumn ()
void  | SizeNameColumn ()
 Protected Member Functions
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
Detailed Description
CRhinoUiPrintWidthListCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Member Enumeration Documentation
◆ columns
 enum CRhinoUiPrintWidthListCtrl::columns
Enumerator
name_column
appearance_column
column_count
Constructor & Destructor Documentation
◆ CRhinoUiPrintWidthListCtrl()
 CRhinoUiPrintWidthListCtrl::CRhinoUiPrintWidthListCtrl  |  ( |   | )
◆ ~CRhinoUiPrintWidthListCtrl()
 virtual CRhinoUiPrintWidthListCtrl::~CRhinoUiPrintWidthListCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AppendPrintWidth()
 int CRhinoUiPrintWidthListCtrl::AppendPrintWidth  |  ( |  double  |  print_width | )
Description: Appends a print width to the end of the control. Parameters: print_width - [in] the print width to append. Returns: >=0 - index of the inserted item. -1 - print_width already exist.
◆ DisplayUnits()
 ON::LengthUnitSystem CRhinoUiPrintWidthListCtrl::DisplayUnits  |  ( |   | ) |   const
Description: Returns the current display unit system. Returns: The current display unit system. See Also: SetDisplayUnits
◆ FindPrintWidth()
 int CRhinoUiPrintWidthListCtrl::FindPrintWidth  |  ( |  double  |  print_width | ) |   const
Description: Finds a print width that is displayed in the control. Parameters: print_width - [in] the print width to find. Returns: >=0 - index of the item. -1 - print width cannot be found.
◆ Initialize()
 void CRhinoUiPrintWidthListCtrl::Initialize  |  ( |   | )
Description: Initializes the control. Remarks: Call this member from CDialog::OnInitDialog().
◆ InsertPrintWidth()
 int CRhinoUiPrintWidthListCtrl::InsertPrintWidth  |  ( |  int  |  item,
|  double  |  print_width
)
Description: Inserts a print width into the control. Parameters: item - [in] index of the item to insert. print_width - [in] the print width to insert. Returns: >=0 - index of the inserted item. -1 - print_width already exist.
◆ OnCustomDraw()
 afx_msg void CRhinoUiPrintWidthListCtrl::OnCustomDraw  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnHeaderEndTrack()
 afx_msg void CRhinoUiPrintWidthListCtrl::OnHeaderEndTrack  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnSize()
 afx_msg void CRhinoUiPrintWidthListCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiPrintWidthListCtrl::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreSubclassWindow()
 virtual void CRhinoUiPrintWidthListCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ SelectedPrintWidth()
 bool CRhinoUiPrintWidthListCtrl::SelectedPrintWidth  |  ( |  double &  |  print_width | )
Description: Returns the selected print width. Parameters: print_width - [out] the print width to retrieve. Returns: TRUE - if an item is selected. FALSE - if an item is not selected.
◆ SetDisplayUnits()
 void CRhinoUiPrintWidthListCtrl::SetDisplayUnits  |  ( |  ON::LengthUnitSystem  |  display_units | )
Description: Sets the current display unit system. Parameters: display_units - [in] the units system. The default is ON::LengthUnitSystem::None. See Also: DisplayUnits
◆ SetSelectedPrintWidth()
 void CRhinoUiPrintWidthListCtrl::SetSelectedPrintWidth  |  ( |  double  |  print_width | )
Description: Selects print width that exists in the control. Parameters: print_width - [in] the print width to select.
◆ SizeAppearanceColumn()
 void CRhinoUiPrintWidthListCtrl::SizeAppearanceColumn  |  ( |   | )
Description: Automatically sizes the appearance column.
◆ SizeNameColumn()
 void CRhinoUiPrintWidthListCtrl::SizeNameColumn  |  ( |   | )
Description: Automatically sizes the name column.