Public Member Functions | Static Public Member Functions | List of all members
ON_XMeshPolyline Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Inheritance diagram for ON_XMeshPolyline:
 Public Member Functions
bool  | IsClosed ()
 Public Member Functions inherited from ON_SimpleArray< ON_XMeshEvent * >
ON_SimpleArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_SimpleArray (const ON_SimpleArray< ON_XMeshEvent * > &)
Copy constructor. More...
ON_SimpleArray (size_t)
size_t parameter = initial capacity More...
ON_SimpleArray (size_t, ON_XMeshEvent *)
create an array of given size and initialize all items to the given value More...
virtual  | ~ON_SimpleArray ()
void  | Append (const ON_XMeshEvent * &)
void  | Append (int, const ON_XMeshEvent * *)
Append copy of an array T[count]. More...
ON_XMeshEvent * &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_XMeshEvent * *  | Array ()
The Array() function return the. More...
const ON_XMeshEvent * *  | Array () const
m_a pointer value. More...
ON_XMeshEvent * *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_XMeshEvent * *  | At (int) const
ON_XMeshEvent * *  | At (ON__INT64)
const ON_XMeshEvent * *  | At (ON__INT64) const
ON_XMeshEvent * *  | At (ON__UINT64)
const ON_XMeshEvent * *  | At (ON__UINT64) const
ON_XMeshEvent * *  | At (unsigned int)
const ON_XMeshEvent * *  | At (unsigned int) const
ON_XMeshEvent * *  | begin ()
Support STL iterators and algorithms. More...
ON_XMeshEvent * const *  | begin () const
int  | BinarySearch (const ON_XMeshEvent * *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_XMeshEvent * *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *), int) const
const ON_XMeshEvent * *  | BinarySearchPtr (const ON_XMeshEvent * *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
const ON_XMeshEvent * *  | BinarySearchPtr (const ON_XMeshEvent * *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *), int) const
int  | Capacity () const
capacity of array More...
ON_XMeshEvent * const *  | cbegin () const
ON_XMeshEvent * const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_XMeshEvent * *  | end ()
ON_XMeshEvent * const *  | end () const
ON_XMeshEvent * *  | First ()
const ON_XMeshEvent * *  | First () const
returns nullptr if count = 0 More...
bool  | HeapSort (int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
void  | Insert (int, const ON_XMeshEvent * &)
int  | InsertInSortedList (const ON_XMeshEvent * &, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
int  | InsertInSortedList (const ON_XMeshEvent * &, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *), int)
ON_XMeshEvent * *  | KeepArray ()
ON_XMeshEvent * *  | Last ()
const ON_XMeshEvent * *  | Last () const
returns nullptr if count = 0 More...
void  | MemSet (unsigned char)
int  | NewCapacity () const
operator const ON_XMeshEvent * * () const
operator ON_XMeshEvent ** ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_SimpleArray< ON_XMeshEvent * > &other) const=delete
ON_SimpleArray< ON_XMeshEvent * > &  | operator= (const ON_SimpleArray< ON_XMeshEvent * > &)
bool  | operator== (const ON_SimpleArray< ON_XMeshEvent * > &other) const=delete
ON_XMeshEvent * &  | operator[] (int)
const ON_XMeshEvent * &  | operator[] (int) const
ON_XMeshEvent * &  | operator[] (ON__INT64)
const ON_XMeshEvent * &  | operator[] (ON__INT64) const
ON_XMeshEvent * &  | operator[] (ON__UINT64)
const ON_XMeshEvent * &  | operator[] (ON__UINT64) const
ON_XMeshEvent * &  | operator[] (unsigned int)
const ON_XMeshEvent * &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Prepend (int, const ON_XMeshEvent * *)
Prepend copy of an array T[count]. More...
bool  | QuickSort (int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
bool  | QuickSortAndRemoveDuplicates (int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *))
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
virtual ON_XMeshEvent * *  | Realloc (ON_XMeshEvent * *, int)
low level memory management ////////////////////////////////////////// More...
void  | Remove ()
virtual void  | Remove (int)
void  | RemoveIf (bool(*predicate)(const ON_XMeshEvent * &key))
void  | RemoveValue (const ON_XMeshEvent * &)
ON_XMeshEvent * *  | Reserve (size_t)
memory management //////////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_XMeshEvent * &) const
int  | Search (const ON_XMeshEvent * *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
void  | SetArray (ON_XMeshEvent * *p)
void  | SetArray (ON_XMeshEvent * *p, int count, int capacity)
ON_XMeshEvent * *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | SetRange (int from, int count, ON_XMeshEvent *)
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *, void *), void *) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, unsigned int *, int(*compar)(const ON_XMeshEvent * *, const ON_XMeshEvent * *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Static Public Member Functions
static void  | Merge (const ON_XMeshPolyline &lhs, const ON_XMeshPolyline &rhs, ON_XMeshPolyline &dest)
 Additional Inherited Members
 Protected Member Functions inherited from ON_SimpleArray< ON_XMeshEvent * >
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_SimpleArray< ON_XMeshEvent * >
ON_XMeshEvent * *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Detailed Description
NOTE: This class should not manage the memory of the ON_XMeshEvents If closed, then first and last are the same.
Member Function Documentation
◆ IsClosed()
 bool ON_XMeshPolyline::IsClosed  |  ( |   | )
◆ Merge()
 static void ON_XMeshPolyline::Merge  |  ( |  const ON_XMeshPolyline &  |  lhs,
|  const ON_XMeshPolyline &  |  rhs,
|  ON_XMeshPolyline &  |  dest
)
static
The default constructors, destructor, etc, for the ON_SimpleArray are correct for this class.