Public Member Functions | List of all members
CRhinoDirectionGripUserInterfaceObject Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Inheritance diagram for CRhinoDirectionGripUserInterfaceObject:
 Public Member Functions
CRhinoDirectionGripUserInterfaceObject ()
CRhinoDirectionGripUserInterfaceObject (const ON_3dPoint &origin, const ON_3dVector &direction)
virtual  | ~CRhinoDirectionGripUserInterfaceObject ()
float  | ArrowRadius () const
CRhinoGripUserInterfaceObject::GripShape  | ArrowShape () const
bool  | ArrowsVisibleInViewport (const CRhinoViewport *viewport) const
float  | DirectionLineLength () const
void  | Draw (CRhinoDisplayPipeline &dp) override
void  | Draw (CRhinoDisplayPipeline &dp, const ON_Color &color)
ON_3dVector  | GripDirection () const
bool  | IsGripPointVisible () const
bool  | IsMouseOver (const CRhinoMouseEventArgs &mouse) override
bool  | IsOneWay () const
void  | OnDrag (const ON_3dPoint &point, const CRhinoMouseEventArgs &mouse) override
void  | OnMouseDown (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseMove (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseUp (const CRhinoMouseEventArgs &mouse) override
void  | SetArrowRadius (float radius)
void  | SetArrowShape (CRhinoGripUserInterfaceObject::GripShape shape)
void  | SetAsOneWay (bool oneWay)
void  | SetDirectionLineLength (float length)
void  | SetGripDirection (const ON_3dVector &direction)
void  | SetGripPointVisible (bool on)
 Public Member Functions inherited from CRhinoGripUserInterfaceObject
CRhinoGripUserInterfaceObject ()
CRhinoGripUserInterfaceObject (const ON_3dPoint &location)
virtual  | ~CRhinoGripUserInterfaceObject ()
int  | AddSnapPoints (int pointCount, const ON_3dPoint *snapPoints)
double  | CameraDepth (const ON_Plane &cameraPlane) const override
void  | ClearConstraints ()
void  | ClearSnapPoints ()
ON_3dPoint  | ComputeDragPoint (const CRhinoMouseEventArgs &mouse)
bool  | Constrain (const ON_Arc &arc)
bool  | Constrain (const ON_Circle &circle)
bool  | Constrain (const ON_Curve &curve)
bool  | Constrain (const ON_Line &line)
void  | EnableObjectSnapCursors (bool enable)
void  | EnableOnObjectCursors (bool enable)
GripShape  | GetGripShape () const
ON_Color  | GripColor () const
ON_Color  | GripFillColor () const
ON_3dPoint  | GripLocation () const
float  | GripRadius () const
float  | GripShapeRotationRadians () const
float  | GripStrokeWidth () const
bool  | ObjectSnapCursorsEnabled () const
bool  | ObjectSnapPermitted () const
void  | OnMouseEnter (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseLeave (const CRhinoMouseEventArgs &mouse) override
bool  | OnObjectCursorsEnabled () const
void  | PermitObjectSnap (bool permit)
void  | SetGripColor (const ON_Color &color)
void  | SetGripFillColor (const ON_Color &color)
void  | SetGripLocation (const ON_3dPoint &point)
void  | SetGripRadius (float radius)
void  | SetGripShape (GripShape shape)
void  | SetGripShapeRotationRadians (float angle)
void  | SetGripStrokeWidth (float width)
 Public Member Functions inherited from CRhinoUserInterfaceObject
CRhinoUserInterfaceObject ()
virtual  | ~CRhinoUserInterfaceObject ()
virtual bool  | AcceptsKeyboardFocus () const
void  | Animate (CRhinoAnimatingDouble &value, double target, double duration, AnimationStyle style, CRhinoDoc *doc)
void  | BindToActiveViewport (bool on)
void  | BindToViewport (unsigned int viewport_sn)
int  | DisplayOrder () const
ON_UUID  | DocumentGroupId () const
unsigned int  | DocumentRuntimeSerialNumber () const
bool  | GetData (const wchar_t *key, bool &value) const
bool  | GetData (const wchar_t *key, double &value) const
bool  | GetData (const wchar_t *key, int &value) const
bool  | GetData (const wchar_t *key, ON_UUID &value) const
bool  | GetData (const wchar_t *key, ON_wString &value) const
bool  | HasKeyboardFocus () const
bool  | HasMouseCapture () const
bool  | IsBoundToActiveViewport () const
unsigned int  | IsBoundToViewport () const
bool  | MoveKeyboardFocusToSibling (bool forward, CRhinoDoc *doc)
virtual bool  | OnCharacter (unsigned int character, unsigned int flags)
virtual void  | OnKeyboardFocusChanged (bool hasFocus)
virtual bool  | OnKeyDown (unsigned int virtualKey, unsigned int flags)
virtual void  | OnMouseClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDoubleClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseWheel (const CRhinoMouseEventArgs &mouse, int delta)
virtual CRhinoCommand::result  | OnRunCommand (const CRhinoCommandContext &context, const CRhinoMouseEventArgs &mouse)
virtual void  | OnTrackpadScroll (const CRhinoMouseEventArgs &mouse, float horizontal, float vertical)
CRhinoUserInterfaceObject *  | Parent ()
const CRhinoUserInterfaceObject *  | Parent () const
bool  | ReceivesMouseWheelEvents () const
bool  | ReceivesTrackpadScrollEvents () const
bool  | RegisterForAllDocuments ()
void  | RunCommand (const CRhinoMouseEventArgs &mouse)
unsigned int  | RuntimeSerialNumber () const
void  | SetCursor (HCURSOR cursor)
void  | SetData (const wchar_t *key, bool value)
void  | SetData (const wchar_t *key, const wchar_t *value)
void  | SetData (const wchar_t *key, double value)
void  | SetData (const wchar_t *key, int value)
void  | SetData (const wchar_t *key, ON_UUID value)
void  | SetDisplayOrder (int order)
void  | SetReceivesMouseWheelEvents (bool enable)
void  | SetReceivesTrackpadScrollEvents (bool enable)
void  | SetTooltip (const wchar_t *tooltip)
void  | SetVisible (bool visible)
bool  | UnregisterFromAllDocuments ()
bool  | Visible () const
 Additional Inherited Members
 Public Types inherited from CRhinoGripUserInterfaceObject
enum  | GripShape { GripShape::Circle = 0, GripShape::Square = 1, GripShape::Triangle = 2, GripShape::X = 3 }
 Public Types inherited from CRhinoUserInterfaceObject
enum  | FocusReason : int { FocusReason::Unknown = 0, FocusReason::Pointer = 1, FocusReason::Navigation = 2 }
 Static Public Member Functions inherited from CRhinoUserInterfaceObject
static void  | ClearKeyboardFocus (CRhinoDoc *doc)
static FocusReason  | KeyboardFocusReason ()
 Protected Member Functions inherited from CRhinoUserInterfaceObject
virtual void  | ContinueAnimate (CRhinoDoc *doc)
void  | ReleaseKeyboardFocus (CRhinoDoc *doc)
void  | SetKeyboardFocus (CRhinoDoc *doc, FocusReason reason=FocusReason::Unknown)
void  | SetMouseCapture (CRhinoDoc *doc)
 Protected Attributes inherited from CRhinoGripUserInterfaceObject
class CRhGripUserInterfaceObjectPrivate *  | m_grip_private = nullptr
 Protected Attributes inherited from CRhinoUserInterfaceObject
class CRhUserInterfaceObjectPrivate *  | m_private = nullptr
Constructor & Destructor Documentation
◆ CRhinoDirectionGripUserInterfaceObject() [1/2]
 CRhinoDirectionGripUserInterfaceObject::CRhinoDirectionGripUserInterfaceObject  |  ( |   | )
◆ CRhinoDirectionGripUserInterfaceObject() [2/2]
 CRhinoDirectionGripUserInterfaceObject::CRhinoDirectionGripUserInterfaceObject  |  ( |  const ON_3dPoint &  |  origin,
|  const ON_3dVector &  |  direction
)
◆ ~CRhinoDirectionGripUserInterfaceObject()
 virtual CRhinoDirectionGripUserInterfaceObject::~CRhinoDirectionGripUserInterfaceObject  |  ( |   | )
virtual
Member Function Documentation
◆ ArrowRadius()
 float CRhinoDirectionGripUserInterfaceObject::ArrowRadius  |  ( |   | ) |   const
◆ ArrowShape()
 CRhinoGripUserInterfaceObject::GripShape CRhinoDirectionGripUserInterfaceObject::ArrowShape  |  ( |   | ) |   const
◆ ArrowsVisibleInViewport()
 bool CRhinoDirectionGripUserInterfaceObject::ArrowsVisibleInViewport  |  ( |  const CRhinoViewport *  |  viewport | ) |   const
◆ DirectionLineLength()
 float CRhinoDirectionGripUserInterfaceObject::DirectionLineLength  |  ( |   | ) |   const
◆ Draw() [1/2]
 void CRhinoDirectionGripUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | )
overridevirtual
Description: All user interface objects must implement a Draw function. This is where drawing using the input display pipeline is performed. The base class Draw function does nothing.
Reimplemented from CRhinoGripUserInterfaceObject.
◆ Draw() [2/2]
 void CRhinoDirectionGripUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  const ON_Color &  |  color
)
◆ GripDirection()
 ON_3dVector CRhinoDirectionGripUserInterfaceObject::GripDirection  |  ( |   | ) |   const
◆ IsGripPointVisible()
 bool CRhinoDirectionGripUserInterfaceObject::IsGripPointVisible  |  ( |   | ) |   const
◆ IsMouseOver()
 bool CRhinoDirectionGripUserInterfaceObject::IsMouseOver  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Return true if the input mouse is considered to be over this object
Reimplemented from CRhinoGripUserInterfaceObject.
◆ IsOneWay()
 bool CRhinoDirectionGripUserInterfaceObject::IsOneWay  |  ( |   | ) |   const
◆ OnDrag()
 void CRhinoDirectionGripUserInterfaceObject::OnDrag  |  ( |  const ON_3dPoint &  |  point,
|  const CRhinoMouseEventArgs &  |  mouse
)
overridevirtual
Description: Gets called while the grip is being dragged to update the location. The default implementation calls SetGripLocation
Reimplemented from CRhinoGripUserInterfaceObject.
◆ OnMouseDown()
 void CRhinoDirectionGripUserInterfaceObject::OnMouseDown  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Called when a mouse button goes down over this UI element Parameters: mouse - mouse position, button and view
Reimplemented from CRhinoGripUserInterfaceObject.
◆ OnMouseMove()
 void CRhinoDirectionGripUserInterfaceObject::OnMouseMove  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Called when a mouse moves over this UI element Parameters: mouse - mouse position, button and view
Reimplemented from CRhinoGripUserInterfaceObject.
◆ OnMouseUp()
 void CRhinoDirectionGripUserInterfaceObject::OnMouseUp  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Called when a mouse button goes up over this UI element Parameters: mouse - mouse position, button and view
Reimplemented from CRhinoGripUserInterfaceObject.
◆ SetArrowRadius()
 void CRhinoDirectionGripUserInterfaceObject::SetArrowRadius  |  ( |  float  |  radius | )
◆ SetArrowShape()
 void CRhinoDirectionGripUserInterfaceObject::SetArrowShape  |  ( |  CRhinoGripUserInterfaceObject::GripShape  |  shape | )
◆ SetAsOneWay()
 void CRhinoDirectionGripUserInterfaceObject::SetAsOneWay  |  ( |  bool  |  oneWay | )
◆ SetDirectionLineLength()
 void CRhinoDirectionGripUserInterfaceObject::SetDirectionLineLength  |  ( |  float  |  length | )
◆ SetGripDirection()
 void CRhinoDirectionGripUserInterfaceObject::SetGripDirection  |  ( |  const ON_3dVector &  |  direction | )
◆ SetGripPointVisible()
 void CRhinoDirectionGripUserInterfaceObject::SetGripPointVisible  |  ( |  bool  |  on | )