Public Member Functions | List of all members
ON_ShutLining::CurveIterator Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Public Member Functions
CurveIterator (const ON_ShutLining &sl)
~CurveIterator ()
Curve *  | Next (void)
Constructor & Destructor Documentation
◆ CurveIterator()
 ON_ShutLining::CurveIterator::CurveIterator  |  ( |  const ON_ShutLining &  |  sl | )
◆ ~CurveIterator()
 ON_ShutLining::CurveIterator::~CurveIterator  |  ( |   | )
Member Function Documentation
◆ Next()
 Curve* ON_ShutLining::CurveIterator::Next  |  ( |  void  |   | )