Public Member Functions | List of all members
CRhinoUiLocalizeDialog Class Reference
RhinoUI
#include <RhinoSdkUiDialog.h>
 Public Member Functions
CRhinoUiLocalizeDialog (class CRhinoUiDHtmlDialog *)
CRhinoUiLocalizeDialog (class CRhinoUiDialog *)
This class if FOR INTERNAL USE ONLY!! More...
CRhinoUiLocalizeDialog (UINT nDialogID)
HWND  | DialogHWnd () const
UINT  | DialogTemplateID () const
bool  | HasBeenLocalized ()
void  | Localize ()
void  | Localize (UUID idPlugIn, HWND hWnd, UINT nDialogID)
UUID  | PlugInUUID () const
Constructor & Destructor Documentation
◆ CRhinoUiLocalizeDialog() [1/3]
 CRhinoUiLocalizeDialog::CRhinoUiLocalizeDialog  |  ( |  class CRhinoUiDialog *  |   | )
This class if FOR INTERNAL USE ONLY!!
◆ CRhinoUiLocalizeDialog() [2/3]
 CRhinoUiLocalizeDialog::CRhinoUiLocalizeDialog  |  ( |  class CRhinoUiDHtmlDialog *  |   | )
◆ CRhinoUiLocalizeDialog() [3/3]
 CRhinoUiLocalizeDialog::CRhinoUiLocalizeDialog  |  ( |  UINT  |  nDialogID | )
Member Function Documentation
◆ DialogHWnd()
 HWND CRhinoUiLocalizeDialog::DialogHWnd  |  ( |   | ) |   const
◆ DialogTemplateID()
 UINT CRhinoUiLocalizeDialog::DialogTemplateID  |  ( |   | ) |   const
◆ HasBeenLocalized()
 bool CRhinoUiLocalizeDialog::HasBeenLocalized  |  ( |   | )
◆ Localize() [1/2]
 void CRhinoUiLocalizeDialog::Localize  |  ( |   | )
◆ Localize() [2/2]
 void CRhinoUiLocalizeDialog::Localize  |  ( |  UUID  |  idPlugIn,
|  HWND  |  hWnd,
|  UINT  |  nDialogID
)
◆ PlugInUUID()
 UUID CRhinoUiLocalizeDialog::PlugInUUID  |  ( |   | ) |   const