Public Member Functions | Public Attributes | List of all members
CRhinoAppFonts Class Reference
Rhino
#include <rhinoSdkApp.h>
 Public Member Functions
CRhinoAppFonts ()=default
void  | SetCommandWindowFonts (const wchar_t *fontFaceName, int pointSize)
 Public Attributes
CFont  | m_BoldFont
CFont  | m_BoldItalicFont
CFont  | m_ItalicFont
CFont  | m_NormalFont
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. All the fonts necessary to display text in the command prompt, command history window, notes, dialog boxes, etc.
Constructor & Destructor Documentation
◆ CRhinoAppFonts()
 CRhinoAppFonts::CRhinoAppFonts  |  ( |   | )
default
Member Function Documentation
◆ SetCommandWindowFonts()
 void CRhinoAppFonts::SetCommandWindowFonts  |  ( |  const wchar_t *  |  fontFaceName,
|  int  |  pointSize
)
Description: Sets m_NormalFont, m_ItalicFont, m_BoldFont, and m_BoldItalicFont to the same font and size with one function call. Also handles updating all the appropriate windows in Rhino to use these new fonts.
Member Data Documentation
◆ m_BoldFont
 CFont CRhinoAppFonts::m_BoldFont
◆ m_BoldItalicFont
 CFont CRhinoAppFonts::m_BoldItalicFont
◆ m_ItalicFont
 CFont CRhinoAppFonts::m_ItalicFont
◆ m_NormalFont
 CFont CRhinoAppFonts::m_NormalFont