Public Member Functions | List of all members
CRhinoViewIterator Class Reference
Rhino
#include <rhinoSdkView.h>
 Public Member Functions
CRhinoViewIterator (unsigned int rhino_doc_sn)
class CRhinoView *  | CurrentView () const
unsigned int  | CurrentViewRuntimeSerialNumber () const
unsigned int  | DocRuntimeSerialNumber () const
class CRhinoView *  | First ()
void  | Initialize ()
class CRhinoView *  | Next ()
Constructor & Destructor Documentation
◆ CRhinoViewIterator()
 CRhinoViewIterator::CRhinoViewIterator  |  ( |  unsigned int  |  rhino_doc_sn | )
Parameters: rhino_doc_sn - [in] 0: iterate all views of all documents. >0: iteration all views of the specified doc.
Member Function Documentation
◆ CurrentView()
 class CRhinoView* CRhinoViewIterator::CurrentView  |  ( |   | ) |   const
Returns: The current value of the iterator. Remarks:
If First() or Next() has not been called, then Current() will return null.
If the view returned by First() or Next() has been deleted since the call to First() or Next(), then CurrentView() will return a null pointer.
◆ CurrentViewRuntimeSerialNumber()
 unsigned int CRhinoViewIterator::CurrentViewRuntimeSerialNumber  |  ( |   | ) |   const
◆ DocRuntimeSerialNumber()
 unsigned int CRhinoViewIterator::DocRuntimeSerialNumber  |  ( |   | ) |   const
Example: Iteratate all views: unsigned int rhino_doc_sn = 0 or doc->RuntimeSerialNumber(); CRhinoDocIterator doc_it(rhino_doc_sn); for ( CRhinoView* rhino_view = view_it.First(); 0 != rhino_view; rhino_view = view_it.Next() ) { ... }
◆ First()
 class CRhinoView* CRhinoViewIterator::First  |  ( |   | )
Returns: The first view that exists. Remarks: You may call First() multiple times on the same iterator. Example: for ( CRhinoView* view = view_it.First(); 0 != view; view = view_it.Next() ) { ... }
◆ Initialize()
 void CRhinoViewIterator::Initialize  |  ( |   | )
Description: Sets the iterator so the next call to Next() will return the first view that exists. This is useful when it is not practical to call First() to begin the iteration through the views. Remarks: You may call Initialize() multiple times on the same iterator. Example: view_it.Initialize(); while ( CRhinoView* view = view_it.Next() ) { ... }
◆ Next()
 class CRhinoView* CRhinoViewIterator::Next  |  ( |   | )
Returns: The next view that exists. Remarks:
Once Next() returns null, it will continue to return null until First() is called.
If Initialize() is called and First() is not called, then the first call to Next() returns the first view.
If First() or Initialize() have not been called, the first call to Next() returns the first view. Example: See CRhinoViewIterator::First() and CRhinoViewIterator::Initialize().