Public Member Functions | Public Attributes | List of all members
ON_3dmGoo Class Reference
OpenNURBS
#include <opennurbs_archive.h>
 Public Member Functions
ON_3dmGoo ()
used to store goo More...
ON_3dmGoo (const ON_3dmGoo &)
~ON_3dmGoo ()
void  | Dump (ON_TextLog &) const
ON_3dmGoo &  | operator= (const ON_3dmGoo &)
 Public Attributes
unsigned char *  | m_goo
ON_3dmGoo *  | m_next_goo
ON_3dmGoo *  | m_prev_goo
unsigned int  | m_typecode
int  | m_value
Constructor & Destructor Documentation
◆ ON_3dmGoo() [1/2]
 ON_3dmGoo::ON_3dmGoo  |  ( |   | )
used to store goo
◆ ~ON_3dmGoo()
 ON_3dmGoo::~ON_3dmGoo  |  ( |   | )
◆ ON_3dmGoo() [2/2]
 ON_3dmGoo::ON_3dmGoo  |  ( |  const ON_3dmGoo &  |   | )
Member Function Documentation
◆ Dump()
 void ON_3dmGoo::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ operator=()
 ON_3dmGoo& ON_3dmGoo::operator=  |  ( |  const ON_3dmGoo &  |   | )
Member Data Documentation
◆ m_goo
 unsigned char* ON_3dmGoo::m_goo
◆ m_next_goo
 ON_3dmGoo* ON_3dmGoo::m_next_goo
◆ m_prev_goo
 ON_3dmGoo* ON_3dmGoo::m_prev_goo
◆ m_typecode
 unsigned int ON_3dmGoo::m_typecode
◆ m_value
 int ON_3dmGoo::m_value