Public Member Functions | List of all members
ON_BrepVertexArray Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepVertexArray:
 Public Member Functions
ON_BrepVertexArray ()
~ON_BrepVertexArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepVertex >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (const ON_ObjectArray< ON_BrepVertex > &)
ON_ObjectArray (size_t)
size_t parameter = initial capacity More...
~ON_ObjectArray ()
override for struct member deallocation, etc. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *))
ON_ObjectArray< ON_BrepVertex > &  | operator= (const ON_ObjectArray< ON_BrepVertex > &)
bool  | QuickSort (int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *))
ON_BrepVertex *  | Realloc (ON_BrepVertex *, int)
 Public Member Functions inherited from ON_ClassArray< ON_BrepVertex >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< ON_BrepVertex > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const ON_BrepVertex &)
void  | Append (int, const ON_BrepVertex *)
Append copy of an array T[count]. More...
ON_BrepVertex &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepVertex *  | Array ()
The Array() function return the. More...
const ON_BrepVertex *  | Array () const
m_a pointer value. More...
ON_BrepVertex *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_BrepVertex *  | At (int) const
ON_BrepVertex *  | At (ON__INT64)
const ON_BrepVertex *  | At (ON__INT64) const
ON_BrepVertex *  | At (ON__UINT64)
const ON_BrepVertex *  | At (ON__UINT64) const
ON_BrepVertex *  | At (unsigned int)
const ON_BrepVertex *  | At (unsigned int) const
ON_BrepVertex *  | begin ()
Support STL iterators and algorithms. More...
ON_BrepVertex const *  | begin () const
int  | BinarySearch (const ON_BrepVertex *, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_BrepVertex *, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *), int) const
int  | Capacity () const
capacity of array More...
ON_BrepVertex const *  | cbegin () const
ON_BrepVertex const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_BrepVertex *  | end ()
ON_BrepVertex const *  | end () const
ON_BrepVertex *  | First ()
const ON_BrepVertex *  | First () const
returns nullptr if count = 0 More...
void  | Insert (int, const ON_BrepVertex &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const ON_BrepVertex &, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *))
int  | InsertInSortedList (const ON_BrepVertex &, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *), int)
ON_BrepVertex *  | KeepArray ()
ON_BrepVertex *  | Last ()
const ON_BrepVertex *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const ON_BrepVertex * () const
operator ON_BrepVertex * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< ON_BrepVertex > &other) const=delete
ON_ClassArray< ON_BrepVertex > &  | operator= (const ON_ClassArray< ON_BrepVertex > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< ON_BrepVertex > &other) const=delete
ON_BrepVertex &  | operator[] (int)
const ON_BrepVertex &  | operator[] (int) const
ON_BrepVertex &  | operator[] (ON__INT64)
const ON_BrepVertex &  | operator[] (ON__INT64) const
ON_BrepVertex &  | operator[] (ON__UINT64)
const ON_BrepVertex &  | operator[] (ON__UINT64) const
ON_BrepVertex &  | operator[] (unsigned int)
const ON_BrepVertex &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepVertex *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_BrepVertex *, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *)) const
void  | SetArray (ON_BrepVertex *p)
void  | SetArray (ON_BrepVertex *p, int count, int capacity)
ON_BrepVertex *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepVertex *, const ON_BrepVertex *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepVertex >
void  | ConstructDefaultElement (ON_BrepVertex *)
void  | DestroyElement (ON_BrepVertex &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepVertex >
ON_BrepVertex *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_BrepVertexArray()
 ON_BrepVertexArray::ON_BrepVertexArray  |  ( |   | )
◆ ~ON_BrepVertexArray()
 ON_BrepVertexArray::~ON_BrepVertexArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepVertexArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepVertexArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepVertexArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const