Public Member Functions | List of all members
CRhinoSdkRenderEx3 Class Referenceabstract
Rhino
#include <RhinoSdkRender.h>
 Inheritance diagram for CRhinoSdkRenderEx3:
 Public Member Functions
CRhinoSdkRenderEx3 (CRhinoDoc &doc, CRhinoRenderPlugIn *plugin)
virtual class IRhinoSdkRenderFrame *  | NewRenderFrameEx3 (CRhinoDoc *pDocument, bool bQuiet)=0
virtual void  | OnRenderWindowFinished (void)=0
 Public Member Functions inherited from CRhinoSdkRenderEx2
virtual class IRhinoSdkRenderFrame *  | NewRenderFrameEx (CRhinoDoc *pDocument)=0
 Public Member Functions inherited from CRhinoSdkRenderEx
virtual  | ~CRhinoSdkRenderEx ()
virtual BOOL32  | AddRenderMeshToSceneEx (const CRhinoObjRef &ref, const CRhinoMaterial &material, const ON_Mesh *)
virtual LRESULT  | CallBackProc (UINT message, WPARAM wParam, LPARAM lParam)
virtual BOOL32  | IgnoreRhinoObjectEx (const CRhinoObjRef &ref)
virtual LRESULT  | QuerySdkRenderEx (UINT message, WPARAM wParam, LPARAM lParam)
virtual RenderReturnCodes  | RenderEx (const CRhinoCommandContext &context, LPSIZE sizeImage=0, const wchar_t *lpsWindowTitle=0, UINT nIDResource=0)
virtual void  | RenderReturnCodesToStringEx (RenderReturnCodes code, ON_wString &out) const
virtual RenderReturnCodes  | RenderWindowEx (const CRhinoCommandContext &context, CRhinoView *view, const LPRECT rect, bool bRenderInWindow)
 Public Member Functions inherited from CRhinoSdkRender
virtual  | ~CRhinoSdkRender ()
virtual BOOL32  | AddLightToScene (const class CRhinoLight &light)
virtual BOOL32  | AddRenderMeshToScene (const CRhinoObject *object, const CRhinoMaterial &material, const ON_Mesh *)
CRhinoDoc &  | Document ()
double  | ElapsedTime (ON_wString &out) const
DWORD  | EndTime () const
int  | ErrorCode () const
virtual BOOL32  | IgnoreRhinoObject (const CRhinoObject *object)
bool  | InBatchMode () const
virtual BOOL32  | NeedToProcessGeometryTable ()
virtual BOOL32  | NeedToProcessLightTable ()
void  | OnRenderFrameDestruction ()
For internal use only. More...
virtual void  | PauseRendering ()
CRhinoRenderPlugIn *  | PlugIn () const
int  | ProcessGeometryTable ()
int  | ProcessLightTable ()
RenderReturnCodes  | Render (const CRhinoCommandContext &context, LPSIZE sizeImage=0, const wchar_t *lpsWindowTitle=0, UINT nIDResource=0)
virtual BOOL32  | RenderContinueModal ()
virtual BOOL32  | RenderEnterModalLoop ()
virtual BOOL32  | RenderExitModalLoop ()
virtual BOOL32  | RenderPreCreateWindow ()
void  | RenderReturnCodesToString (RenderReturnCodes code, ON_wString &out) const
virtual BOOL32  | RenderSceneWithNoMeshes ()
RenderReturnCodes  | RenderWindow (const CRhinoCommandContext &context, CRhinoView *view, const LPRECT rect, bool bRenderInWindow)
virtual void  | ResumeRendering ()
virtual BOOL32  | StartRenderingInWindow (CRhinoView *view, const LPCRECT rect)
DWORD  | StartTime () const
virtual void  | StopRendering ()
virtual bool  | SupportsPause () const
 Additional Inherited Members
 Public Types inherited from CRhinoSdkRender
enum  | RenderReturnCodes {
 render_ok = 0, render_empty_scene, render_cancel, render_no_active_view,
 render_on_pre_create_window, render_no_frame_wnd_pointer, render_error_creating_window, render_error_starting_render,
 render_enter_modal_loop, render_exit_modal_loop, render_wm_quit
 }
Render command an helpers. More...
 Protected Member Functions inherited from CRhinoSdkRenderEx2
virtual class CRhinoSdkRenderFrame *  | NewRenderFrame (CRhinoDoc *doc) override
 Protected Member Functions inherited from CRhinoSdkRenderEx
virtual void  | OnRenderFrameDestructionEx ()
virtual int  | ProcessGeometryTableEx ()
virtual int  | ProcessLightTableEx ()
 Protected Member Functions inherited from CRhinoSdkRender
CImpl *  | Impl ()
RenderReturnCodes  | ReturnRenderCode (RenderReturnCodes rc)
CRhinoView *  | RhinoView () const
void  | SetRhinoView (CRhinoView *v)
 Protected Attributes inherited from CRhinoSdkRender
friend  | CImpl
bool  | m_batch_mode
DWORD  | m_end_time
int  | m_error_code
int  | m_light_count
int  | m_mesh_count
CRhinoRenderPlugIn *  | m_plugin
BOOL32  | m_render_canceled
CRhinoDoc &  | m_rhino_doc
CRhinoView *  | m_rhino_view
ON__UINT_PTR  | m_sdk_reserved = 0
DWORD  | m_start_time
Constructor & Destructor Documentation
◆ CRhinoSdkRenderEx3()
 CRhinoSdkRenderEx3::CRhinoSdkRenderEx3  |  ( |  CRhinoDoc &  |  doc,
|  CRhinoRenderPlugIn *  |  plugin
)
Member Function Documentation
◆ NewRenderFrameEx3()
 virtual class IRhinoSdkRenderFrame* CRhinoSdkRenderEx3::NewRenderFrameEx3  |  ( |  CRhinoDoc *  |  pDocument,
|  bool  |  bQuiet
)
pure virtual
◆ OnRenderWindowFinished()
 virtual void CRhinoSdkRenderEx3::OnRenderWindowFinished  |  ( |  void  |   | )
pure virtual