Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_TestClass Class Reference
OpenNURBS
#include <opennurbs_testclass.h>
 Public Member Functions
ON_TestClass ()
ON_TestClass (const ON_TestClass &)
~ON_TestClass ()
void  | Dump (class ON_TextLog &text_log) const
ON_TestClass &  | operator= (const ON_TestClass &)
void  | SetValue (const ON_wString s)
const ON_wString  | ToString () const
const ON_wString  | Value () const
 Static Public Member Functions
static ON__UINT64  | ConstructedCount ()
static ON__UINT64  | CurrentCount ()
static ON__UINT64  | DestructedCount ()
static void  | GetCurrentAndConstructedCount (ON__UINT64 &constructed_count, ON__UINT64 &current_count)
 Public Attributes
const ON__UINT64  | ConstructedAt
const ON__UINT64  | CopiedFrom
const ON__UINT64  | SerialNumber
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_TestClass() [1/2]
 ON_TestClass::ON_TestClass  |  ( |   | )
◆ ~ON_TestClass()
 ON_TestClass::~ON_TestClass  |  ( |   | )
◆ ON_TestClass() [2/2]
 ON_TestClass::ON_TestClass  |  ( |  const ON_TestClass &  |   | )
Member Function Documentation
◆ ConstructedCount()
 static ON__UINT64 ON_TestClass::ConstructedCount  |  ( |   | )
static
Returns: Number of ON_TestClass instances that have been constructed. Remarks: Thread safe. If you need to know two or more of ConstructedCount(), DestructedCount(), and CurrentCount() the same time, call GetCurrentAndConstructedCount().
◆ CurrentCount()
 static ON__UINT64 ON_TestClass::CurrentCount  |  ( |   | )
static
Returns: Number of ON_TestClass instances that currently exist. Remarks: Thread safe. If you need to know two or more of ConstructedCount(), DestructedCount(), and CurrentCount() the same time, call GetCurrentAndConstructedCount().
◆ DestructedCount()
 static ON__UINT64 ON_TestClass::DestructedCount  |  ( |   | )
static
Returns: Number of ON_TestClass instances that have been destroyed. Remarks: Thread safe. If you need to know two or more of ConstructedCount(), DestructedCount(), and CurrentCount() the same time, call GetCurrentAndConstructedCount().
◆ Dump()
 void ON_TestClass::Dump  |  ( |  class ON_TextLog &  |  text_log | ) |   const
Returns: String value. Remarks: Thread safe.
◆ GetCurrentAndConstructedCount()
 static void ON_TestClass::GetCurrentAndConstructedCount  |  ( |  ON__UINT64 &  |  constructed_count,
|  ON__UINT64 &  |  current_count
)
static
Parameters: constructed_count - [out] Number of ON_TestClass that have been constructed. current_count - [out] Number of ON_TestClass that currently exist. Remarks: Thread safe.
◆ operator=()
 ON_TestClass& ON_TestClass::operator=  |  ( |  const ON_TestClass &  |   | )
◆ SetValue()
 void ON_TestClass::SetValue  |  ( |  const ON_wString  |  s | )
Returns: String value. Remarks: Thread safe.
◆ ToString()
 const ON_wString ON_TestClass::ToString  |  ( |   | ) |   const
Returns: A string with the format ON_TestClass[<SERIAL_NUMBER>] "<STRING_VALUE>" where <SERIAL_NUMBER> is this->SerialNumber and <STRING_VALUE> is the string returned by this->Value().
Remarks: Thread safe.
◆ Value()
 const ON_wString ON_TestClass::Value  |  ( |   | ) |   const
Returns: String value. Remarks: Thread safe.
Member Data Documentation
◆ ConstructedAt
 const ON__UINT64 ON_TestClass::ConstructedAt
Time this instance was constructed. Seconds since Jan 1, 1970, UCT from C-runtime time(nullptr).
◆ CopiedFrom
 const ON__UINT64 ON_TestClass::CopiedFrom
If this class was created by the copy constructor, then CopiedFrom is the serial number of the source class. Otherwise, CopiedFrom is zero.
◆ SerialNumber
 const ON__UINT64 ON_TestClass::SerialNumber
The first instance of a ON_TestClass has serial number 1.