Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoUiController Class Referenceabstract
RDK
#include <RhRdkDataSource.h>
 Inheritance diagram for IRhinoUiController:
 Public Types
enum  | EventPriority : unsigned int { EventPriority::Low, EventPriority::Normal, EventPriority::High, EventPriority::RealTime }
Event priority More...
 Public Member Functions
virtual void  | Activate (void)=0
virtual UUID  | Id (void) const =0
virtual bool  | IsActivated (void) const =0
virtual void  | RegisterEventWatcher (class IRhinoUiControllerEventWatcher &ew)=0
virtual void  | RequiredDataSources (OUT ON_SimpleArray< ON_UUID > &aId) const =0
virtual EventPriority  | SetEventPriority (EventPriority ep)=0
virtual void  | UnregisterEventWatcher (class IRhinoUiControllerEventWatcher &ew)=0
 Public Member Functions inherited from IRhinoUiDataSourceHost
virtual void  | AddDataSource (class IRhinoUiDataSource &ds)=0
virtual void  | Commit (const UUID &uuidData, IRhinoUiEventInfo *pInfo=nullptr)=0
virtual void  | CopyDataSourcesFrom (IRhinoUiDataSourceHost &host)=0
virtual void  | Discard (const UUID &uuidData)=0
virtual void *  | GetData (const UUID &uuidData, bool bForWrite, bool bAutoChangeBracket=true) const =0
virtual void  | GetDataSources (ON_SimpleArray< IRhinoUiDataSource * > &aOut) const =0
virtual void  | RemoveDataSource (IRhinoUiDataSource &ds)=0
 Public Member Functions inherited from IRhinoUiDataSourceEventWatcher
virtual void  | Delete (void)=0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)=0
virtual void  | OnEvent (const UUID &uuidData, const IRhinoUiEventInfo *pInfo)=0
 Static Public Member Functions
static void  | CustomDeleter (IRhinoUiController *)
static std::shared_ptr< IRhinoUiController >  | make_shared (IRhinoUiController *)
 Protected Member Functions
virtual  | ~IRhinoUiController ()
 Protected Member Functions inherited from IRhinoUiDataSourceEventWatcher
virtual  | ~IRhinoUiDataSourceEventWatcher ()
Member Enumeration Documentation
◆ EventPriority
 enum IRhinoUiController::EventPriority : unsigned int
strong
Event priority
Enumerator
Low
Low priority
Normal
Normal priority
High
High priority
RealTime
Real-time priority
Constructor & Destructor Documentation
◆ ~IRhinoUiController()
 virtual IRhinoUiController::~IRhinoUiController  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ Activate()
 virtual void IRhinoUiController::Activate  |  ( |  void  |   | )
pure virtual
Call this method when UI construction is complete and the values should be passed for the first time from the model to the view.
◆ CustomDeleter()
 static void IRhinoUiController::CustomDeleter  |  ( |  IRhinoUiController *  |   | )
static
◆ Id()
 virtual UUID IRhinoUiController::Id  |  ( |  void  |   | ) |   const
pure virtual
Returns
The unique id of this controller.
◆ IsActivated()
 virtual bool IRhinoUiController::IsActivated  |  ( |  void  |   | ) |   const
pure virtual
◆ make_shared()
 static std::shared_ptr<IRhinoUiController> IRhinoUiController::make_shared  |  ( |  IRhinoUiController *  |   | )
static
◆ RegisterEventWatcher()
 virtual void IRhinoUiController::RegisterEventWatcher  |  ( |  class IRhinoUiControllerEventWatcher &  |  ew | )
pure virtual
Register an event watcher to be notified when the model changes.
◆ RequiredDataSources()
 virtual void IRhinoUiController::RequiredDataSources  |  ( |  OUT ON_SimpleArray< ON_UUID > &  |  aId | ) |   const
pure virtual
Retrieve an array of data source ids required by this controller.
◆ SetEventPriority()
 virtual EventPriority IRhinoUiController::SetEventPriority  |  ( |  EventPriority  |  ep | )
pure virtual
Set the event priority. You should only change the event priority around an event send and set it back to the old value afterwards.
Returns
the old event priority.
◆ UnregisterEventWatcher()
 virtual void IRhinoUiController::UnregisterEventWatcher  |  ( |  class IRhinoUiControllerEventWatcher &  |  ew | )
pure virtual
Unregister an event watcher which has been added by RegisterEventWatcher(). This must be done when the event watcher is deleted.