Public Member Functions | Friends | List of all members
ON_XMeshEvent Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Public Member Functions
ON_XMeshEvent ()
~ON_XMeshEvent ()
void  | Add (ON_XMeshEdge *pE, double t, int side)
void  | Add (ON_XMeshFace *pF, const ON_3dPoint &abc, int side)
3 doubles. More...
void  | Add (ON_XMeshVertex *pV, int side)
bool  | AddToComponent (int side)
Adds this to it's component's event list. More...
void  | AllComponents (int side, ON_SimpleArray< const ON_XMeshComponent * > &Components) const
void  | AllComponents (int side, ON_SimpleArray< ON_XMeshComponent * > &Components)
void  | AllEdges (int side, ON_SimpleArray< const ON_XMeshEdge * > &Edges) const
void  | AllEdges (int side, ON_SimpleArray< ON_XMeshEdge * > &Edges)
void  | AllFaces (int side, ON_SimpleArray< const ON_XMeshFace * > &Faces) const
void  | AllFaces (int side, ON_SimpleArray< ON_XMeshFace * > &Faces)
void  | AllVertices (int side, ON_SimpleArray< const ON_XMeshVertex * > &Vertices) const
void  | AllVertices (int side, ON_SimpleArray< ON_XMeshVertex * > &Vertices)
Get all faces or edges that involve component[side]. Side value not checked. More...
bool  | ComponentMatches (const ON_XMeshComponent *pC, int side) const
true if m_component[side] = pC More...
bool  | ComponentsMatch (const ON_XMeshComponent *pA, const ON_XMeshComponent *pB) const
true if m_component[0]=pA and m_component[1] = pB; More...
void  | CreateComponentString (ON_XMeshEventComponentString &S) const
For debug purposes. More...
ON_XMeshEdge *  | Edge (int side)
const ON_XMeshEdge *  | Edge (int side) const
ON_XMeshEdge *  | Edge (int side, double &t)
const ON_XMeshEdge *  | Edge (int side, double &t) const
ON_XMeshFace *  | Face (int side)
const ON_XMeshFace *  | Face (int side) const
ON_XMeshFace *  | Face (int side, ON_3dPoint &abc)
const ON_XMeshFace *  | Face (int side, ON_3dPoint &abc) const
bool  | GetFaces (int side, ON_SimpleArray< ON_XMeshFace * > &Faces)
Find all the faces that include the component on side. More...
void  | Ignore ()
Sets m_bIgnore to true. More...
bool  | IsActive () const
Just checks m_bIgnore. More...
ON_3dPoint  | Point (int side) const
Evaluate the component. More...
void  | RemoveFromComponent (int side)
Removes this from its component's event list. More...
bool  | UsesEdge (const ON_XMeshEdge *pE, int side) const
bool  | UsesFace (const ON_XMeshFace *pF, int side) const
ON_XMeshVertex *  | Vertex (int side)
const ON_XMeshVertex *  | Vertex (int side) const
 Friends
class  | ON_XMeshEventIterator
class  | ON_XMeshEventPool
class  | ON_XMeshIntersector
Constructor & Destructor Documentation
◆ ON_XMeshEvent()
 ON_XMeshEvent::ON_XMeshEvent  |  ( |   | )
◆ ~ON_XMeshEvent()
 ON_XMeshEvent::~ON_XMeshEvent  |  ( |   | )
Member Function Documentation
◆ Add() [1/3]
 void ON_XMeshEvent::Add  |  ( |  ON_XMeshEdge *  |  pE,
|  double  |  t,
|  int  |  side
)
◆ Add() [2/3]
 void ON_XMeshEvent::Add  |  ( |  ON_XMeshFace *  |  pF,
|  const ON_3dPoint &  |  abc,
|  int  |  side
)
3 doubles.
◆ Add() [3/3]
 void ON_XMeshEvent::Add  |  ( |  ON_XMeshVertex *  |  pV,
|  int  |  side
)
◆ AddToComponent()
 bool ON_XMeshEvent::AddToComponent  |  ( |  int  |  side | )
Adds this to it's component's event list.
◆ AllComponents() [1/2]
 void ON_XMeshEvent::AllComponents  |  ( |  int  |  side,
|  ON_SimpleArray< const ON_XMeshComponent * > &  |  Components
) |   |  const
◆ AllComponents() [2/2]
 void ON_XMeshEvent::AllComponents  |  ( |  int  |  side,
|  ON_SimpleArray< ON_XMeshComponent * > &  |  Components
)
◆ AllEdges() [1/2]
 void ON_XMeshEvent::AllEdges  |  ( |  int  |  side,
|  ON_SimpleArray< const ON_XMeshEdge * > &  |  Edges
) |   |  const
◆ AllEdges() [2/2]
 void ON_XMeshEvent::AllEdges  |  ( |  int  |  side,
|  ON_SimpleArray< ON_XMeshEdge * > &  |  Edges
)
◆ AllFaces() [1/2]
 void ON_XMeshEvent::AllFaces  |  ( |  int  |  side,
|  ON_SimpleArray< const ON_XMeshFace * > &  |  Faces
) |   |  const
◆ AllFaces() [2/2]
 void ON_XMeshEvent::AllFaces  |  ( |  int  |  side,
|  ON_SimpleArray< ON_XMeshFace * > &  |  Faces
)
◆ AllVertices() [1/2]
 void ON_XMeshEvent::AllVertices  |  ( |  int  |  side,
|  ON_SimpleArray< const ON_XMeshVertex * > &  |  Vertices
) |   |  const
◆ AllVertices() [2/2]
 void ON_XMeshEvent::AllVertices  |  ( |  int  |  side,
|  ON_SimpleArray< ON_XMeshVertex * > &  |  Vertices
)
Get all faces or edges that involve component[side]. Side value not checked.
◆ ComponentMatches()
 bool ON_XMeshEvent::ComponentMatches  |  ( |  const ON_XMeshComponent *  |  pC,
|  int  |  side
) |   |  const
true if m_component[side] = pC
◆ ComponentsMatch()
 bool ON_XMeshEvent::ComponentsMatch  |  ( |  const ON_XMeshComponent *  |  pA,
|  const ON_XMeshComponent *  |  pB
) |   |  const
true if m_component[0]=pA and m_component[1] = pB;
◆ CreateComponentString()
 void ON_XMeshEvent::CreateComponentString  |  ( |  ON_XMeshEventComponentString &  |  S | ) |   const
For debug purposes.
◆ Edge() [1/4]
 ON_XMeshEdge* ON_XMeshEvent::Edge  |  ( |  int  |  side | )
◆ Edge() [2/4]
 const ON_XMeshEdge* ON_XMeshEvent::Edge  |  ( |  int  |  side | ) |   const
◆ Edge() [3/4]
 ON_XMeshEdge* ON_XMeshEvent::Edge  |  ( |  int  |  side,
|  double &  |  t
)
◆ Edge() [4/4]
 const ON_XMeshEdge* ON_XMeshEvent::Edge  |  ( |  int  |  side,
|  double &  |  t
) |   |  const
◆ Face() [1/4]
 ON_XMeshFace* ON_XMeshEvent::Face  |  ( |  int  |  side | )
◆ Face() [2/4]
 const ON_XMeshFace* ON_XMeshEvent::Face  |  ( |  int  |  side | ) |   const
◆ Face() [3/4]
 ON_XMeshFace* ON_XMeshEvent::Face  |  ( |  int  |  side,
|  ON_3dPoint &  |  abc
)
◆ Face() [4/4]
 const ON_XMeshFace* ON_XMeshEvent::Face  |  ( |  int  |  side,
|  ON_3dPoint &  |  abc
) |   |  const
◆ GetFaces()
 bool ON_XMeshEvent::GetFaces  |  ( |  int  |  side,
|  ON_SimpleArray< ON_XMeshFace * > &  |  Faces
)
Find all the faces that include the component on side.
◆ Ignore()
 void ON_XMeshEvent::Ignore  |  ( |   | )
Sets m_bIgnore to true.
◆ IsActive()
 bool ON_XMeshEvent::IsActive  |  ( |   | ) |   const
Just checks m_bIgnore.
◆ Point()
 ON_3dPoint ON_XMeshEvent::Point  |  ( |  int  |  side | ) |   const
Evaluate the component.
◆ RemoveFromComponent()
 void ON_XMeshEvent::RemoveFromComponent  |  ( |  int  |  side | )
Removes this from its component's event list.
◆ UsesEdge()
 bool ON_XMeshEvent::UsesEdge  |  ( |  const ON_XMeshEdge *  |  pE,
|  int  |  side
) |   |  const
◆ UsesFace()
 bool ON_XMeshEvent::UsesFace  |  ( |  const ON_XMeshFace *  |  pF,
|  int  |  side
) |   |  const
◆ Vertex() [1/2]
 ON_XMeshVertex* ON_XMeshEvent::Vertex  |  ( |  int  |  side | )
◆ Vertex() [2/2]
 const ON_XMeshVertex* ON_XMeshEvent::Vertex  |  ( |  int  |  side | ) |   const
Friends And Related Function Documentation
◆ ON_XMeshEventIterator
 friend class ON_XMeshEventIterator
friend
◆ ON_XMeshEventPool
 friend class ON_XMeshEventPool
friend
◆ ON_XMeshIntersector
 friend class ON_XMeshIntersector
friend