Public Member Functions | Protected Attributes | List of all members
CArgsRhinoRevolve Class Reference
RhinoGet
#include <rhinoSdkGetRevolve.h>
 Public Member Functions
CArgsRhinoRevolve ()
~CArgsRhinoRevolve ()
void  | AddInputCurve (CRhinoObject *pCrv)
void  | AddProfile (ON_Curve *pCrv)
ON_Line &  | Axis ()
int  | DeformableDegree ()
int  | DeformablePointCount ()
bool  | DeleteInput () const
ON_Interval  | Domain () const
double  | EndAngle () const
int  | InputCount () const
CRhinoObject *  | InputCurve (int index) const
bool  | IsDeformable ()
ON_Curve *  | Profile (int index)
int  | ProfileCount ()
void  | RemoveProfile (int i)
next 2 functions added Aug 27 2008 - LW More...
void  | ReplaceProfile (int i, ON_Curve *pCrv)
void  | SetAxis (ON_Line &axis)
void  | SetDeformable (bool b=true)
void  | SetDeformableDegree (int degree)
void  | SetDeformablePointCount (int count=5)
void  | SetDeleteInput (bool del=true)
void  | SetDomain (ON_Interval &domain)
void  | SetEndAngle (double endangle)
void  | SetStartAngle (double startangle)
void  | SetTrimToAxis (bool b=true)
double  | StartAngle () const
bool  | TrimToAxis ()
 Protected Attributes
ON_Line  | m_axis = ON_Line::UnsetLine
bool  | m_bDeformable = false
bool  | m_bDeleteInput = false
bool  | m_bTrimToAxis = true
char  | m_deformable_degree = 3
int  | m_deformable_point_count = 4
ON_Interval  | m_domain
angular domain in radians More...
ON_SimpleArray< CRhinoObject * >  | m_input_curves
ON_SimpleArray< ON_Curve * >  | m_profiles
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CArgsRhinoRevolve()
 CArgsRhinoRevolve::CArgsRhinoRevolve  |  ( |   | )
◆ ~CArgsRhinoRevolve()
 CArgsRhinoRevolve::~CArgsRhinoRevolve  |  ( |   | )
Member Function Documentation
◆ AddInputCurve()
 void CArgsRhinoRevolve::AddInputCurve  |  ( |  CRhinoObject *  |  pCrv | )
Description: Add, count, and retrieve pointers to the input curves Parameters: pCrv [in] - curve pointer to store index [in] - index of the curve to retrieve Returns: Pointer to the specified curve or Number of curves stored
◆ AddProfile()
 void CArgsRhinoRevolve::AddProfile  |  ( |  ON_Curve *  |  pCrv | )
◆ Axis()
 ON_Line& CArgsRhinoRevolve::Axis  |  ( |   | )
◆ DeformableDegree()
 int CArgsRhinoRevolve::DeformableDegree  |  ( |   | )
◆ DeformablePointCount()
 int CArgsRhinoRevolve::DeformablePointCount  |  ( |   | )
◆ DeleteInput()
 bool CArgsRhinoRevolve::DeleteInput  |  ( |   | ) |   const
◆ Domain()
 ON_Interval CArgsRhinoRevolve::Domain  |  ( |   | ) |   const
Description: Set or get the angular domain for the revolve Parameters: domain [in] - new domain to set Returns: The current domain
◆ EndAngle()
 double CArgsRhinoRevolve::EndAngle  |  ( |   | ) |   const
◆ InputCount()
 int CArgsRhinoRevolve::InputCount  |  ( |   | ) |   const
◆ InputCurve()
 CRhinoObject* CArgsRhinoRevolve::InputCurve  |  ( |  int  |  index | ) |   const
◆ IsDeformable()
 bool CArgsRhinoRevolve::IsDeformable  |  ( |   | )
Description: Set or get the deformable surface option settings for the revolved surface Parameters: count [in] - number of cv's to use in deformable surfaces, should be bigger than degree degree [in] - the degree of the deformable surface, valid range is from 1 to 11 Returns: @untitled table true Make surface deformable false Make surface exact The number of points for deformable surfaces Remarks: If the number of points is 0, its exact
◆ Profile()
 ON_Curve* CArgsRhinoRevolve::Profile  |  ( |  int  |  index | )
◆ ProfileCount()
 int CArgsRhinoRevolve::ProfileCount  |  ( |   | )
Description: Count, add or get profile curves for the revolve Parameters: pCrv [in] - pointer to a curve to add to the profile array index [in] - index in the profile array of the curve to return Returns: Pointer to the specified profile curve or NULL if the index is invalid
◆ RemoveProfile()
 void CArgsRhinoRevolve::RemoveProfile  |  ( |  int  |  i | )
next 2 functions added Aug 27 2008 - LW
◆ ReplaceProfile()
 void CArgsRhinoRevolve::ReplaceProfile  |  ( |  int  |  i,
|  ON_Curve *  |  pCrv
)
◆ SetAxis()
 void CArgsRhinoRevolve::SetAxis  |  ( |  ON_Line &  |  axis | )
Description: Set or get the revolve axis Parameters: axis [in] - a line on the axis Returns: a line on the axis
◆ SetDeformable()
 void CArgsRhinoRevolve::SetDeformable  |  ( |  bool  |  b = true | )
◆ SetDeformableDegree()
 void CArgsRhinoRevolve::SetDeformableDegree  |  ( |  int  |  degree | )
◆ SetDeformablePointCount()
 void CArgsRhinoRevolve::SetDeformablePointCount  |  ( |  int  |  count = 5 | )
◆ SetDeleteInput()
 void CArgsRhinoRevolve::SetDeleteInput  |  ( |  bool  |  del = true | )
Description: Set or get whether or not input profiles should be deleted. Parameters: del [in] - true: delete input, false: don't delete Returns: @untitled table true Delete input False Don't delete input
◆ SetDomain()
 void CArgsRhinoRevolve::SetDomain  |  ( |  ON_Interval &  |  domain | )
◆ SetEndAngle()
 void CArgsRhinoRevolve::SetEndAngle  |  ( |  double  |  endangle | )
◆ SetStartAngle()
 void CArgsRhinoRevolve::SetStartAngle  |  ( |  double  |  startangle | )
◆ SetTrimToAxis()
 void CArgsRhinoRevolve::SetTrimToAxis  |  ( |  bool  |  b = true | )
Description: Get or set if profiles should be trimmed to the revolve axis Parameters: b [in] - true: trim the profiles, false: don't trim the profiles Returns: @untitled table true Do trim False Don't trim
◆ StartAngle()
 double CArgsRhinoRevolve::StartAngle  |  ( |   | ) |   const
Description: Get or set the start or end angles of the domain Parameters: startangle, endangle [in] - angle to set Returns: Current start or end angle See Also: Domain(), SetDomain()
◆ TrimToAxis()
 bool CArgsRhinoRevolve::TrimToAxis  |  ( |   | )
Member Data Documentation
◆ m_axis
 ON_Line CArgsRhinoRevolve::m_axis = ON_Line::UnsetLine
protected
◆ m_bDeformable
 bool CArgsRhinoRevolve::m_bDeformable = false
protected
◆ m_bDeleteInput
 bool CArgsRhinoRevolve::m_bDeleteInput = false
protected
◆ m_bTrimToAxis
 bool CArgsRhinoRevolve::m_bTrimToAxis = true
protected
◆ m_deformable_degree
 char CArgsRhinoRevolve::m_deformable_degree = 3
protected
◆ m_deformable_point_count
 int CArgsRhinoRevolve::m_deformable_point_count = 4
protected
◆ m_domain
 ON_Interval CArgsRhinoRevolve::m_domain
protected
angular domain in radians
◆ m_input_curves
 ON_SimpleArray<CRhinoObject*> CArgsRhinoRevolve::m_input_curves
protected
◆ m_profiles
 ON_SimpleArray<ON_Curve*> CArgsRhinoRevolve::m_profiles
protected