Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoCurvatureGraphSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoCurvatureGraphSettings ()
CRhinoCurvatureGraphSettings (const CRhinoCurvatureGraphSettings &)
~CRhinoCurvatureGraphSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoCurvatureGraphSettings &other) const
CRhinoCurvatureGraphSettings &  | operator= (const CRhinoCurvatureGraphSettings &)
bool  | operator== (const CRhinoCurvatureGraphSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetWireDensity (int wireDensity)
void  | Validate ()
clamp settings to valid values More...
int  | WireDensity () const
 Public Attributes
bool  | m_bSrfuHair = true
true if surface u isocurve hair is on More...
bool  | m_bSrfvHair = true
true if surface v isocurve hair is on More...
ON_Color  | m_curve_hair_color
int  | m_hair_density = 1
>= 0 larger numbers = more hairs More...
int  | m_hair_scale = 100
100 = true length, > 100 magnified, < 100 shortened More...
int  | m_sample_density = 2
between 1 and 10. Higher numbers draw smoother outer curves. More...
ON_Color  | m_srfu_hair_color
ON_Color  | m_srfv_hair_color
 Static Public Attributes
static const CRhinoCurvatureGraphSettings  | Default
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: When curves, surfaces, and polysurfaces have their curvature graph turned on, these settings control the appearance of the curvature graph.
Constructor & Destructor Documentation
◆ CRhinoCurvatureGraphSettings() [1/2]
 CRhinoCurvatureGraphSettings::CRhinoCurvatureGraphSettings  |  ( |   | )
◆ CRhinoCurvatureGraphSettings() [2/2]
 CRhinoCurvatureGraphSettings::CRhinoCurvatureGraphSettings  |  ( |  const CRhinoCurvatureGraphSettings &  |   | )
◆ ~CRhinoCurvatureGraphSettings()
 CRhinoCurvatureGraphSettings::~CRhinoCurvatureGraphSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoCurvatureGraphSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoCurvatureGraphSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoCurvatureGraphSettings::operator!=  |  ( |  const CRhinoCurvatureGraphSettings &  |  other | ) |   const
◆ operator=()
 CRhinoCurvatureGraphSettings& CRhinoCurvatureGraphSettings::operator=  |  ( |  const CRhinoCurvatureGraphSettings &  |   | )
◆ operator==()
 bool CRhinoCurvatureGraphSettings::operator==  |  ( |  const CRhinoCurvatureGraphSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoCurvatureGraphSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoCurvatureGraphSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetWireDensity()
 void CRhinoCurvatureGraphSettings::SetWireDensity  |  ( |  int  |  wireDensity | )
◆ Validate()
 void CRhinoCurvatureGraphSettings::Validate  |  ( |   | )
clamp settings to valid values
◆ WireDensity()
 int CRhinoCurvatureGraphSettings::WireDensity  |  ( |   | ) |   const
Member Data Documentation
◆ Default
 const CRhinoCurvatureGraphSettings CRhinoCurvatureGraphSettings::Default
static
◆ m_bSrfuHair
 bool CRhinoCurvatureGraphSettings::m_bSrfuHair = true
true if surface u isocurve hair is on
◆ m_bSrfvHair
 bool CRhinoCurvatureGraphSettings::m_bSrfvHair = true
true if surface v isocurve hair is on
◆ m_curve_hair_color
 ON_Color CRhinoCurvatureGraphSettings::m_curve_hair_color
◆ m_hair_density
 int CRhinoCurvatureGraphSettings::m_hair_density = 1
>= 0 larger numbers = more hairs
◆ m_hair_scale
 int CRhinoCurvatureGraphSettings::m_hair_scale = 100
100 = true length, > 100 magnified, < 100 shortened
◆ m_sample_density
 int CRhinoCurvatureGraphSettings::m_sample_density = 2
between 1 and 10. Higher numbers draw smoother outer curves.
◆ m_srfu_hair_color
 ON_Color CRhinoCurvatureGraphSettings::m_srfu_hair_color
◆ m_srfv_hair_color
 ON_Color CRhinoCurvatureGraphSettings::m_srfv_hair_color