Public Member Functions | List of all members
ON_ConvexHullRefEx Class Reference
OpenNURBS
#include <opennurbs_convex_poly.h>
 Inheritance diagram for ON_ConvexHullRefEx:
 Public Member Functions
ON_ConvexHullRefEx ()
ON_ConvexHullRefEx (const double *v0, bool is_rat, int n, int dim, int stride)
As above with a stride to the array. dim <4. More...
ON_ConvexHullRefEx (const double *v0, bool is_rat, int n, int dim=3)
v0 is an array of 2d or 3d points in either euclidean or homogeneous coordinates. dim<4. More...
ON_ConvexHullRefEx (const ON_3dPoint *V0, int count)
a 3d point array More...
ON_ConvexHullRefEx (const ON_3dVector *V0, int count)
a 3d point array More...
ON_ConvexHullRefEx (const ON_4dPoint *V0, int count)
a array of homogeneous points More...
virtual  | ~ON_ConvexHullRefEx () override
int  | Count () const override
void  | Initialize (const double *V0, ON::point_style style, int count)
style must be either not_rational or homogeneous_rational = 2, More...
void  | Initialize (const ON_3dVector *V0, int count)
void  | Initialize (const ON_4dPoint *V0, int count)
virtual double  | MaximumCoordinate () const override
virtual int  | SupportIndex (ON_3dVector W, int i0) const override
Support map. More...
ON_3dVector  | Vertex (int j) const override
 Public Member Functions inherited from ON_ConvexPoly
virtual  | ~ON_ConvexPoly ()
ON_3dPoint  | Evaluate (ON_4dex dex, ON_4dPoint B) const
bool  | GetClosestPoint (const ON_ConvexPoly &BHull, ON_4dex &Adex, ON_4dex &Bdex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPoint (ON_3dPoint P0, ON_4dex &dex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPointSeeded (const ON_ConvexPoly &BHull, ON_4dex &Adex, ON_4dex &Bdex, ON_4dPoint &bary, double maximum_distance=ON_DBL_MAX) const
bool  | GetClosestPointSeeded (ON_3dPoint P0, ON_4dex &dex, ON_4dPoint &Bary, double maximum_distance=ON_DBL_MAX) const
bool  | IsValid4Dex (const ON_4dex &D) const
ON_3dPoint  | Support (ON_3dVector W, int i0=0) const
 Additional Inherited Members
 Static Public Member Functions inherited from ON_ConvexPoly
static bool  | IsValid4DexN (const ON_4dex &D, int n)
static bool  | Standardize (ON_4dex &D, ON_4dPoint &B)
Detailed Description
3d convex hull defined by an explicit collection of points called vertices. Note: vertices need not be extreme points WARNING: Points are referenced not stored for optimal performance in' some applications. The list of points must remain alive and in there initial location For the duration of this object.
This is an improved version of ON_ConvexHullRef that includes support for 2d point lists.
Constructor & Destructor Documentation
◆ ON_ConvexHullRefEx() [1/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |   | )
inline
◆ ON_ConvexHullRefEx() [2/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |  const ON_3dVector *  |  V0,
|  int  |  count
)
a 3d point array
◆ ON_ConvexHullRefEx() [3/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |  const ON_3dPoint *  |  V0,
|  int  |  count
)
a 3d point array
◆ ON_ConvexHullRefEx() [4/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |  const ON_4dPoint *  |  V0,
|  int  |  count
)
a array of homogeneous points
◆ ON_ConvexHullRefEx() [5/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |  const double *  |  v0,
|  bool  |  is_rat,
|  int  |  n,
|  int  |  dim = 3
)
v0 is an array of 2d or 3d points in either euclidean or homogeneous coordinates. dim<4.
◆ ON_ConvexHullRefEx() [6/6]
 ON_ConvexHullRefEx::ON_ConvexHullRefEx  |  ( |  const double *  |  v0,
|  bool  |  is_rat,
|  int  |  n,
|  int  |  dim,
|  int  |  stride
)
As above with a stride to the array. dim <4.
◆ ~ON_ConvexHullRefEx()
 virtual ON_ConvexHullRefEx::~ON_ConvexHullRefEx  |  ( |   | )
inlineoverridevirtual
Member Function Documentation
◆ Count()
 int ON_ConvexHullRefEx::Count  |  ( |   | ) |   const
inlineoverridevirtual
Returns: Number of vertices >=0
Implements ON_ConvexPoly.
◆ Initialize() [1/3]
 void ON_ConvexHullRefEx::Initialize  |  ( |  const double *  |  V0,
|  ON::point_style  |  style,
|  int  |  count
)
style must be either not_rational or homogeneous_rational = 2,
◆ Initialize() [2/3]
 void ON_ConvexHullRefEx::Initialize  |  ( |  const ON_3dVector *  |  V0,
|  int  |  count
)
◆ Initialize() [3/3]
 void ON_ConvexHullRefEx::Initialize  |  ( |  const ON_4dPoint *  |  V0,
|  int  |  count
)
◆ MaximumCoordinate()
 virtual double ON_ConvexHullRefEx::MaximumCoordinate  |  ( |   | ) |   const
overridevirtual
Description: This is a bound on the collection of vertices. Vertex(i).MaximumCoordinate()<= MaximumCoordinate() for all i
Implements ON_ConvexPoly.
◆ SupportIndex()
 virtual int ON_ConvexHullRefEx::SupportIndex  |  ( |  ON_3dVector  |  W,
|  int  |  i0
) |   |  const
overridevirtual
Support map.
Implements ON_ConvexPoly.
◆ Vertex()
 ON_3dVector ON_ConvexHullRefEx::Vertex  |  ( |  int  |  i | ) |   const
overridevirtual
Returns: Vertex[i] for i=0,...,Count()-1
Implements ON_ConvexPoly.