Public Member Functions | Public Attributes | List of all members
CRhinoAppContextMenuSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppContextMenuSettings ()
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoAppContextMenuSettings &) const
bool  | operator== (const CRhinoAppContextMenuSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
 Public Attributes
CRhinoStringDictionary  | m_grip_context_menu_items
CRhinoStringDictionary  | m_object_context_menu_items
CRhinoStringDictionary  | m_view_context_menu_items
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppContextMenuSettings()
 CRhinoAppContextMenuSettings::CRhinoAppContextMenuSettings  |  ( |   | )
Member Function Documentation
◆ LoadProfile()
 void CRhinoAppContextMenuSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoAppContextMenuSettings::operator!=  |  ( |  const CRhinoAppContextMenuSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppContextMenuSettings::operator==  |  ( |  const CRhinoAppContextMenuSettings &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppContextMenuSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
Member Data Documentation
◆ m_grip_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_grip_context_menu_items
◆ m_object_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_object_context_menu_items
◆ m_view_context_menu_items
 CRhinoStringDictionary CRhinoAppContextMenuSettings::m_view_context_menu_items