Public Member Functions | Public Attributes | List of all members
CRhinoPageViewObjectIterator Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Inheritance diagram for CRhinoPageViewObjectIterator:
 Public Member Functions
CRhinoPageViewObjectIterator (unsigned int rhino_page_view_serial_number, object_state=normal_or_locked_objects, object_category=active_objects)
~CRhinoPageViewObjectIterator ()
 Public Member Functions inherited from CRhinoObjectIterator
CRhinoObjectIterator (const CRhinoDoc &, object_state=normal_or_locked_objects, object_category=active_objects)
CRhinoObjectIterator (const CRhinoObjectIterator &)
CRhinoObjectIterator (object_state s=normal_or_locked_objects, object_category c=active_objects)
obsolete constructor - you must specify the document More...
CRhinoObjectIterator (unsigned int rhino_doc_sn, const class CRhinoFileWriteOptions &fwo)
CRhinoObjectIterator (unsigned int rhino_doc_sn, object_state=normal_or_locked_objects, object_category=active_objects)
~CRhinoObjectIterator ()
CRhinoDoc *  | Document () const
void  | EnableFastSelection (bool bEnableFastSelection=true)
void  | EnableSelectedFilter (BOOL32 b=true, BOOL32 bCheckSubObjects=false)
void  | EnableVisibleFilter (BOOL32 b=true)
CRhinoObject *  | First ()
void  | IncludeGrips (bool bIncludeGrips=true)
void  | IncludeLights (BOOL32 bIncludeLights=true)
void  | IncludeMarkups (bool include=true)
void  | IncludePhantoms (bool bIncludePhantoms=true)
CRhinoObject *  | Next ()
const CRhinoObjectIterator &  | operator= (const CRhinoObjectIterator &)=delete
void  | SetActiveInViewportFilter (bool bEnable, const CRhinoViewport &viewport, bool bFilter)
void  | SetLayerFilter (int layer_index)
void  | SetMarkupFilter (const ON_UUID &markup_id)
void  | SetMaterialFilter (int material_index)
void  | SetObjectFilter (unsigned int object_filter)
void  | SetSpaceFilter (bool bEnable, ON::active_space space, bool bFilter)
void  | SetViewportFilter (const CRhinoViewport &viewport)
void  | SetViewportIdFilter (bool bEnable, ON_UUID viewport_id, bool bFilter)
 Public Attributes
const bool  | m_bValidIterator
const ON_UUID  | m_rhino_page_view_main_viewport_id
const unsigned int  | m_rhino_page_view_sn
 Public Attributes inherited from CRhinoObjectIterator
const unsigned int  | m_rhino_doc_sn
document being iterated. More...
 Additional Inherited Members
 Public Types inherited from CRhinoObjectIterator
enum  | object_category { active_objects = 1, reference_objects = 2, active_and_reference_objects = 3 }
enum  | object_state {
 normal_objects = 1, locked_objects = 2, hidden_objects = 4, idef_objects = 8,
 deleted_objects = 16, normal_or_locked_objects = 3, undeleted_objects = 7, all_objects = 0xFFFFFFFF,
 undeleted_and_idef_objects = 0x7FFFFFFF
 }
Detailed Description
Description: Tool to go through rhino objects that are on a specified page
Constructor & Destructor Documentation
◆ CRhinoPageViewObjectIterator()
 CRhinoPageViewObjectIterator::CRhinoPageViewObjectIterator  |  ( |  unsigned int  |  rhino_page_view_serial_number,
|  object_state  |   = normal_or_locked_objects,
|  object_category  |   = active_objects
)
◆ ~CRhinoPageViewObjectIterator()
 CRhinoPageViewObjectIterator::~CRhinoPageViewObjectIterator  |  ( |   | )
Member Data Documentation
◆ m_bValidIterator
 const bool CRhinoPageViewObjectIterator::m_bValidIterator
◆ m_rhino_page_view_main_viewport_id
 const ON_UUID CRhinoPageViewObjectIterator::m_rhino_page_view_main_viewport_id
◆ m_rhino_page_view_sn
 const unsigned int CRhinoPageViewObjectIterator::m_rhino_page_view_sn