Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_AngleUnitName Class Reference
OpenNURBS
#include <opennurbs_parse.h>
 Public Member Functions
ON_AngleUnitName ()=default
ON_AngleUnitName (const ON_AngleUnitName &)=default
~ON_AngleUnitName ()=default
ON::AngleUnitSystem  | AngleUnit () const
bool  | AngleUnitAndNameAreSet () const
bool  | AngleUnitIsSet () const
bool  | AngleUnitIsSetOrNone () const
const wchar_t *  | AngleUnitName () const
bool  | AngleUnitNameIsEmpty () const
bool  | AngleUnitNameIsNotEmpty () const
bool  | AngleUnitNameIsPlural () const
bool  | AngleUnitNameIsSingular () const
unsigned int  | LocaleId () const
ON_AngleUnitName &  | operator= (const ON_AngleUnitName &)=default
 Static Public Member Functions
static int  | CompareLocaleIdUnitSystemName (const ON_AngleUnitName &a, const ON_AngleUnitName &b)
static int  | CompareUnitSystemLocaleIdName (const ON_AngleUnitName &a, const ON_AngleUnitName &b)
static ON_AngleUnitName  | Create (unsigned int locale_id, ON::AngleUnitSystem angle_unit_system, bool bPlural)
static unsigned int  | GetAngleUnitNameList (size_t angle_unit_list_capacity, class ON_AngleUnitName *angle_unit_list)
 Static Public Attributes
static const ON_AngleUnitName  | None
Constructor & Destructor Documentation
◆ ON_AngleUnitName() [1/2]
 ON_AngleUnitName::ON_AngleUnitName  |  ( |   | )
default
◆ ~ON_AngleUnitName()
 ON_AngleUnitName::~ON_AngleUnitName  |  ( |   | )
default
◆ ON_AngleUnitName() [2/2]
 ON_AngleUnitName::ON_AngleUnitName  |  ( |  const ON_AngleUnitName &  |   | )
default
Member Function Documentation
◆ AngleUnit()
 ON::AngleUnitSystem ON_AngleUnitName::AngleUnit  |  ( |   | ) |   const
◆ AngleUnitAndNameAreSet()
 bool ON_AngleUnitName::AngleUnitAndNameAreSet  |  ( |   | ) |   const
Returns: True if the angle unit system is set and the name is not empty. False if length unit system is ON::AngleUnitSystem::None or ON::AngleUnitSystem::Unset or the name is empty.
◆ AngleUnitIsSet()
 bool ON_AngleUnitName::AngleUnitIsSet  |  ( |   | ) |   const
Returns: True if the angle unit system is set. False if angle unit system is ON::AngleUnitSystem::None or ON::AngleUnitSystem::Unset.
◆ AngleUnitIsSetOrNone()
 bool ON_AngleUnitName::AngleUnitIsSetOrNone  |  ( |   | ) |   const
Returns: True if the angle unit system is set or is ON::AngleUnitSystem::None
◆ AngleUnitName()
 const wchar_t* ON_AngleUnitName::AngleUnitName  |  ( |   | ) |   const
Returns: A pointer to a localized angle unit name or a pointer to an empty string. Remarks: Never returns nullptr.
◆ AngleUnitNameIsEmpty()
 bool ON_AngleUnitName::AngleUnitNameIsEmpty  |  ( |   | ) |   const
◆ AngleUnitNameIsNotEmpty()
 bool ON_AngleUnitName::AngleUnitNameIsNotEmpty  |  ( |   | ) |   const
◆ AngleUnitNameIsPlural()
 bool ON_AngleUnitName::AngleUnitNameIsPlural  |  ( |   | ) |   const
Remarks: True if the angle unit name is plural in languages where that question has a meaningful answer. Remarks: Some names and name abbreviations are both singular and plural.
◆ AngleUnitNameIsSingular()
 bool ON_AngleUnitName::AngleUnitNameIsSingular  |  ( |   | ) |   const
Remarks: True if the angle unit name is singular in languages where that question has a meaningful answer. Remarks: Some names and name abbreviations are both singular and plural.
◆ CompareLocaleIdUnitSystemName()
 static int ON_AngleUnitName::CompareLocaleIdUnitSystemName  |  ( |  const ON_AngleUnitName &  |  a,
|  const ON_AngleUnitName &  |  b
)
static
Description: Dictionary compare of all ON_LengthUnitName information in the order locale id, unit system, name, singular, plural
◆ CompareUnitSystemLocaleIdName()
 static int ON_AngleUnitName::CompareUnitSystemLocaleIdName  |  ( |  const ON_AngleUnitName &  |  a,
|  const ON_AngleUnitName &  |  b
)
static
Description: Dictionary compare of all ON_LengthUnitName information in the order unit system, locale id, name, singular, plural
◆ Create()
 static ON_AngleUnitName ON_AngleUnitName::Create  |  ( |  unsigned int  |  locale_id,
|  ON::AngleUnitSystem  |  angle_unit_system,
|  bool  |  bPlural
)
static
◆ GetAngleUnitNameList()
 static unsigned int ON_AngleUnitName::GetAngleUnitNameList  |  ( |  size_t  |  angle_unit_list_capacity,
|  class ON_AngleUnitName *  |  angle_unit_list
)
static
Description: Get list of angle unit names and abbreviations and their corresponding unit systems that are recognized by ON_ParseAngleUnitName().
Parameters: angle_unit_list_capacity - [in] number of available elements in angle_unit_list[] If angle_unit_list_capacity is zero and angle_unit_list is null, then the number of angle unit names is returned. angle_unit_list - [out] The list of angle unit names is returned here.
Returns: Number of angle unit names and abbreviations.
Example: unsigned int count = ON_GetAngleUnitNameList(0,0); ON_UnitName* angle_unit_list = new (std::nothrow) ON_UnitName[capacity]; count = ON_GetAngleUnitNameList(count,angle_unit_list); ... delete[] angle_unit_list; Remarks: If angle_unit_list_capacity is zero and angle_unit_list is null, then the number of angle unit names is returned.
◆ LocaleId()
 unsigned int ON_AngleUnitName::LocaleId  |  ( |   | ) |   const
◆ operator=()
 ON_AngleUnitName& ON_AngleUnitName::operator=  |  ( |  const ON_AngleUnitName &  |   | )
default
Member Data Documentation
◆ None
 const ON_AngleUnitName ON_AngleUnitName::None
static