Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_PlanarSections Class Reference
OpenNURBS
#include <opennurbs_plus_sections.h>
 Public Member Functions
ON_PlanarSections ()
ON_PlanarSections (const ON_PlanarSections &src)
~ON_PlanarSections ()
bool  | Append (class ON_MeshXPlane &mxp, const class ON_Surface *srf, const class ON_SectionAnalysisAppearance &appearance, const class ON_SectionAnalysisPlane &plane)
void  | DeleteSectionsWithSectionAppearanceId (ON_UUID m_section_appearance_id)
void  | DeleteSectionsWithSectionPlaneId (ON_UUID m_section_plane_id)
ON_PlanarSections &  | operator= (const ON_PlanarSections &src)
 Static Public Member Functions
static bool  | AttachToObject (const class ON_Object &object, class ON_MeshXPlane &mxp, const class ON_Surface *srf, const class ON_SectionAnalysisAppearance &appearance, const class ON_SectionAnalysisPlane &plane)
static bool  | AttachToObject (const class ON_Object *object, class ON_MeshXPlane &mxp, const class ON_Surface *srf, const class ON_SectionAnalysisAppearance &appearance, const class ON_SectionAnalysisPlane &plane)
static const ON_PlanarSections *  | Get (const class ON_Object &obj)
static const ON_PlanarSections *  | Get (const class ON_Object *obj)
static void  | RemoveFromObject (const class ON_Object &obj)
static void  | RemoveFromObject (const class ON_Object *obj)
 Public Attributes
const unsigned char  | m_class_version
constructor sets m_class_version = 0; More...
ON__UINT64  | m_section_appearances_mark
ON__UINT64  | m_section_planes_mark
ON_SimpleArray< const class ON_PlanarSection * >  | m_sections
Constructor & Destructor Documentation
◆ ON_PlanarSections() [1/2]
 ON_PlanarSections::ON_PlanarSections  |  ( |   | )
◆ ~ON_PlanarSections()
 ON_PlanarSections::~ON_PlanarSections  |  ( |   | )
◆ ON_PlanarSections() [2/2]
 ON_PlanarSections::ON_PlanarSections  |  ( |  const ON_PlanarSections &  |  src | )
Member Function Documentation
◆ Append()
 bool ON_PlanarSections::Append  |  ( |  class ON_MeshXPlane &  |  mxp,
|  const class ON_Surface *  |  srf,
|  const class ON_SectionAnalysisAppearance &  |  appearance,
|  const class ON_SectionAnalysisPlane &  |  plane
)
Description: Calculate and append planar sections to m_sections[]. Parameters: mxp - [in] srf - [in] If srf is not null, then msp.m_mesh must be an approximation of srf and mxp.m_mesh.m_S[] must be parameters from srf. appearance - [in] plane - [in]
◆ AttachToObject() [1/2]
 static bool ON_PlanarSections::AttachToObject  |  ( |  const class ON_Object &  |  object,
|  class ON_MeshXPlane &  |  mxp,
|  const class ON_Surface *  |  srf,
|  const class ON_SectionAnalysisAppearance &  |  appearance,
|  const class ON_SectionAnalysisPlane &  |  plane
)
static
Description: Calculate and attach planar sections to object. Parameters: object - [in] The section information will be attached to object. Typically, object will be mxp.m_mesh or the surface, brep face or brep used to create the mesh, but you can attach the sections to any class derived from ON_Object. mxp - [in] a mesh and a plane to intersect. srf - [in] If srf is not null, then msp.m_mesh must be an approximation of srf and mxp.m_mesh.m_S[] must be parameters from srf. srf will be used to calculate sectional curvature information. Often, mxp.m_mesh is a mesh of a brep face and srf is the underlying surface. appearance - [in] plane - [in]
◆ AttachToObject() [2/2]
 static bool ON_PlanarSections::AttachToObject  |  ( |  const class ON_Object *  |  object,
|  class ON_MeshXPlane &  |  mxp,
|  const class ON_Surface *  |  srf,
|  const class ON_SectionAnalysisAppearance &  |  appearance,
|  const class ON_SectionAnalysisPlane &  |  plane
)
static
◆ DeleteSectionsWithSectionAppearanceId()
 void ON_PlanarSections::DeleteSectionsWithSectionAppearanceId  |  ( |  ON_UUID  |  m_section_appearance_id | )
◆ DeleteSectionsWithSectionPlaneId()
 void ON_PlanarSections::DeleteSectionsWithSectionPlaneId  |  ( |  ON_UUID  |  m_section_plane_id | )
◆ Get() [1/2]
 static const ON_PlanarSections* ON_PlanarSections::Get  |  ( |  const class ON_Object &  |  obj | )
static
Description: Gets any planar sections that are attached to obj. Parameters: obj - [in]
◆ Get() [2/2]
 static const ON_PlanarSections* ON_PlanarSections::Get  |  ( |  const class ON_Object *  |  obj | )
static
◆ operator=()
 ON_PlanarSections& ON_PlanarSections::operator=  |  ( |  const ON_PlanarSections &  |  src | )
◆ RemoveFromObject() [1/2]
 static void ON_PlanarSections::RemoveFromObject  |  ( |  const class ON_Object &  |  obj | )
static
Description: Destroys all planar sections that are attached to obj. Parameters: obj - [in]
◆ RemoveFromObject() [2/2]
 static void ON_PlanarSections::RemoveFromObject  |  ( |  const class ON_Object *  |  obj | )
static
Member Data Documentation
◆ m_class_version
 const unsigned char ON_PlanarSections::m_class_version
constructor sets m_class_version = 0;
Fields may be added to this class during the V5 lifecycle. If that happens, then m_class_version will be incremented.
◆ m_section_appearances_mark
 ON__UINT64 ON_PlanarSections::m_section_appearances_mark
◆ m_section_planes_mark
 ON__UINT64 ON_PlanarSections::m_section_planes_mark
◆ m_sections
 ON_SimpleArray< const class ON_PlanarSection* > ON_PlanarSections::m_sections