Public Member Functions | List of all members
CRhRdkContentMoved Class Referencefinal
RDK
#include <RhRdkEventSink.h>
 Public Member Functions
CRhRdkContentMoved (const CRhRdkContentArray &aContentMoved, const CRhRdkContent *pBefore, HWND hWnd, const UUID &e, void *p)
const CRhRdkContent *  | ContentBefore (void) const
const CRhRdkContentArray &  | ContentMoved (void) const
UUID  | EditorId (void) const
HWND  | Window (void) const
Detailed Description
Deprecated:
OBSOLETE
Constructor & Destructor Documentation
◆ CRhRdkContentMoved()
 CRhRdkContentMoved::CRhRdkContentMoved  |  ( |  const CRhRdkContentArray &  |  aContentMoved,
|  const CRhRdkContent *  |  pBefore,
|  HWND  |  hWnd,
|  const UUID &  |  e,
|  void *  |  p
)
Member Function Documentation
◆ ContentBefore()
 const CRhRdkContent* CRhRdkContentMoved::ContentBefore  |  ( |  void  |   | ) |   const
inline
◆ ContentMoved()
 const CRhRdkContentArray& CRhRdkContentMoved::ContentMoved  |  ( |  void  |   | ) |   const
inline
◆ EditorId()
 UUID CRhRdkContentMoved::EditorId  |  ( |  void  |   | ) |   const
inline
◆ Window()
 HWND CRhRdkContentMoved::Window  |  ( |  void  |   | ) |   const
inline