Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoSdkRenderFrame Class Referenceabstract
Rhino
#include <RhinoSdkRenderFrame.h>
 Inheritance diagram for IRhinoSdkRenderFrame:
 Public Member Functions
virtual bool  | CopyRenderWindowToClipboard () const =0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual ON_2iSize  | ImageSize () const =0
virtual bool  | IsRendering () const =0
virtual void  | MakeModal (bool bModal)=0
virtual bool  | SaveRenderImageAs (const wchar_t *lpsFileName) const =0
virtual void  | SetImageSize (const ON_2iSize &)=0
virtual void  | SetPlugIn (CRhinoRenderPlugIn *pPlugIn)=0
virtual void  | SetRenderCommand (CRhinoSdkRender *pRenderCommand)=0
virtual void  | SetSaveOnClose (bool bSave)=0
virtual void  | SetView (const ON_3dmView &view)=0
virtual bool  | StartRendering ()=0
virtual void  | StopRendering ()=0
virtual const ON_3dmView &  | View () const =0
 Public Member Functions inherited from IRhinoWindow
virtual  | ~IRhinoWindow ()=default
virtual bool  | Create (const CRhinoWindowCreateOptions &options)=0
virtual bool  | Created () const =0
virtual bool  | Destroy ()=0
virtual const wchar_t *  | EnglishCaption () const =0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual RHINO_WINDOW_HANDLE  | Handle (void)=0
virtual bool  | IsEnabled () const =0
virtual bool  | IsVisible () const =0
virtual const wchar_t *  | LocalCaption () const
virtual ON_2iPoint  | Location () const =0
virtual RHINO_WINDOW_HANDLE  | Parent () const =0
virtual void  | Refresh (bool immediate=false)=0
virtual void  | Release ()=0
virtual void  | SetFocused ()=0
virtual void  | SetIsEnabled (bool enable)=0
virtual void  | SetIsVisible (bool visible)=0
virtual void  | SetLocation (ON_2iPoint location)=0
virtual void  | SetParent (RHINO_WINDOW_HANDLE parent)=0
virtual void  | SetSize (ON_2iSize size, bool redraw=false, bool redrawBorder=false)=0
virtual ON_2iSize  | Size () const =0
virtual LPARAM  | WindowProc (unsigned int message, WPARAM wParam, LPARAM lParam)
 Static Public Member Functions
static ON_SimpleArray< class IRhinoSdkRenderFrame * >  | RenderFrames (const CRhinoDoc &)
static class IRhinoSdkRenderFrame *  | TopRenderFrame (const CRhinoDoc &)
 Protected Member Functions
IRhinoSdkRenderFrame ()
virtual  | ~IRhinoSdkRenderFrame ()
virtual void  | Delete (void)=0
 Protected Member Functions inherited from IRhinoWindow
IRhinoWindow ()=default
IRhinoWindow (const IRhinoWindow &)=delete
IRhinoWindow &  | operator= (const IRhinoWindow &)=delete
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. RhinoSdkRenderFrame.h : header file This is the new, modern, MFC free version of the render window class. The old CRhinoSdkRenderFrame class can access this interface through the RenderFrame() functions. This will provide the encapsulation that allows non-MFC windows to be used without hacks in Rhino 6.8 onwards.
Constructor & Destructor Documentation
◆ IRhinoSdkRenderFrame()
 IRhinoSdkRenderFrame::IRhinoSdkRenderFrame  |  ( |   | )
protected
◆ ~IRhinoSdkRenderFrame()
 virtual IRhinoSdkRenderFrame::~IRhinoSdkRenderFrame  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ CopyRenderWindowToClipboard()
 virtual bool IRhinoSdkRenderFrame::CopyRenderWindowToClipboard  |  ( |   | ) |   const
pure virtual
◆ Delete()
 virtual void IRhinoSdkRenderFrame::Delete  |  ( |  void  |   | )
protectedpure virtual
This is for implementation only, to ensure that the correct runtime is used for memory deallocation. This function cannot be called from anywhere else than the implementation for IRhinoWindow::Release.
◆ EVF()
 virtual void* IRhinoSdkRenderFrame::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
◆ ImageSize()
 virtual ON_2iSize IRhinoSdkRenderFrame::ImageSize  |  ( |   | ) |   const
pure virtual
◆ IsRendering()
 virtual bool IRhinoSdkRenderFrame::IsRendering  |  ( |   | ) |   const
pure virtual
◆ MakeModal()
 virtual void IRhinoSdkRenderFrame::MakeModal  |  ( |  bool  |  bModal | )
pure virtual
◆ RenderFrames()
 static ON_SimpleArray<class IRhinoSdkRenderFrame*> IRhinoSdkRenderFrame::RenderFrames  |  ( |  const CRhinoDoc &  |   | )
static
◆ SaveRenderImageAs()
 virtual bool IRhinoSdkRenderFrame::SaveRenderImageAs  |  ( |  const wchar_t *  |  lpsFileName | ) |   const
pure virtual
◆ SetImageSize()
 virtual void IRhinoSdkRenderFrame::SetImageSize  |  ( |  const ON_2iSize &  |   | )
pure virtual
◆ SetPlugIn()
 virtual void IRhinoSdkRenderFrame::SetPlugIn  |  ( |  CRhinoRenderPlugIn *  |  pPlugIn | )
pure virtual
◆ SetRenderCommand()
 virtual void IRhinoSdkRenderFrame::SetRenderCommand  |  ( |  CRhinoSdkRender *  |  pRenderCommand | )
pure virtual
◆ SetSaveOnClose()
 virtual void IRhinoSdkRenderFrame::SetSaveOnClose  |  ( |  bool  |  bSave | )
pure virtual
◆ SetView()
 virtual void IRhinoSdkRenderFrame::SetView  |  ( |  const ON_3dmView &  |  view | )
pure virtual
◆ StartRendering()
 virtual bool IRhinoSdkRenderFrame::StartRendering  |  ( |   | )
pure virtual
◆ StopRendering()
 virtual void IRhinoSdkRenderFrame::StopRendering  |  ( |   | )
pure virtual
◆ TopRenderFrame()
 static class IRhinoSdkRenderFrame* IRhinoSdkRenderFrame::TopRenderFrame  |  ( |  const CRhinoDoc &  |   | )
static
◆ View()
 virtual const ON_3dmView& IRhinoSdkRenderFrame::View  |  ( |   | ) |   const
pure virtual