Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmConstructionPlaneGridDefaults Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmConstructionPlaneGridDefaults ()=default
ON_3dmConstructionPlaneGridDefaults (const ON_3dmConstructionPlaneGridDefaults &)=default
~ON_3dmConstructionPlaneGridDefaults ()=default
void  | Dump (ON_TextLog &text_log) const
ON_3dmConstructionPlaneGridDefaults &  | operator= (const ON_3dmConstructionPlaneGridDefaults &)=default
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bShowGrid = true
bool  | m_bShowGridAxes = true
bool  | m_bShowWorldAxes = true
int  | m_grid_line_count = 70
number of grid lines in each direction More...
double  | m_grid_spacing = 1.0
distance between grid lines More...
int  | m_grid_thick_frequency = 5
double  | m_snap_spacing = 1.0
 Static Public Attributes
static const ON_3dmConstructionPlaneGridDefaults  | Default
Detailed Description
ON_3dmConstructionPlaneGridDefaults
Default settings used for construction plane grids
Constructor & Destructor Documentation
◆ ON_3dmConstructionPlaneGridDefaults() [1/2]
 ON_3dmConstructionPlaneGridDefaults::ON_3dmConstructionPlaneGridDefaults  |  ( |   | )
default
◆ ~ON_3dmConstructionPlaneGridDefaults()
 ON_3dmConstructionPlaneGridDefaults::~ON_3dmConstructionPlaneGridDefaults  |  ( |   | )
default
◆ ON_3dmConstructionPlaneGridDefaults() [2/2]
 ON_3dmConstructionPlaneGridDefaults::ON_3dmConstructionPlaneGridDefaults  |  ( |  const ON_3dmConstructionPlaneGridDefaults &  |   | )
default
Member Function Documentation
◆ Dump()
 void ON_3dmConstructionPlaneGridDefaults::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ operator=()
 ON_3dmConstructionPlaneGridDefaults& ON_3dmConstructionPlaneGridDefaults::operator=  |  ( |  const ON_3dmConstructionPlaneGridDefaults &  |   | )
default
◆ Read()
 bool ON_3dmConstructionPlaneGridDefaults::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmConstructionPlaneGridDefaults::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Default
 const ON_3dmConstructionPlaneGridDefaults ON_3dmConstructionPlaneGridDefaults::Default
static
◆ m_bShowGrid
 bool ON_3dmConstructionPlaneGridDefaults::m_bShowGrid = true
0: none, 1: all lines are thick, 2: every other is thick, ...
◆ m_bShowGridAxes
 bool ON_3dmConstructionPlaneGridDefaults::m_bShowGridAxes = true
◆ m_bShowWorldAxes
 bool ON_3dmConstructionPlaneGridDefaults::m_bShowWorldAxes = true
◆ m_grid_line_count
 int ON_3dmConstructionPlaneGridDefaults::m_grid_line_count = 70
number of grid lines in each direction
distance between snap points. Typically this is the same distance as grid spacing.
◆ m_grid_spacing
 double ON_3dmConstructionPlaneGridDefaults::m_grid_spacing = 1.0
distance between grid lines
◆ m_grid_thick_frequency
 int ON_3dmConstructionPlaneGridDefaults::m_grid_thick_frequency = 5
thick line frequency
◆ m_snap_spacing
 double ON_3dmConstructionPlaneGridDefaults::m_snap_spacing = 1.0
when "grid snap" is enabled, the