Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoPropertiesPanelPageEventArgs Class Referenceabstract
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
virtual bool  | AnySelected (unsigned int objectTypes) const =0
virtual CRhinoDoc *  | Document () const =0
virtual unsigned int  | DocumentRuntimeSerialNumber () const =0
virtual int  | GetObjects (ON_SimpleArray< const CRhinoObject * > &objectList) const =0
virtual int  | GetObjects (unsigned int objectTypes, ON_SimpleArray< const CRhinoObject * > &objectList) const =0
virtual const CRhinoObject *  | ObjectAt (int index) const =0
virtual int  | ObjectCount () const =0
virtual unsigned int  | ObjectTypes () const =0
virtual CRhinoView *  | View () const =0
virtual class CRhinoViewport *  | Viewport () const =0
virtual ON_UUID  | ViewportId () const =0
virtual unsigned int  | ViewRuntimeSerialNumber () const =0
 Static Public Member Functions
static IRhinoPropertiesPanelPageEventArgs *  | FromHost (const class IRhinoPropertiesPanelPageHost *host)
static IRhinoPropertiesPanelPageEventArgs *  | FromPage (const class IRhinoPropertiesPanelPage *page)
 Protected Member Functions
IRhinoPropertiesPanelPageEventArgs ()=default
IRhinoPropertiesPanelPageEventArgs (const IRhinoPropertiesPanelPageEventArgs &)=delete
~IRhinoPropertiesPanelPageEventArgs ()=default
IRhinoPropertiesPanelPageEventArgs &  | operator= (const IRhinoPropertiesPanelPageEventArgs &)=delete
Detailed Description
class IRhinoPropertiesPanelPageEventArgs
Description: Interface used to extend the Rhino object properties panel.
Constructor & Destructor Documentation
◆ IRhinoPropertiesPanelPageEventArgs() [1/2]
 IRhinoPropertiesPanelPageEventArgs::IRhinoPropertiesPanelPageEventArgs  |  ( |   | )
protecteddefault
 Description: Default constructor.
◆ ~IRhinoPropertiesPanelPageEventArgs()
 IRhinoPropertiesPanelPageEventArgs::~IRhinoPropertiesPanelPageEventArgs  |  ( |   | )
protecteddefault
 Description: Default destructor.
◆ IRhinoPropertiesPanelPageEventArgs() [2/2]
 IRhinoPropertiesPanelPageEventArgs::IRhinoPropertiesPanelPageEventArgs  |  ( |  const IRhinoPropertiesPanelPageEventArgs &  |   | )
protecteddelete
 Description: Delete the default copy constructor
Member Function Documentation
◆ AnySelected()
 virtual bool IRhinoPropertiesPanelPageEventArgs::AnySelected  |  ( |  unsigned int  |  objectTypes | ) |   const
pure virtual
 Description: Call this method to determine if the list contains any objects of the specified type. Parameters: objectTypes [in] - Type(s) of objects to filter for, see CRhinoObject::ObjectType Returns: Returns true if there is one or more objects of objectType in currently selected or false if there are none.
◆ Document()
 virtual CRhinoDoc* IRhinoPropertiesPanelPageEventArgs::Document  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the runtime serial number for the document that was active when the message was generated. Returns: Returns the document that was active or null if there was none.
◆ DocumentRuntimeSerialNumber()
 virtual unsigned int IRhinoPropertiesPanelPageEventArgs::DocumentRuntimeSerialNumber  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the runtime serial number for the document that was active when the message was generated. Returns: Returns the runtime serial number for the document that was active.
◆ FromHost()
 static IRhinoPropertiesPanelPageEventArgs* IRhinoPropertiesPanelPageEventArgs::FromHost  |  ( |  const class IRhinoPropertiesPanelPageHost *  |  host | )
static
 Description: This is being provided temporarily to allow access to the selected object list from the IRhinoPropertiesPanelPageHost. Returns: If the page is valid then a pointer to the host page IRhinoPropertiesPanelPageEventArgs interface is returned otherwise; null is returned. DO NOT delete this pointer.
◆ FromPage()
 static IRhinoPropertiesPanelPageEventArgs* IRhinoPropertiesPanelPageEventArgs::FromPage  |  ( |  const class IRhinoPropertiesPanelPage *  |  page | )
static
 Description: This is being provided temporarily to allow access to the selected object list from the IRhinoPropertiesPanelPage. Returns: If the page is valid then a pointer to the pages IRhinoPropertiesPanelPageEventArgs interface is returned otherwise; null is returned. DO NOT delete this pointer.
◆ GetObjects() [1/2]
 virtual int IRhinoPropertiesPanelPageEventArgs::GetObjects  |  ( |  ON_SimpleArray< const CRhinoObject * > &  |  objectList | ) |   const
pure virtual
 Description: Call this method to get a list of the currently selected objects. This method calls GetSelectedObjects(ON::object_type::any_object, objectList). Parameters: objectList [out] - Selected objects of objectType are added to this list. This method does not empty the list. Returns: Returns the number of items added to objectList.
◆ GetObjects() [2/2]
 virtual int IRhinoPropertiesPanelPageEventArgs::GetObjects  |  ( |  unsigned int  |  objectTypes,
|  ON_SimpleArray< const CRhinoObject * > &  |  objectList
) |   |  const
pure virtual
 Description: Call this method to get a list of the currently selected objects of a specified type. Parameters: objectTypes [in] - Type(s) of objects to filter for, see ON::object_type objectList [out] - Selected objects of objectType are added to this list. This method does not empty the list. Returns: Returns the number of items added to objectList.
◆ ObjectAt()
 virtual const CRhinoObject* IRhinoPropertiesPanelPageEventArgs::ObjectAt  |  ( |  int  |  index | ) |   const
pure virtual
 Description: Call this method when iterating the selected object list. Returns: Returns the object at the specified index or null if the index is not valid.
◆ ObjectCount()
 virtual int IRhinoPropertiesPanelPageEventArgs::ObjectCount  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the number of selected objects. Returns: Returns the number of selected objects.
◆ ObjectTypes()
 virtual unsigned int IRhinoPropertiesPanelPageEventArgs::ObjectTypes  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the combined CRhinoObject::ObjectType in the selection list. This is the fastest way of determining if a specific object type exist in the current selection. Returns: Returns the combined CRhinoObject::ObjectType types of the currently selected objects.
◆ operator=()
 IRhinoPropertiesPanelPageEventArgs& IRhinoPropertiesPanelPageEventArgs::operator=  |  ( |  const IRhinoPropertiesPanelPageEventArgs &  |   | )
protecteddelete
 Description: Delete the default operator=
◆ View()
 virtual CRhinoView* IRhinoPropertiesPanelPageEventArgs::View  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the view that was active when the message was generated. Returns: Returns the view that was active when the message was generated.
◆ Viewport()
 virtual class CRhinoViewport* IRhinoPropertiesPanelPageEventArgs::Viewport  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the viewport that was active when the message was generated. Returns: Returns the viewport that was active when the message was generated.
◆ ViewportId()
 virtual ON_UUID IRhinoPropertiesPanelPageEventArgs::ViewportId  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the runtime serial number for the viewport that was active when the message was generated. Returns: Returns the runtime serial number for the viewport that was active when the message was generated.
◆ ViewRuntimeSerialNumber()
 virtual unsigned int IRhinoPropertiesPanelPageEventArgs::ViewRuntimeSerialNumber  |  ( |   | ) |   const
pure virtual
 Description: Call this method to get the runtime serial number for the view that was active when the message was generated. Returns: Returns the runtime serial number for the view that was active when the message was generated.