Public Member Functions | List of all members
ON_SubDEdgeArray Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDEdgeArray ()=default
ON_SubDEdgeArray (const ON_SubD &subd)
ON_SubDEdgeArray (const ON_SubDEdgeArray &)=default
unsigned int  | EdgeCount () const
ON_SubDEdgeArray &  | operator= (const ON_SubDEdgeArray &)=default
const class ON_SubDEdge *  | operator[] (unsigned int i) const
const ON_SubD &  | SubD () const
Detailed Description
ON_SubDEdgeArray Description: Avoid using ON_SubDEdgeArray. ON_SubDEdgeIterator is more efficient and a better choice.
Constructor & Destructor Documentation
◆ ON_SubDEdgeArray() [1/3]
 ON_SubDEdgeArray::ON_SubDEdgeArray  |  ( |  const ON_SubD &  |  subd | )
◆ ON_SubDEdgeArray() [2/3]
 ON_SubDEdgeArray::ON_SubDEdgeArray  |  ( |   | )
default
◆ ON_SubDEdgeArray() [3/3]
 ON_SubDEdgeArray::ON_SubDEdgeArray  |  ( |  const ON_SubDEdgeArray &  |   | )
default
Member Function Documentation
◆ EdgeCount()
 unsigned int ON_SubDEdgeArray::EdgeCount  |  ( |   | ) |   const
inline
◆ operator=()
 ON_SubDEdgeArray& ON_SubDEdgeArray::operator=  |  ( |  const ON_SubDEdgeArray &  |   | )
default
◆ operator[]()
 const class ON_SubDEdge* ON_SubDEdgeArray::operator[]  |  ( |  unsigned int  |  i | ) |   const
inline
◆ SubD()
 const ON_SubD& ON_SubDEdgeArray::SubD  |  ( |   | ) |   const
inline