Public Member Functions | Public Attributes | List of all members
ON_IntersectCurveSDF::ON_CurveSDFEvent Class Reference
#include <opennurbs_plus_implicitfn.h>
 Public Member Functions
ON_CurveSDFEvent ()
 Public Attributes
ON_Interval  | m_interval
ON_3dPoint  | m_point
ON_CurveSDFEventType  | m_type
Detailed Description
Curve - SDF intersection event Lists the point location or curve overlap interval for intersection events between a curve and an SDF
Constructor & Destructor Documentation
◆ ON_CurveSDFEvent()
 ON_IntersectCurveSDF::ON_CurveSDFEvent::ON_CurveSDFEvent  |  ( |   | )
inline
Member Data Documentation
◆ m_interval
 ON_Interval ON_IntersectCurveSDF::ON_CurveSDFEvent::m_interval
the overlap interval [t0, t1] with t0 < t1 of the overlapping curve
◆ m_point
 ON_3dPoint ON_IntersectCurveSDF::ON_CurveSDFEvent::m_point
◆ m_type
 ON_CurveSDFEventType ON_IntersectCurveSDF::ON_CurveSDFEvent::m_type