Classes | Public Member Functions | Public Attributes | List of all members
ON_RtfStringBuilder Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Inheritance diagram for ON_RtfStringBuilder:
 Classes
class  | TextRun
 Public Member Functions
ON_RtfStringBuilder (const ON_DimStyle *dimstyle, double height, ON_Color color)
virtual  | ~ON_RtfStringBuilder ()
bool  | AppendCodePoint (ON__UINT32 codept) override
void  | BeginColorTable () override
void  | BeginFontTable () override
void  | BeginHeader () override
void  | Bold (const wchar_t *value) override
void  | ColorBackground (const wchar_t *value) override
void  | ColorBlue (const wchar_t *value) override
void  | ColorForeground (const wchar_t *value) override
void  | ColorGreen (const wchar_t *value) override
void  | ColorRed (const wchar_t *value) override
void  | DefaultFont (const wchar_t *value) override
void  | FontSize (const wchar_t *value) override
void  | FontTag (const wchar_t *value) override
void  | GroupBegin () override
virtuals More...
void  | GroupEnd () override
bool  | InColorTable ()
void  | InitStringBuilder (const ON_DimStyle *default_style)
void  | Italic (const wchar_t *value) override
bool  | MakeBold ()
bool  | MakeFacename ()
bool  | MakeItalic ()
bool  | MakeUnderline ()
void  | Newline () override
void  | NoSuperSub () override
const ON_wString  | OutputString ()
void  | Paragraph () override
void  | ParagraphDefaults () override
TextRun  | PopRun ()
void  | PushRun (TextRun &run)
void  | RunBegin () override
void  | RunEnd () override
void  | Section () override
void  | SetDefaultFacename (const wchar_t *facename)
void  | SetInColorTable (bool b)
void  | SetMakeBold (bool b)
void  | SetMakeFacename (bool b)
void  | SetMakeItalic (bool b)
void  | SetMakeUnderline (bool b)
void  | SetOverrideFacename (const wchar_t *facename)
void  | SetSkipBold (bool b)
void  | SetSkipColorTbl (bool b)
void  | SetSkipFacename (bool b)
void  | SetSkipItalic (bool b)
void  | SetSkipUnderline (bool b)
bool  | SettingFacename ()
bool  | SkipBold ()
bool  | SkipColorTbl ()
bool  | SkipFacename ()
bool  | SkipItalic ()
bool  | SkippingFacename ()
bool  | SkipUnderline ()
void  | Strikethrough (const wchar_t *value) override
void  | Subscript () override
void  | Superscript () override
void  | Tab () override
void  | TextField (const wchar_t *name) override
void  | UnderlineOff () override
void  | UnderlineOn () override
void  | UniDecimal (const wchar_t *value) override
void  | UniDest (const wchar_t *value) override
void  | UniEmbeddedDest (const wchar_t *value) override
 Public Member Functions inherited from ON_TextBuilder
ON_TextBuilder ()
virtual  | ~ON_TextBuilder ()
virtual void  | Bullet ()
virtual void  | CharSet (const wchar_t *value)
unsigned int  | CharSetFromMap (int nval)
virtual void  | CodePage (const wchar_t *value)
unsigned int  | CodePageFromMap (int nval)
virtual void  | EmDash ()
virtual void  | EnDash ()
const ON_wString  | FaceNameFromMap (int nval)
virtual void  | FinishFontDef ()
virtual void  | FlushText (size_t count, ON__UINT32 *cp_array)
virtual void  | FormatChange ()
virtual void  | InitBuilder (const ON_Font *default_font)
virtual void  | LDblQuote ()
virtual void  | LQuote ()
virtual void  | RDblQuote ()
virtual bool  | ReadingFontDefinition ()
virtual bool  | ReadingFontTable ()
virtual void  | RQuote ()
ON__UINT32 *  | RunCodePoints (const ON_TextRun &run)
virtual void  | SetReadingFontDefinition (bool b)
virtual void  | SetStackScale (const wchar_t *value)
virtual void  | StackEnd ()
virtual void  | StackFraction (const wchar_t *value)
virtual void  | UniCpCount (const wchar_t *value)
 Public Attributes
TextRun  | m_current_run
ON_ClassArray< TextRun >  | m_run_stack
 Public Attributes inherited from ON_TextBuilder
ON_SimpleArray< ON__UINT32 >  | m_current_codepoints
TextProps  | m_current_props
ON__UINT16  | m_current_UTF16_buffer [2]
ON__INT32  | m_current_UTF16_buffer_count = 0
ON__INT32  | m_default_font_index = 0
ON_ClassArray< ON_FaceNameKey >  | m_facename_map
ON__INT32  | m_font_index = 0
ON__INT32  | m_font_table_level = 10000
ON__INT32  | m_in_run
ON__INT32  | m_level = 0
ON_ClassArray< TextProps >  | m_prop_stack
 Additional Inherited Members
 Public Types inherited from ON_TextBuilder
enum  | : ON__UINT16 { m_UFT16_waiting_mark = 0xEEEE, m_UFT16_unused_mark = 0xFFFF }
Constructor & Destructor Documentation
◆ ON_RtfStringBuilder()
 ON_RtfStringBuilder::ON_RtfStringBuilder  |  ( |  const ON_DimStyle *  |  dimstyle,
|  double  |  height,
|  ON_Color  |  color
)
◆ ~ON_RtfStringBuilder()
 virtual ON_RtfStringBuilder::~ON_RtfStringBuilder  |  ( |   | )
virtual
Member Function Documentation
◆ AppendCodePoint()
 bool ON_RtfStringBuilder::AppendCodePoint  |  ( |  ON__UINT32  |  codept | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginColorTable()
 void ON_RtfStringBuilder::BeginColorTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginFontTable()
 void ON_RtfStringBuilder::BeginFontTable  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ BeginHeader()
 void ON_RtfStringBuilder::BeginHeader  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Bold()
 void ON_RtfStringBuilder::Bold  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorBackground()
 void ON_RtfStringBuilder::ColorBackground  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorBlue()
 void ON_RtfStringBuilder::ColorBlue  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorForeground()
 void ON_RtfStringBuilder::ColorForeground  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorGreen()
 void ON_RtfStringBuilder::ColorGreen  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ColorRed()
 void ON_RtfStringBuilder::ColorRed  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ DefaultFont()
 void ON_RtfStringBuilder::DefaultFont  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FontSize()
 void ON_RtfStringBuilder::FontSize  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ FontTag()
 void ON_RtfStringBuilder::FontTag  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ GroupBegin()
 void ON_RtfStringBuilder::GroupBegin  |  ( |   | )
overridevirtual
virtuals
Reimplemented from ON_TextBuilder.
◆ GroupEnd()
 void ON_RtfStringBuilder::GroupEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ InColorTable()
 bool ON_RtfStringBuilder::InColorTable  |  ( |   | )
bool InFontTable(); void SetInFontTable(bool b);
◆ InitStringBuilder()
 void ON_RtfStringBuilder::InitStringBuilder  |  ( |  const ON_DimStyle *  |  default_style | )
◆ Italic()
 void ON_RtfStringBuilder::Italic  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ MakeBold()
 bool ON_RtfStringBuilder::MakeBold  |  ( |   | )
◆ MakeFacename()
 bool ON_RtfStringBuilder::MakeFacename  |  ( |   | )
◆ MakeItalic()
 bool ON_RtfStringBuilder::MakeItalic  |  ( |   | )
◆ MakeUnderline()
 bool ON_RtfStringBuilder::MakeUnderline  |  ( |   | )
◆ Newline()
 void ON_RtfStringBuilder::Newline  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ NoSuperSub()
 void ON_RtfStringBuilder::NoSuperSub  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ OutputString()
 const ON_wString ON_RtfStringBuilder::OutputString  |  ( |   | )
◆ Paragraph()
 void ON_RtfStringBuilder::Paragraph  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ ParagraphDefaults()
 void ON_RtfStringBuilder::ParagraphDefaults  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ PopRun()
 TextRun ON_RtfStringBuilder::PopRun  |  ( |   | )
◆ PushRun()
 void ON_RtfStringBuilder::PushRun  |  ( |  TextRun &  |  run | )
◆ RunBegin()
 void ON_RtfStringBuilder::RunBegin  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ RunEnd()
 void ON_RtfStringBuilder::RunEnd  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Section()
 void ON_RtfStringBuilder::Section  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ SetDefaultFacename()
 void ON_RtfStringBuilder::SetDefaultFacename  |  ( |  const wchar_t *  |  facename | )
◆ SetInColorTable()
 void ON_RtfStringBuilder::SetInColorTable  |  ( |  bool  |  b | )
◆ SetMakeBold()
 void ON_RtfStringBuilder::SetMakeBold  |  ( |  bool  |  b | )
◆ SetMakeFacename()
 void ON_RtfStringBuilder::SetMakeFacename  |  ( |  bool  |  b | )
◆ SetMakeItalic()
 void ON_RtfStringBuilder::SetMakeItalic  |  ( |  bool  |  b | )
◆ SetMakeUnderline()
 void ON_RtfStringBuilder::SetMakeUnderline  |  ( |  bool  |  b | )
◆ SetOverrideFacename()
 void ON_RtfStringBuilder::SetOverrideFacename  |  ( |  const wchar_t *  |  facename | )
◆ SetSkipBold()
 void ON_RtfStringBuilder::SetSkipBold  |  ( |  bool  |  b | )
◆ SetSkipColorTbl()
 void ON_RtfStringBuilder::SetSkipColorTbl  |  ( |  bool  |  b | )
◆ SetSkipFacename()
 void ON_RtfStringBuilder::SetSkipFacename  |  ( |  bool  |  b | )
◆ SetSkipItalic()
 void ON_RtfStringBuilder::SetSkipItalic  |  ( |  bool  |  b | )
◆ SetSkipUnderline()
 void ON_RtfStringBuilder::SetSkipUnderline  |  ( |  bool  |  b | )
◆ SettingFacename()
 bool ON_RtfStringBuilder::SettingFacename  |  ( |   | )
◆ SkipBold()
 bool ON_RtfStringBuilder::SkipBold  |  ( |   | )
◆ SkipColorTbl()
 bool ON_RtfStringBuilder::SkipColorTbl  |  ( |   | )
◆ SkipFacename()
 bool ON_RtfStringBuilder::SkipFacename  |  ( |   | )
◆ SkipItalic()
 bool ON_RtfStringBuilder::SkipItalic  |  ( |   | )
◆ SkippingFacename()
 bool ON_RtfStringBuilder::SkippingFacename  |  ( |   | )
◆ SkipUnderline()
 bool ON_RtfStringBuilder::SkipUnderline  |  ( |   | )
◆ Strikethrough()
 void ON_RtfStringBuilder::Strikethrough  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Subscript()
 void ON_RtfStringBuilder::Subscript  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Superscript()
 void ON_RtfStringBuilder::Superscript  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ Tab()
 void ON_RtfStringBuilder::Tab  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ TextField()
 void ON_RtfStringBuilder::TextField  |  ( |  const wchar_t *  |  name | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOff()
 void ON_RtfStringBuilder::UnderlineOff  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UnderlineOn()
 void ON_RtfStringBuilder::UnderlineOn  |  ( |   | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UniDecimal()
 void ON_RtfStringBuilder::UniDecimal  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UniDest()
 void ON_RtfStringBuilder::UniDest  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
◆ UniEmbeddedDest()
 void ON_RtfStringBuilder::UniEmbeddedDest  |  ( |  const wchar_t *  |  value | )
overridevirtual
Reimplemented from ON_TextBuilder.
Member Data Documentation
◆ m_current_run
 TextRun ON_RtfStringBuilder::m_current_run
◆ m_run_stack
 ON_ClassArray< TextRun > ON_RtfStringBuilder::m_run_stack