Public Member Functions | Public Attributes | List of all members
CRhWidgetDrawAttr Class Reference
Rhino
#include <rhinoSdkWidget.h>
 Inheritance diagram for CRhWidgetDrawAttr:
 Public Member Functions
CRhWidgetDrawAttr ()
 Public Attributes
ON_Color  | m_col
UINT  | m_pattern
int  | m_thickness
UUID  | m_uuid_object
Constructor & Destructor Documentation
◆ CRhWidgetDrawAttr()
 CRhWidgetDrawAttr::CRhWidgetDrawAttr  |  ( |   | )
inline
Member Data Documentation
◆ m_col
 ON_Color CRhWidgetDrawAttr::m_col
◆ m_pattern
 UINT CRhWidgetDrawAttr::m_pattern
◆ m_thickness
 int CRhWidgetDrawAttr::m_thickness
◆ m_uuid_object
 UUID CRhWidgetDrawAttr::m_uuid_object