Public Types | Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoGetEllipse Class Reference
RhinoGet
#include <rhinoSdkGetEllipse.h>
 Public Types
enum  | eEllipseMode {
 center, centercorner, corner, diameter,
 fromfoci, aroundcurve, fitpoints
 }
current Ellipse mode of RhinoGetEllipse functions More...
 Public Member Functions
CArgsRhinoGetEllipse ()
CArgsRhinoGetEllipse (const CArgsRhinoGetEllipse &)
~CArgsRhinoGetEllipse ()
BOOL32  | AcceptNumber () const
const double  | Angle () const
int  | AroundDirectionCount () const
number of faces in the around direction More...
int  | AroundDirectionMinCount () const
const CRhinoCommandOptionName &  | AroundMeshDensityDirectionPrompt () const
prompt for number of faces in the around direction More...
bool  | CapFaceStyle () const
void  | ClearPrompts (void)
BOOL32  | Deformable () const
BOOL32  | DeformablePointCount () const
int  | Dir () const
const double  | Eccentricity () const
eEllipseMode  | EllipseMode () const
const ON_3dPoint &  | FirstPoint () const
const ON_wString &  | FirstPrompt () const
BOOL32  | MarkFoci () const
const ON_3dVector &  | Normal () const
CArgsRhinoGetEllipse &  | operator= (const CArgsRhinoGetEllipse &)
bool  | PromptForMeshDensity () const
int  | Quadrant () const
const ON_3dPoint &  | SecondPoint () const
const ON_wString &  | SecondPrompt () const
void  | SetAcceptNumber (BOOL32=TRUE)
Set whether the last prompt accepts a number or not. Used in center_start_end. More...
void  | SetAngle (double)
The current Ellipse angle in center_start_angle. More...
void  | SetAroundDirectionCount (int count)
void  | SetAroundDirectionMinCount (int count)
void  | SetAroundMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetCapFaceStyle (bool bMakeQuadCaps=true)
false == tris, true == quads More...
void  | SetDeformable (BOOL32=TRUE)
void  | SetDeformablePointCount (int=12)
void  | SetDir (int)
The current Ellipse direction in center_start_end. More...
void  | SetEccentricity (double)
The eccentricity of FromFoci ellipse. More...
void  | SetEllipseMode (eEllipseMode=center)
Set the Ellipse mode. More...
void  | SetFirstPoint (const ON_3dPoint &)
Set the first point to use instead of asking for one. More...
void  | SetFirstPrompt (const wchar_t *)
Set a custom prompt to use for getting the first point. More...
void  | SetFirstPromptIfEmpty (const wchar_t *)
void  | SetMarkFoci (BOOL32=TRUE)
Indicates the user wants the ellipse foci marked with point objects. More...
void  | SetNormal (const ON_3dVector &)
The current Ellipse normal in center_start_end. More...
void  | SetPromptForMeshDensity (bool bMeshDensity=true)
void  | SetQuadrant (int)
The current third point quadrant in center_start_end. More...
void  | SetSecondPoint (const ON_3dPoint &)
Set the second point to use instead of asking for one. More...
void  | SetSecondPrompt (const wchar_t *)
Set a custom prompt to use for getting the second point. More...
void  | SetSecondPromptIfEmpty (const wchar_t *)
void  | SetShowDeformableOption (BOOL32=TRUE)
void  | SetThirdPoint (const ON_3dPoint &)
Set the third point to use instead of asking for one. More...
void  | SetThirdPrompt (const wchar_t *)
Set a custom prompt to use for getting third point. More...
void  | SetThirdPromptIfEmpty (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseThirdPoint (BOOL32=TRUE)
void  | SetVerticalDirectionCount (int count)
void  | SetVerticalDirectionMinCount (int count)
void  | SetVerticalMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
BOOL32  | ShowDeformableOption () const
const ON_3dPoint &  | ThirdPoint () const
const ON_wString &  | ThirdPrompt () const
bool  | UseActiveLayerLinetype () const
BOOL32  | UseFirstPoint () const
BOOL32  | UseFirstPrompt () const
BOOL32  | UseSecondPoint () const
BOOL32  | UseSecondPrompt () const
BOOL32  | UseThirdPoint () const
BOOL32  | UseThirdPrompt () const
int  | VerticalDirectionCount () const
number of faces in the vertical direction More...
int  | VerticalDirectionMinCount () const
const CRhinoCommandOptionName &  | VerticalMeshDensityDirectionPrompt () const
prompt for number of faces in the vertical direction More...
 Public Attributes
ON_Plane  | m_plane
double  | m_rx
double  | m_ry
ON_3dVector  | m_tangent
[i] curve tangent in around curve mode More...
BOOL32  | m_tangent_mode
true if curve tangent defined More...
 Protected Attributes
double  | m_angle
[internal] the Ellipse angle, used in center_start_angle More...
BOOL32  | m_bAcceptNumber
[i] if true, the last prompt accept number. Needed for center_start_end/angle More...
int  | m_bDeformable
[i/o] when set, the user wants a deformable ellipse More...
BOOL32  | m_bMarkFoci
[i] when set, the user wants the ellipse foci to be marked with a point More...
BOOL32  | m_bShowDeformableOption
[i] when set, the user is allowed to change the deformable option More...
BOOL32  | m_bUseFirstPoint
[i] use m_FirstPoint instead of asking for point More...
BOOL32  | m_bUseFirstPrompt
[i] use custom prompt m_FirstPrompt More...
BOOL32  | m_bUseSecondPoint
[i] use m_SecondPoint instead of asking for point More...
BOOL32  | m_bUseSecondPrompt
[i] use custom prompt m_SecondPrompt More...
BOOL32  | m_bUseThirdPoint
[i] use m_ThirdPoint instead of asking for point More...
BOOL32  | m_bUseThirdPrompt
[i] use custom prompt m_ThirdPrompt More...
int  | m_deformable_point_count
[i/o] defines the requested point count for deformable ellipse More...
int  | m_dir
[internal] previous Ellipse direction. Needed for center_start_end/angle More...
double  | m_eccentricity
[internal] eccentricity of FromFoci ellipse More...
ON_3dPoint  | m_FirstPoint
[i] if m_bHaveFirstPoint first point specified here More...
ON_wString  | m_FirstPrompt
[i] Custom prompt for first point More...
CRhinoCommandOptionName  | m_mesh_density_around_direction_prompt
int  | m_mesh_density_AroundDirection
int  | m_mesh_density_MinAroundDirection
int  | m_mesh_density_MinVerticalDirection
CRhinoCommandOptionName  | m_mesh_density_vertical_direction_prompt
int  | m_mesh_density_VerticalDirection
eEllipseMode  | m_mode
[internal] Current mode while drawing the Ellipse More...
ON_3dVector  | m_normal
[i] the Ellipse normal. Needed for center_start_end/angle More...
bool  | m_PromptForMeshDensity
int  | m_quadrant
[internal] previous quadrant for last point. Needed for center_start_end/angle More...
ON_3dPoint  | m_SecondPoint
[i] if m_bHaveSecondPoint second point specified here More...
ON_wString  | m_SecondPrompt
[i] Custom prompt for second point More...
ON_3dPoint  | m_ThirdPoint
[i] if m_bHaveThirdPoint third point specified here More...
ON_wString  | m_ThirdPrompt
[i] Custom prompt for third point More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
 CLASS CArgsRhinoGetEllipse
OVERVIEW TEXT Arguments for RhinoGetEllipse... functions
KEYWORDS
Ellipse RhinoGetEllipse
Member Enumeration Documentation
◆ eEllipseMode
 enum CArgsRhinoGetEllipse::eEllipseMode
current Ellipse mode of RhinoGetEllipse functions
Enumerator
center
centercorner
corner
diameter
fromfoci
aroundcurve
fitpoints
least squares fit points
Constructor & Destructor Documentation
◆ CArgsRhinoGetEllipse() [1/2]
 CArgsRhinoGetEllipse::CArgsRhinoGetEllipse  |  ( |   | )
◆ ~CArgsRhinoGetEllipse()
 CArgsRhinoGetEllipse::~CArgsRhinoGetEllipse  |  ( |   | )
◆ CArgsRhinoGetEllipse() [2/2]
 CArgsRhinoGetEllipse::CArgsRhinoGetEllipse  |  ( |  const CArgsRhinoGetEllipse &  |   | )
Member Function Documentation
◆ AcceptNumber()
 BOOL32 CArgsRhinoGetEllipse::AcceptNumber  |  ( |   | ) |   const
◆ Angle()
 const double CArgsRhinoGetEllipse::Angle  |  ( |   | ) |   const
◆ AroundDirectionCount()
 int CArgsRhinoGetEllipse::AroundDirectionCount  |  ( |   | ) |   const
number of faces in the around direction
◆ AroundDirectionMinCount()
 int CArgsRhinoGetEllipse::AroundDirectionMinCount  |  ( |   | ) |   const
◆ AroundMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetEllipse::AroundMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in the around direction
◆ CapFaceStyle()
 bool CArgsRhinoGetEllipse::CapFaceStyle  |  ( |   | ) |   const
◆ ClearPrompts()
 void CArgsRhinoGetEllipse::ClearPrompts  |  ( |  void  |   | )
◆ Deformable()
 BOOL32 CArgsRhinoGetEllipse::Deformable  |  ( |   | ) |   const
◆ DeformablePointCount()
 BOOL32 CArgsRhinoGetEllipse::DeformablePointCount  |  ( |   | ) |   const
◆ Dir()
 int CArgsRhinoGetEllipse::Dir  |  ( |   | ) |   const
◆ Eccentricity()
 const double CArgsRhinoGetEllipse::Eccentricity  |  ( |   | ) |   const
◆ EllipseMode()
 eEllipseMode CArgsRhinoGetEllipse::EllipseMode  |  ( |   | ) |   const
◆ FirstPoint()
 const ON_3dPoint& CArgsRhinoGetEllipse::FirstPoint  |  ( |   | ) |   const
◆ FirstPrompt()
 const ON_wString& CArgsRhinoGetEllipse::FirstPrompt  |  ( |   | ) |   const
◆ MarkFoci()
 BOOL32 CArgsRhinoGetEllipse::MarkFoci  |  ( |   | ) |   const
◆ Normal()
 const ON_3dVector& CArgsRhinoGetEllipse::Normal  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetEllipse& CArgsRhinoGetEllipse::operator=  |  ( |  const CArgsRhinoGetEllipse &  |   | )
◆ PromptForMeshDensity()
 bool CArgsRhinoGetEllipse::PromptForMeshDensity  |  ( |   | ) |   const
◆ Quadrant()
 int CArgsRhinoGetEllipse::Quadrant  |  ( |   | ) |   const
◆ SecondPoint()
 const ON_3dPoint& CArgsRhinoGetEllipse::SecondPoint  |  ( |   | ) |   const
◆ SecondPrompt()
 const ON_wString& CArgsRhinoGetEllipse::SecondPrompt  |  ( |   | ) |   const
◆ SetAcceptNumber()
 void CArgsRhinoGetEllipse::SetAcceptNumber  |  ( |  BOOL32  |   = TRUE | )
Set whether the last prompt accepts a number or not. Used in center_start_end.
◆ SetAngle()
 void CArgsRhinoGetEllipse::SetAngle  |  ( |  double  |   | )
The current Ellipse angle in center_start_angle.
◆ SetAroundDirectionCount()
 void CArgsRhinoGetEllipse::SetAroundDirectionCount  |  ( |  int  |  count | )
◆ SetAroundDirectionMinCount()
 void CArgsRhinoGetEllipse::SetAroundDirectionMinCount  |  ( |  int  |  count | )
◆ SetAroundMeshDensityDirectionPrompt()
 void CArgsRhinoGetEllipse::SetAroundMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |   | )
◆ SetCapFaceStyle()
 void CArgsRhinoGetEllipse::SetCapFaceStyle  |  ( |  bool  |  bMakeQuadCaps = true | )
false == tris, true == quads
◆ SetDeformable()
 void CArgsRhinoGetEllipse::SetDeformable  |  ( |  BOOL32  |   = TRUE | )
◆ SetDeformablePointCount()
 void CArgsRhinoGetEllipse::SetDeformablePointCount  |  ( |  int  |   = 12 | )
◆ SetDir()
 void CArgsRhinoGetEllipse::SetDir  |  ( |  int  |   | )
The current Ellipse direction in center_start_end.
◆ SetEccentricity()
 void CArgsRhinoGetEllipse::SetEccentricity  |  ( |  double  |   | )
The eccentricity of FromFoci ellipse.
◆ SetEllipseMode()
 void CArgsRhinoGetEllipse::SetEllipseMode  |  ( |  eEllipseMode  |   = center | )
Set the Ellipse mode.
◆ SetFirstPoint()
 void CArgsRhinoGetEllipse::SetFirstPoint  |  ( |  const ON_3dPoint &  |   | )
Set the first point to use instead of asking for one.
◆ SetFirstPrompt()
 void CArgsRhinoGetEllipse::SetFirstPrompt  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the first point.
◆ SetFirstPromptIfEmpty()
 void CArgsRhinoGetEllipse::SetFirstPromptIfEmpty  |  ( |  const wchar_t *  |   | )
◆ SetMarkFoci()
 void CArgsRhinoGetEllipse::SetMarkFoci  |  ( |  BOOL32  |   = TRUE | )
Indicates the user wants the ellipse foci marked with point objects.
◆ SetNormal()
 void CArgsRhinoGetEllipse::SetNormal  |  ( |  const ON_3dVector &  |   | )
The current Ellipse normal in center_start_end.
◆ SetPromptForMeshDensity()
 void CArgsRhinoGetEllipse::SetPromptForMeshDensity  |  ( |  bool  |  bMeshDensity = true | )
Interface to allow primitive mesh creation to use RhinoGetPlane, RhinoGetBox, RhinoGetCircle etc.
◆ SetQuadrant()
 void CArgsRhinoGetEllipse::SetQuadrant  |  ( |  int  |   | )
The current third point quadrant in center_start_end.
◆ SetSecondPoint()
 void CArgsRhinoGetEllipse::SetSecondPoint  |  ( |  const ON_3dPoint &  |   | )
Set the second point to use instead of asking for one.
◆ SetSecondPrompt()
 void CArgsRhinoGetEllipse::SetSecondPrompt  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting the second point.
◆ SetSecondPromptIfEmpty()
 void CArgsRhinoGetEllipse::SetSecondPromptIfEmpty  |  ( |  const wchar_t *  |   | )
◆ SetShowDeformableOption()
 void CArgsRhinoGetEllipse::SetShowDeformableOption  |  ( |  BOOL32  |   = TRUE | )
◆ SetThirdPoint()
 void CArgsRhinoGetEllipse::SetThirdPoint  |  ( |  const ON_3dPoint &  |   | )
Set the third point to use instead of asking for one.
◆ SetThirdPrompt()
 void CArgsRhinoGetEllipse::SetThirdPrompt  |  ( |  const wchar_t *  |   | )
Set a custom prompt to use for getting third point.
◆ SetThirdPromptIfEmpty()
 void CArgsRhinoGetEllipse::SetThirdPromptIfEmpty  |  ( |  const wchar_t *  |   | )
◆ SetUseActiveLayerLinetype()
 void CArgsRhinoGetEllipse::SetUseActiveLayerLinetype  |  ( |  bool  |  on | )
When true the linetype of the active layer is used for dynamic drawing.
◆ SetUseThirdPoint()
 void CArgsRhinoGetEllipse::SetUseThirdPoint  |  ( |  BOOL32  |   = TRUE | )
◆ SetVerticalDirectionCount()
 void CArgsRhinoGetEllipse::SetVerticalDirectionCount  |  ( |  int  |  count | )
◆ SetVerticalDirectionMinCount()
 void CArgsRhinoGetEllipse::SetVerticalDirectionMinCount  |  ( |  int  |  count | )
◆ SetVerticalMeshDensityDirectionPrompt()
 void CArgsRhinoGetEllipse::SetVerticalMeshDensityDirectionPrompt  |  ( |  const CRhinoCommandOptionName &  |   | )
◆ ShowDeformableOption()
 BOOL32 CArgsRhinoGetEllipse::ShowDeformableOption  |  ( |   | ) |   const
◆ ThirdPoint()
 const ON_3dPoint& CArgsRhinoGetEllipse::ThirdPoint  |  ( |   | ) |   const
◆ ThirdPrompt()
 const ON_wString& CArgsRhinoGetEllipse::ThirdPrompt  |  ( |   | ) |   const
◆ UseActiveLayerLinetype()
 bool CArgsRhinoGetEllipse::UseActiveLayerLinetype  |  ( |   | ) |   const
◆ UseFirstPoint()
 BOOL32 CArgsRhinoGetEllipse::UseFirstPoint  |  ( |   | ) |   const
◆ UseFirstPrompt()
 BOOL32 CArgsRhinoGetEllipse::UseFirstPrompt  |  ( |   | ) |   const
◆ UseSecondPoint()
 BOOL32 CArgsRhinoGetEllipse::UseSecondPoint  |  ( |   | ) |   const
◆ UseSecondPrompt()
 BOOL32 CArgsRhinoGetEllipse::UseSecondPrompt  |  ( |   | ) |   const
◆ UseThirdPoint()
 BOOL32 CArgsRhinoGetEllipse::UseThirdPoint  |  ( |   | ) |   const
◆ UseThirdPrompt()
 BOOL32 CArgsRhinoGetEllipse::UseThirdPrompt  |  ( |   | ) |   const
◆ VerticalDirectionCount()
 int CArgsRhinoGetEllipse::VerticalDirectionCount  |  ( |   | ) |   const
number of faces in the vertical direction
◆ VerticalDirectionMinCount()
 int CArgsRhinoGetEllipse::VerticalDirectionMinCount  |  ( |   | ) |   const
◆ VerticalMeshDensityDirectionPrompt()
 const CRhinoCommandOptionName& CArgsRhinoGetEllipse::VerticalMeshDensityDirectionPrompt  |  ( |   | ) |   const
prompt for number of faces in the vertical direction
Member Data Documentation
◆ m_angle
 double CArgsRhinoGetEllipse::m_angle
protected
[internal] the Ellipse angle, used in center_start_angle
◆ m_bAcceptNumber
 BOOL32 CArgsRhinoGetEllipse::m_bAcceptNumber
protected
[i] if true, the last prompt accept number. Needed for center_start_end/angle
◆ m_bDeformable
 int CArgsRhinoGetEllipse::m_bDeformable
protected
[i/o] when set, the user wants a deformable ellipse
Fix for RH-56780 - Tim February 3, 2020 Converted m_bDeformable to a bitfield so we can add extra settings without changing the size of the class.
◆ m_bMarkFoci
 BOOL32 CArgsRhinoGetEllipse::m_bMarkFoci
protected
[i] when set, the user wants the ellipse foci to be marked with a point
◆ m_bShowDeformableOption
 BOOL32 CArgsRhinoGetEllipse::m_bShowDeformableOption
protected
[i] when set, the user is allowed to change the deformable option
◆ m_bUseFirstPoint
 BOOL32 CArgsRhinoGetEllipse::m_bUseFirstPoint
protected
[i] use m_FirstPoint instead of asking for point
◆ m_bUseFirstPrompt
 BOOL32 CArgsRhinoGetEllipse::m_bUseFirstPrompt
protected
[i] use custom prompt m_FirstPrompt
◆ m_bUseSecondPoint
 BOOL32 CArgsRhinoGetEllipse::m_bUseSecondPoint
protected
[i] use m_SecondPoint instead of asking for point
◆ m_bUseSecondPrompt
 BOOL32 CArgsRhinoGetEllipse::m_bUseSecondPrompt
protected
[i] use custom prompt m_SecondPrompt
◆ m_bUseThirdPoint
 BOOL32 CArgsRhinoGetEllipse::m_bUseThirdPoint
protected
[i] use m_ThirdPoint instead of asking for point
◆ m_bUseThirdPrompt
 BOOL32 CArgsRhinoGetEllipse::m_bUseThirdPrompt
protected
[i] use custom prompt m_ThirdPrompt
◆ m_deformable_point_count
 int CArgsRhinoGetEllipse::m_deformable_point_count
protected
[i/o] defines the requested point count for deformable ellipse
◆ m_dir
 int CArgsRhinoGetEllipse::m_dir
protected
[internal] previous Ellipse direction. Needed for center_start_end/angle
◆ m_eccentricity
 double CArgsRhinoGetEllipse::m_eccentricity
protected
[internal] eccentricity of FromFoci ellipse
◆ m_FirstPoint
 ON_3dPoint CArgsRhinoGetEllipse::m_FirstPoint
protected
[i] if m_bHaveFirstPoint first point specified here
◆ m_FirstPrompt
 ON_wString CArgsRhinoGetEllipse::m_FirstPrompt
protected
[i] Custom prompt for first point
◆ m_mesh_density_around_direction_prompt
 CRhinoCommandOptionName CArgsRhinoGetEllipse::m_mesh_density_around_direction_prompt
protected
◆ m_mesh_density_AroundDirection
 int CArgsRhinoGetEllipse::m_mesh_density_AroundDirection
protected
◆ m_mesh_density_MinAroundDirection
 int CArgsRhinoGetEllipse::m_mesh_density_MinAroundDirection
protected
◆ m_mesh_density_MinVerticalDirection
 int CArgsRhinoGetEllipse::m_mesh_density_MinVerticalDirection
protected
◆ m_mesh_density_vertical_direction_prompt
 CRhinoCommandOptionName CArgsRhinoGetEllipse::m_mesh_density_vertical_direction_prompt
protected
◆ m_mesh_density_VerticalDirection
 int CArgsRhinoGetEllipse::m_mesh_density_VerticalDirection
protected
◆ m_mode
 eEllipseMode CArgsRhinoGetEllipse::m_mode
protected
[internal] Current mode while drawing the Ellipse
◆ m_normal
 ON_3dVector CArgsRhinoGetEllipse::m_normal
protected
[i] the Ellipse normal. Needed for center_start_end/angle
◆ m_plane
 ON_Plane CArgsRhinoGetEllipse::m_plane
◆ m_PromptForMeshDensity
 bool CArgsRhinoGetEllipse::m_PromptForMeshDensity
protected
Interface to allow primitive mesh creation to use RhinoGetCylinder, RhinoGetCone, etc.
◆ m_quadrant
 int CArgsRhinoGetEllipse::m_quadrant
protected
[internal] previous quadrant for last point. Needed for center_start_end/angle
◆ m_rx
 double CArgsRhinoGetEllipse::m_rx
◆ m_ry
 double CArgsRhinoGetEllipse::m_ry
◆ m_SecondPoint
 ON_3dPoint CArgsRhinoGetEllipse::m_SecondPoint
protected
[i] if m_bHaveSecondPoint second point specified here
◆ m_SecondPrompt
 ON_wString CArgsRhinoGetEllipse::m_SecondPrompt
protected
[i] Custom prompt for second point
◆ m_tangent
 ON_3dVector CArgsRhinoGetEllipse::m_tangent
[i] curve tangent in around curve mode
◆ m_tangent_mode
 BOOL32 CArgsRhinoGetEllipse::m_tangent_mode
true if curve tangent defined
◆ m_ThirdPoint
 ON_3dPoint CArgsRhinoGetEllipse::m_ThirdPoint
protected
[i] if m_bHaveThirdPoint third point specified here
◆ m_ThirdPrompt
 ON_wString CArgsRhinoGetEllipse::m_ThirdPrompt
protected
[i] Custom prompt for third point