Public Member Functions | List of all members
CRhRdkContextTaskOrigin Class Reference
RDK
#include <RhRdkTaskOrigin.h>
 Inheritance diagram for CRhRdkContextTaskOrigin:
 Public Member Functions
CRhRdkContextTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual bool  | SupportsTask (const CRhRdkTask &task) const override
 Public Member Functions inherited from CRhRdkTaskOrigin
CRhRdkTaskOrigin (const CRhRdkDocument &rdkDoc, CRhRdkControllerPtr con)
virtual  | ~CRhRdkTaskOrigin ()
virtual IRhRdkTaskCollection::Control  | Control (void) const =0
CRhRdkControllerPtr  | Controller (void) const
virtual int  | GetSelectedCount (void) const
void  | GetSelection (CRhRdkContentArray &aContentOut, bool bForModify=false) const
virtual void  | GetSelectionImpl (CRhRdkContentArray &aContentOut) const =0
virtual int  | GetState (void) const
virtual bool  | IsAmbivalent (void) const
virtual void  | OnBeginAskUserSure (const UUID &uuidTask) const
virtual void  | OnBeginExecuteTask (const UUID &uuidTask) const
virtual void  | OnEndAskUserSure (const UUID &uuidTask, RhRdkMbResult) const
virtual void  | OnEndExecuteTask (const UUID &uuidTask, CRhRdkTask::Result) const
virtual const CRhRdkPreviewAppearance *  | PreviewAppearance (void) const
virtual const CRhRdkPreviewMetaData *  | PreviewMetaData (void) const
virtual CRhRdkDocument *  | RdkDocument (void) const
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual const wchar_t *  | TopLevelKind (void) const =0
virtual UUID  | Uuid (void) const =0
virtual bool  | WillReplaceContent (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Used when task origin is context-sensitive.
Constructor & Destructor Documentation
◆ CRhRdkContextTaskOrigin()
 CRhRdkContextTaskOrigin::CRhRdkContextTaskOrigin  |  ( |  const CRhRdkDocument &  |  rdkDoc,
|  CRhRdkControllerPtr  |  con
)
Member Function Documentation
◆ SupportsTask()
 virtual bool CRhRdkContextTaskOrigin::SupportsTask  |  ( |  const CRhRdkTask &  |  task | ) |   const
overridevirtual
Reimplemented from CRhRdkTaskOrigin.
Reimplemented in CRhRdkBreadcrumbTaskOrigin, CRhRdkSubNodeTaskOrigin, CRhRdkFloatingPreviewTaskOrigin, CRhRdkContentInstanceBrowserTaskOrigin, CRhRdkContentTypeBrowserTaskOrigin, and CRhRdkSingleSelectionTaskOrigin.