Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoAppShortcutKeys Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | shortcut_key {
 f1 = 0, f2, f3, f4,
 f5, f6, f7, f8,
 f9, f10, f11, f12,
 ctrl_f1, ctrl_f2, ctrl_f3, ctrl_f4,
 ctrl_f5, ctrl_f6, ctrl_f7, ctrl_f8,
 ctrl_f9, ctrl_f10, ctrl_f11, ctrl_f12,
 shift_ctrl_f1, shift_ctrl_f2, shift_ctrl_f3, shift_ctrl_f4,
 shift_ctrl_f5, shift_ctrl_f6, shift_ctrl_f7, shift_ctrl_f8,
 shift_ctrl_f9, shift_ctrl_f10, shift_ctrl_f11, shift_ctrl_f12,
 alt_ctrl_f1, alt_ctrl_f2, alt_ctrl_f3, alt_ctrl_f4,
 alt_ctrl_f5, alt_ctrl_f6, alt_ctrl_f7, alt_ctrl_f8,
 alt_ctrl_f9, alt_ctrl_f10, alt_ctrl_f11, alt_ctrl_f12,
 ctrl_a, ctrl_b, ctrl_c, ctrl_d,
 ctrl_e, ctrl_f, ctrl_g, ctrl_h,
 ctrl_i, ctrl_j, ctrl_k, ctrl_l,
 ctrl_m, ctrl_n, ctrl_o, ctrl_p,
 ctrl_q, ctrl_r, ctrl_s, ctrl_t,
 ctrl_u, ctrl_v, ctrl_w, ctrl_x,
 ctrl_y, ctrl_z, shift_ctrl_a, shift_ctrl_b,
 shift_ctrl_c, shift_ctrl_d, shift_ctrl_e, shift_ctrl_f,
 shift_ctrl_g, shift_ctrl_h, shift_ctrl_i, shift_ctrl_j,
 shift_ctrl_k, shift_ctrl_l, shift_ctrl_m, shift_ctrl_n,
 shift_ctrl_o, shift_ctrl_p, shift_ctrl_q, shift_ctrl_r,
 shift_ctrl_s, shift_ctrl_t, shift_ctrl_u, shift_ctrl_v,
 shift_ctrl_w, shift_ctrl_x, shift_ctrl_y, shift_ctrl_z,
 alt_ctrl_a, alt_ctrl_b, alt_ctrl_c, alt_ctrl_d,
 alt_ctrl_e, alt_ctrl_f, alt_ctrl_g, alt_ctrl_h,
 alt_ctrl_i, alt_ctrl_j, alt_ctrl_k, alt_ctrl_l,
 alt_ctrl_m, alt_ctrl_n, alt_ctrl_o, alt_ctrl_p,
 alt_ctrl_q, alt_ctrl_r, alt_ctrl_s, alt_ctrl_t,
 alt_ctrl_u, alt_ctrl_v, alt_ctrl_w, alt_ctrl_x,
 alt_ctrl_y, alt_ctrl_z, ctrl_0, ctrl_1,
 ctrl_2, ctrl_3, ctrl_4, ctrl_5,
 ctrl_6, ctrl_7, ctrl_8, ctrl_9,
 shift_ctrl_0, shift_ctrl_1, shift_ctrl_2, shift_ctrl_3,
 shift_ctrl_4, shift_ctrl_5, shift_ctrl_6, shift_ctrl_7,
 shift_ctrl_8, shift_ctrl_9, alt_ctrl_0, alt_ctrl_1,
 alt_ctrl_2, alt_ctrl_3, alt_ctrl_4, alt_ctrl_5,
 alt_ctrl_6, alt_ctrl_7, alt_ctrl_8, alt_ctrl_9,
 home, end, ctrl_home, ctrl_end,
 shift_home, shift_end, shift_ctrl_home, shift_ctrl_end,
 alt_ctrl_home, alt_ctrl_end, tab, page_up,
 page_down, shift_page_up, shift_page_down, ctrl_page_up,
 ctrl_page_down, shift_ctrl_page_up, shift_ctrl_page_down, alt_ctrl_page_up,
 alt_ctrl_page_down, none, alt_home, alt_end,
 alt_a, alt_b, alt_c, alt_d,
 alt_e, alt_f, alt_g, alt_h,
 alt_i, alt_j, alt_k, alt_l,
 alt_m, alt_n, alt_o, alt_p,
 alt_q, alt_r, alt_s, alt_t,
 alt_u, alt_v, alt_w, alt_x,
 alt_y, alt_z, alt_0, alt_1,
 alt_2, alt_3, alt_4, alt_5,
 alt_6, alt_7, alt_8, alt_9,
 alt_f1, alt_f2, alt_f3, alt_f4,
 alt_f5, alt_f6, alt_f7, alt_f8,
 alt_f9, alt_f10, alt_f11, alt_f12,
 alt_shift_home, alt_shift_end, alt_shift_a, alt_shift_b,
 alt_shift_c, alt_shift_d, alt_shift_e, alt_shift_f,
 alt_shift_g, alt_shift_h, alt_shift_i, alt_shift_j,
 alt_shift_k, alt_shift_l, alt_shift_m, alt_shift_n,
 alt_shift_o, alt_shift_p, alt_shift_q, alt_shift_r,
 alt_shift_s, alt_shift_t, alt_shift_u, alt_shift_v,
 alt_shift_w, alt_shift_x, alt_shift_y, alt_shift_z,
 alt_shift_0, alt_shift_1, alt_shift_2, alt_shift_3,
 alt_shift_4, alt_shift_5, alt_shift_6, alt_shift_7,
 alt_shift_8, alt_shift_9, alt_shift_f1, alt_shift_f2,
 alt_shift_f3, alt_shift_f4, alt_shift_f5, alt_shift_f6,
 alt_shift_f7, alt_shift_f8, alt_shift_f9, alt_shift_f10,
 alt_shift_f11, alt_shift_f12, maccontrol_home, maccontrol_end,
 maccontrol_a, maccontrol_b, maccontrol_c, maccontrol_d,
 maccontrol_e, maccontrol_f, maccontrol_g, maccontrol_h,
 maccontrol_i, maccontrol_j, maccontrol_k, maccontrol_l,
 maccontrol_m, maccontrol_n, maccontrol_o, maccontrol_p,
 maccontrol_q, maccontrol_r, maccontrol_s, maccontrol_t,
 maccontrol_u, maccontrol_v, maccontrol_w, maccontrol_x,
 maccontrol_y, maccontrol_z, maccontrol_0, maccontrol_1,
 maccontrol_2, maccontrol_3, maccontrol_4, maccontrol_5,
 maccontrol_6, maccontrol_7, maccontrol_8, maccontrol_9,
 maccontrol_f1, maccontrol_f2, maccontrol_f3, maccontrol_f4,
 maccontrol_f5, maccontrol_f6, maccontrol_f7, maccontrol_f8,
 maccontrol_f9, maccontrol_f10, maccontrol_f11, maccontrol_f12,
 maccontrol_alt_home, maccontrol_alt_end, maccontrol_alt_a, maccontrol_alt_b,
 maccontrol_alt_c, maccontrol_alt_d, maccontrol_alt_e, maccontrol_alt_f,
 maccontrol_alt_g, maccontrol_alt_h, maccontrol_alt_i, maccontrol_alt_j,
 maccontrol_alt_k, maccontrol_alt_l, maccontrol_alt_m, maccontrol_alt_n,
 maccontrol_alt_o, maccontrol_alt_p, maccontrol_alt_q, maccontrol_alt_r,
 maccontrol_alt_s, maccontrol_alt_t, maccontrol_alt_u, maccontrol_alt_v,
 maccontrol_alt_w, maccontrol_alt_x, maccontrol_alt_y, maccontrol_alt_z,
 maccontrol_alt_0, maccontrol_alt_1, maccontrol_alt_2, maccontrol_alt_3,
 maccontrol_alt_4, maccontrol_alt_5, maccontrol_alt_6, maccontrol_alt_7,
 maccontrol_alt_8, maccontrol_alt_9, maccontrol_alt_f1, maccontrol_alt_f2,
 maccontrol_alt_f3, maccontrol_alt_f4, maccontrol_alt_f5, maccontrol_alt_f6,
 maccontrol_alt_f7, maccontrol_alt_f8, maccontrol_alt_f9, maccontrol_alt_f10,
 maccontrol_alt_f11, maccontrol_alt_f12, maccontrol_ctrl_home, maccontrol_ctrl_end,
 maccontrol_ctrl_a, maccontrol_ctrl_b, maccontrol_ctrl_c, maccontrol_ctrl_d,
 maccontrol_ctrl_e, maccontrol_ctrl_f, maccontrol_ctrl_g, maccontrol_ctrl_h,
 maccontrol_ctrl_i, maccontrol_ctrl_j, maccontrol_ctrl_k, maccontrol_ctrl_l,
 maccontrol_ctrl_m, maccontrol_ctrl_n, maccontrol_ctrl_o, maccontrol_ctrl_p,
 maccontrol_ctrl_q, maccontrol_ctrl_r, maccontrol_ctrl_s, maccontrol_ctrl_t,
 maccontrol_ctrl_u, maccontrol_ctrl_v, maccontrol_ctrl_w, maccontrol_ctrl_x,
 maccontrol_ctrl_y, maccontrol_ctrl_z, maccontrol_ctrl_0, maccontrol_ctrl_1,
 maccontrol_ctrl_2, maccontrol_ctrl_3, maccontrol_ctrl_4, maccontrol_ctrl_5,
 maccontrol_ctrl_6, maccontrol_ctrl_7, maccontrol_ctrl_8, maccontrol_ctrl_9,
 maccontrol_ctrl_f1, maccontrol_ctrl_f2, maccontrol_ctrl_f3, maccontrol_ctrl_f4,
 maccontrol_ctrl_f5, maccontrol_ctrl_f6, maccontrol_ctrl_f7, maccontrol_ctrl_f8,
 maccontrol_ctrl_f9, maccontrol_ctrl_f10, maccontrol_ctrl_f11, maccontrol_ctrl_f12,
 maccontrol_shift_home, maccontrol_shift_end, maccontrol_shift_a, maccontrol_shift_b,
 maccontrol_shift_c, maccontrol_shift_d, maccontrol_shift_e, maccontrol_shift_f,
 maccontrol_shift_g, maccontrol_shift_h, maccontrol_shift_i, maccontrol_shift_j,
 maccontrol_shift_k, maccontrol_shift_l, maccontrol_shift_m, maccontrol_shift_n,
 maccontrol_shift_o, maccontrol_shift_p, maccontrol_shift_q, maccontrol_shift_r,
 maccontrol_shift_s, maccontrol_shift_t, maccontrol_shift_u, maccontrol_shift_v,
 maccontrol_shift_w, maccontrol_shift_x, maccontrol_shift_y, maccontrol_shift_z,
 maccontrol_shift_0, maccontrol_shift_1, maccontrol_shift_2, maccontrol_shift_3,
 maccontrol_shift_4, maccontrol_shift_5, maccontrol_shift_6, maccontrol_shift_7,
 maccontrol_shift_8, maccontrol_shift_9, maccontrol_shift_f1, maccontrol_shift_f2,
 maccontrol_shift_f3, maccontrol_shift_f4, maccontrol_shift_f5, maccontrol_shift_f6,
 maccontrol_shift_f7, maccontrol_shift_f8, maccontrol_shift_f9, maccontrol_shift_f10,
 maccontrol_shift_f11, maccontrol_shift_f12, ctrl_plus, ctrl_minus
 }
 Public Member Functions
CRhinoAppShortcutKeys ()
CRhinoAppShortcutKeys (const CRhinoAppShortcutKeys &src)
~CRhinoAppShortcutKeys ()
void  | ClearAllMacros ()
void  | Defaults ()
int  | GetAllShortcuts (ON_ClassArray< CRhinoKeyboardShortcut > &shortcuts) const
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const wchar_t *  | Macro (bool control, bool shift, bool alt, bool macControlKeyDown, unsigned int keycode) const
const wchar_t *  | Macro (shortcut_key) const
bool  | operator!= (const CRhinoAppShortcutKeys &src) const
CRhinoAppShortcutKeys &  | operator= (const CRhinoAppShortcutKeys &src)
bool  | operator== (const CRhinoAppShortcutKeys &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetMacro (shortcut_key, const wchar_t *)
void  | SetMacro (unsigned int keycode, RhinoKeyboardModifierKey modifier, const wchar_t *macro)
 Static Public Member Functions
static shortcut_key  | FromKeyCombo (bool control, bool shift, bool alt, bool macControlKeyDown, unsigned int nChar)
static bool  | IsAcceptableKeyCombo (unsigned int keycode, RhinoKeyboardModifierKey modifier)
static void  | Label (bool control, bool shift, bool alt, bool macControlKeyDown, unsigned int keycode, ON_wString &label)
static void  | Label (int key, ON_wString &label)
 Protected Member Functions
bool  | KeyInRange (shortcut_key) const
 Protected Attributes
ON_wString  | m_macros [177]
keep at 177 in order to maintain same class size as Rhino 7 More...
Detailed Description
Member Enumeration Documentation
◆ shortcut_key
 enum CRhinoAppShortcutKeys::shortcut_key
Enumerator
f1
f2
f3
f4
f5
f6
f7
f8
f9
f10
f11
f12
ctrl_f1
ctrl_f2
ctrl_f3
ctrl_f4
ctrl_f5
ctrl_f6
ctrl_f7
ctrl_f8
ctrl_f9
ctrl_f10
ctrl_f11
ctrl_f12
shift_ctrl_f1
shift_ctrl_f2
shift_ctrl_f3
shift_ctrl_f4
shift_ctrl_f5
shift_ctrl_f6
shift_ctrl_f7
shift_ctrl_f8
shift_ctrl_f9
shift_ctrl_f10
shift_ctrl_f11
shift_ctrl_f12
alt_ctrl_f1
alt_ctrl_f2
alt_ctrl_f3
alt_ctrl_f4
alt_ctrl_f5
alt_ctrl_f6
alt_ctrl_f7
alt_ctrl_f8
alt_ctrl_f9
alt_ctrl_f10
alt_ctrl_f11
alt_ctrl_f12
ctrl_a
ctrl_b
ctrl_c
ctrl_d
ctrl_e
ctrl_f
ctrl_g
ctrl_h
ctrl_i
ctrl_j
ctrl_k
ctrl_l
ctrl_m
ctrl_n
ctrl_o
ctrl_p
ctrl_q
ctrl_r
ctrl_s
ctrl_t
ctrl_u
ctrl_v
ctrl_w
ctrl_x
ctrl_y
ctrl_z
shift_ctrl_a
shift_ctrl_b
shift_ctrl_c
shift_ctrl_d
shift_ctrl_e
shift_ctrl_f
shift_ctrl_g
shift_ctrl_h
shift_ctrl_i
shift_ctrl_j
shift_ctrl_k
shift_ctrl_l
shift_ctrl_m
shift_ctrl_n
shift_ctrl_o
shift_ctrl_p
shift_ctrl_q
shift_ctrl_r
shift_ctrl_s
shift_ctrl_t
shift_ctrl_u
shift_ctrl_v
shift_ctrl_w
shift_ctrl_x
shift_ctrl_y
shift_ctrl_z
alt_ctrl_a
alt_ctrl_b
alt_ctrl_c
alt_ctrl_d
alt_ctrl_e
alt_ctrl_f
alt_ctrl_g
alt_ctrl_h
alt_ctrl_i
alt_ctrl_j
alt_ctrl_k
alt_ctrl_l
alt_ctrl_m
alt_ctrl_n
alt_ctrl_o
alt_ctrl_p
alt_ctrl_q
alt_ctrl_r
alt_ctrl_s
alt_ctrl_t
alt_ctrl_u
alt_ctrl_v
alt_ctrl_w
alt_ctrl_x
alt_ctrl_y
alt_ctrl_z
ctrl_0
ctrl_1
ctrl_2
ctrl_3
ctrl_4
ctrl_5
ctrl_6
ctrl_7
ctrl_8
ctrl_9
shift_ctrl_0
shift_ctrl_1
shift_ctrl_2
shift_ctrl_3
shift_ctrl_4
shift_ctrl_5
shift_ctrl_6
shift_ctrl_7
shift_ctrl_8
shift_ctrl_9
alt_ctrl_0
alt_ctrl_1
alt_ctrl_2
alt_ctrl_3
alt_ctrl_4
alt_ctrl_5
alt_ctrl_6
alt_ctrl_7
alt_ctrl_8
alt_ctrl_9
home
end
ctrl_home
ctrl_end
shift_home
shift_end
shift_ctrl_home
shift_ctrl_end
alt_ctrl_home
alt_ctrl_end
tab
24 March 2020, Mikko, RH-57554 Added "tab". PageUp/Down combos haven't been exposed since 2003, hope it's ok to inject a new item above them.
page_up
page_down
shift_page_up
shift_page_down
ctrl_page_up
ctrl_page_down
shift_ctrl_page_up
shift_ctrl_page_down
alt_ctrl_page_up
alt_ctrl_page_down
none
alt_home
29 September 2023, John Morse https://mcneel.myjetbrains.com/youtrack/issue/RH-77352 Mac only Alt+XX shortcuts
alt_end
alt_a
alt_b
alt_c
alt_d
alt_e
alt_f
alt_g
alt_h
alt_i
alt_j
alt_k
alt_l
alt_m
alt_n
alt_o
alt_p
alt_q
alt_r
alt_s
alt_t
alt_u
alt_v
alt_w
alt_x
alt_y
alt_z
alt_0
alt_1
alt_2
alt_3
alt_4
alt_5
alt_6
alt_7
alt_8
alt_9
alt_f1
alt_f2
alt_f3
alt_f4
alt_f5
alt_f6
alt_f7
alt_f8
alt_f9
alt_f10
alt_f11
alt_f12
alt_shift_home
alt_shift_end
alt_shift_a
alt_shift_b
alt_shift_c
alt_shift_d
alt_shift_e
alt_shift_f
alt_shift_g
alt_shift_h
alt_shift_i
alt_shift_j
alt_shift_k
alt_shift_l
alt_shift_m
alt_shift_n
alt_shift_o
alt_shift_p
alt_shift_q
alt_shift_r
alt_shift_s
alt_shift_t
alt_shift_u
alt_shift_v
alt_shift_w
alt_shift_x
alt_shift_y
alt_shift_z
alt_shift_0
alt_shift_1
alt_shift_2
alt_shift_3
alt_shift_4
alt_shift_5
alt_shift_6
alt_shift_7
alt_shift_8
alt_shift_9
alt_shift_f1
alt_shift_f2
alt_shift_f3
alt_shift_f4
alt_shift_f5
alt_shift_f6
alt_shift_f7
alt_shift_f8
alt_shift_f9
alt_shift_f10
alt_shift_f11
alt_shift_f12
maccontrol_home
maccontrol_end
maccontrol_a
maccontrol_b
maccontrol_c
maccontrol_d
maccontrol_e
maccontrol_f
maccontrol_g
maccontrol_h
maccontrol_i
maccontrol_j
maccontrol_k
maccontrol_l
maccontrol_m
maccontrol_n
maccontrol_o
maccontrol_p
maccontrol_q
maccontrol_r
maccontrol_s
maccontrol_t
maccontrol_u
maccontrol_v
maccontrol_w
maccontrol_x
maccontrol_y
maccontrol_z
maccontrol_0
maccontrol_1
maccontrol_2
maccontrol_3
maccontrol_4
maccontrol_5
maccontrol_6
maccontrol_7
maccontrol_8
maccontrol_9
maccontrol_f1
maccontrol_f2
maccontrol_f3
maccontrol_f4
maccontrol_f5
maccontrol_f6
maccontrol_f7
maccontrol_f8
maccontrol_f9
maccontrol_f10
maccontrol_f11
maccontrol_f12
maccontrol_alt_home
maccontrol_alt_end
maccontrol_alt_a
maccontrol_alt_b
maccontrol_alt_c
maccontrol_alt_d
maccontrol_alt_e
maccontrol_alt_f
maccontrol_alt_g
maccontrol_alt_h
maccontrol_alt_i
maccontrol_alt_j
maccontrol_alt_k
maccontrol_alt_l
maccontrol_alt_m
maccontrol_alt_n
maccontrol_alt_o
maccontrol_alt_p
maccontrol_alt_q
maccontrol_alt_r
maccontrol_alt_s
maccontrol_alt_t
maccontrol_alt_u
maccontrol_alt_v
maccontrol_alt_w
maccontrol_alt_x
maccontrol_alt_y
maccontrol_alt_z
maccontrol_alt_0
maccontrol_alt_1
maccontrol_alt_2
maccontrol_alt_3
maccontrol_alt_4
maccontrol_alt_5
maccontrol_alt_6
maccontrol_alt_7
maccontrol_alt_8
maccontrol_alt_9
maccontrol_alt_f1
maccontrol_alt_f2
maccontrol_alt_f3
maccontrol_alt_f4
maccontrol_alt_f5
maccontrol_alt_f6
maccontrol_alt_f7
maccontrol_alt_f8
maccontrol_alt_f9
maccontrol_alt_f10
maccontrol_alt_f11
maccontrol_alt_f12
maccontrol_ctrl_home
maccontrol_ctrl_end
maccontrol_ctrl_a
maccontrol_ctrl_b
maccontrol_ctrl_c
maccontrol_ctrl_d
maccontrol_ctrl_e
maccontrol_ctrl_f
maccontrol_ctrl_g
maccontrol_ctrl_h
maccontrol_ctrl_i
maccontrol_ctrl_j
maccontrol_ctrl_k
maccontrol_ctrl_l
maccontrol_ctrl_m
maccontrol_ctrl_n
maccontrol_ctrl_o
maccontrol_ctrl_p
maccontrol_ctrl_q
maccontrol_ctrl_r
maccontrol_ctrl_s
maccontrol_ctrl_t
maccontrol_ctrl_u
maccontrol_ctrl_v
maccontrol_ctrl_w
maccontrol_ctrl_x
maccontrol_ctrl_y
maccontrol_ctrl_z
maccontrol_ctrl_0
maccontrol_ctrl_1
maccontrol_ctrl_2
maccontrol_ctrl_3
maccontrol_ctrl_4
maccontrol_ctrl_5
maccontrol_ctrl_6
maccontrol_ctrl_7
maccontrol_ctrl_8
maccontrol_ctrl_9
maccontrol_ctrl_f1
maccontrol_ctrl_f2
maccontrol_ctrl_f3
maccontrol_ctrl_f4
maccontrol_ctrl_f5
maccontrol_ctrl_f6
maccontrol_ctrl_f7
maccontrol_ctrl_f8
maccontrol_ctrl_f9
maccontrol_ctrl_f10
maccontrol_ctrl_f11
maccontrol_ctrl_f12
maccontrol_shift_home
maccontrol_shift_end
maccontrol_shift_a
maccontrol_shift_b
maccontrol_shift_c
maccontrol_shift_d
maccontrol_shift_e
maccontrol_shift_f
maccontrol_shift_g
maccontrol_shift_h
maccontrol_shift_i
maccontrol_shift_j
maccontrol_shift_k
maccontrol_shift_l
maccontrol_shift_m
maccontrol_shift_n
maccontrol_shift_o
maccontrol_shift_p
maccontrol_shift_q
maccontrol_shift_r
maccontrol_shift_s
maccontrol_shift_t
maccontrol_shift_u
maccontrol_shift_v
maccontrol_shift_w
maccontrol_shift_x
maccontrol_shift_y
maccontrol_shift_z
maccontrol_shift_0
maccontrol_shift_1
maccontrol_shift_2
maccontrol_shift_3
maccontrol_shift_4
maccontrol_shift_5
maccontrol_shift_6
maccontrol_shift_7
maccontrol_shift_8
maccontrol_shift_9
maccontrol_shift_f1
maccontrol_shift_f2
maccontrol_shift_f3
maccontrol_shift_f4
maccontrol_shift_f5
maccontrol_shift_f6
maccontrol_shift_f7
maccontrol_shift_f8
maccontrol_shift_f9
maccontrol_shift_f10
maccontrol_shift_f11
maccontrol_shift_f12
ctrl_plus
12 Aug 2024, Mikko, RH-82951 Added Control/Command Plus/Minus for zoom in/out.
ctrl_minus
Constructor & Destructor Documentation
◆ CRhinoAppShortcutKeys() [1/2]
 CRhinoAppShortcutKeys::CRhinoAppShortcutKeys  |  ( |   | )
◆ CRhinoAppShortcutKeys() [2/2]
 CRhinoAppShortcutKeys::CRhinoAppShortcutKeys  |  ( |  const CRhinoAppShortcutKeys &  |  src | )
◆ ~CRhinoAppShortcutKeys()
 CRhinoAppShortcutKeys::~CRhinoAppShortcutKeys  |  ( |   | )
Member Function Documentation
◆ ClearAllMacros()
 void CRhinoAppShortcutKeys::ClearAllMacros  |  ( |   | )
◆ Defaults()
 void CRhinoAppShortcutKeys::Defaults  |  ( |   | )
◆ FromKeyCombo()
 static shortcut_key CRhinoAppShortcutKeys::FromKeyCombo  |  ( |  bool  |  control,
|  bool  |  shift,
|  bool  |  alt,
|  bool  |  macControlKeyDown,
|  unsigned int  |  nChar
)
static
◆ GetAllShortcuts()
 int CRhinoAppShortcutKeys::GetAllShortcuts  |  ( |  ON_ClassArray< CRhinoKeyboardShortcut > &  |  shortcuts | ) |   const
◆ IsAcceptableKeyCombo()
 static bool CRhinoAppShortcutKeys::IsAcceptableKeyCombo  |  ( |  unsigned int  |  keycode,
|  RhinoKeyboardModifierKey  |  modifier
)
static
◆ KeyInRange()
 bool CRhinoAppShortcutKeys::KeyInRange  |  ( |  shortcut_key  |   | ) |   const
protected
Deprecated:
This function should not be used.
◆ Label() [1/2]
 static void CRhinoAppShortcutKeys::Label  |  ( |  bool  |  control,
|  bool  |  shift,
|  bool  |  alt,
|  bool  |  macControlKeyDown,
|  unsigned int  |  keycode,
|  ON_wString &  |  label
)
static
◆ Label() [2/2]
 static void CRhinoAppShortcutKeys::Label  |  ( |  int  |  key,
|  ON_wString &  |  label
)
static
◆ LoadProfile()
 void CRhinoAppShortcutKeys::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ Macro() [1/2]
 const wchar_t* CRhinoAppShortcutKeys::Macro  |  ( |  bool  |  control,
|  bool  |  shift,
|  bool  |  alt,
|  bool  |  macControlKeyDown,
|  unsigned int  |  keycode
) |   |  const
◆ Macro() [2/2]
 const wchar_t* CRhinoAppShortcutKeys::Macro  |  ( |  shortcut_key  |   | ) |   const
◆ operator!=()
 bool CRhinoAppShortcutKeys::operator!=  |  ( |  const CRhinoAppShortcutKeys &  |  src | ) |   const
◆ operator=()
 CRhinoAppShortcutKeys& CRhinoAppShortcutKeys::operator=  |  ( |  const CRhinoAppShortcutKeys &  |  src | )
◆ operator==()
 bool CRhinoAppShortcutKeys::operator==  |  ( |  const CRhinoAppShortcutKeys &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppShortcutKeys::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetMacro() [1/2]
 void CRhinoAppShortcutKeys::SetMacro  |  ( |  shortcut_key  |  ,
|  const wchar_t *
)
◆ SetMacro() [2/2]
 void CRhinoAppShortcutKeys::SetMacro  |  ( |  unsigned int  |  keycode,
|  RhinoKeyboardModifierKey  |  modifier,
|  const wchar_t *  |  macro
)
Member Data Documentation
◆ m_macros
 ON_wString CRhinoAppShortcutKeys::m_macros[177]
protected
keep at 177 in order to maintain same class size as Rhino 7