Public Member Functions | List of all members
ON_LinetypeShape Class Reference
OpenNURBS
#include <opennurbs_linetype.h>
 Public Member Functions
ON_LinetypeShape ()
ON_LinetypeShape (const ON_LinetypeShape &other)
ON_LinetypeShape (double offset, const ON_Geometry &geometry)
virtual  | ~ON_LinetypeShape ()
const ON_Geometry *  | Geometry () const
double  | LocalOffset () const
ON_LinetypeShape &  | operator= (const ON_LinetypeShape &other)
bool  | Read (ON_BinaryArchive &archive)
bool  | Write (ON_BinaryArchive &archive) const
Constructor & Destructor Documentation
◆ ON_LinetypeShape() [1/3]
 ON_LinetypeShape::ON_LinetypeShape  |  ( |   | )
◆ ON_LinetypeShape() [2/3]
 ON_LinetypeShape::ON_LinetypeShape  |  ( |  double  |  offset,
|  const ON_Geometry &  |  geometry
)
◆ ON_LinetypeShape() [3/3]
 ON_LinetypeShape::ON_LinetypeShape  |  ( |  const ON_LinetypeShape &  |  other | )
◆ ~ON_LinetypeShape()
 virtual ON_LinetypeShape::~ON_LinetypeShape  |  ( |   | )
virtual
Member Function Documentation
◆ Geometry()
 const ON_Geometry* ON_LinetypeShape::Geometry  |  ( |   | ) |   const
◆ LocalOffset()
 double ON_LinetypeShape::LocalOffset  |  ( |   | ) |   const
◆ operator=()
 ON_LinetypeShape& ON_LinetypeShape::operator=  |  ( |  const ON_LinetypeShape &  |  other | )
◆ Read()
 bool ON_LinetypeShape::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_LinetypeShape::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const