Public Member Functions | Public Attributes | List of all members
CRhinoDib::Pixel Class Reference
#include <RhinoSdkUiDibMac.h>
 Public Member Functions
Pixel (BITMAPINFO &in_bmi, const CRhinoDib *in_dib, int in_cd, long in_x, long in_y, unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha, unsigned char *in_pRGBAPixel8=nullptr)
Pixel (BITMAPINFO &in_bmi, LPBYTE in_bits, long in_cd, long in_x, long in_y, unsigned char in_r, unsigned char in_g, unsigned char in_b, unsigned char in_alpha)
float  | Float (void) const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images. More...
float  | Float (void) const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images. More...
void  | Set (float)
void  | Set (float)
void  | Set (unsigned char in_r, unsigned char in_g, unsigned char in_b, int in_alpha)
void  | Set (unsigned char in_r, unsigned char in_g, unsigned char in_b, unsigned char in_alpha)
 Public Attributes
int  | alpha
const unsigned char  | alpha
unsigned char  | b
const unsigned char  | b
BITMAPINFO &  | bmi
int  | color_depth
const int  | color_depth
LPBYTE  | dib_bits
unsigned char  | g
const unsigned char  | g
const CRhinoDib *  | pDib
unsigned char *  | pRGBAPixel8
unsigned char  | r
const unsigned char  | r
ON__UINT_PTR  | reserved
long  | x
const long  | x
long  | y
const long  | y
Constructor & Destructor Documentation
◆ Pixel() [1/2]
 CRhinoDib::Pixel::Pixel  |  ( |  BITMAPINFO &  |  in_bmi,
|  LPBYTE  |  in_bits,
|  long  |  in_cd,
|  long  |  in_x,
|  long  |  in_y,
|  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  unsigned char  |  in_alpha
)
inline
◆ Pixel() [2/2]
 CRhinoDib::Pixel::Pixel  |  ( |  BITMAPINFO &  |  in_bmi,
|  const CRhinoDib *  |  in_dib,
|  int  |  in_cd,
|  long  |  in_x,
|  long  |  in_y,
|  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha,
|  unsigned char *  |  in_pRGBAPixel8 = nullptr
)
inline
Member Function Documentation
◆ Float() [1/2]
 float CRhinoDib::Pixel::Float  |  ( |  void  |   | ) |   const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images.
◆ Float() [2/2]
 float CRhinoDib::Pixel::Float  |  ( |  void  |   | ) |   const
To support DIBs where a 32-bit float type is stored in the 32 bits of each pixel. Does not work on non-32-bit images.
◆ Set() [1/4]
 void CRhinoDib::Pixel::Set  |  ( |  float  |   | )
◆ Set() [2/4]
 void CRhinoDib::Pixel::Set  |  ( |  float  |   | )
◆ Set() [3/4]
 void CRhinoDib::Pixel::Set  |  ( |  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  int  |  in_alpha
)
◆ Set() [4/4]
 void CRhinoDib::Pixel::Set  |  ( |  unsigned char  |  in_r,
|  unsigned char  |  in_g,
|  unsigned char  |  in_b,
|  unsigned char  |  in_alpha
)
inline
Member Data Documentation
◆ alpha [1/2]
 int CRhinoDib::Pixel::alpha
◆ alpha [2/2]
 const unsigned char CRhinoDib::Pixel::alpha
◆ b [1/2]
 unsigned char CRhinoDib::Pixel::b
◆ b [2/2]
 const unsigned char CRhinoDib::Pixel::b
◆ bmi
 BITMAPINFO & CRhinoDib::Pixel::bmi
◆ color_depth [1/2]
 int CRhinoDib::Pixel::color_depth
◆ color_depth [2/2]
 const int CRhinoDib::Pixel::color_depth
◆ dib_bits
 LPBYTE CRhinoDib::Pixel::dib_bits
◆ g [1/2]
 unsigned char CRhinoDib::Pixel::g
◆ g [2/2]
 const unsigned char CRhinoDib::Pixel::g
◆ pDib
 const CRhinoDib* CRhinoDib::Pixel::pDib
◆ pRGBAPixel8
 unsigned char* CRhinoDib::Pixel::pRGBAPixel8
Only set this value when the exact format is known (8-bit RGBA or RGB) Note that this is Mac only.
◆ r [1/2]
 unsigned char CRhinoDib::Pixel::r
◆ r [2/2]
 const unsigned char CRhinoDib::Pixel::r
◆ reserved
 ON__UINT_PTR CRhinoDib::Pixel::reserved
◆ x [1/2]
 long CRhinoDib::Pixel::x
◆ x [2/2]
 const long CRhinoDib::Pixel::x
◆ y [1/2]
 long CRhinoDib::Pixel::y
◆ y [2/2]
 const long CRhinoDib::Pixel::y