Public Member Functions | List of all members
CRhRdkIORContextMenu Class Referencefinal
RDK
#include <RhRdkIORContextMenu.h>
 Public Member Functions
CRhRdkIORContextMenu ()
~CRhRdkIORContextMenu ()
bool  | TrackMenu (HWND pWnd, const ON_2iPoint &point, double &dIOROut, ON_wString *pStringOut=nullptr) const
Constructor & Destructor Documentation
◆ CRhRdkIORContextMenu()
 CRhRdkIORContextMenu::CRhRdkIORContextMenu  |  ( |   | )
◆ ~CRhRdkIORContextMenu()
 CRhRdkIORContextMenu::~CRhRdkIORContextMenu  |  ( |   | )
Member Function Documentation
◆ TrackMenu()
 bool CRhRdkIORContextMenu::TrackMenu  |  ( |  HWND  |  pWnd,
|  const ON_2iPoint &  |  point,
|  double &  |  dIOROut,
|  ON_wString *  |  pStringOut = nullptr
) |   |  const