Public Types | Public Member Functions | List of all members
CArgsRhinoFair Class Reference
Rhino
#include <rhinoSdkFair.h>
 Public Types
enum  | eClamp { ecNone = 0, ecTangency = 1, ecCurvature = 2 }
 Public Member Functions
CArgsRhinoFair ()
~CArgsRhinoFair ()
double  | AngleTolerance () const
int  | ClampEnd () const
int  | ClampStart () const
const ON_Curve *  | InputCurve () const
int  | IterationCount () const
void  | SetAngleTolerance (double tol)
void  | SetClampEnd (int dercount)
void  | SetClampStart (int dercount)
void  | SetInputCurve (const ON_Curve *pC)
void  | SetIterationCount (int count)
void  | SetTolerance (double tol)
double  | Tolerance () const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ eClamp
 enum CArgsRhinoFair::eClamp
Enumerator
ecNone
ecTangency
ecCurvature
Constructor & Destructor Documentation
◆ CArgsRhinoFair()
 CArgsRhinoFair::CArgsRhinoFair  |  ( |   | )
◆ ~CArgsRhinoFair()
 CArgsRhinoFair::~CArgsRhinoFair  |  ( |   | )
Member Function Documentation
◆ AngleTolerance()
 double CArgsRhinoFair::AngleTolerance  |  ( |   | ) |   const
Description: Get or set the angle tolerance Parameters: [in] tol - the new tolerance Returns: the angle tolerance Remarks: Kinks less than this will be removed
◆ ClampEnd()
 int CArgsRhinoFair::ClampEnd  |  ( |   | ) |   const
Description: Get or set the number of CV's on the end to keep in place Parameters: [in] dercount - Number of derivatives to fix Returns: Number of derivatives fixed Remarks: 0: position, 1: tangency, 2: curvature
◆ ClampStart()
 int CArgsRhinoFair::ClampStart  |  ( |   | ) |   const
Description: Get or set the number of CV's on the start to keep in place Parameters: [in] dercount - Number of derivatives to fix Returns: Number of derivatives fixed Remarks: 0: position, 1: tangency, 2: curvature
◆ InputCurve()
 const ON_Curve* CArgsRhinoFair::InputCurve  |  ( |   | ) |   const
Description: Get or set the input curve to fair Parameters: [in] pC - pointer to the curve Returns: a new faired version of the curve
◆ IterationCount()
 int CArgsRhinoFair::IterationCount  |  ( |   | ) |   const
Description: Set or get the number of iteratoins to use in adjusting the curve Parameters: [in] count - Number of iterations Returns: Number of iterations
◆ SetAngleTolerance()
 void CArgsRhinoFair::SetAngleTolerance  |  ( |  double  |  tol | )
◆ SetClampEnd()
 void CArgsRhinoFair::SetClampEnd  |  ( |  int  |  dercount | )
◆ SetClampStart()
 void CArgsRhinoFair::SetClampStart  |  ( |  int  |  dercount | )
◆ SetInputCurve()
 void CArgsRhinoFair::SetInputCurve  |  ( |  const ON_Curve *  |  pC | )
◆ SetIterationCount()
 void CArgsRhinoFair::SetIterationCount  |  ( |  int  |  count | )
◆ SetTolerance()
 void CArgsRhinoFair::SetTolerance  |  ( |  double  |  tol | )
◆ Tolerance()
 double CArgsRhinoFair::Tolerance  |  ( |   | ) |   const
Description: Get or set the fairing position tolerance Parameters: [in] tol - the new tolerance Returns: the fairing tolerance Remarks: The faired curve can deviate from the input by this much