Public Types | Public Member Functions | List of all members
ON_RdkDocumentDefaults Class Reference
OpenNURBS
This class is for internal RDK use only. More...
#include <opennurbs_xml.h>
 Public Types
enum  | ValueSets { ValueSets::All, ValueSets::New }
 Public Member Functions
ON_RdkDocumentDefaults (const ON_RdkDocumentDefaults &)=delete
ON_RdkDocumentDefaults (int major_version, ValueSets vs, void *reserved=nullptr)
virtual  | ~ON_RdkDocumentDefaults ()
virtual void  | CopyDefaultsTo (ON_XMLNode &dest) const
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual const ON_XMLNode &  | Node (void) const
const ON_RdkDocumentDefaults &  | operator= (const ON_RdkDocumentDefaults &)=delete
Detailed Description
This class is for internal RDK use only.
Member Enumeration Documentation
◆ ValueSets
 enum ON_RdkDocumentDefaults::ValueSets
strong
Enumerator
All
New
Constructor & Destructor Documentation
◆ ON_RdkDocumentDefaults() [1/2]
 ON_RdkDocumentDefaults::ON_RdkDocumentDefaults  |  ( |  int  |  major_version,
|  ValueSets  |  vs,
|  void *  |  reserved = nullptr
)
◆ ON_RdkDocumentDefaults() [2/2]
 ON_RdkDocumentDefaults::ON_RdkDocumentDefaults  |  ( |  const ON_RdkDocumentDefaults &  |   | )
delete
◆ ~ON_RdkDocumentDefaults()
 virtual ON_RdkDocumentDefaults::~ON_RdkDocumentDefaults  |  ( |   | )
virtual
Member Function Documentation
◆ CopyDefaultsTo()
 virtual void ON_RdkDocumentDefaults::CopyDefaultsTo  |  ( |  ON_XMLNode &  |  dest | ) |   const
virtual
◆ EVF()
 virtual void* ON_RdkDocumentDefaults::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ Node()
 virtual const ON_XMLNode& ON_RdkDocumentDefaults::Node  |  ( |  void  |   | ) |   const
virtual
◆ operator=()
 const ON_RdkDocumentDefaults& ON_RdkDocumentDefaults::operator=  |  ( |  const ON_RdkDocumentDefaults &  |   | )
delete