Public Types | Public Member Functions | Public Attributes | Protected Types | Protected Member Functions | Protected Attributes | Static Protected Attributes | Friends | List of all members
CRhinoUiTabbedSheetCtrl Class Reference
RhinoUI
#include <RhinoSdkUiTabbedSheetCtrl.h>
 Inheritance diagram for CRhinoUiTabbedSheetCtrl:
 Public Types
enum  | orientation { orient_top = 0, orient_left, orient_right, orient_bottom }
enum  | scroll_button {
 sb_invalid = 0, sb_first, sb_last, sb_next,
 sb_previous, sb_add, force_32bit_scroll_button = 0xFFFFFFFF
 }
 Public Member Functions
CRhinoUiTabbedSheetCtrl ()
virtual  | ~CRhinoUiTabbedSheetCtrl ()
int  | AddItem (const CRhinoUiTabbedSheetCtrlItem &item)
int  | AddItem (const wchar_t *lpsItem, CWnd *pWndItem=NULL)
scroll_button  | ButtonFromPoint (CPoint pt) const
void  | CancelEditLabel ()
bool  | CanSeeItem (int iItem) const
bool  | CreateTabbedSheetCtrl (CWnd *pParent, UINT nID, LPRECT lpRect=NULL)
bool  | DeleteAllItems ()
bool  | DeleteItem (int iItem)
CEdit *  | EditLabel (int iItem)
bool  | EditLabelOnDoubleClick () const
void  | GetControlColors (COLORREF &crActiveTab, COLORREF &crActiveText, COLORREF &crNormalTab, COLORREF &crNormalText) const
const CRhinoUiTabbedSheetCtrlItem *  | GetCurItem () const
int  | GetCurSel () const
CEdit *  | GetEditControl () const
const CRhinoUiTabbedSheetCtrlItem *  | GetItem (int iItem) const
bool  | GetItem (int iItem, TCITEM *pTabCtrlItem) const
int  | GetItemCount () const
DWORD_PTR  | GetItemData (int iItem) const
void *  | GetItemDataPtr (int iItem) const
int  | GetItemIndex (const wchar_t *lps, bool bCaseSensitiveMatch=false) const
bool  | GetItemRect (int iItem, LPRECT lpRect) const
DWORD  | GetItemState (int iItem) const
bool  | HideItem (int iItem, bool bHide=true)
bool  | IncludeAddButton ()
bool  | IncludeFirstAndLastButtons () const
bool  | IncludeNextAndPreviousButtons () const
int  | InsertItem (int iIndex, const CRhinoUiTabbedSheetCtrlItem &item)
int  | InsertItem (int iIndex, const wchar_t *lpsItem, CWnd *pWndItem=NULL)
int  | InsertItem (int iIndex, LPCTSTR lpsItem, int iImage)
int  | InsertItem (int iIndex, TCITEM *pTabCtrlItem)
int  | InsertItem (UINT nMask, int iIndex, LPCTSTR lpsItem, int iImage, LPARAM lParam)
int  | InsertItem (UINT nMask, int iIndex, LPCTSTR lpsItem, int iImage, LPARAM lParam, DWORD dwState, DWORD dwStateMask)
bool  | IsHorizontal () const
bool  | IsVertical () const
int  | ItemIndexFromPoint (CPoint pt) const
bool  | ItemIndexIsValid (int iItem) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnNcPaint ()
afx_msg void  | OnPaint ()
afx_msg void  | OnRButtonDown (UINT nFlags, CPoint point)
afx_msg BOOL32  | OnSetCursor (CWnd *pWnd, UINT nHitTest, UINT message)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
afx_msg void  | OnTimer (UINT_PTR nIDEvent)
orientation  | Orientation () const
void  | RecalcLayout ()
bool  | RecalcOnAddOrInsert () const
void  | Redraw ()
bool  | ReplaceDlgItem (CDialog *pParent, UINT nID)
bool  | SetControlColors (COLORREF crActiveTab=ON_UNSET_COLOR, COLORREF crActiveText=ON_UNSET_COLOR, COLORREF crNormalTab=ON_UNSET_COLOR, COLORREF crNormalText=ON_UNSET_COLOR)
int  | SetCurSel (int iItem)
bool  | SetEditLabelOnDoubleClick (bool b)
void  | SetIncludeAddButton (bool b)
bool  | SetIncludeFirstAndLastButtons (bool b)
bool  | SetIncludeNextAndPreviousButtons (bool b)
bool  | SetItem (int iItem, const CRhinoUiTabbedSheetCtrlItem &item)
bool  | SetItem (int iItem, TCITEM *pTabCtrlItem)
int  | SetItemData (int iItem, DWORD_PTR dwItemData)
int  | SetItemDataPtr (int iItem, void *pData)
orientation  | SetOrientation (orientation orient)
bool  | SetRecalcOnAddOrInsert (bool b)
 Public Attributes
class CInternalRhUiTabbedSheetCtrl *  | m_internal_tabbed_sheet_ctrl = nullptr
 Protected Types
enum  | mouse_capture {
 no_mouse_capture = 0, scroll_mouse_capture, scroll_hover_mouse_capture, drag_tab_capture,
 force_32bit_mouse_capture = 0xFFFFFFFF
 }
enum  | timers { scroll_timer = 100, tool_tip_timer, force_32bit_timers = 0xFFFFFFFF }
 Protected Member Functions
bool  | CreateEdit ()
void  | DestroyDragWindow ()
bool  | DoScrollButton (scroll_button sb)
bool  | DrawScrollButton (CDC &dc, scroll_button sb)
void  | EndEdit ()
CFont *  | GetDrawFont (bool bBold) const
CFont *  | GetDrawFont (bool bBold, bool bHorizontal, bool bottom_up) const
void  | HoseItemList ()
void  | KillScrollMouseHover ()
void  | KillScrollTimer ()
void  | KillTooltipTimer ()
void  | MakeButtonDibs (CRect &rItem, int cy)
afx_msg LRESULT  | OnEndEditMessage (WPARAM wParam, LPARAM lParam)
virtual void  | PreSubclassWindow ()
void  | RedrawButtons ()
void  | ResetScrollButtons ()
void  | SendSelChangedMessage (bool bChanged, int iPrevious, int iCurrent)
LRESULT  | SendTabbedSheetCustomMessage (bool bToParent, CRhinoUiTabbedSheetCtrlMsg::CUSTOMINFO &info)
bool  | ShowDragWindow (int iItem, bool bShow, CPoint point)
 Protected Attributes
bool  | m_bEditLabelOnDoubleClick
bool  | m_bIncludeFirstAndLastButtons
bool  | m_bIncludeNextAndPreviousButtons
bool  | m_bRecalcOnAddOrInsert
CRhinoDib  | m_button_dib
CRhinoDib  | m_button_dib_disabled
COLORREF  | m_crActiveTab
COLORREF  | m_crActiveText
COLORREF  | m_crNormalTab
COLORREF  | m_crNormalText
CRhinoUiDragBitmapWnd *  | m_drag_window
CRhinoUiTabbedSheetCtrlGDI *  | m_gdi
scroll_button  | m_hot_scroll_button
int  | m_iCurSel
int  | m_iEdit
int  | m_iFirstVisible
int  | m_iFirstVisibleIndex
int  | m_iLastVisible
int  | m_iLastVisibleIndex
ON_SimpleArray< CRhinoUiTabbedSheetCtrlItem * >  | m_item_list
int  | m_iVisible
CPoint  | m_lmouse_down_pt
mouse_capture  | m_mouse_capture
scroll_button  | m_mouse_down_on_scroll_button
orientation  | m_orientation
class CRhinoUiInPlaceEdit *  | m_pEdit
scroll_button  | m_pressed_scroll_button
CRect  | m_rButtons
CRect  | m_rCtrlClient
CRect  | m_rFirst
CRect  | m_rLast
CRect  | m_rNext
CRect  | m_rPage
CRect  | m_rPageBorders
CRect  | m_rPrev
CRect  | m_rTabs
scroll_button  | m_scroll_timer_button
 Static Protected Attributes
static COLORREF  | m_crMask
static CRhinoDib  | m_drag_dib
 Friends
class  | CRhinoUiTabbedSheetCtrlGDI
Member Enumeration Documentation
◆ mouse_capture
 enum CRhinoUiTabbedSheetCtrl::mouse_capture
protected
Enumerator
no_mouse_capture
scroll_mouse_capture
scroll_hover_mouse_capture
drag_tab_capture
force_32bit_mouse_capture
for internal use only, this allows adding additional values without breaking the SDK in the future
◆ orientation
 enum CRhinoUiTabbedSheetCtrl::orientation
Enumerator
orient_top
Display tabs at top of control with pages below.
orient_left
Display tabs on left side of control with pages to the right.
orient_right
Display tabs on right side of control with pages to the left.
orient_bottom
Default orientation, display tabs at bottom of control with pages above.
◆ scroll_button
 enum CRhinoUiTabbedSheetCtrl::scroll_button
Enumerator
sb_invalid
sb_first
sb_last
sb_next
sb_previous
sb_add
force_32bit_scroll_button
for internal use only, this allows adding additional values without breaking the SDK in the future
◆ timers
 enum CRhinoUiTabbedSheetCtrl::timers
protected
Enumerator
scroll_timer
tool_tip_timer
force_32bit_timers
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiTabbedSheetCtrl()
 CRhinoUiTabbedSheetCtrl::CRhinoUiTabbedSheetCtrl  |  ( |   | )
Description: Constructor
◆ ~CRhinoUiTabbedSheetCtrl()
 virtual CRhinoUiTabbedSheetCtrl::~CRhinoUiTabbedSheetCtrl  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ AddItem() [1/2]
 int CRhinoUiTabbedSheetCtrl::AddItem  |  ( |  const CRhinoUiTabbedSheetCtrlItem &  |  item | )
Description: Adds a new last item to existing tab control.
Parameters: item [in] Reference to a CRhinoUiTabbedSheetCtrlItem object that specifies the attributes of the tab.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::InsertItem()
◆ AddItem() [2/2]
 int CRhinoUiTabbedSheetCtrl::AddItem  |  ( |  const wchar_t *  |  lpsItem,
|  CWnd *  |  pWndItem = NULL
)
Description: Adds a new last item to existing tab control.
Parameters: lpsItem [in] Address of a null-terminated string that contains the text of the tab. pWndItem [in] Pointer to window which should be displayed when this tab is active. If this is NULL then no window synchronization occurs.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::InsertItem()
◆ ButtonFromPoint()
 scroll_button CRhinoUiTabbedSheetCtrl::ButtonFromPoint  |  ( |  CPoint  |  pt | ) |   const
Description: Determines which scroll button, if any, is at the specified screen position.
Parameters: pt [in] Screen point
Returns: scroll_button Which identifies the scroll button or sb_invalid if no button is at the specified position.
See Also: CRhinoUiTabbedSheetCtrl::ItemIndexFromPoint()
◆ CancelEditLabel()
 void CRhinoUiTabbedSheetCtrl::CancelEditLabel  |  ( |   | )
Description: Cancels tab item text editing operation.
See Also: CRhinoUiTabbedSheetCtrl::EditLabel() CRhinoUiTabbedSheetCtrl::GetEditControl()
◆ CanSeeItem()
 bool CRhinoUiTabbedSheetCtrl::CanSeeItem  |  ( |  int  |  iItem | ) |   const
Description: Call this method if to determine if you can currently see the tab specified by iItem on the screen.
Parameters: iItem [in] Zero-based index of the tab.
Returns: Returns true if the entier tab is currently visible on the screen.
◆ CreateEdit()
 bool CRhinoUiTabbedSheetCtrl::CreateEdit  |  ( |   | )
protected
Description: Create in-place edit control used by EditLable() method
Returns: Returns true if edit control was created successfully or already existed or false if unable to create the control.
See Also: CRhinoUiTabbedSheetCtrl::EditLabel()
◆ CreateTabbedSheetCtrl()
 bool CRhinoUiTabbedSheetCtrl::CreateTabbedSheetCtrl  |  ( |  CWnd *  |  pParent,
|  UINT  |  nID,
|  LPRECT  |  lpRect = NULL
)
Description: Create tab control window.
Parameters: pParent [in] Parent window for this tab control. nID [in] The ID of the child window.
Returns: Returns true if successful; otherwise false
◆ DeleteAllItems()
 bool CRhinoUiTabbedSheetCtrl::DeleteAllItems  |  ( |   | )
Description: Removes all items from a tab control.
Returns: Returns true if successful; otherwise false.
See Also: CRhinoUiTabbedSheetCtrl::DeleteItem()
◆ DeleteItem()
 bool CRhinoUiTabbedSheetCtrl::DeleteItem  |  ( |  int  |  iItem | )
Description: Removes the specified item from a tab control.
Parameters: iItem [in] The zero-based index number of the item to delete.
Returns: Return true if successful; otherwise false.
See Also: CRhinoUiTabbedSheetCtrl::DeleteAllItems()
◆ DestroyDragWindow()
 void CRhinoUiTabbedSheetCtrl::DestroyDragWindow  |  ( |   | )
protected
◆ DoScrollButton()
 bool CRhinoUiTabbedSheetCtrl::DoScrollButton  |  ( |  scroll_button  |  sb | )
protected
Description: Method called by the scroll button click event handler or the scroll timer.
Parameters: sb [in] Scroll button action.
Returns: Returns true if a scroll action has occurred.
See Also:
◆ DrawScrollButton()
 bool CRhinoUiTabbedSheetCtrl::DrawScrollButton  |  ( |  CDC &  |  dc,
|  scroll_button  |  sb
)
protected
Description: Call this method to draw the scroll buttons if any are visible. This will draw the buttons in there current state.
Parameters: dc [in] Device context to draw to. sb [in] Button to draw.
Returns: Returns true if a button was drawn or false if it was not.
◆ EditLabel()
 CEdit* CRhinoUiTabbedSheetCtrl::EditLabel  |  ( |  int  |  iItem | )
Description: Use this method to begin in-place editing of the specified text in the tab.
Parameters: iItem [in] Zero-based index of the tab.
Returns: Returns a pointer to the in-place edit control if successful otherwise returns NULL.
See Also: CRhinoUiTabbedSheetCtrl::GetEditControl() CRhinoUiTabbedSheetCtrl::CancelEditLabel()
◆ EditLabelOnDoubleClick()
 bool CRhinoUiTabbedSheetCtrl::EditLabelOnDoubleClick  |  ( |   | ) |   const
Description: Call this method to find out if tab label names will in-place edit when double clicked.
Returns: Returns true if the label will in-place edit on double click otherwise returns false.
See Also: CRhinoUiTabbedSheetCtrl::SetEditLabelOnDoubleClick() CRhinoUiTabbedSheetCtrl::EditLabel() CRhinoUiTabbedSheetCtrlMsg::mid_begin_label_edit CRhinoUiTabbedSheetCtrlMsg::mid_end_label_edit
◆ EndEdit()
 void CRhinoUiTabbedSheetCtrl::EndEdit  |  ( |   | )
protected
Description: Send message to parent to decide whether or not to commit new text to the tab. If parent says it is okay then update the text and invalidate the control.
See Also: CRhinoUiTabbedSheetCtrl::CreateEdit() CRhinoUiTabbedSheetCtrl::EditLabel()
◆ GetControlColors()
 void CRhinoUiTabbedSheetCtrl::GetControlColors  |  ( |  COLORREF &  |  crActiveTab,
|  COLORREF &  |  crActiveText,
|  COLORREF &  |  crNormalTab,
|  COLORREF &  |  crNormalText
) |   |  const
Description: By default active tabs are drawing using ::GetSysColor( COLOR_WINDOW) and inactive tabs are drawn using ::GetSysColor( COLOR_BTNFACE). You may override this behavior by setting a color to a value other than ON_UNSET_COLOR. Cal this method to determine the current draw colors.
Parameters: crActiveTab [out] Color to use when drawing the active tab background. crActiveText [out] Color to use when drawing the active tab caption text. crNormalTab [out] Color to use when drawing an inactive tab background. crNormalText [out] Color to use when drawing an inactive tab caption text.
See Also: CRhinoUiTabbedSheetCtrl::SetControlColors()
◆ GetCurItem()
 const CRhinoUiTabbedSheetCtrlItem* CRhinoUiTabbedSheetCtrl::GetCurItem  |  ( |   | ) |   const
Description: Retrieves a pointer to a CRhinoUiTabbedSheetCtrlItem for the currently selected tab in a tab control.
Returns: Pointer to a CRhinoUiTabbedSheetCtrlItem for the currently selected tab if successful, otherwise NULL
See Also: CRhinoUiTabbedSheetCtrl::GetCurSel() CRhinoUiTabbedSheetCtrl::SetCurSel()
◆ GetCurSel()
 int CRhinoUiTabbedSheetCtrl::GetCurSel  |  ( |   | ) |   const
Description: Retrieves the zero based index for the currently selected tab in a tab control.
Returns: Zero-based index of the selected tab if successful or – 1 if no tab is selected.
See Also: CRhinoUiTabbedSheetCtrl::SetCurSel() CRhinoUiTabbedSheetCtrl::GetCurItem()
◆ GetDrawFont() [1/2]
 CFont* CRhinoUiTabbedSheetCtrl::GetDrawFont  |  ( |  bool  |  bBold | ) |   const
protected
Description: Call this method to get the font used for drawing tab label text.
Parameters: bBold [in] If true then the bold version of the font is returned otherwise the normal font is returned. The font angle is determined by the current orientation. For orient_top and orient_bottom positions a horizontal font is returned. For the orient_left position a font with an angle of 90 is returned. For the orient_right position a font with an angle of 270 is returned.
Returns: Pointer to the specified font if successful or NULL if not.
See Also: CTabSheetDlgTest::GetDrawFont( bool bBold, bool bHorizontal, bool bottom_up) CTabSheetDlgTest::Orientation()
◆ GetDrawFont() [2/2]
 CFont* CRhinoUiTabbedSheetCtrl::GetDrawFont  |  ( |  bool  |  bBold,
|  bool  |  bHorizontal,
|  bool  |  bottom_up
) |   |  const
protected
Description: Call this method to get the font used for drawing tab label text.
Parameters: bBold [in] If true then the bold version of the font is returned otherwise the normal font is returned. bHorizontal [in] If true then a normal, horizontal font is returned otherwise a vertical font is returned. The vertical font that is returned is controlled by the bottom_up argument. If bottom up is true then a font with lfEscapement and lfOrientation of 900 (90 degrees) is returned otherwise; a font with lfEscapement and lfOrientation of 2700 (270 degrees) is returned. bottom_up [in] Only valid if bHorizontal is false. If bottom up is true then a font with lfEscapement and lfOrientation of 900 (90 degrees) is returned otherwise; a font with lfEscapement and lfOrientation of 2700 (270 degrees) is returned.
Returns: Pointer to the specified font if successful or NULL if not.
See Also: CTabSheetDlgTest::GetDrawFont( bool bBold)
◆ GetEditControl()
 CEdit* CRhinoUiTabbedSheetCtrl::GetEditControl  |  ( |   | ) |   const
Description: This method retrieves a pointer to the edit control used to edit text in a tab.
Returns: If successful, a pointer to the CEdit object that is used to edit the item text; otherwise, it is NULL.
See Also: CRhinoUiTabbedSheetCtrl::EditLabel() CRhinoUiTabbedSheetCtrl::CancelEditLabel()
◆ GetItem() [1/2]
 const CRhinoUiTabbedSheetCtrlItem* CRhinoUiTabbedSheetCtrl::GetItem  |  ( |  int  |  iItem | ) |   const
Description: Retrieves information about a tab in a tab control.
Parameters: iItem [in] Zero-based index of the tab.
Returns: Pointer to a CRhinoUiTabbedSheetCtrlItem which contains information about the tab.
See Also: class CRhinoUiTabbedSheetCtrlItem
◆ GetItem() [2/2]
 bool CRhinoUiTabbedSheetCtrl::GetItem  |  ( |  int  |  iItem,
|  TCITEM *  |  pTabCtrlItem
) |   |  const
Description: Retrieves information about a tab in a tab control.
Parameters: iItem [in] Zero-based index of the tab. pTabCtrlItem [out] Pointer to a TCITEM structure, used to specify the information to retrieve. Also used to receive information about the tab. This structure is used with the InsertItem, GetItem, and SetItem member functions.
Returns: Returns true if successful; false otherwise.
See Also: CTabCtrl::GetItem in the Platform SDK
◆ GetItemCount()
 int CRhinoUiTabbedSheetCtrl::GetItemCount  |  ( |   | ) |   const
Description: Retrieves the number of tabs in the tab control. This includes tabs that are hidden.
Returns: Number of items, including hidden items, in the tab control.
See Also: CRhinoUiTabbedSheetCtrl::GetItem() CRhinoUiTabbedSheetCtrl::SetItem()
◆ GetItemData()
 DWORD_PTR CRhinoUiTabbedSheetCtrl::GetItemData  |  ( |  int  |  iItem | ) |   const
Description: This method retrieves the application-specific value associated with item specified by iItem.
Parameters: iItem [in] Zero-based index of the tab.
Returns: A application-specific value associated with item specified by iItem.
See Also: CRhinoUiTabbedSheetCtrlItem::GetData()
◆ GetItemDataPtr()
 void* CRhinoUiTabbedSheetCtrl::GetItemDataPtr  |  ( |  int  |  iItem | ) |   const
Description: This method retrieves the application-specific value associated with the item specified by iItem.
Parameters: iItem [in] Zero-based index of the tab.
Returns: A application-specific pointer associated with iItem or NULL if none.
See Also: CRhinoUiTabbedSheetCtrl::SetData() CRhinoUiTabbedSheetCtrlItem::SetData() CRhinoUiTabbedSheetCtrlItem::GetData() CRhinoUiTabbedSheetCtrlItem::SetDataPtr() CRhinoUiTabbedSheetCtrlItem::GetDataPtr()
◆ GetItemIndex()
 int CRhinoUiTabbedSheetCtrl::GetItemIndex  |  ( |  const wchar_t *  |  lps,
|  bool  |  bCaseSensitiveMatch = false
) |   |  const
Description: Retrieves zero based index of the first tab found with the specified name.
Parameters: lps [in] Name of tab to look for. bCaseSensitiveMatch [in] If true then will only find tab where name and case match otherwise; will find tab where name matches regardless of case.
Returns: Returns zero based index of first tab found with matching name or -1 if no match found.
See Also: CRhinoUiTabbedSheetCtrl::GetItem()
◆ GetItemRect()
 bool CRhinoUiTabbedSheetCtrl::GetItemRect  |  ( |  int  |  iItem,
|  LPRECT  |  lpRect
) |   |  const
Description: Retrieves the bounding rectangle for the specified tab in a tab control.
Parameters: iItem [in] Zero-based index of the tab. lpRect [out] Pointer to a RECT structure that receives the bounding rectangle of the tab. These coordinates use the viewport's current mapping mode. Returns: true If successful; otherwise false.
◆ GetItemState()
 DWORD CRhinoUiTabbedSheetCtrl::GetItemState  |  ( |  int  |  iItem | ) |   const
Description: Retrieves the state of the tab control item identified by iItem.
Parameters: iItem [in] The zero-based index number of the item for which to retrieve state information.
Returns: Returns CRhinoUiTabbedSheetCtrlItem::item_state enum describing the current state of this tab control item. Can be one of the following: normal_state Tab is in normal state, not depressed or highlighted. pressed_state The tab control item is selected. highlighted_state The tab control item is highlighted.
See Also: CRhinoUiTabbedSheetCtrlItem::item_state
◆ HideItem()
 bool CRhinoUiTabbedSheetCtrl::HideItem  |  ( |  int  |  iItem,
|  bool  |  bHide = true
)
Description: Remove item from display but not from tab control. This is useful to temporarily hide a tab. Hidding the current tab will result in the current selection being set to none.
Parameters: iItem [in] Zero-based index of the tab to hide.
Returns: Returns true if tab was hidden successfully.
◆ HoseItemList()
 void CRhinoUiTabbedSheetCtrl::HoseItemList  |  ( |   | )
protected
Description: Clean up m_item_list pointers.
◆ IncludeAddButton()
 bool CRhinoUiTabbedSheetCtrl::IncludeAddButton  |  ( |   | )
Description: Call this method to determine if the tab button will be displayed. This method will only work if called after the control has been created, the default value is false.
Returns: Returns true if the add tab button is part of the control
See Also: CRhinoUiTabbedSheetCtrl::SetIncludeAddButton()
◆ IncludeFirstAndLastButtons()
 bool CRhinoUiTabbedSheetCtrl::IncludeFirstAndLastButtons  |  ( |   | ) |   const
Description: Call this method to find out if "First" and "Last" scroll buttons will be displayed. The "First" button will make sure the first visible tab control item is displayed, the "Last" button will make sure the last visible tab control item is displayed.
Returns: Returns true if the "First" and "Last" scroll buttons will be displayed otherwise returns false.
See Also: CRhinoUiTabbedSheetCtrl::SetIncludeFirstAndLastButtons()
◆ IncludeNextAndPreviousButtons()
 bool CRhinoUiTabbedSheetCtrl::IncludeNextAndPreviousButtons  |  ( |   | ) |   const
Description: Call this method to find out if "Previous" and "Next" scroll buttons will be displayed. The "Previous" button will make sure the item, prior to the current first visible item, is displayed, the "Next" button will make sure the item after the last displayed is visible.
Returns: Returns true if "Next" and "Previous" buttons are visible otherwise false.
See Also: CRhinoUiTabbedSheetCtrl::IncludeFirstAndLastButtons()
◆ InsertItem() [1/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  int  |  iIndex,
|  const CRhinoUiTabbedSheetCtrlItem &  |  item
)
Description: Inserts a new tab in an existing tab control.
Parameters: iIndex [in] Zero-based index of the new tab. item [in] Reference to a CRhinoUiTabbedSheetCtrlItem object that specifies the attributes of the tab.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem()
◆ InsertItem() [2/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  int  |  iIndex,
|  const wchar_t *  |  lpsItem,
|  CWnd *  |  pWndItem = NULL
)
Description: Inserts a new tab in an existing tab control.
Parameters: iIndex [in] Zero-based index of the new tab. lpsItem [in] Address of a null-terminated string that contains the text of the tab. pWndItem [in] Pointer to window which should be displayed when this tab is active. If this is NULL then no window synchronization occurs.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem()
◆ InsertItem() [3/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  int  |  iIndex,
|  LPCTSTR  |  lpsItem,
|  int  |  iImage
)
Description: Inserts a new tab in an existing tab control.
Parameters: iIndex [in] Zero-based index of the new tab. lpsItem [in] Address of a null-terminated string that contains the text of the tab. iImage [in] The zero-based index of an image to insert from an image list.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem() TCITEM in the Platform SDK CTabCtrl::InsertItem in the Platform SDK
◆ InsertItem() [4/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  int  |  iIndex,
|  TCITEM *  |  pTabCtrlItem
)
Description: Inserts a new tab in an existing tab control.
Parameters: iIndex [in] Zero-based index of the new tab. pTabCtrlItem [in] Pointer to a TCITEM structure that specifies the attributes of the tab.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem() TCITEM in the Platform SDK CTabCtrl::InsertItem in the Platform SDK
◆ InsertItem() [5/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  UINT  |  nMask,
|  int  |  iIndex,
|  LPCTSTR  |  lpsItem,
|  int  |  iImage,
|  LPARAM  |  lParam
)
Description: Inserts a new tab in an existing tab control.
Parameters: nMask [in] Specifies which TCITEM structure attributes to set. Can be zero or a combination of the following values: TCIF_TEXT The pszText member is valid. TCIF_IMAGE The iImage member is valid. TCIF_PARAM The lParam member is valid. TCIF_RTLREADING The text of pszText is displayed using right-to-left reading order on Hebrew or Arabic systems. TCIF_STATE The dwState member is valid. iIndex [in] Zero-based index of the new tab. lpsItem [in] Address of a null-terminated string that contains the text of the tab. iImage [in] The zero-based index of an image to insert from an image list. lParam [in] Application-defined data associated with the tab.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem() CRhinoUiTabbedSheetCtrl::GetItemData() TCITEM in the Platform SDK CTabCtrl::InsertItem in the Platform SDK
◆ InsertItem() [6/6]
 int CRhinoUiTabbedSheetCtrl::InsertItem  |  ( |  UINT  |  nMask,
|  int  |  iIndex,
|  LPCTSTR  |  lpsItem,
|  int  |  iImage,
|  LPARAM  |  lParam,
|  DWORD  |  dwState,
|  DWORD  |  dwStateMask
)
Description: Inserts a new tab in an existing tab control.
Parameters: nMask [in] Specifies which TCITEM structure attributes to set. Can be zero or a combination of the following values: TCIF_TEXT The pszText member is valid. TCIF_IMAGE The iImage member is valid. TCIF_PARAM The lParam member is valid. TCIF_RTLREADING The text of pszText is displayed using right-to-left reading order on Hebrew or Arabic systems. TCIF_STATE The dwState member is valid. iIndex [in] Zero-based index of the new tab. lpsItem [in] Address of a null-terminated string that contains the text of the tab. iImage [in] The zero-based index of an image to insert from an image list. lParam [in] Application-defined data associated with the tab. dwStateMask [in] Specifies which states are to be set. For more information, see TCITEM in the Platform SDK.
Returns: Zero-based index of the new tab if successful; otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::AddItem() TCITEM in the Platform SDK CTabCtrl::InsertItem in the Platform SDK
◆ IsHorizontal()
 bool CRhinoUiTabbedSheetCtrl::IsHorizontal  |  ( |   | ) |   const
Description: Call this method to find out if the tabs are aligned horizontally on the top or bottom of the control.
Returns: Returns true if tabs are aligned at the top or bottom of the control otherwise, returns false.
See Also: CRhinoUiTabbedSheetCtrl::IsVertical() CRhinoUiTabbedSheetCtrl::Orientation() CRhinoUiTabbedSheetCtrl::orientation enum
◆ IsVertical()
 bool CRhinoUiTabbedSheetCtrl::IsVertical  |  ( |   | ) |   const
Description: Call this method to find out if the tabs are aligned vertically on the right or left side of the control.
Returns: Returns true if tabs are aligned at the right or bottom of the control otherwise, returns false.
See Also: CRhinoUiTabbedSheetCtrl::IsHorizontal() CRhinoUiTabbedSheetCtrl::Orientation() CRhinoUiTabbedSheetCtrl::orientation enum
◆ ItemIndexFromPoint()
 int CRhinoUiTabbedSheetCtrl::ItemIndexFromPoint  |  ( |  CPoint  |  pt | ) |   const
Description: Determines which tab, if any, is at the specified screen position.
Parameters: pt [in] Screen point
Returns: Returns the zero-based index of the tab or – 1 if no tab is at the specified position.
See Also: CRhinoUiTabbedSheetCtrl::ButtonFromPoint()
◆ ItemIndexIsValid()
 bool CRhinoUiTabbedSheetCtrl::ItemIndexIsValid  |  ( |  int  |  iItem | ) |   const
Description: Call this helper method to determine if a tab index value is valid.
Parameters: iItem [in] Zero-based index of the tab.
Returns: Returns true if iItem is greater than zero and less than GetItemCount()
See Also: CRhinoUiTabbedSheetCtrl::GetItemCount()
◆ KillScrollMouseHover()
 void CRhinoUiTabbedSheetCtrl::KillScrollMouseHover  |  ( |   | )
protected
Description: Call this method to kill the timer and mouse capture associated with a scroll button mouse over active.
◆ KillScrollTimer()
 void CRhinoUiTabbedSheetCtrl::KillScrollTimer  |  ( |   | )
protected
Description: Call this method to clear the scroll timer flags.
◆ KillTooltipTimer()
 void CRhinoUiTabbedSheetCtrl::KillTooltipTimer  |  ( |   | )
protected
Description: Call this method to clear the scroll button tool tip timer flags.
◆ MakeButtonDibs()
 void CRhinoUiTabbedSheetCtrl::MakeButtonDibs  |  ( |  CRect &  |  rItem,
|  int  |  cy
)
protected
Description: Call this method to make sure the scroll button rectangles and bitmap match the current tab orientation. This will only update if ResetScrollButtons() has been called first.
Parameters: rItem [in/out] Current area available to position the scroll buttons. This rect will be adjusted removing the scroll buttons and reflecting what area is left for the tabs.
See Also: CTabSheetDlgTest::ResetScrollButtons()
◆ OnCreate()
 afx_msg int CRhinoUiTabbedSheetCtrl::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnDestroy()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnDestroy  |  ( |   | )
◆ OnEndEditMessage()
 afx_msg LRESULT CRhinoUiTabbedSheetCtrl::OnEndEditMessage  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protected
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonUp()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseMove()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnNcPaint()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnNcPaint  |  ( |   | )
◆ OnPaint()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnPaint  |  ( |   | )
◆ OnRButtonDown()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnRButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnSetCursor()
 afx_msg BOOL32 CRhinoUiTabbedSheetCtrl::OnSetCursor  |  ( |  CWnd *  |  pWnd,
|  UINT  |  nHitTest,
|  UINT  |  message
)
◆ OnSize()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ OnTimer()
 afx_msg void CRhinoUiTabbedSheetCtrl::OnTimer  |  ( |  UINT_PTR  |  nIDEvent | )
◆ Orientation()
 orientation CRhinoUiTabbedSheetCtrl::Orientation  |  ( |   | ) |   const
Description: Call this method to get the current display orientation for tab control items in this control.
Returns: Returns the current display orientation for tab control items in this control. Possible values: orient_top Display tabs at top of control with pages below orient_left Display tabs on left side of control with pages to the right orient_right Display tabs on right side of control with pages to the left orient_bottom Display tabs at bottom of control with pages above
See Also: CRhinoUiTabbedSheetCtrl::SetOrientation() CRhinoUiTabbedSheetCtrl::orientation
◆ PreSubclassWindow()
 virtual void CRhinoUiTabbedSheetCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ RecalcLayout()
 void CRhinoUiTabbedSheetCtrl::RecalcLayout  |  ( |   | )
Description: Call this method to have tab display and hit test elements update. This is called when adding, deleting, hiding or scrolling.
◆ RecalcOnAddOrInsert()
 bool CRhinoUiTabbedSheetCtrl::RecalcOnAddOrInsert  |  ( |   | ) |   const
Description: Call this method to find out if layout is recalculated when calling AddItem() or InsertItem() methods. You may want to temporarily disable this if you are adding multiple items.
Returns: Returns true if tab layout will be recalculated each time AddItem() or InsertItem() methods are called otherwise; returns false.
See Also: CRhinoUiTabbedSheetCtrl::SetRecalcOnAddOrInsert() CRhinoUiTabbedSheetCtrl::RecalcLayout()
◆ Redraw()
 void CRhinoUiTabbedSheetCtrl::Redraw  |  ( |   | )
Description: Call this method to force the tab control to redraw itself.
◆ RedrawButtons()
 void CRhinoUiTabbedSheetCtrl::RedrawButtons  |  ( |   | )
protected
Description: Call this method to force scroll buttons to redraw.
◆ ReplaceDlgItem()
 bool CRhinoUiTabbedSheetCtrl::ReplaceDlgItem  |  ( |  CDialog *  |  pParent,
|  UINT  |  nID
)
Description: Replace a dialog item with this control
Parameters: pParent [in] Dialog to embed tab control inside of. nID [in] The ID of the dialog control to replace. The new tab control will be created using this ID.
Returns: Returns true if successful; otherwise false
See Also: CRhinoUiTabbedSheetCtrl::CreateTabbedSheetCtrl()
◆ ResetScrollButtons()
 void CRhinoUiTabbedSheetCtrl::ResetScrollButtons  |  ( |   | )
protected
Description: Call this methods to force RecalcLayout() to recalculate scroll button rectangles and button bitmaps.
◆ SendSelChangedMessage()
 void CRhinoUiTabbedSheetCtrl::SendSelChangedMessage  |  ( |  bool  |  bChanged,
|  int  |  iPrevious,
|  int  |  iCurrent
)
protected
Description: Call this method when the current selection has been changed to force TCN_SELCHANGE and TCN_SELCHANGING messages to be sent to this controls parent window. Also sends CRhinoUiTabbedSheetCtrl::m_sel_changed_custom_win_msg registered windows message.
Parameters: bChanged [in] If true then the current selection has been changed otherwise it is about to change.
See Also: CRhinoUiTabbedSheetCtrl::m_sel_changed_custom_win_msg
◆ SendTabbedSheetCustomMessage()
 LRESULT CRhinoUiTabbedSheetCtrl::SendTabbedSheetCustomMessage  |  ( |  bool  |  bToParent,
|  CRhinoUiTabbedSheetCtrlMsg::CUSTOMINFO &  |  info
)
protected
Description: Send specified message to the parent of this control, if the message returns zero then send the message to this window also. The message will only be sent to the parent if bToParent is true.
Parameters: bToParent [in] If bToParent is true then message is sent to the parent window. If the parent window returns non-zero then nothing else happens. If the parent window returns zero then the message is also sent to this control. If bToParent is false then the message is sent directly to this control. info [in/out] Message ID and parameters to send to window(s)
Returns: Returns value received by CWnd::SendMessage().
See Also: CWnd::SendMessage() class CRhinoUiTabbedSheetCtrlMsg CRhinoUiTabbedSheetCtrlMsg::InitCustomInfo()
◆ SetControlColors()
 bool CRhinoUiTabbedSheetCtrl::SetControlColors  |  ( |  COLORREF  |  crActiveTab = ON_UNSET_COLOR,
|  COLORREF  |  crActiveText = ON_UNSET_COLOR,
|  COLORREF  |  crNormalTab = ON_UNSET_COLOR,
|  COLORREF  |  crNormalText = ON_UNSET_COLOR
)
Description: By default active tabs are drawing using ::GetSysColor( COLOR_WINDOW) and inactive tabs are drawn using ::GetSysColor( COLOR_BTNFACE). You may override this behavior by setting a color to a value other than ON_UNSET_COLOR. Calling this method without any arguments will reset the colors to there default values.
Parameters: crActiveTab [in] Color to use when drawing the active tab background. crActiveText [in] Color to use when drawing the active tab caption text. crNormalTab [in] Color to use when drawing an inactive tab background. crNormalText [in] Color to use when drawing an inactive tab caption text.
Returns: Returns true if colors are changed.
See Also: CRhinoUiTabbedSheetCtrl::GetControlColors()
◆ SetCurSel()
 int CRhinoUiTabbedSheetCtrl::SetCurSel  |  ( |  int  |  iItem | )
Description: Selects a tab in a tab control.
Parameters: iItem [in] The zero-based index of the item to be selected.
Returns: Zero-based index of the previously selected tab if successful, otherwise – 1.
See Also: CRhinoUiTabbedSheetCtrl::GetCurSel() CRhinoUiTabbedSheetCtrl::GetCurItem()
◆ SetEditLabelOnDoubleClick()
 bool CRhinoUiTabbedSheetCtrl::SetEditLabelOnDoubleClick  |  ( |  bool  |  b | )
Description: Call this method to enable or disable tab label name in-place editing when a tab label is double clicked.
Parameters: b [in] If this is true then labels will in-place edit when double clicked if CRhinoUiTabbedSheetCtrlMsg::mid_begin_label_edit message returns 1.
Returns: Returns previous state.
See Also: CRhinoUiTabbedSheetCtrl::SetEditLabelOnDoubleClick() CRhinoUiTabbedSheetCtrl::EditLabel() CRhinoUiTabbedSheetCtrlMsg::mid_begin_label_edit CRhinoUiTabbedSheetCtrlMsg::mid_end_label_edit
◆ SetIncludeAddButton()
 void CRhinoUiTabbedSheetCtrl::SetIncludeAddButton  |  ( |  bool  |  b | )
Description: Call this method to cause the add tab button (the "+" after the last tab) to be added to the control. This method will only work if called after the control has been created, the default value is false.
Parameters: b [in] If this is true then the add button is visible otherwise; the add button is not visible
See Also: CRhinoUiTabbedSheetCtrl::IncludeAddButton()
◆ SetIncludeFirstAndLastButtons()
 bool CRhinoUiTabbedSheetCtrl::SetIncludeFirstAndLastButtons  |  ( |  bool  |  b | )
Description: Call this method to enable or disable the display of the "First" and "Last" scroll buttons. The "First" button will make sure the first visible tab control item is displayed, the "Last" button will make sure the last visible tab control item is displayed.
Parameters: b [in] If this is true then the first and last buttons will be displayed otherwise they will not.
Returns: Returns previous state.
See Also: CRhinoUiTabbedSheetCtrl::IncludeFirstAndLastButtons()
◆ SetIncludeNextAndPreviousButtons()
 bool CRhinoUiTabbedSheetCtrl::SetIncludeNextAndPreviousButtons  |  ( |  bool  |  b | )
Description: Call this method to enable display of the "Previous" and "Next" scroll buttons. The "Previous" button will make sure the item, prior to the current first visible item, is displayed, the "Next" button will make sure the item after the last displayed is visible.
Parameters: b [in] If true then the "Next" and "Previous" buttons will be displayed otherwise they will not.
Returns: Returns previous state.
See Also: CRhinoUiTabbedSheetCtrl::SetIncludeFirstAndLastButtons()
◆ SetItem() [1/2]
 bool CRhinoUiTabbedSheetCtrl::SetItem  |  ( |  int  |  iItem,
|  const CRhinoUiTabbedSheetCtrlItem &  |  item
)
Description: Changes an items properties including display window and tab label.
Parameters: iItem [in] The zero-based index number of the item for which to retrieve state information. item [in] Reference to a CRhinoUiTabbedSheetCtrlItem object that specifies the new attributes for the tab. Returns: Returns true if item attributes have been successfully updated.
See Also: class CRhinoUiTabbedSheetCtrlItem
◆ SetItem() [2/2]
 bool CRhinoUiTabbedSheetCtrl::SetItem  |  ( |  int  |  iItem,
|  TCITEM *  |  pTabCtrlItem
)
Description: Sets some or all of a tab's attributes.
Parameters: iItem [in] Zero-based index of the tab. pTabCtrlItem [in] Pointer to a TCITEM structure that contains the new item attributes. The mask member specifies which attributes to set. If the mask member specifies the TCIF_TEXT value, the pszText member is the address of a null-terminated string and the cchTextMax member is ignored. Returns: Return true if successful; otherwise false.
See Also: CTabCtrl::GetItem in the Platform SDK
◆ SetItemData()
 int CRhinoUiTabbedSheetCtrl::SetItemData  |  ( |  int  |  iItem,
|  DWORD_PTR  |  dwItemData
)
Description: This method sets the application-specific value associated with the item specified by iItem.
Parameters: iItem [in] Zero-based index of the tab. dwItemData [in] Specifies a application-specific value to be associated with this item.
See Also: CRhinoUiTabbedSheetCtrlItem::GetData() CRhinoUiTabbedSheetCtrlItem::SetData() CRhinoUiTabbedSheetCtrlItem::GetDataPtr() CRhinoUiTabbedSheetCtrlItem::SetDataPtr()
◆ SetItemDataPtr()
 int CRhinoUiTabbedSheetCtrl::SetItemDataPtr  |  ( |  int  |  iItem,
|  void *  |  pData
)
Description: This method sets the application-specific value associated with the item specified by iItem.
Parameters: iItem [in] Zero-based index of the tab.
Parameters: pData [in] Specifies a application-specific value to be associated iItem.
See Also: CRhinoUiTabbedSheetCtrl::SetDataPtr() CRhinoUiTabbedSheetCtrlItem::SetData() CRhinoUiTabbedSheetCtrlItem::GetData() CRhinoUiTabbedSheetCtrlItem::SetData() CRhinoUiTabbedSheetCtrlItem::GetDataPtr()
◆ SetOrientation()
 orientation CRhinoUiTabbedSheetCtrl::SetOrientation  |  ( |  orientation  |  orient | )
Description: Set the display orientation for tab control items in this control.
Parameters: orient [in] Display orientation for tab control items in this control. Possible values: orient_top Display tabs at top of control with pages below orient_left Display tabs on left side of control with pages to the right orient_right Display tabs on right side of control with pages to the left orient_bottom Display tabs at bottom of control with pages above
Returns: Returns previous orientation
See Also: CRhinoUiTabbedSheetCtrl::Orientation() CRhinoUiTabbedSheetCtrl::orientation
◆ SetRecalcOnAddOrInsert()
 bool CRhinoUiTabbedSheetCtrl::SetRecalcOnAddOrInsert  |  ( |  bool  |  b | )
Description: Call this method to control whether or not AddItem() and InsertItem() methods will call RecalcLayout() after adding a new tab to the control. You may want to temporarily disable this functionality when adding many items to a control. If you disable this functionality you are responsible for calling RecalcLayout() to get new tabs to appear.
Parameters: b [in] If true then RecalcLayout() is not called when adding new items otherwise it is.
Returns: Previous value.
See Also: CRhinoUiTabbedSheetCtrl::RecalcLayout()
◆ ShowDragWindow()
 bool CRhinoUiTabbedSheetCtrl::ShowDragWindow  |  ( |  int  |  iItem,
|  bool  |  bShow,
|  CPoint  |  point
)
protected
Friends And Related Function Documentation
◆ CRhinoUiTabbedSheetCtrlGDI
 friend class CRhinoUiTabbedSheetCtrlGDI
friend
Member Data Documentation
◆ m_bEditLabelOnDoubleClick
 bool CRhinoUiTabbedSheetCtrl::m_bEditLabelOnDoubleClick
protected
◆ m_bIncludeFirstAndLastButtons
 bool CRhinoUiTabbedSheetCtrl::m_bIncludeFirstAndLastButtons
protected
◆ m_bIncludeNextAndPreviousButtons
 bool CRhinoUiTabbedSheetCtrl::m_bIncludeNextAndPreviousButtons
protected
◆ m_bRecalcOnAddOrInsert
 bool CRhinoUiTabbedSheetCtrl::m_bRecalcOnAddOrInsert
protected
◆ m_button_dib
 CRhinoDib CRhinoUiTabbedSheetCtrl::m_button_dib
protected
◆ m_button_dib_disabled
 CRhinoDib CRhinoUiTabbedSheetCtrl::m_button_dib_disabled
protected
◆ m_crActiveTab
 COLORREF CRhinoUiTabbedSheetCtrl::m_crActiveTab
protected
◆ m_crActiveText
 COLORREF CRhinoUiTabbedSheetCtrl::m_crActiveText
protected
◆ m_crMask
 COLORREF CRhinoUiTabbedSheetCtrl::m_crMask
staticprotected
◆ m_crNormalTab
 COLORREF CRhinoUiTabbedSheetCtrl::m_crNormalTab
protected
◆ m_crNormalText
 COLORREF CRhinoUiTabbedSheetCtrl::m_crNormalText
protected
◆ m_drag_dib
 CRhinoDib CRhinoUiTabbedSheetCtrl::m_drag_dib
staticprotected
◆ m_drag_window
 CRhinoUiDragBitmapWnd* CRhinoUiTabbedSheetCtrl::m_drag_window
protected
◆ m_gdi
 CRhinoUiTabbedSheetCtrlGDI* CRhinoUiTabbedSheetCtrl::m_gdi
protected
◆ m_hot_scroll_button
 scroll_button CRhinoUiTabbedSheetCtrl::m_hot_scroll_button
protected
◆ m_iCurSel
 int CRhinoUiTabbedSheetCtrl::m_iCurSel
protected
◆ m_iEdit
 int CRhinoUiTabbedSheetCtrl::m_iEdit
protected
◆ m_iFirstVisible
 int CRhinoUiTabbedSheetCtrl::m_iFirstVisible
protected
◆ m_iFirstVisibleIndex
 int CRhinoUiTabbedSheetCtrl::m_iFirstVisibleIndex
protected
◆ m_iLastVisible
 int CRhinoUiTabbedSheetCtrl::m_iLastVisible
protected
◆ m_iLastVisibleIndex
 int CRhinoUiTabbedSheetCtrl::m_iLastVisibleIndex
protected
◆ m_internal_tabbed_sheet_ctrl
 class CInternalRhUiTabbedSheetCtrl* CRhinoUiTabbedSheetCtrl::m_internal_tabbed_sheet_ctrl = nullptr
◆ m_item_list
 ON_SimpleArray<CRhinoUiTabbedSheetCtrlItem*> CRhinoUiTabbedSheetCtrl::m_item_list
protected
◆ m_iVisible
 int CRhinoUiTabbedSheetCtrl::m_iVisible
protected
◆ m_lmouse_down_pt
 CPoint CRhinoUiTabbedSheetCtrl::m_lmouse_down_pt
protected
◆ m_mouse_capture
 mouse_capture CRhinoUiTabbedSheetCtrl::m_mouse_capture
protected
◆ m_mouse_down_on_scroll_button
 scroll_button CRhinoUiTabbedSheetCtrl::m_mouse_down_on_scroll_button
protected
◆ m_orientation
 orientation CRhinoUiTabbedSheetCtrl::m_orientation
protected
◆ m_pEdit
 class CRhinoUiInPlaceEdit* CRhinoUiTabbedSheetCtrl::m_pEdit
protected
◆ m_pressed_scroll_button
 scroll_button CRhinoUiTabbedSheetCtrl::m_pressed_scroll_button
protected
◆ m_rButtons
 CRect CRhinoUiTabbedSheetCtrl::m_rButtons
protected
◆ m_rCtrlClient
 CRect CRhinoUiTabbedSheetCtrl::m_rCtrlClient
protected
◆ m_rFirst
 CRect CRhinoUiTabbedSheetCtrl::m_rFirst
protected
◆ m_rLast
 CRect CRhinoUiTabbedSheetCtrl::m_rLast
protected
◆ m_rNext
 CRect CRhinoUiTabbedSheetCtrl::m_rNext
protected
◆ m_rPage
 CRect CRhinoUiTabbedSheetCtrl::m_rPage
protected
◆ m_rPageBorders
 CRect CRhinoUiTabbedSheetCtrl::m_rPageBorders
protected
◆ m_rPrev
 CRect CRhinoUiTabbedSheetCtrl::m_rPrev
protected
◆ m_rTabs
 CRect CRhinoUiTabbedSheetCtrl::m_rTabs
protected
◆ m_scroll_timer_button
 scroll_button CRhinoUiTabbedSheetCtrl::m_scroll_timer_button
protected