Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoGetPolygon Class Reference
RhinoGet
SDK header stuff. More...
#include <rhinoSdkGetPolygon.h>
 Inheritance diagram for CArgsRhinoGetPolygon:
 Public Member Functions
CArgsRhinoGetPolygon ()
CArgsRhinoGetPolygon (const CArgsRhinoGetPolygon &)
~CArgsRhinoGetPolygon ()
const BOOL32  | AroundCurve () const
const ON_Circle &  | Circle () const
const ON_wString &  | CircumscribedAroundCurveCenterPrompt () const
const ON_wString &  | CircumscribedCenterPrompt () const
const ON_wString &  | CornerPrompt () const
const ON_Curve *  | Curve () const
const ON_wString &  | EdgeEndPrompt () const
const ON_wString &  | EdgeMidpointPrompt () const
const BOOL32  | EdgeMode () const
const ON_wString &  | EdgeStartPrompt () const
void  | EnablePyramidOption (bool=true)
void  | EnableVerticalPolygonOption (bool=true)
const ON_3dPoint &  | FirstPoint () const
const BOOL32  | Flip () const
unsigned int  | GetCap () const
const BOOL32  | GettingStarModePolygon () const
const BOOL32  | Inscribed () const
const ON_wString &  | InscribedAroundCurveCenterPrompt () const
const ON_wString &  | InscribedCenterPrompt () const
gets More...
const ON_3dVector &  | Normal () const
int  | NumSides () const
CArgsRhinoGetPolygon &  | operator= (const CArgsRhinoGetPolygon &)
const int  | PyramidConstraint () const
const bool  | PyramidOptionAvailable () const
const ON_3dPoint &  | SecondPoint () const
void  | SetAroundCurve (BOOL32)
void  | SetCap (unsigned int)
void  | SetCircle (const ON_Circle &)
void  | SetCircumscribedAroundCurveCenterPrompt (const wchar_t *)
void  | SetCircumscribedCenterPrompt (const wchar_t *)
void  | SetCornerPrompt (const wchar_t *)
void  | SetCurve (const ON_Curve *)
void  | SetEdgeEndPrompt (const wchar_t *)
void  | SetEdgeMidpointPrompt (const wchar_t *)
void  | SetEdgeMode (BOOL32)
void  | SetEdgeStartPrompt (const wchar_t *)
void  | SetFirstPoint (const ON_3dPoint &)
void  | SetFlip (BOOL32)
void  | SetGettingStarModePolygon (BOOL32)
void  | SetInscribed (BOOL32)
void  | SetInscribedAroundCurveCenterPrompt (const wchar_t *)
void  | SetInscribedCenterPrompt (const wchar_t *)
sets More...
void  | SetNormal (const ON_3dVector &)
void  | SetNumSides (int)
void  | SetPyramidConstraint (int)
void  | SetSecondPoint (const ON_3dPoint &)
void  | SetStarAroundCurveCenterPrompt (const wchar_t *)
void  | SetStarCenterPrompt (const wchar_t *)
void  | SetStarEndPrompt (const wchar_t *)
void  | SetStarMode (BOOL32)
void  | SetStarSecondRadius (double)
void  | SetStarSecondRadiusPrompt (const wchar_t *)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetUseFirstPoint (BOOL32)
void  | SetUseNormal (BOOL32)
void  | SetUseStarSecondRadius (BOOL32)
void  | SetVertical (BOOL32)
const ON_wString &  | StarAroundCurveCenterPrompt () const
const ON_wString &  | StarCenterPrompt () const
const ON_wString &  | StarEndPrompt () const
const BOOL32  | StarMode () const
double  | StarSecondRadius () const
const ON_wString &  | StarSecondRadiusPrompt () const
bool  | UseActiveLayerLinetype () const
const BOOL32  | UseFirstPoint () const
const BOOL32  | UseNormal () const
const BOOL32  | UseStarSecondRadius () const
const BOOL32  | Vertical () const
const bool  | VerticalPolygonOptionAvailable () const
 Public Attributes
int  | m_NumSides
variables More...
 Protected Attributes
BOOL32  | m_AroundCurve
BOOL32  | m_bGettingStarModePolygon
bool  | m_bPyramidAvailable
int  | m_bPyramidConstraint
0 = None, 1 = Vertical, 2 = AroundCurve More...
bool  | m_bVerticalPolygonAvailable
ON_Circle  | m_Circle
ON_wString  | m_CircumscribedAroundCurveCenterPrompt
ON_wString  | m_CircumscribedCenterPrompt
ON_wString  | m_CornerPrompt
const ON_Curve *  | m_Curve
ON_wString  | m_EdgeEndPrompt
ON_wString  | m_EdgeMidpointPrompt
BOOL32  | m_EdgeMode
true=polygon by edge More...
ON_wString  | m_EdgeStartPrompt
ON_3dPoint  | m_FirstPoint
BOOL32  | m_Flip
BOOL32  | m_Inscribed
true=inscribed, false=circumscribed More...
ON_wString  | m_InscribedAroundCurveCenterPrompt
ON_wString  | m_InscribedCenterPrompt
ON_3dVector  | m_Normal
ON_3dPoint  | m_SecondPoint
ON_wString  | m_StarAroundCurveCenterPrompt
ON_wString  | m_StarCenterPrompt
ON_wString  | m_StarEndPrompt
BOOL32  | m_StarMode
true=star More...
double  | m_StarSecondRadius
ON_wString  | m_StarSecondRadiusPrompt
BOOL32  | m_UseFirstPoint
BOOL32  | m_UseNormal
BOOL32  | m_UseStarSecondRadius
BOOL32  | m_Vertical
Detailed Description
SDK header stuff.
 CLASS CArgsRhinoGetPolygon
OVERVIEW TEXT Arguments for RhinoGetPolygon... functions
KEYWORDS
Polygon RhinoGetPolygon GetPolygon
Constructor & Destructor Documentation
◆ CArgsRhinoGetPolygon() [1/2]
 CArgsRhinoGetPolygon::CArgsRhinoGetPolygon  |  ( |   | )
◆ ~CArgsRhinoGetPolygon()
 CArgsRhinoGetPolygon::~CArgsRhinoGetPolygon  |  ( |   | )
◆ CArgsRhinoGetPolygon() [2/2]
 CArgsRhinoGetPolygon::CArgsRhinoGetPolygon  |  ( |  const CArgsRhinoGetPolygon &  |   | )
Member Function Documentation
◆ AroundCurve()
 const BOOL32 CArgsRhinoGetPolygon::AroundCurve  |  ( |   | ) |   const
◆ Circle()
 const ON_Circle& CArgsRhinoGetPolygon::Circle  |  ( |   | ) |   const
◆ CircumscribedAroundCurveCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::CircumscribedAroundCurveCenterPrompt  |  ( |   | ) |   const
◆ CircumscribedCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::CircumscribedCenterPrompt  |  ( |   | ) |   const
◆ CornerPrompt()
 const ON_wString& CArgsRhinoGetPolygon::CornerPrompt  |  ( |   | ) |   const
◆ Curve()
 const ON_Curve* CArgsRhinoGetPolygon::Curve  |  ( |   | ) |   const
◆ EdgeEndPrompt()
 const ON_wString& CArgsRhinoGetPolygon::EdgeEndPrompt  |  ( |   | ) |   const
◆ EdgeMidpointPrompt()
 const ON_wString& CArgsRhinoGetPolygon::EdgeMidpointPrompt  |  ( |   | ) |   const
◆ EdgeMode()
 const BOOL32 CArgsRhinoGetPolygon::EdgeMode  |  ( |   | ) |   const
◆ EdgeStartPrompt()
 const ON_wString& CArgsRhinoGetPolygon::EdgeStartPrompt  |  ( |   | ) |   const
◆ EnablePyramidOption()
 void CArgsRhinoGetPolygon::EnablePyramidOption  |  ( |  bool  |   = true | )
◆ EnableVerticalPolygonOption()
 void CArgsRhinoGetPolygon::EnableVerticalPolygonOption  |  ( |  bool  |   = true | )
◆ FirstPoint()
 const ON_3dPoint& CArgsRhinoGetPolygon::FirstPoint  |  ( |   | ) |   const
◆ Flip()
 const BOOL32 CArgsRhinoGetPolygon::Flip  |  ( |   | ) |   const
◆ GetCap()
 unsigned int CArgsRhinoGetPolygon::GetCap  |  ( |   | ) |   const
◆ GettingStarModePolygon()
 const BOOL32 CArgsRhinoGetPolygon::GettingStarModePolygon  |  ( |   | ) |   const
◆ Inscribed()
 const BOOL32 CArgsRhinoGetPolygon::Inscribed  |  ( |   | ) |   const
◆ InscribedAroundCurveCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::InscribedAroundCurveCenterPrompt  |  ( |   | ) |   const
◆ InscribedCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::InscribedCenterPrompt  |  ( |   | ) |   const
gets
◆ Normal()
 const ON_3dVector& CArgsRhinoGetPolygon::Normal  |  ( |   | ) |   const
◆ NumSides()
 int CArgsRhinoGetPolygon::NumSides  |  ( |   | ) |   const
◆ operator=()
 CArgsRhinoGetPolygon& CArgsRhinoGetPolygon::operator=  |  ( |  const CArgsRhinoGetPolygon &  |   | )
◆ PyramidConstraint()
 const int CArgsRhinoGetPolygon::PyramidConstraint  |  ( |   | ) |   const
◆ PyramidOptionAvailable()
 const bool CArgsRhinoGetPolygon::PyramidOptionAvailable  |  ( |   | ) |   const
◆ SecondPoint()
 const ON_3dPoint& CArgsRhinoGetPolygon::SecondPoint  |  ( |   | ) |   const
◆ SetAroundCurve()
 void CArgsRhinoGetPolygon::SetAroundCurve  |  ( |  BOOL32  |   | )
◆ SetCap()
 void CArgsRhinoGetPolygon::SetCap  |  ( |  unsigned int  |   | )
◆ SetCircle()
 void CArgsRhinoGetPolygon::SetCircle  |  ( |  const ON_Circle &  |   | )
◆ SetCircumscribedAroundCurveCenterPrompt()
 void CArgsRhinoGetPolygon::SetCircumscribedAroundCurveCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetCircumscribedCenterPrompt()
 void CArgsRhinoGetPolygon::SetCircumscribedCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetCornerPrompt()
 void CArgsRhinoGetPolygon::SetCornerPrompt  |  ( |  const wchar_t *  |   | )
◆ SetCurve()
 void CArgsRhinoGetPolygon::SetCurve  |  ( |  const ON_Curve *  |   | )
◆ SetEdgeEndPrompt()
 void CArgsRhinoGetPolygon::SetEdgeEndPrompt  |  ( |  const wchar_t *  |   | )
◆ SetEdgeMidpointPrompt()
 void CArgsRhinoGetPolygon::SetEdgeMidpointPrompt  |  ( |  const wchar_t *  |   | )
◆ SetEdgeMode()
 void CArgsRhinoGetPolygon::SetEdgeMode  |  ( |  BOOL32  |   | )
◆ SetEdgeStartPrompt()
 void CArgsRhinoGetPolygon::SetEdgeStartPrompt  |  ( |  const wchar_t *  |   | )
◆ SetFirstPoint()
 void CArgsRhinoGetPolygon::SetFirstPoint  |  ( |  const ON_3dPoint &  |   | )
◆ SetFlip()
 void CArgsRhinoGetPolygon::SetFlip  |  ( |  BOOL32  |   | )
◆ SetGettingStarModePolygon()
 void CArgsRhinoGetPolygon::SetGettingStarModePolygon  |  ( |  BOOL32  |   | )
◆ SetInscribed()
 void CArgsRhinoGetPolygon::SetInscribed  |  ( |  BOOL32  |   | )
◆ SetInscribedAroundCurveCenterPrompt()
 void CArgsRhinoGetPolygon::SetInscribedAroundCurveCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetInscribedCenterPrompt()
 void CArgsRhinoGetPolygon::SetInscribedCenterPrompt  |  ( |  const wchar_t *  |   | )
sets
◆ SetNormal()
 void CArgsRhinoGetPolygon::SetNormal  |  ( |  const ON_3dVector &  |   | )
◆ SetNumSides()
 void CArgsRhinoGetPolygon::SetNumSides  |  ( |  int  |   | )
◆ SetPyramidConstraint()
 void CArgsRhinoGetPolygon::SetPyramidConstraint  |  ( |  int  |   | )
◆ SetSecondPoint()
 void CArgsRhinoGetPolygon::SetSecondPoint  |  ( |  const ON_3dPoint &  |   | )
◆ SetStarAroundCurveCenterPrompt()
 void CArgsRhinoGetPolygon::SetStarAroundCurveCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetStarCenterPrompt()
 void CArgsRhinoGetPolygon::SetStarCenterPrompt  |  ( |  const wchar_t *  |   | )
◆ SetStarEndPrompt()
 void CArgsRhinoGetPolygon::SetStarEndPrompt  |  ( |  const wchar_t *  |   | )
◆ SetStarMode()
 void CArgsRhinoGetPolygon::SetStarMode  |  ( |  BOOL32  |   | )
◆ SetStarSecondRadius()
 void CArgsRhinoGetPolygon::SetStarSecondRadius  |  ( |  double  |   | )
◆ SetStarSecondRadiusPrompt()
 void CArgsRhinoGetPolygon::SetStarSecondRadiusPrompt  |  ( |  const wchar_t *  |   | )
◆ SetUseActiveLayerLinetype()
 void CArgsRhinoGetPolygon::SetUseActiveLayerLinetype  |  ( |  bool  |  on | )
When true the linetype of the active layer is used for dynamic drawing.
◆ SetUseFirstPoint()
 void CArgsRhinoGetPolygon::SetUseFirstPoint  |  ( |  BOOL32  |   | )
◆ SetUseNormal()
 void CArgsRhinoGetPolygon::SetUseNormal  |  ( |  BOOL32  |   | )
◆ SetUseStarSecondRadius()
 void CArgsRhinoGetPolygon::SetUseStarSecondRadius  |  ( |  BOOL32  |   | )
◆ SetVertical()
 void CArgsRhinoGetPolygon::SetVertical  |  ( |  BOOL32  |   | )
◆ StarAroundCurveCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::StarAroundCurveCenterPrompt  |  ( |   | ) |   const
◆ StarCenterPrompt()
 const ON_wString& CArgsRhinoGetPolygon::StarCenterPrompt  |  ( |   | ) |   const
◆ StarEndPrompt()
 const ON_wString& CArgsRhinoGetPolygon::StarEndPrompt  |  ( |   | ) |   const
◆ StarMode()
 const BOOL32 CArgsRhinoGetPolygon::StarMode  |  ( |   | ) |   const
◆ StarSecondRadius()
 double CArgsRhinoGetPolygon::StarSecondRadius  |  ( |   | ) |   const
◆ StarSecondRadiusPrompt()
 const ON_wString& CArgsRhinoGetPolygon::StarSecondRadiusPrompt  |  ( |   | ) |   const
◆ UseActiveLayerLinetype()
 bool CArgsRhinoGetPolygon::UseActiveLayerLinetype  |  ( |   | ) |   const
◆ UseFirstPoint()
 const BOOL32 CArgsRhinoGetPolygon::UseFirstPoint  |  ( |   | ) |   const
◆ UseNormal()
 const BOOL32 CArgsRhinoGetPolygon::UseNormal  |  ( |   | ) |   const
◆ UseStarSecondRadius()
 const BOOL32 CArgsRhinoGetPolygon::UseStarSecondRadius  |  ( |   | ) |   const
◆ Vertical()
 const BOOL32 CArgsRhinoGetPolygon::Vertical  |  ( |   | ) |   const
◆ VerticalPolygonOptionAvailable()
 const bool CArgsRhinoGetPolygon::VerticalPolygonOptionAvailable  |  ( |   | ) |   const
Member Data Documentation
◆ m_AroundCurve
 BOOL32 CArgsRhinoGetPolygon::m_AroundCurve
protected
◆ m_bGettingStarModePolygon
 BOOL32 CArgsRhinoGetPolygon::m_bGettingStarModePolygon
protected
◆ m_bPyramidAvailable
 bool CArgsRhinoGetPolygon::m_bPyramidAvailable
protected
◆ m_bPyramidConstraint
 int CArgsRhinoGetPolygon::m_bPyramidConstraint
protected
0 = None, 1 = Vertical, 2 = AroundCurve
◆ m_bVerticalPolygonAvailable
 bool CArgsRhinoGetPolygon::m_bVerticalPolygonAvailable
protected
◆ m_Circle
 ON_Circle CArgsRhinoGetPolygon::m_Circle
protected
◆ m_CircumscribedAroundCurveCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_CircumscribedAroundCurveCenterPrompt
protected
◆ m_CircumscribedCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_CircumscribedCenterPrompt
protected
◆ m_CornerPrompt
 ON_wString CArgsRhinoGetPolygon::m_CornerPrompt
protected
◆ m_Curve
 const ON_Curve* CArgsRhinoGetPolygon::m_Curve
protected
◆ m_EdgeEndPrompt
 ON_wString CArgsRhinoGetPolygon::m_EdgeEndPrompt
protected
◆ m_EdgeMidpointPrompt
 ON_wString CArgsRhinoGetPolygon::m_EdgeMidpointPrompt
protected
◆ m_EdgeMode
 BOOL32 CArgsRhinoGetPolygon::m_EdgeMode
protected
true=polygon by edge
◆ m_EdgeStartPrompt
 ON_wString CArgsRhinoGetPolygon::m_EdgeStartPrompt
protected
◆ m_FirstPoint
 ON_3dPoint CArgsRhinoGetPolygon::m_FirstPoint
protected
◆ m_Flip
 BOOL32 CArgsRhinoGetPolygon::m_Flip
protected
◆ m_Inscribed
 BOOL32 CArgsRhinoGetPolygon::m_Inscribed
protected
true=inscribed, false=circumscribed
◆ m_InscribedAroundCurveCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_InscribedAroundCurveCenterPrompt
protected
◆ m_InscribedCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_InscribedCenterPrompt
protected
◆ m_Normal
 ON_3dVector CArgsRhinoGetPolygon::m_Normal
protected
◆ m_NumSides
 int CArgsRhinoGetPolygon::m_NumSides
variables
◆ m_SecondPoint
 ON_3dPoint CArgsRhinoGetPolygon::m_SecondPoint
protected
◆ m_StarAroundCurveCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_StarAroundCurveCenterPrompt
protected
◆ m_StarCenterPrompt
 ON_wString CArgsRhinoGetPolygon::m_StarCenterPrompt
protected
◆ m_StarEndPrompt
 ON_wString CArgsRhinoGetPolygon::m_StarEndPrompt
protected
◆ m_StarMode
 BOOL32 CArgsRhinoGetPolygon::m_StarMode
protected
true=star
◆ m_StarSecondRadius
 double CArgsRhinoGetPolygon::m_StarSecondRadius
protected
◆ m_StarSecondRadiusPrompt
 ON_wString CArgsRhinoGetPolygon::m_StarSecondRadiusPrompt
protected
◆ m_UseFirstPoint
 BOOL32 CArgsRhinoGetPolygon::m_UseFirstPoint
protected
◆ m_UseNormal
 BOOL32 CArgsRhinoGetPolygon::m_UseNormal
protected
◆ m_UseStarSecondRadius
 BOOL32 CArgsRhinoGetPolygon::m_UseStarSecondRadius
protected
◆ m_Vertical
 BOOL32 CArgsRhinoGetPolygon::m_Vertical
protected