Public Types | Public Member Functions | Static Public Member Functions | Public Attributes | Friends | List of all members
CRhinoDimStyle Class Reference
Rhino
CRhinoDimStyle class. More...
#include <rhinoSdkDimStyle.h>
 Inheritance diagram for CRhinoDimStyle:
 Public Types
enum  | { min_precision = 0, max_precision = 7 }
 Public Types inherited from ON_DimStyle
enum  | : unsigned int { FieldCount = (unsigned int)field::Count }
enum  | angle_format : unsigned char { angle_format::DecimalDegrees = 0, angle_format::DegMinSec = 1, angle_format::Radians = 2, angle_format::Grads = 3 }
Display format for angles More...
enum  | arrow_fit : unsigned char { arrow_fit::Auto = 0, arrow_fit::ArrowsInside = 1, arrow_fit::ArrowsOutside = 2 }
Arrow display position inside or outside extension lines More...
enum  | centermark_style : unsigned char { centermark_style::None = 0, centermark_style::Mark = 1, centermark_style::MarkAndLines = 2 }
Style for drawing centermark for Radial dimensions and Centermark objects More...
enum  | ContentAngleStyle : unsigned char { ContentAngleStyle::Horizontal = 0, ContentAngleStyle::Aligned = 1, ContentAngleStyle::Rotated = 2 }
Angle for text or other leader or dimension content More...
enum  | field : unsigned int {
 field::Unset = 0, field::Name = 1, field::Index = 2, field::ExtensionLineExtension = 3,
 field::ExtensionLineOffset = 4, field::Arrowsize = 5, field::LeaderArrowsize = 6, field::Centermark = 7,
 field::TextGap = 8, field::TextHeight = 9, field::DimTextLocation = 10, field::MaskFrameType = 11,
 field::LengthResolution = 12, field::AngleFormat = 13, field::AngleResolution = 14, field::Font = 15,
 field::LengthFactor = 16, field::Alternate = 17, field::AlternateLengthFactor = 18, field::AlternateLengthResolution = 20,
 field::Prefix = 21, field::Suffix = 22, field::AlternatePrefix = 23, field::AlternateSuffix = 24,
 field::DimensionLineExtension = 25, field::SuppressExtension1 = 26, field::SuppressExtension2 = 27, field::ExtLineColorSource = 28,
 field::DimLineColorSource = 29, field::ArrowColorSource = 30, field::TextColorSource = 31, field::ExtLineColor = 32,
 field::DimLineColor = 33, field::ArrowColor = 34, field::TextColor = 35, field::ExtLinePlotColorSource = 36,
 field::DimLinePlotColorSource = 37, field::ArrowPlotColorSource = 38, field::TextPlotColorSource = 39, field::ExtLinePlotColor = 40,
 field::DimLinePlotColor = 41, field::ArrowPlotColor = 42, field::TextPlotColor = 43, field::ExtLinePlotWeightSource = 44,
 field::DimLinePlotWeightSource = 45, field::ExtLinePlotWeight_mm = 46, field::DimLinePlotWeight_mm = 47, field::ToleranceFormat = 48,
 field::ToleranceResolution = 49, field::ToleranceUpperValue = 50, field::ToleranceLowerValue = 51, field::AltToleranceResolution = 52,
 field::ToleranceHeightScale = 53, field::BaselineSpacing = 54, field::DrawMask = 55, field::MaskColorSource = 56,
 field::MaskColor = 57, field::MaskBorder = 58, field::DimensionScale = 59, field::DimscaleSource = 60,
 field::FixedExtensionLength = 61, field::FixedExtensionOn = 62, field::TextRotation = 63, field::SuppressArrow1 = 64,
 field::SuppressArrow2 = 65, field::TextmoveLeader = 66, field::ArclengthSymbol = 67, field::StackTextheightScale = 68,
 field::StackFormat = 69, field::AltRound = 70, field::Round = 71, field::AngularRound = 72,
 field::AltZeroSuppress = 73, field::AngleZeroSuppress = 75, field::ZeroSuppress = 76, field::AltBelow = 77,
 field::ArrowType1 = 78, field::ArrowType2 = 79, field::LeaderArrowType = 80, field::ArrowBlockId1 = 81,
 field::ArrowBlockId2 = 82, field::LeaderArrowBlock = 83, field::DimRadialTextLocation = 84, field::TextVerticalAlignment = 85,
 field::LeaderTextVerticalAlignment = 86, field::LeaderContentAngleStyle = 87, field::LeaderCurveType = 88, field::LeaderContentAngle = 89,
 field::LeaderHasLanding = 90, field::LeaderLandingLength = 91, field::MaskFlags = 92, field::CentermarkStyle = 93,
 field::TextHorizontalAlignment = 94, field::LeaderTextHorizontalAlignment = 95, field::DrawForward = 96, field::SignedOrdinate = 97,
 field::UnitSystem = 98, field::TextMask = 99, field::TextOrientation = 100, field::LeaderTextOrientation = 101,
 field::DimTextOrientation = 102, field::DimRadialTextOrientation = 103, field::DimTextAngleStyle = 104, field::DimRadialTextAngleStyle = 105,
 field::TextUnderlined = 106, field::DimensionLengthDisplay = 109, field::AlternateDimensionLengthDisplay = 110, field::ForceDimLine = 111,
 field::ArrowFit = 112, field::TextFit = 113, field::DecimalSeparator = 114, field::Kerning = 115,
 field::LineSpaceScale = 116, field::ClippingArrowType1 = 117, field::ClippingArrowType2 = 118, field::ClippingArrowSize = 119,
 field::SuppressDimLine1 = 120, field::SuppressDimLine2 = 121, field::Count = 122
 }
Field identifiers used for file i/o and getting/setting values More...
enum  | leader_curve_type : unsigned char { leader_curve_type::None = 0, leader_curve_type::Polyline = 1, leader_curve_type::Spline = 2 }
Type of leader curve More...
enum  | LengthDisplay : unsigned int {
 LengthDisplay::ModelUnits = 0, LengthDisplay::Millmeters = 3, LengthDisplay::Centimeters = 4, LengthDisplay::Meters = 5,
 LengthDisplay::Kilometers = 6, LengthDisplay::InchesDecimal = 7, LengthDisplay::InchesFractional = 1, LengthDisplay::FeetDecimal = 8,
 LengthDisplay::FeetAndInches = 2, LengthDisplay::Miles = 9
 }
Interface. More...
enum  | OBSOLETE_length_format : unsigned char { OBSOLETE_length_format::Decimal = 0, OBSOLETE_length_format::Fractional = 1, OBSOLETE_length_format::FeetInches = 2, OBSOLETE_length_format::FeetDecimalInches = 3 }
Obsolete format for length display - use ON_DimStyle::DimensionLengthDisplay instead More...
enum  | stack_format : unsigned char { stack_format::None = 0, stack_format::StackHorizontal = 1, stack_format::StackDiagonal = 2 }
Format of stacked fractions More...
enum  | suppress_zero : unsigned char {
 suppress_zero::None = 0, suppress_zero::SuppressLeading = 1, suppress_zero::SuppressTrailing = 2, suppress_zero::SuppressLeadingAndTrailing = 3,
 suppress_zero::SuppressZeroFeet = 4, suppress_zero::SuppressZeroInches = 8, suppress_zero::SuppressZeroFeetAndZeroInches = 12
 }
Marks leading and trailing zeros for removal. More...
enum  | text_fit : unsigned char {
 text_fit::Auto = 0, text_fit::TextInside = 1, text_fit::TextRight = 2, text_fit::TextLeft = 3,
 text_fit::TextHintRight = 4, text_fit::TextHintLeft = 5
 }
Text display position inside or outside extension lines More...
enum  | TextLocation : unsigned char { TextLocation::AboveDimLine = 0, TextLocation::InDimLine = 1, TextLocation::BelowDimLine = 2 }
The location of text in linear, angular, radial, and ordinate dimensions. More...
enum  | tolerance_format : unsigned char { tolerance_format::None = 0, tolerance_format::Symmetrical = 1, tolerance_format::Deviation = 2, tolerance_format::Limits = 3 }
Style of tolerance display for dimensions More...
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
double  | DSxArrowSize () const
double  | DSxCenterMark () const
double  | DSxDimExtension () const
double  | DSxExtExtension () const
double  | DSxExtOffset () const
double  | DSxLeaderArrowSize () const
double  | DSxTextGap () const
double  | DSxTextHeight () const
bool  | IsReference () const
bool  | IsSystemDimStyle () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
bool  | operator== (const CRhinoDimStyle &) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
 Public Member Functions inherited from ON_DimStyle
ON_DimStyle ()
Default constructor result is identical to ON_DimStyle::Unset;. More...
ON_DimStyle (const ON_3dmAnnotationSettings &src)
ON_DimStyle (const ON_DimStyle &src)=default
ON_DimStyle (ON::LengthUnitSystem model_length_unit_system, const class ON_V5x_DimStyle &src)
Used when reading V5 and earlier archives. More...
~ON_DimStyle ()=default
bool  | Alternate () const
Additional measurement display toggle. More...
bool  | AlternateBelow () const
ON_DimStyle::LengthDisplay  | AlternateDimensionLengthDisplay () const
Set dimension length units and format /summary> More...
ON::LengthUnitSystem  | AlternateDimensionLengthDisplayUnit (unsigned int model_sn) const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary> More...
double  | AlternateLengthFactor () const
AlternateLengthFactor is a rarely used. See Length factor for a description of this property. /summary> More...
int  | AlternateLengthResolution () const
Display resolution for alternate length measurements. More...
const ON_wString &  | AlternatePrefix () const
Dimension alternate prefix text. More...
double  | AlternateRoundOff () const
const ON_wString &  | AlternateSuffix () const
Dimension alternate suffix text. More...
int  | AlternateToleranceResolution () const
ON_DimStyle::suppress_zero  | AlternateZeroSuppress () const
angle_format  | AngleFormat () const
int  | AngleResolution () const
Display resolution for angle measurements. More...
double  | AngleRoundOff () const
ON_DimStyle::suppress_zero  | AngleZeroSuppress () const
int  | ArcLengthSymbol () const
ON_UUID  | ArrowBlockId1 () const
ON_UUID  | ArrowBlockId2 () const
ON_Color  | ArrowColor () const
ON::object_color_source  | ArrowColorSource () const
ON_DimStyle::arrow_fit  | ArrowFit () const
ON_Color  | ArrowPlotColor () const
ON::plot_color_source  | ArrowPlotColorSource () const
double  | ArrowSize () const
Arrow size. More...
ON_Arrowhead::arrow_type  | ArrowType1 () const
ON_Arrowhead::arrow_type  | ArrowType2 () const
double  | BaselineSpacing () const
double  | CenterMark () const
Centermark size. More...
ON_DimStyle::centermark_style  | CenterMarkStyle () const
Centermark style. More...
void  | ClearAllFieldOverrides ()
double  | ClippingArrowSize () const
ON_ClippingArrowhead::arrow_type  | ClippingArrowType1 () const
ON_ClippingArrowhead::arrow_type  | ClippingArrowType2 () const
bool  | CompareDimstyle (const ON_DimStyle &src) const
bool  | CompareFields (const ON_DimStyle &src) const
const class ON_SHA1_Hash &  | ContentHash () const
const ON_DimStyle  | CreateOverrideCandidate () const
wchar_t  | DecimalSeparator () const
ON_DimStyle::LengthDisplay  | DimensionLengthDisplay () const
Dimension length units and format /summary> More...
ON::LengthUnitSystem  | DimensionLengthDisplayUnit (unsigned int model_sn) const
Parameters: model_sn - 0, a model serial number, or ON_UNSET_UINT_INDEX to use the dimstyle's ModelSerialNumber() value. Returns Unit system for dimension length display. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn > 0, then the value of ON::LengthUnitSystemFromModelSerialNumber(model_sn) is returned. If DimensionLengthDisplay() == ON_DimStyle::LengthDisplay::ModelUnits and model_sn == 0, then ON::LengthUnitSystem::None is returned. /summary> More...
ON_Color  | DimensionLineColor () const
ON::object_color_source  | DimensionLineColorSource () const
ON_Color  | DimensionLinePlotColor () const
ON::plot_color_source  | DimensionLinePlotColorSource () const
double  | DimensionLinePlotWeight () const
ON::plot_weight_source  | DimensionLinePlotWeightSource () const
double  | DimExtension () const
Extension of dimension line past extension lines. More...
ON_DimStyle::ContentAngleStyle  | DimRadialTextAngleStyle () const
ON_DimStyle::TextLocation  | DimRadialTextLocation () const
The location of text relative to the dimension line in radial dimensions. More...
ON::TextOrientation  | DimRadialTextOrientation () const
double  | DimScale () const
int  | DimScaleSource () const
0: Global DimScale, 1: DimStyle DimScale More...
ON_DimStyle::ContentAngleStyle  | DimTextAngleStyle () const
ON_DimStyle::TextLocation  | DimTextLocation () const
The location of text relative to the dimension line in linear, angular, and ordinate dimensions. More...
ON::TextOrientation  | DimTextOrientation () const
bool  | DrawForward () const
bool  | DrawTextMask () const
Determines whether or not to draw a Text Mask. More...
void  | Dump (ON_TextLog &) const override
virtual More...
void  | EmergencyDestroy ()
Interface. More...
ON_Color  | ExtensionLineColor () const
ON::object_color_source  | ExtensionLineColorSource () const
ON_Color  | ExtensionLinePlotColor () const
ON::plot_color_source  | ExtensionLinePlotColorSource () const
double  | ExtensionLinePlotWeight () const
ON::plot_weight_source  | ExtensionLinePlotWeightSource () const
double  | ExtExtension () const
Extension line extension. More...
double  | ExtOffset () const
Extension line offset. More...
double  | FixedExtensionLen () const
bool  | FixedExtensionLenOn () const
const class ON_Font &  | Font () const
const class ON_Font &  | FontCharacteristics () const
const bool  | FontSubstituted () const
bool  | ForceDimLine () const
bool  | HasOverrides () const
void  | InheritFields (const ON_DimStyle &parent)
bool  | IsChildDimstyle () const
Test if this dimstyle is the child of any other dimstyle. More...
bool  | IsChildOf (const ON_UUID &parent_id) const
bool  | IsFieldOverride (ON_DimStyle::field field_id) const
bool  | IsOverrideDimStyleCandidate (ON_UUID parent_id, bool bRequireSetOverrides, ON_wString *error_description=nullptr) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual More...
ON_UUID  | LeaderArrowBlockId () const
double  | LeaderArrowSize () const
Arrow size. More...
ON_Arrowhead::arrow_type  | LeaderArrowType () const
double  | LeaderContentAngleDegrees () const
double  | LeaderContentAngleRadians () const
ON_DimStyle::ContentAngleStyle  | LeaderContentAngleStyle () const
was contentalignment More...
ON_DimStyle::leader_curve_type  | LeaderCurveType () const
bool  | LeaderHasLanding () const
double  | LeaderLandingLength () const
ON::TextHorizontalAlignment  | LeaderTextHorizontalAlignment () const
ON::TextOrientation  | LeaderTextOrientation () const
ON::TextVerticalAlignment  | LeaderTextVerticalAlignment () const
was attachstyle More...
double  | LengthFactor () const
LengthFactor is a rarely used. It applies when a model is being drawn to a scale and the dimension length values should be reverse scaled. For example, if a model is drawn at 1/4 scale, a line 5 units long indicates the real world line is 20 units long. In this case setting LengthFactor to 4 would cause a linear dimension applied to that line to display a value of 20. /summary> More...
int  | LengthResolution () const
Display resolution for distance measurements. More...
double  | LineSpaceScale () const
double  | MaskBorder () const
ON_Color  | MaskColor () const
ON_TextMask::MaskType  | MaskFillType () const
Determines where to get the color to draw a Text Mask. More...
ON_TextMask::MaskFrame  | MaskFrameType () const
Determines whether to draw a frame around a Text Mask. More...
ON_DimStyle &  | operator= (const ON_DimStyle &)=default
ON__UINT32  | OverrideCount () const
void  | OverrideFields (const ON_DimStyle &source, const ON_DimStyle &parent)
void  | OverrideFieldsWithDifferentValues (const ON_DimStyle &source, const ON_DimStyle &parent)
const ON_SHA1_Hash &  | ParentContentHash () const
const class ON_Font &  | ParentDimStyleFont () const
const ON_wString &  | Prefix () const
Dimension prefix text. More...
bool  | Read (ON_BinaryArchive &) override
virtual More...
double  | RoundOff () const
void  | Scale (double scale)
double  | ScaleLeftLength_mm () const
double  | ScaleRightLength_mm () const
const ON_ScaleValue &  | ScaleValue () const
void  | SetAlternate (bool)
void  | SetAlternateBelow (bool below)
void  | SetAlternateDimensionLengthDisplay (ON_DimStyle::LengthDisplay length_display)
Set alternate dimension length units and format /summary> More...
void  | SetAlternateLengthFactor (double)
AlternateLengthFactor is a rarely used. See Length factor for a description of this property. /summary> More...
void  | SetAlternateLengthResolution (int)
void  | SetAlternatePrefix (const wchar_t *)
void  | SetAlternateRoundOff (double r)
void  | SetAlternateSuffix (const wchar_t *)
void  | SetAlternateToleranceResolution (int r)
void  | SetAlternateZeroSuppress (ON_DimStyle::suppress_zero s)
void  | SetAngleFormat (angle_format format)
void  | SetAngleResolution (int)
void  | SetAngleRoundOff (double r)
void  | SetAngleZeroSuppress (ON_DimStyle::suppress_zero s)
void  | SetArcLengthSymbol (int m)
void  | SetArrowBlockId1 (ON_UUID id)
void  | SetArrowBlockId2 (ON_UUID id)
void  | SetArrowColor (ON_Color c)
void  | SetArrowColorSource (const ON::object_color_source src)
void  | SetArrowFit (ON_DimStyle::arrow_fit arrowfit)
void  | SetArrowPlotColor (ON_Color c)
void  | SetArrowPlotColorSource (const ON::plot_color_source src)
void  | SetArrowSize (const double)
void  | SetArrowType1 (ON_Arrowhead::arrow_type)
void  | SetArrowType1And2 (ON_Arrowhead::arrow_type)
void  | SetArrowType2 (ON_Arrowhead::arrow_type)
void  | SetBaselineSpacing (double spacing)
void  | SetCenterMark (const double)
void  | SetCenterMarkStyle (ON_DimStyle::centermark_style style)
void  | SetClippingArrowSize (double s)
void  | SetClippingArrowType1 (ON_ClippingArrowhead::arrow_type)
void  | SetClippingArrowType2 (ON_ClippingArrowhead::arrow_type)
void  | SetDecimalSeparator (wchar_t separator)
void  | SetDimensionLengthDisplay (ON_DimStyle::LengthDisplay length_display)
Alternate dimension length units and format /summary> More...
void  | SetDimensionLineColor (ON_Color c)
void  | SetDimensionLineColorSource (const ON::object_color_source src)
void  | SetDimensionLinePlotColor (ON_Color c)
void  | SetDimensionLinePlotColorSource (const ON::plot_color_source src)
void  | SetDimensionLinePlotWeight (double w)
void  | SetDimensionLinePlotWeightSource (const ON::plot_weight_source src)
void  | SetDimExtension (const double e)
void  | SetDimRadialTextAngleStyle (ON_DimStyle::ContentAngleStyle style)
void  | SetDimRadialTextLocation (ON_DimStyle::TextLocation)
void  | SetDimRadialTextOrientation (ON::TextOrientation)
void  | SetDimScale (double left_val, ON::LengthUnitSystem left_us, double right_val, ON::LengthUnitSystem right_us)
void  | SetDimScale (double scale)
void  | SetDimScale (ON_ScaleValue sv)
void  | SetDimScaleSource (int source)
void  | SetDimTextAngleStyle (ON_DimStyle::ContentAngleStyle style)
void  | SetDimTextLocation (ON_DimStyle::TextLocation)
void  | SetDimTextOrientation (ON::TextOrientation)
void  | SetDrawForward (bool drawforward)
void  | SetDrawTextMask (bool bDraw)
void  | SetExtensionLineColor (ON_Color c)
void  | SetExtensionLineColorSource (const ON::object_color_source src)
void  | SetExtensionLinePlotColor (ON_Color c)
void  | SetExtensionLinePlotColorSource (const ON::plot_color_source src)
void  | SetExtensionLinePlotWeight (double w)
void  | SetExtensionLinePlotWeightSource (const ON::plot_weight_source src)
void  | SetExtExtension (const double)
void  | SetExtOffset (const double)
void  | SetFieldOverride (ON_DimStyle::field field_id, bool bOverrideParent)
void  | SetFieldOverrideAll (bool bOverrideParent)
void  | SetFixedExtensionLen (double l)
void  | SetFixedExtensionLenOn (bool on)
void  | SetFont (const class ON_Font &font_characteristics)
void  | SetForceDimLine (bool forcedimline)
void  | SetLeaderArrowBlockId (ON_UUID id)
void  | SetLeaderArrowSize (const double)
void  | SetLeaderArrowType (ON_Arrowhead::arrow_type)
void  | SetLeaderContentAngleDegrees (double angle_degrees)
void  | SetLeaderContentAngleRadians (double angle_radians)
void  | SetLeaderContentAngleStyle (ON_DimStyle::ContentAngleStyle style)
void  | SetLeaderCurveType (ON_DimStyle::leader_curve_type type)
void  | SetLeaderHasLanding (bool landing)
void  | SetLeaderLandingLength (double length)
void  | SetLeaderTextHorizontalAlignment (ON::TextHorizontalAlignment halign)
void  | SetLeaderTextOrientation (ON::TextOrientation)
void  | SetLeaderTextVerticalAlignment (ON::TextVerticalAlignment style)
void  | SetLengthFactor (double)
LengthFactor is a rarely used. It applies when a model is being drawn to a scale and the dimension length values should be reverse scaled. For example, if a model is drawn at 1/4 scale, a line 5 units long indicates the real world line is 20 units long. In this case setting LengthFactor to 4 would cause a linear dimension applied to that line to display a value of 20. /summary> More...
void  | SetLengthResolution (int)
void  | SetLineSpaceScale (double scale)
void  | SetMaskBorder (double offset)
void  | SetMaskColor (ON_Color color)
Does not return viewport background color. More...
void  | SetMaskFillType (ON_TextMask::MaskType source)
void  | SetMaskFrameType (ON_TextMask::MaskFrame source)
void  | SetPrefix (const wchar_t *)
void  | SetRoundOff (double r)
void  | SetSignedOrdinate (bool allowsigned)
void  | SetSourceDimstyle (ON_UUID source_uuid)
void  | SetStackFractionFormat (ON_DimStyle::stack_format f)
void  | SetStackHeightScale (double f)
void  | SetSuffix (const wchar_t *)
void  | SetSuppressArrow1 (bool s)
void  | SetSuppressArrow2 (bool s)
void  | SetSuppressDimLine1 (bool)
void  | SetSuppressDimLine2 (bool)
void  | SetSuppressExtension1 (bool)
void  | SetSuppressExtension2 (bool)
void  | SetTextColor (ON_Color c)
void  | SetTextColorSource (const ON::object_color_source src)
void  | SetTextFit (ON_DimStyle::text_fit textfit)
void  | SetTextGap (double gap)
void  | SetTextHeight (double height)
void  | SetTextHorizontalAlignment (ON::TextHorizontalAlignment halign)
void  | SetTextMask (const ON_TextMask &text_mask)
void  | SetTextMoveLeader (int m)
void  | SetTextOrientation (ON::TextOrientation)
void  | SetTextPlotColor (ON_Color c)
void  | SetTextPlotColorSource (const ON::object_color_source src)
void  | SetTextRotation (double r)
void  | SetTextUnderlined (bool underlined)
void  | SetTextVerticalAlignment (ON::TextVerticalAlignment style)
void  | SetToleranceFormat (ON_DimStyle::tolerance_format format)
void  | SetToleranceHeightScale (double scale)
void  | SetToleranceLowerValue (double lower_value)
void  | SetToleranceResolution (int resolution)
void  | SetToleranceUpperValue (double upper_value)
void  | SetToleranceZeroSuppress (ON_DimStyle::suppress_zero s)
void  | SetUnitSystem (ON::LengthUnitSystem us)
NOTE WELL: A dimstyle unit system was added in V6, but has never been fully used. The idea was this would make it easier to figure out what text height/ arrow size, ... actually meant. Especially in situations where model space and page space have different unit systems, and in more complex cases like text in instance definitions and inserting annotation from models with mismatched unit systems. It is used internally to get some scales properly set and use in limited merging contexts. More...
void  | SetUnitSystemFromContext (bool bUseName, ON::LengthUnitSystem source_unit_system, ON::LengthUnitSystem destination_unit_system)
void  | SetUseKerning (bool enableKerning)
void  | SetZeroSuppress (ON_DimStyle::suppress_zero s)
bool  | SignedOrdinate () const
ON_UUID  | SourceDimstyle () const
ON_DimStyle::stack_format  | StackFractionFormat () const
double  | StackHeightScale () const
const ON_wString &  | Suffix () const
Dimension suffix text. More...
bool  | SuppressArrow1 () const
bool  | SuppressArrow2 () const
bool  | SuppressDimLine1 () const
bool  | SuppressDimLine2 () const
bool  | SuppressExtension1 () const
Suppress first dimension extension line. More...
bool  | SuppressExtension2 () const
Suppress second dimension extension line. More...
double  | TextAdvanceOfCodePoint (unsigned unicode_code_point) const
ON_Color  | TextColor () const
ON::object_color_source  | TextColorSource () const
ON_DimStyle::text_fit  | TextFit () const
double  | TextGap () const
Distance from dimension lines to text. More...
double  | TextHeight () const
Height of dimension text. More...
ON::TextHorizontalAlignment  | TextHorizontalAlignment () const
const ON_TextMask &  | TextMask () const
int  | TextMoveLeader () const
ON::TextOrientation  | TextOrientation () const
ON_Color  | TextPlotColor () const
ON::object_color_source  | TextPlotColorSource () const
const class ON_SHA1_Hash  | TextPositionPropertiesHash () const
double  | TextRotation () const
bool  | TextUnderlined () const
ON::TextVerticalAlignment  | TextVerticalAlignment () const
double  | TextWidthOfEmSpace () const
double  | TextWidthOfEnSpace () const
double  | TextWidthOfFigureSpace () const
double  | TextWidthOfIdeographicSpace () const
double  | TextWidthOfMediumMathematicalSpace () const
double  | TextWidthOfSpace () const
tolerance_format  | ToleranceFormat () const
double  | ToleranceHeightScale () const
double  | ToleranceLowerValue () const
int  | ToleranceResolution () const
double  | ToleranceUpperValue () const
ON_DimStyle::suppress_zero  | ToleranceZeroSuppress () const
ON::LengthUnitSystem  | UnitSystem () const
NOTE WELL: A dimstyle unit system was added in V6, but has never been fully used. The idea was this would make it easier to figure out what text height/ arrow size, ... actually meant. Especially in situations where model space and page space have different unit systems, and in more complex cases like text in instance definitions and inserting annotation from models with mismatched unit systems. It is used internally to get some scales properly set and use in limited merging contexts. More...
bool  | UnitSystemIsSet () const
bool  | UseKerning () const
Should kerning be applied when computing glyph placement. More...
bool  | Write (ON_BinaryArchive &) const override
virtual More...
ON_DimStyle::suppress_zero  | ZeroSuppress () const
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
void  | Dump (ON_TextLog &) const override
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static void  | InitPrecisionList (CComboBox &combo_box, int def_precision, UINT current_format)
decimal, fractional, feet/inches More...
static void  | InitPrecisionList (CComboBox *combo_boxes[2], int defaults[2], UINT &current_format, BOOL32 bLinearOnly)
static void  | InitToleranceStyleList (CComboBox &combo_box, UINT current=0)
static unsigned int  | NextRuntimeSerialNumber ()
static const ON_DimStyle *  | ParentDimstyle (const CRhinoDoc *doc, ON_UUID id)
 Static Public Member Functions inherited from ON_DimStyle
static ON_DimStyle::angle_format  | AngleFormatFromUnsigned (unsigned int format_as_unsigned)
static ON_DimStyle::arrow_fit  | ArrowFitFromUnsigned (unsigned int arrow_fit_as_unsigned)
static ON_DimStyle::centermark_style  | CentermarkStyleFromUnsigned (unsigned int centermark_as_unsigned)
static ON_DimStyle::ContentAngleStyle  | ContentAngleStyleFromUnsigned (unsigned int alignment_as_unsigned)
static ON_DimStyle *  | CreateFromFont (const ON_Font *font_characteristics, double model_space_text_scale, const ON_DimStyle *dimstyle_settings, const class ON_ComponentManifest *manifest, ON_DimStyle *destination)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, const ON_UnitSystem &text_height_unit_system)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, const ON_UnitSystem &text_height_unit_system, ON::TextVerticalAlignment valign, ON::TextHorizontalAlignment halign)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, const ON_UnitSystem &text_height_unit_system, ON::TextVerticalAlignment valign, ON::TextHorizontalAlignment halign, ON::TextOrientation orientation, ON_DimStyle::TextLocation dim_text_location)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, ON::LengthUnitSystem text_height_unit_system)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, ON::LengthUnitSystem text_height_unit_system, ON::TextVerticalAlignment valign, ON::TextHorizontalAlignment halign)
static const ON_DimStyle  | CreateFromProperties (const ON_DimStyle &parent_dim_style, ON::AnnotationType annotation_type, const ON_Font *font, double model_space_text_scale, double text_height, ON::LengthUnitSystem text_height_unit_system, ON::TextVerticalAlignment valign, ON::TextHorizontalAlignment halign, ON::TextOrientation orientation, ON_DimStyle::TextLocation dim_text_location)
static const class ON_DimStyle &  | DimStyleOrDefault (const class ON_DimStyle *dimstyle)
static ON::OBSOLETE_DistanceDisplayMode  | DistanceDisplayModeFromLengthFormat (ON_DimStyle::OBSOLETE_length_format)
convert ON_DimStyle::OBSOLETE_length_format enum to ON::OBSOLETE_DistanceDisplayMode enum More...
static ON_DimStyle::field  | FieldFromUnsigned (unsigned int field_as_unsigned)
static const ON_DimStyle *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_DimStyle *none_return_value)
static ON_DimStyle::leader_curve_type  | LeaderCurveTypeFromUnsigned (unsigned int type_as_unsigned)
static ON_DimStyle::LengthDisplay  | LengthDisplayFromUnitsAndFormat (ON::LengthUnitSystem units, ON_DimStyle::OBSOLETE_length_format lengthformat)
static ON_DimStyle::LengthDisplay  | LengthDisplayFromUnsigned (unsigned int length_display_as_unsigned)
static bool  | LengthDisplayIsDecimal (ON_DimStyle::LengthDisplay dimension_length_display)
static ON_DimStyle::OBSOLETE_length_format  | LengthFormatFromDistanceDisplayMode (ON::OBSOLETE_DistanceDisplayMode)
convert ON::OBSOLETE_DistanceDisplayMode enum to ON_DimStyle::OBSOLETE_length_format enum More...
static ON::LengthUnitSystem  | LengthUnitSystemFromLengthDisplay (ON_DimStyle::LengthDisplay dimension_length_display)
static ON_DimStyle::OBSOLETE_length_format  | OBSOLETE_LengthFormatFromLengthDisplay (ON_DimStyle::LengthDisplay dimension_length_display, ON::LengthUnitSystem model_unit_system)
static ON_DimStyle::OBSOLETE_length_format  | OBSOLETE_LengthFormatFromLengthDisplay (ON_DimStyle::LengthDisplay dimension_length_display, unsigned int model_serial_number)
static ON_DimStyle::OBSOLETE_length_format  | OBSOLETE_LengthFormatFromUnsigned (unsigned int format_as_unsigned)
static ON_DimStyle::stack_format  | StackFormatFromUnsigned (unsigned int format_as_unsigned)
static const ON_DimStyle &  | SystemDimstyleFromContentHash (const ON_SHA1_Hash &content_hash)
static const ON_DimStyle &  | SystemDimstyleFromId (ON_UUID id)
static const ON_DimStyle &  | SystemDimstyleFromIndex (int index)
static const ON_DimStyle &  | SystemDimstyleFromName (const ON_NameHash &name_hash)
static ON_DimStyle::text_fit  | TextFitFromUnsigned (unsigned int text_fit_as_unsigned)
static ON_DimStyle::TextLocation  | TextLocationFromUnsigned (unsigned int dim_text_location_as_unsigned)
static ON_DimStyle::tolerance_format  | ToleranceFormatFromUnsigned (unsigned int format_as_unsigned)
static int  | V5AngleFormat (ON_DimStyle::angle_format v6format)
static int  | V5ArrowType (ON_Arrowhead::arrow_type v6type)
For converting to and from V5 Dimstyles. More...
static int  | V5LengthFormat (ON_DimStyle::OBSOLETE_length_format v6format)
static int  | V5MaskColorSourceFromV6MaskType (ON_TextMask::MaskType mask_type)
static int  | V5ToleranceFormat (ON_DimStyle::tolerance_format v6format)
static ON_DimStyle::angle_format  | V6AngleFormat (int v5format)
static ON_Arrowhead::arrow_type  | V6ArrowType (int v5type)
static ON_DimStyle::OBSOLETE_length_format  | V6LengthFormat (int v5format)
static ON_TextMask::MaskType  | V6MaskTypeFromV5MaskColorSource (int v5_mask_color_source)
static ON_DimStyle::tolerance_format  | V6ToleranceFormat (int v5format)
static ON_DimStyle::suppress_zero  | ZeroSuppressFromUnsigned (unsigned int suppress_ero_as_unsigned)
static bool  | ZeroSuppressMatchesLengthDisplay (ON_DimStyle::suppress_zero zero_suppress, ON_DimStyle::LengthDisplay length_display)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Public Attributes
const unsigned int  | m_dimstyle_sn
const class CRhinoDimStyleTable &  | m_doc_dimension_style_table
int  | m_remap_index = -1
int  | m_sort_index = -1
Runtime index used to sort dimstyles in dialogs. More...
 Friends
class  | CRhinoDimStyleTable
 Additional Inherited Members
 Static Public Attributes inherited from ON_DimStyle
static const ON_DimStyle  | Default
index = -1, unique and persistent id. More...
static const ON_DimStyle  | DefaultFeetDecimal
index = -8, unique and persistent id. More...
static const ON_DimStyle  | DefaultFeetEngrave
index = -9, unique and persistent id. More...
static const ON_DimStyle  | DefaultFootInchArchitecture
index = -4, unique and persistent id. More...
static const ON_DimStyle  | DefaultInchDecimal
index = -2, unique and persistent id. More...
static const ON_DimStyle  | DefaultInchFractional
index = -3, unique and persistent id. More...
static const ON_DimStyle  | DefaultMillimeterArchitecture
index = -7, unique and persistent id. More...
static const ON_DimStyle  | DefaultMillimeterEngrave
index = -10, unique and persistent id. More...
static const ON_DimStyle  | DefaultMillimeterLarge
index = -6, unique and persistent id. More...
static const ON_DimStyle  | DefaultMillimeterSmall
index = -5, unique and persistent id. More...
static const ON_DimStyle  | DefaultModelUnitsDecimal
index = -11, unique and persistent id. More...
static const ON_DimStyle  | DefaultModelUnitsEngrave
index = -12, unique and persistent id. More...
static const ON_DimStyle  | DefaultModelUnitsGeometricTolerance
index = -13, unique and persistent id. More...
static const ON_DimStyle  | Unset
Predefined default dimension styles always available. More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
CRhinoDimStyle class.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
min_precision
max_precision
Member Function Documentation
◆ DSxArrowSize()
 double CRhinoDimStyle::DSxArrowSize  |  ( |   | ) |   const
◆ DSxCenterMark()
 double CRhinoDimStyle::DSxCenterMark  |  ( |   | ) |   const
◆ DSxDimExtension()
 double CRhinoDimStyle::DSxDimExtension  |  ( |   | ) |   const
◆ DSxExtExtension()
 double CRhinoDimStyle::DSxExtExtension  |  ( |   | ) |   const
These functions are like the ON_DimStyle ones but with the values multiplied by DimScale()
◆ DSxExtOffset()
 double CRhinoDimStyle::DSxExtOffset  |  ( |   | ) |   const
◆ DSxLeaderArrowSize()
 double CRhinoDimStyle::DSxLeaderArrowSize  |  ( |   | ) |   const
◆ DSxTextGap()
 double CRhinoDimStyle::DSxTextGap  |  ( |   | ) |   const
◆ DSxTextHeight()
 double CRhinoDimStyle::DSxTextHeight  |  ( |   | ) |   const
◆ InitPrecisionList() [1/2]
 static void CRhinoDimStyle::InitPrecisionList  |  ( |  CComboBox &  |  combo_box,
|  int  |  def_precision,
|  UINT  |  current_format
)
static
decimal, fractional, feet/inches
Parameters
combo_box | combobox control
def_precision | default precision
◆ InitPrecisionList() [2/2]
 static void CRhinoDimStyle::InitPrecisionList  |  ( |  CComboBox *  |  combo_boxes[2],
|  int  |  defaults[2],
|  UINT &  |  current_format,
|  BOOL32  |  bLinearOnly
)
static
Parameters
combo_boxes | (Obsolete function) length and angle combo box controls
defaults | default length and angle precision
current_format | last/next radio button index (input/output)
◆ InitToleranceStyleList()
 static void CRhinoDimStyle::InitToleranceStyleList  |  ( |  CComboBox &  |  combo_box,
|  UINT  |  current = 0
)
static
◆ IsReference()
 bool CRhinoDimStyle::IsReference  |  ( |   | ) |   const
Returns: True if the dimstyle is part of a worksession reference model or a linked instance definition model. If IsReference() is true, then the dimstyle will not be saved as part of this document. See Also: CRhinoDimStyle::WorksessionReferenceModelSerialNumber() CRhinoDimStyle::LinkedInstanceDefinitionSerialNumber
◆ IsSystemDimStyle()
 bool CRhinoDimStyle::IsSystemDimStyle  |  ( |   | ) |   const
Returns: True if the dimstyle is one of the system dimstyles:
m_doc_dimension_style_table.DefaultDimensionStyle m_doc_dimension_style_table.DefaultInchDecimal m_doc_dimension_style_table.DefaultInchFractional m_doc_dimension_style_table.DefaultFootInchArchitecture m_doc_dimension_style_table.DefaultMillimeterSmall m_doc_dimension_style_table.DefaultMillimeterLarge m_doc_dimension_style_table.DefaultMillimeterArchitecture
◆ LinkedInstanceDefinitionSerialNumber()
 unsigned int CRhinoDimStyle::LinkedInstanceDefinitionSerialNumber  |  ( |   | ) |   const
Returns: 0: The dimstyle is not part of a linked instance definition 1-1000: These numbers are reserved for future use. >1000: CRhinoDoc::m_instance_defintion_table.FindBySerialNumber() can be used to find the instance definition. Remarks: The linked instance definition serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
◆ NextRuntimeSerialNumber()
 static unsigned int CRhinoDimStyle::NextRuntimeSerialNumber  |  ( |   | )
static
◆ operator==()
 bool CRhinoDimStyle::operator==  |  ( |  const CRhinoDimStyle &  |   | ) |   const
◆ ParentDimstyle()
 static const ON_DimStyle* CRhinoDimStyle::ParentDimstyle  |  ( |  const CRhinoDoc *  |  doc,
|  ON_UUID  |  id
)
static
◆ WorksessionReferenceModelSerialNumber()
 unsigned int CRhinoDimStyle::WorksessionReferenceModelSerialNumber  |  ( |   | ) |   const
Returns: Worksession reference model id. 0: dimstyle is not in a reference model. 1: dimstyle is in an unidentified worksession reference model. 2-1000: reserved for future use >1000: Serial number of the worksession reference model. Remarks: The reference model serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
Friends And Related Function Documentation
◆ CRhinoDimStyleTable
 friend class CRhinoDimStyleTable
friend
Member Data Documentation
◆ m_dimstyle_sn
 const unsigned int CRhinoDimStyle::m_dimstyle_sn
Runtime serial number of this dimstyle. This serial number is unique for each dimstyle in an instance of a Rhino application. This serial number is not saved in files and it is generally different the next time a file is read.
◆ m_doc_dimension_style_table
 const class CRhinoDimStyleTable& CRhinoDimStyle::m_doc_dimension_style_table
◆ m_remap_index
 int CRhinoDimStyle::m_remap_index = -1
Used for font index remapping during I/O operations. It is a runtime variable and should be ignored by everything except CRhinoDoc::Read3DM() and CRhinoDoc::Write3DM().
◆ m_sort_index
 int CRhinoDimStyle::m_sort_index = -1
Runtime index used to sort dimstyles in dialogs.