Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoPrintControlsBase Class Reference
Rhino
#include <rhinoSdkPrintDialog.h>
 Inheritance diagram for CRhinoPrintControlsBase:
 Public Member Functions
CRhinoPrintControlsBase (UINT nIDTemplate, CWnd *pParent)
 Public Member Functions inherited from CRhinoUiExpandableTabPage_New
CRhinoUiExpandableTabPage_New (UINT nIDTemplate, CWnd *pParent)
virtual  | ~CRhinoUiExpandableTabPage_New ()
void  | SetParentForOnCreate (CWnd *p)
bool  | SetUseSpecialColors (bool b)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
void  | AdjustRightEdge (int cx, int cy, CWnd &control)
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
bool  | GetPrintInfo (CRhinoPrintInfo &info) const
virtual BOOL32  | OnInitDialog ()
virtual void  | OnPrintSettingsChanged ()
afx_msg LRESULT  | PrintSettingsChangeMesssage (WPARAM wParam, LPARAM lParam)
bool  | SetPrintInfo (const CRhinoPrintInfo &info)
void  | UpdatePreviewWindow ()
 Protected Member Functions inherited from CRhinoUiExpandableTabPage_New
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg LRESULT  | OnIsWindowSection (WPARAM, LPARAM)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
class CRhPrintDialog *  | m_pPrintDialog
Parent Dialog that contains all of the "meat" these controls make changes to. More...
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
Constructor & Destructor Documentation
◆ CRhinoPrintControlsBase()
 CRhinoPrintControlsBase::CRhinoPrintControlsBase  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParent
)
Member Function Documentation
◆ AdjustRightEdge()
 void CRhinoPrintControlsBase::AdjustRightEdge  |  ( |  int  |  cx,
|  int  |  cy,
|  CWnd &  |  control
)
protected
◆ DoDataExchange()
 virtual void CRhinoPrintControlsBase::DoDataExchange  |  ( |  CDataExchange *  |  pDX | )
protectedvirtual
DDX/DDV support.
Reimplemented from CRhinoUiDialog.
◆ GetPrintInfo()
 bool CRhinoPrintControlsBase::GetPrintInfo  |  ( |  CRhinoPrintInfo &  |  info | ) |   const
protected
◆ OnInitDialog()
 virtual BOOL32 CRhinoPrintControlsBase::OnInitDialog  |  ( |   | )
protectedvirtual
Reimplemented from CRhinoUiDialog.
◆ OnPrintSettingsChanged()
 virtual void CRhinoPrintControlsBase::OnPrintSettingsChanged  |  ( |   | )
protectedvirtual
Gets called when the print dialog gets a BroadcastPrintSettingsChanged call Override to update controls on this page to match the new settings
◆ PrintSettingsChangeMesssage()
 afx_msg LRESULT CRhinoPrintControlsBase::PrintSettingsChangeMesssage  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protected
◆ SetPrintInfo()
 bool CRhinoPrintControlsBase::SetPrintInfo  |  ( |  const CRhinoPrintInfo &  |  info | )
protected
◆ UpdatePreviewWindow()
 void CRhinoPrintControlsBase::UpdatePreviewWindow  |  ( |   | )
protected
Member Data Documentation
◆ m_pPrintDialog
 class CRhPrintDialog* CRhinoPrintControlsBase::m_pPrintDialog
protected
Parent Dialog that contains all of the "meat" these controls make changes to.