Public Attributes | List of all members
CRhRdkContentField::CChangeInfo Class Reference
#include <RhRdkContentField.h>
 Public Attributes
RhRdkChangeContext  | m_ChangeContext
CRhRdkContentField *  | m_pField
void *  | m_pReserved
CRhRdkVariant  | m_vOldValue
Member Data Documentation
◆ m_ChangeContext
 RhRdkChangeContext CRhRdkContentField::CChangeInfo::m_ChangeContext
◆ m_pField
 CRhRdkContentField* CRhRdkContentField::CChangeInfo::m_pField
◆ m_pReserved
 void* CRhRdkContentField::CChangeInfo::m_pReserved
◆ m_vOldValue
 CRhRdkVariant CRhRdkContentField::CChangeInfo::m_vOldValue