Public Member Functions | Public Attributes | List of all members
ON_TextureCoordinates Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_TextureCoordinates ()
 Public Attributes
int  | m_dim
1, 2, or 3 More...
ON_SimpleArray< ON_3fPoint >  | m_T
texture coordinates More...
ON_MappingTag  | m_tag
Constructor & Destructor Documentation
◆ ON_TextureCoordinates()
 ON_TextureCoordinates::ON_TextureCoordinates  |  ( |   | )
Member Data Documentation
◆ m_dim
 int ON_TextureCoordinates::m_dim
1, 2, or 3
◆ m_T
 ON_SimpleArray<ON_3fPoint> ON_TextureCoordinates::m_T
texture coordinates
◆ m_tag
 ON_MappingTag ON_TextureCoordinates::m_tag