Public Member Functions | Static Public Member Functions | List of all members
ON_MeshThicknessAnalysisVertexIterator Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshThicknessAnalysisVertexIterator ()=default
ON_MeshThicknessAnalysisVertexIterator (const class ON_MeshThicknessAnalysis &mta)
ON_MeshThicknessAnalysisVertexIterator (const ON_MeshThicknessAnalysisVertexIterator &)=default
~ON_MeshThicknessAnalysisVertexIterator ()=default
ON_MeshThicknessAnalysisPoint  | CurrentPoint () const
unsigned int  | CurrentPointIndex () const
ON_MeshThicknessAnalysisPoint  | FirstPoint ()
bool  | GetCurrentPoint (ON_MeshThicknessAnalysisPoint &point) const
bool  | GetFirstPoint (ON_MeshThicknessAnalysisPoint &point)
bool  | GetNextPoint (ON_MeshThicknessAnalysisPoint &point)
unsigned int  | MeshCount () const
ON_MeshThicknessAnalysisPoint  | NextPoint ()
ON_MeshThicknessAnalysisVertexIterator &  | operator= (const ON_MeshThicknessAnalysisVertexIterator &)=default
unsigned int  | PointCount () const
unsigned int  | Reset ()
 Static Public Member Functions
static ON_MeshThicknessAnalysisVertexIterator  | Create (const class ON_MeshThicknessAnalysis &mta)
Constructor & Destructor Documentation
◆ ON_MeshThicknessAnalysisVertexIterator() [1/3]
 ON_MeshThicknessAnalysisVertexIterator::ON_MeshThicknessAnalysisVertexIterator  |  ( |   | )
default
◆ ~ON_MeshThicknessAnalysisVertexIterator()
 ON_MeshThicknessAnalysisVertexIterator::~ON_MeshThicknessAnalysisVertexIterator  |  ( |   | )
default
◆ ON_MeshThicknessAnalysisVertexIterator() [2/3]
 ON_MeshThicknessAnalysisVertexIterator::ON_MeshThicknessAnalysisVertexIterator  |  ( |  const ON_MeshThicknessAnalysisVertexIterator &  |   | )
default
◆ ON_MeshThicknessAnalysisVertexIterator() [3/3]
 ON_MeshThicknessAnalysisVertexIterator::ON_MeshThicknessAnalysisVertexIterator  |  ( |  const class ON_MeshThicknessAnalysis &  |  mta | )
Member Function Documentation
◆ Create()
 static ON_MeshThicknessAnalysisVertexIterator ON_MeshThicknessAnalysisVertexIterator::Create  |  ( |  const class ON_MeshThicknessAnalysis &  |  mta | )
static
◆ CurrentPoint()
 ON_MeshThicknessAnalysisPoint ON_MeshThicknessAnalysisVertexIterator::CurrentPoint  |  ( |   | ) |   const
Returns: Current analysis point. If none are available, then ON_MeshThicknessAnalysisPoint::UnsetPoint is returned.
◆ CurrentPointIndex()
 unsigned int ON_MeshThicknessAnalysisVertexIterator::CurrentPointIndex  |  ( |   | ) |   const
Returns: Zero based index of the current point. ON_UNSET_UINT_INDEX is returned if no point is available.
◆ FirstPoint()
 ON_MeshThicknessAnalysisPoint ON_MeshThicknessAnalysisVertexIterator::FirstPoint  |  ( |   | )
Description: Initializes the iterator and returns the first analysis point (first vertex in first mesh). Returns: First analysis point. If none are available, then ON_MeshThicknessAnalysisPoint::UnsetPoint is returned.
◆ GetCurrentPoint()
 bool ON_MeshThicknessAnalysisVertexIterator::GetCurrentPoint  |  ( |  ON_MeshThicknessAnalysisPoint &  |  point | ) |   const
Description: Does not change the iterator state. Parameters: point - [out] Analysis point returned here. Returns: true: The current point was returned. false: No point is available. Either the ON_MeshThicknessAnalysis has no points or the iterator has run through all of them. point = ON_MeshThicknessAnalysisPoint::UnsetPoint.
◆ GetFirstPoint()
 bool ON_MeshThicknessAnalysisVertexIterator::GetFirstPoint  |  ( |  ON_MeshThicknessAnalysisPoint &  |  point | )
Description: Initializes the iterator and gets the first analysis point (first vertex in first mesh). Parameters: point - [out] Analysis point returned here. Returns: true: point was returned. false: no analysis points are in the ON_MeshThicknessAnalysisVertexIterator. point = ON_MeshThicknessAnalysisPoint::UnsetPoint.
◆ GetNextPoint()
 bool ON_MeshThicknessAnalysisVertexIterator::GetNextPoint  |  ( |  ON_MeshThicknessAnalysisPoint &  |  point | )
Description: Increments the iterator to the next point and gets that point. Parameters: point - [out] Analysis point returned here. Returns: true: point was returned. false: no more analysis points are available. point = ON_MeshThicknessAnalysisPoint::UnsetPoint.
◆ MeshCount()
 unsigned int ON_MeshThicknessAnalysisVertexIterator::MeshCount  |  ( |   | ) |   const
Returns: Number of meshes in the ON_MeshThicknessAnalysis.
◆ NextPoint()
 ON_MeshThicknessAnalysisPoint ON_MeshThicknessAnalysisVertexIterator::NextPoint  |  ( |   | )
Description: Increments the iterator to the next point and returns that point. Returns: Next analysis point. If none are available, then ON_MeshThicknessAnalysisPoint::UnsetPoint is returned.
◆ operator=()
 ON_MeshThicknessAnalysisVertexIterator& ON_MeshThicknessAnalysisVertexIterator::operator=  |  ( |  const ON_MeshThicknessAnalysisVertexIterator &  |   | )
default
◆ PointCount()
 unsigned int ON_MeshThicknessAnalysisVertexIterator::PointCount  |  ( |   | ) |   const
Returns: Total number of points in the ON_MeshThicknessAnalysis.
 This is the sum of the vertex counts from each mesh.
◆ Reset()
 unsigned int ON_MeshThicknessAnalysisVertexIterator::Reset  |  ( |   | )
Description: Resets the iterator so the next call to GetNextPoint() will return the first point. Returns: Number of analysis points in ON_MeshThicknessAnalysis.