Public Member Functions | List of all members
ON_AerialPhotoCameraPosition Class Reference
OpenNURBS
#include <opennurbs_photogrammetry.h>
 Public Member Functions
ON_AerialPhotoCameraPosition ()
bool  | GetLocation (ON_3dPoint &camera_location) const
bool  | GetOrientationAnglesDegrees (double *omega_degrees, double *phi_degrees, double *kappa_degrees) const
bool  | GetOrientationAnglesRadians (double *omega_radians, double *phi_radians, double *kappa_radians) const
bool  | GetOrientationDirection (ON_3dVector &camera_direction) const
bool  | GetOrientationFrame (ON_3dVector &camera_X, ON_3dVector &camera_Y, ON_3dVector &camera_Z) const
bool  | GetOrientationRight (ON_3dVector &camera_right) const
bool  | GetOrientationRotation (ON_Xform &camera_rotaion) const
bool  | GetOrientationUp (ON_3dVector &camera_up) const
bool  | GetUnitSystem (ON_UnitSystem &unit_system) const
bool  | IsSet () const
ON_3dPoint  | Location () const
bool  | LocationIsSet () const
bool  | OrientationIsSet () const
ON_Xform  | OrientationRotation () const
bool  | SetLocation (ON_3dPoint camera_location)
bool  | SetOrientationAnglesDegrees (double omega_degrees, double phi_degrees, double kappa_degrees)
bool  | SetOrientationAnglesRadians (double omega_radians, double phi_radians, double kappa_radians)
bool  | SetOrientationRotation (ON_Xform camera_rotation)
bool  | SetOrientationVectors (ON_3dVector camera_up, ON_3dVector camera_right, ON_3dVector camera_direction)
bool  | SetUnitSystem (ON::LengthUnitSystem unit_system)
bool  | SetUnitSystem (ON_UnitSystem unit_system)
ON_UnitSystem  | UnitSystem () const
bool  | UnitSystemIsSet () const
void  | Unset ()
void  | UnsetLocation ()
void  | UnsetOrientation ()
void  | UnsetUnitSystem ()
Constructor & Destructor Documentation
◆ ON_AerialPhotoCameraPosition()
 ON_AerialPhotoCameraPosition::ON_AerialPhotoCameraPosition  |  ( |   | )
Member Function Documentation
◆ GetLocation()
 bool ON_AerialPhotoCameraPosition::GetLocation  |  ( |  ON_3dPoint &  |  camera_location | ) |   const
◆ GetOrientationAnglesDegrees()
 bool ON_AerialPhotoCameraPosition::GetOrientationAnglesDegrees  |  ( |  double *  |  omega_degrees,
|  double *  |  phi_degrees,
|  double *  |  kappa_degrees
) |   |  const
◆ GetOrientationAnglesRadians()
 bool ON_AerialPhotoCameraPosition::GetOrientationAnglesRadians  |  ( |  double *  |  omega_radians,
|  double *  |  phi_radians,
|  double *  |  kappa_radians
) |   |  const
◆ GetOrientationDirection()
 bool ON_AerialPhotoCameraPosition::GetOrientationDirection  |  ( |  ON_3dVector &  |  camera_direction | ) |   const
◆ GetOrientationFrame()
 bool ON_AerialPhotoCameraPosition::GetOrientationFrame  |  ( |  ON_3dVector &  |  camera_X,
|  ON_3dVector &  |  camera_Y,
|  ON_3dVector &  |  camera_Z
) |   |  const
Description: Get a right handed ortho normal camera frame. Parameters: camera_X - [out] world coordinate unit vector pointing to the right in the camera image camera_Y - [out] world coordinate unit vector in the camera up direction. camera_Z - [out] world coordinate unit vector pointing into the camera (from the image toward the camera).
◆ GetOrientationRight()
 bool ON_AerialPhotoCameraPosition::GetOrientationRight  |  ( |  ON_3dVector &  |  camera_right | ) |   const
◆ GetOrientationRotation()
 bool ON_AerialPhotoCameraPosition::GetOrientationRotation  |  ( |  ON_Xform &  |  camera_rotaion | ) |   const
Returns: A rotation transformation "R" such that camera right = R*ON_3dVector::XAxis camera up = R*ON_3dVector::YAxis camera direction = -R*ON_3dVector::ZAxis
◆ GetOrientationUp()
 bool ON_AerialPhotoCameraPosition::GetOrientationUp  |  ( |  ON_3dVector &  |  camera_up | ) |   const
◆ GetUnitSystem()
 bool ON_AerialPhotoCameraPosition::GetUnitSystem  |  ( |  ON_UnitSystem &  |  unit_system | ) |   const
◆ IsSet()
 bool ON_AerialPhotoCameraPosition::IsSet  |  ( |   | ) |   const
Returns: True if both the location and orientation are set.
◆ Location()
 ON_3dPoint ON_AerialPhotoCameraPosition::Location  |  ( |   | ) |   const
◆ LocationIsSet()
 bool ON_AerialPhotoCameraPosition::LocationIsSet  |  ( |   | ) |   const
Location interface
◆ OrientationIsSet()
 bool ON_AerialPhotoCameraPosition::OrientationIsSet  |  ( |   | ) |   const
Orientation interface
◆ OrientationRotation()
 ON_Xform ON_AerialPhotoCameraPosition::OrientationRotation  |  ( |   | ) |   const
◆ SetLocation()
 bool ON_AerialPhotoCameraPosition::SetLocation  |  ( |  ON_3dPoint  |  camera_location | )
◆ SetOrientationAnglesDegrees()
 bool ON_AerialPhotoCameraPosition::SetOrientationAnglesDegrees  |  ( |  double  |  omega_degrees,
|  double  |  phi_degrees,
|  double  |  kappa_degrees
)
Description: Set camera orientation information from rotation angles in degrees.
Remarks: There are four ways to specify the camera's orientation. 1) Use SetCameraOrientationAnglesRadians() to set camera orientation information from rotation angles in radians. 2) Use SetCameraOrientationAnglesDegrees() to set camera orientation information from rotation angles in degrees. 3) Use SetCameraOrientationVectors() to set camera orientation information from vectors that report the camera's up, right and direction. 3) Use SetCameraOrientationRotation() to set camera orientation information from a rotation matrix. Use the method for which you have the most accurate input and the other values will be calculated as accurately as possible.
◆ SetOrientationAnglesRadians()
 bool ON_AerialPhotoCameraPosition::SetOrientationAnglesRadians  |  ( |  double  |  omega_radians,
|  double  |  phi_radians,
|  double  |  kappa_radians
)
Description: Set camera orientation information from rotation angles in radians.
Remarks: There are four ways to specify the camera's orientation. 1) Use SetOrientationAnglesRadians() to set camera orientation information from rotation angles in radians. 2) Use SetOrientationAnglesDegrees() to set camera orientation information from rotation angles in degrees. 3) Use SetOrientationVectors() to set camera orientation information from vectors that report the camera's up, right and direction. 3) Use SetOrientationRotation() to set camera orientation information from a rotation matrix. Use the method for which you have the most accurate input and the other values will be calculated as accurately as possible.
◆ SetOrientationRotation()
 bool ON_AerialPhotoCameraPosition::SetOrientationRotation  |  ( |  ON_Xform  |  camera_rotation | )
Description: Set camera orientation information from a rotation matrix.
Remarks: There are four ways to specify the camera's orientation. 1) Use SetCameraOrientationAnglesRadians() to set camera orientation information from rotation angles in radians. 2) Use SetCameraOrientationAnglesDegrees() to set camera orientation information from rotation angles in degrees. 3) Use SetCameraOrientationVectors() to set camera orientation information from vectors that report the camera's up, right and direction. 3) Use SetCameraOrientationRotation() to set camera orientation information from a rotation matrix. Use the method for which you have the most accurate input and the other values will be calculated as accurately as possible.
◆ SetOrientationVectors()
 bool ON_AerialPhotoCameraPosition::SetOrientationVectors  |  ( |  ON_3dVector  |  camera_up,
|  ON_3dVector  |  camera_right,
|  ON_3dVector  |  camera_direction
)
Description: Set camera orientation information from up, right and direction vectors.
Remarks: There are four ways to specify the camera's orientation. 1) Use SetCameraOrientationAnglesRadians() to set camera orientation information from rotation angles in radians. 2) Use SetCameraOrientationAnglesDegrees() to set camera orientation information from rotation angles in degrees. 3) Use SetCameraOrientationVectors() to set camera orientation information from vectors that report the camera's up, right and direction. 3) Use SetCameraOrientationRotation() to set camera orientation information from a rotation matrix. Use the method for which you have the most accurate input and the other values will be calculated as accurately as possible.
◆ SetUnitSystem() [1/2]
 bool ON_AerialPhotoCameraPosition::SetUnitSystem  |  ( |  ON::LengthUnitSystem  |  unit_system | )
◆ SetUnitSystem() [2/2]
 bool ON_AerialPhotoCameraPosition::SetUnitSystem  |  ( |  ON_UnitSystem  |  unit_system | )
◆ UnitSystem()
 ON_UnitSystem ON_AerialPhotoCameraPosition::UnitSystem  |  ( |   | ) |   const
◆ UnitSystemIsSet()
 bool ON_AerialPhotoCameraPosition::UnitSystemIsSet  |  ( |   | ) |   const
Camera position unit system
◆ Unset()
 void ON_AerialPhotoCameraPosition::Unset  |  ( |   | )
◆ UnsetLocation()
 void ON_AerialPhotoCameraPosition::UnsetLocation  |  ( |   | )
◆ UnsetOrientation()
 void ON_AerialPhotoCameraPosition::UnsetOrientation  |  ( |   | )
◆ UnsetUnitSystem()
 void ON_AerialPhotoCameraPosition::UnsetUnitSystem  |  ( |   | )