Public Member Functions | Protected Member Functions | List of all members
CRhinoAppUiDockBarManager Class Reference
RhinoUI
#include <RhinoSdkUiLibManagers.h>
 Inheritance diagram for CRhinoAppUiDockBarManager:
 Public Member Functions
CRhinoAppUiDockBarManager ()=default
virtual  | ~CRhinoAppUiDockBarManager ()
class CRhOsnapToolBar *  | GetRhinoOsnapToolBar () const
class CRhSelectionFilterToolBar *  | GetRhinoSelectionFilterToolBar () const
class CRhinoStatusBar *  | GetRhinoStatusBar () const
 Public Member Functions inherited from CRhinoUiDockBarManager
CRhinoUiDockBarManager (void)
~CRhinoUiDockBarManager (void)
void  | CallOnActivateApp (BOOL32 bActive, DWORD dwThreadID)
bool  | CReateDefaultDockBars ()
CRhinoUiDockBar *  | CreateDockBarObject (CRuntimeClass *pRC, UUID plug_in_id) const
bool  | CreateRhinoDockBar (CRhinoUiDockBar *pCB, UUID plug_in_id, bool show_control_bar=true, DWORD default_dock_location=AFX_IDW_DOCKBAR_FLOAT, DWORD dock_style=CBRS_ALIGN_ANY, LPPOINT float_point=NULL, DWORD styles=CBRS_TOOLTIPS|CBRS_SIZE_DYNAMIC|CBRS_TOOLTIPS|CBRS_FLYBY|CBRS_LEFT)
CRhinoUiDockBar *  | CreateRhinoDockBar (CRuntimeClass *pRC, UUID plug_in_id, bool show_control_bar=true, DWORD default_dock_location=AFX_IDW_DOCKBAR_FLOAT, DWORD dock_style=CBRS_ALIGN_ANY, LPPOINT float_point=NULL, DWORD styles=CBRS_TOOLTIPS|CBRS_SIZE_DYNAMIC|CBRS_TOOLTIPS|CBRS_FLYBY|CBRS_LEFT)
void  | DestroyDockBarCollection (void) const
void  | DisableHideOnDeactivate (bool b)
CRhinoUiDockBar *  | DockBar (int index) const
int  | DockBarCount () const
void  | DockDockBar (const CRhinoUiDockBar *dock_bar, UINT dock_location=0, LPCRECT lpRect=NULL)
void  | DockDockBar (int index, UINT dock_location=0, LPCRECT lpRect=NULL)
void  | DockDockBar (UUID uuid, UINT dock_location=0, LPCRECT lpRect=NULL)
bool  | DockingLocationLocked () const
CRhinoUiDockBar *  | FindDockBar (const wchar_t *control_bar_name, int language_id=1033)
CRhinoUiDockBar *  | FindDockBar (UUID uuid) const
void  | FloatDockBar (const CRhinoUiDockBar *dock_bar, CPoint point)
void  | FloatDockBar (int index, CPoint point)
void  | FloatDockBar (UUID uuid, CPoint point)
CRhinoAppAppearanceSettings::command_prompt_position  | GetCommandPromptPosition () const
Gets and set the location of the command prompt dockbar. More...
unsigned int  | GetNextDockBarID ()
void  | GetSortedList (ON_SimpleArray< CRhinoUiDockBar * > &sorted_list, bool ignore_not_created=false) const
bool  | HideOnDeactivateEnabled () const
int  | IndexFromPointer (CRhinoUiDockBar *pCB) const
bool  | InitialMainFrameWindowPos (WINDOWPLACEMENT &wp) const
bool  | IsDockBarVisible (CRhinoUiDockBar *dock_bar) const
bool  | IsDockBarVisible (int index) const
bool  | IsDockBarVisible (UUID uuid) const
void  | LoadToolBarsAndRestoreDockBarPositionAndStates ()
bool  | LockDockingLocation (bool b)
void  | MainFrameOnSize (UINT nType)
bool  | OnCWinAppSaveAllModified (bool bSaveCollections=true)
void  | OnExitInstance ()
CRhinoUiDockBar *  | operator[] (int index) const
bool  | RestoreMainFrameWindowPos ()
CFrameWnd *  | RhinoMainFrame () const
void  | SetCommandPromptPosition (CRhinoAppAppearanceSettings::command_prompt_position position)
bool  | ShowDockBar (const CRhinoUiDockBar *dock_bar, bool show_dock_bar, bool delay_recalc_layout) const
bool  | ShowDockBar (int index, bool show_control_bar, bool delay_recalc_layout) const
bool  | ShowDockBar (UUID uuid, bool show_control_bar, bool delay_recalc_layout) const
void  | Sort (int(*compar)(CRhinoUiDockBar *const *, CRhinoUiDockBar *const *, void *), int(*cull)(const CRhinoUiDockBar *, void *), void *p=0)
RhinoTabbedDockBar::CCollection *  | TabbedDockBarCollection (void) const
bool  | UnhookDeleteAndDestroyDockBar (CRhinoUiDockBar *dock_bar)
bool  | UnhookDeleteAndDestroyDockBar (int dock_bar_index)
bool  | UnhookDeleteAndDestroyDockBar (UUID dock_bar_id)
 Protected Member Functions
bool  | CreateStatusBar (CFrameWnd *pMainFrame) override
bool  | OnCReateDefaultDockBars () override
void  | OnSetDockStateCompleted () override
 Additional Inherited Members
 Static Public Member Functions inherited from CRhinoUiDockBarManager
static int  | CullNotCreatedDockBars (const CRhinoUiDockBar *, void *)
static int  | SortDockBarsByName (CRhinoUiDockBar *const *, CRhinoUiDockBar *const *, void *)
 Public Attributes inherited from CRhinoUiDockBarManager
class CRhDockBarManagerExtension *  | m__control_bar_manager_sdk_extension
Reserved for future use. More...
Detailed Description
End of lines copied to MacHelpers.mm
Constructor & Destructor Documentation
◆ CRhinoAppUiDockBarManager()
 CRhinoAppUiDockBarManager::CRhinoAppUiDockBarManager  |  ( |   | )
default
◆ ~CRhinoAppUiDockBarManager()
 virtual CRhinoAppUiDockBarManager::~CRhinoAppUiDockBarManager  |  ( |   | )
virtual
Member Function Documentation
◆ CreateStatusBar()
 bool CRhinoAppUiDockBarManager::CreateStatusBar  |  ( |  CFrameWnd *  |  pMainFrame | )
overrideprotectedvirtual
Reimplemented from CRhinoUiDockBarManager.
◆ GetRhinoOsnapToolBar()
 class CRhOsnapToolBar* CRhinoAppUiDockBarManager::GetRhinoOsnapToolBar  |  ( |   | ) |   const
◆ GetRhinoSelectionFilterToolBar()
 class CRhSelectionFilterToolBar* CRhinoAppUiDockBarManager::GetRhinoSelectionFilterToolBar  |  ( |   | ) |   const
◆ GetRhinoStatusBar()
 class CRhinoStatusBar* CRhinoAppUiDockBarManager::GetRhinoStatusBar  |  ( |   | ) |   const
◆ OnCReateDefaultDockBars()
 bool CRhinoAppUiDockBarManager::OnCReateDefaultDockBars  |  ( |   | )
overrideprotectedvirtual
Reimplemented from CRhinoUiDockBarManager.
◆ OnSetDockStateCompleted()
 void CRhinoAppUiDockBarManager::OnSetDockStateCompleted  |  ( |   | )
overrideprotectedvirtual
Reimplemented from CRhinoUiDockBarManager.