Public Member Functions | Public Attributes | List of all members
CRhinoGripDirections Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
bool  | IsSet () const
void  | Unset ()
 Public Attributes
ON_3dVector  | m_X
ON_3dVector  | m_Y
ON_3dVector  | m_Z
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Function Documentation
◆ IsSet()
 bool CRhinoGripDirections::IsSet  |  ( |   | ) |   const
◆ Unset()
 void CRhinoGripDirections::Unset  |  ( |   | )
Member Data Documentation
◆ m_X
 ON_3dVector CRhinoGripDirections::m_X
◆ m_Y
 ON_3dVector CRhinoGripDirections::m_Y
◆ m_Z
 ON_3dVector CRhinoGripDirections::m_Z