Public Member Functions | List of all members
CRhRdkCompoundContentImplementor Class Referenceabstract
RDK
#include <RhRdkCompoundContentImplementor.h>
 Inheritance diagram for CRhRdkCompoundContentImplementor:
 Public Member Functions
virtual bool  | DisableLighting (void) const =0
virtual void *  | EVF (const wchar_t *, void *) override=0
virtual UUID  | InterfaceId (void) const final override
virtual bool  | IsBuiltIn (void) const =0
virtual UUID  | Kind (void) const =0
virtual CRhRdkCompoundContentImplementor *  | NewInstance (void) const =0
virtual UUID  | TargetRenderEngineId (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
Renderers implement this interface to provide a means of handling compound content such as blends.
Member Function Documentation
◆ DisableLighting()
 virtual bool CRhRdkCompoundContentImplementor::DisableLighting  |  ( |  void  |   | ) |   const
pure virtual
Implemented in CRhRdkBasicMaterialCCI, and CRhRdkBasicEnvironmentCCI.
◆ EVF()
 virtual void* CRhRdkCompoundContentImplementor::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
overridepure virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
Implemented in CRhRdkBasicMaterialCCI, and CRhRdkBasicEnvironmentCCI.
◆ InterfaceId()
 virtual UUID CRhRdkCompoundContentImplementor::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ IsBuiltIn()
 virtual bool CRhRdkCompoundContentImplementor::IsBuiltIn  |  ( |  void  |   | ) |   const
pure virtual
Implemented in CRhRdkBasicMaterialCCI, and CRhRdkBasicEnvironmentCCI.
◆ Kind()
 virtual UUID CRhRdkCompoundContentImplementor::Kind  |  ( |  void  |   | ) |   const
pure virtual
Returns
The unique id for the kind of CCI.
Implemented in CRhRdkBasicMaterialCCI, and CRhRdkBasicEnvironmentCCI.
◆ NewInstance()
 virtual CRhRdkCompoundContentImplementor* CRhRdkCompoundContentImplementor::NewInstance  |  ( |  void  |   | ) |   const
pure virtual
Returns
A new instance of the same object.
◆ TargetRenderEngineId()
 virtual UUID CRhRdkCompoundContentImplementor::TargetRenderEngineId  |  ( |  void  |   | ) |   const
pure virtual
Returns
The Render Engine Id of target renderer.