Public Member Functions | Friends | List of all members
CRhinoUiOptionsListCtrlPushButton Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlPushButton:
 Public Member Functions
CRhinoUiOptionsListCtrlPushButton (LPCTSTR lpsLabel=NULL, LPCTSTR lpsButtonCaption=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlPushButton ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
afx_msg void  | OnBnClicked ()
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
virtual bool  | OnItemButtonClicked ()
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
void  | SetText (LPCTSTR lps)
 Public Member Functions inherited from CRhinoUiButton
CRhinoUiButton ()
virtual  | ~CRhinoUiButton ()
COLORREF  | ButtonColor () const
bool  | ButtonIsHot () const
void  | DrawButtonBitmap (CDC &dc, CRect r)
bool  | DrawButtonFrame () const
void  | DrawButtonText (CDC &dc, CRect rText)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
CImageList *  | GetImageList (image_list il) const
CSize  | GetImageListImageSize (image_list il) const
int  | GetImageListIndex (image_list il) const
const wchar_t *  | GetToolTipText () const
bool  | IsBitmapButton () const
bool  | IsColorButton () const
bool  | IsMenuButton () const
virtual bool  | OnColorButtonClicked ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
void  | OnCustomMouseButtonDown ()
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
Event handlers. More...
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnMButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnRButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnRButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnTimer (UINT_PTR nIDEvent)
void  | SetButtonColor (COLORREF cr=ON_UNSET_COLOR)
CImageList *  | SetImageList (CImageList *pImageList, image_list il)
int  | SetImageListIndex (int iIndex, image_list il)
bool  | SetIsMenuButton (bool b)
bool  | SetSuppressButtonFrameWhenNotHot (bool b)
void  | SetSuppressTextWhenEnabled (bool b)
void  | SetToolTipText (const wchar_t *lpsTip)
bool  | SuppressButtonFrameWhenNotHot () const
bool  | SuppressTextWhenEnabled () const
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Friends
class  | CRhinoUiButton
 Additional Inherited Members
 Public Types inherited from CRhinoUiButton
enum  | image_list { il_normal = 0, il_disabled, force_32bit_image_list = 0xFFFFFFFF }
enum  | mouse_down_button { mdb_left = 0, mdb_right, mdb_middle }
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Public Attributes inherited from CRhinoUiButton
class CRhUiButtonExtension *  | m__button_sdk_extension
 Static Public Attributes inherited from CRhinoUiButton
static const UINT  | m_on_color_changed_msg_id
static const UINT  | m_on_menu_button_down
static const UINT  | m_on_mouse_button_down
 Protected Types inherited from CRhinoUiButton
enum  | {
 tool_tip_timer = 100, tool_tip_cleanup_timer = 101, tool_tip_cleanup_delay = 500, track_mode_no_track = 0,
 track_mode_no_button_down = 1, track_mode_lbutton_down = 2, track_mode_mbutton_down = 3, track_mode_rbutton_down = 4,
 force_32bit_button = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiButton
void  | EndTracking ()
void  | EndTrackToolTip ()
bool  | MakeOwnerDraw ()
bool  | MouseOkToDisplayToolTip ()
bool  | MouseOverThisButton ()
virtual BOOL32  | OnChildNotify (UINT message, WPARAM wParam, LPARAM lParam, LRESULT *pLResult)
bool  | OnMouseButtonDown (mouse_down_button mdb, UINT nFlags, CPoint point)
bool  | OnMouseButtonUp (mouse_down_button mdb, UINT nFlags, CPoint point)
virtual void  | PreSubclassWindow ()
CWnd overrides. More...
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
bool  | StartTracking ()
bool  | ToolTipIsVisible () const
bool  | TrackToolTip (bool bShow, LPRECT lpR)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
 Protected Attributes inherited from CRhinoUiButton
bool  | m_bIsMenuButton
bool  | m_bSuppressButtonFrameWhenNotHot
bool  | m_bSuppressTextWhenEnabled
COLORREF  | m_crButton
Color button properties. More...
CImageList *  | m_image_list_disabled
int  | m_image_list_disabled_index
CImageList *  | m_image_list_normal
Bitmap button properties. More...
int  | m_image_list_normal_index
CSize  | m_image_size_disabled
CSize  | m_image_size_normal
CRect  | m_rToolTip
int  | m_track_mode
Tooltip. More...
bool  | m_traking_over_button
ON_wString  | m_wToolTip
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
 Static Protected Attributes inherited from CRhinoUiButton
static CRhinoUiToolTip  | m_tooltip
Detailed Description
CRhinoUiOptionsListCtrlPushButton
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlPushButton()
 CRhinoUiOptionsListCtrlPushButton::CRhinoUiOptionsListCtrlPushButton  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsButtonCaption = NULL,
|  int  |  iIndentLevel = 0
)
Description:
Parameters:
Returns:
See Also:
◆ ~CRhinoUiOptionsListCtrlPushButton()
 virtual CRhinoUiOptionsListCtrlPushButton::~CRhinoUiOptionsListCtrlPushButton  |  ( |   | )
virtual
Description:
Parameters:
Returns:
See Also:
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlPushButton::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description:
Parameters:
Returns:
See Also:
Implements CRhinoUiOptionsListCtrlItem.
◆ MoveItemWindow()
 void CRhinoUiOptionsListCtrlPushButton::MoveItemWindow  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit
)
virtual
Description:
Parameters:
Returns:
See Also:
Implements CRhinoUiOptionsListCtrlItem.
◆ OnBnClicked()
 afx_msg void CRhinoUiOptionsListCtrlPushButton::OnBnClicked  |  ( |   | )
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlPushButton::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description:
Parameters:
Returns:
See Also:
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ OnItemButtonClicked()
 virtual bool CRhinoUiOptionsListCtrlPushButton::OnItemButtonClicked  |  ( |   | )
virtual
Description:
Parameters:
Returns:
See Also:
Reimplemented in CRhinoUiOptionsListCtrlColorButton.
◆ OnKillFocus()
 afx_msg void CRhinoUiOptionsListCtrlPushButton::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlPushButton::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ SetText()
 void CRhinoUiOptionsListCtrlPushButton::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: This method is used to set text value for this item. This value is displayed in the right column of the options list control.
Parameters: lps [in] New display text for this item.
See Also: CRhinoUiOptionsListCtrl::Text() CRhinoUiOptionsListCtrl::DrawItemText()
Reimplemented from CRhinoUiOptionsListCtrlItem.
Friends And Related Function Documentation
◆ CRhinoUiButton
 friend class CRhinoUiButton
friend