Public Member Functions | Static Public Attributes | List of all members
ON_MeshFaceList Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshFaceList ()
ON_MeshFaceList (const ON_Mesh *mesh)
unsigned int  | FaceCount () const
size_t  | FaceStride () const
unsigned int  | FaceVertexCount () const
const unsigned int *  | Fvi (unsigned int face_index) const
unsigned int  | GetVertexIndexInterval (unsigned int minimum_valid_vertex_index, unsigned int maximum_valid_vertex_index, unsigned int *minimum_vertex_index, unsigned int *maximum_vertex_index) const
bool  | IsQuad (unsigned int face_index) const
unsigned int *  | QuadFvi (unsigned int face_index, unsigned int buffer[4]) const
unsigned int  | SetFromMesh (const ON_Mesh *mesh)
unsigned int  | SetFromQuadList (size_t quad_count, size_t quad_stride, const unsigned int *quads)
unsigned int  | SetFromTriangleList (size_t triangle_count, size_t triangle_stride, const unsigned int *triangles)
 Static Public Attributes
static const ON_MeshFaceList  | EmptyFaceList
Constructor & Destructor Documentation
◆ ON_MeshFaceList() [1/2]
 ON_MeshFaceList::ON_MeshFaceList  |  ( |   | )
inline
◆ ON_MeshFaceList() [2/2]
 ON_MeshFaceList::ON_MeshFaceList  |  ( |  const ON_Mesh *  |  mesh | )
Member Function Documentation
◆ FaceCount()
 unsigned int ON_MeshFaceList::FaceCount  |  ( |   | ) |   const
inline
◆ FaceStride()
 size_t ON_MeshFaceList::FaceStride  |  ( |   | ) |   const
inline
◆ FaceVertexCount()
 unsigned int ON_MeshFaceList::FaceVertexCount  |  ( |   | ) |   const
inline
◆ Fvi()
 const unsigned int* ON_MeshFaceList::Fvi  |  ( |  unsigned int  |  face_index | ) |   const
inline
◆ GetVertexIndexInterval()
 unsigned int ON_MeshFaceList::GetVertexIndexInterval  |  ( |  unsigned int  |  minimum_valid_vertex_index,
|  unsigned int  |  maximum_valid_vertex_index,
|  unsigned int *  |  minimum_vertex_index,
|  unsigned int *  |  maximum_vertex_index
) |   |  const
Description: Get the minimum and maximum vertex indices referenced by a face in the list. Parameters: minimum_valid_vertex_index - [in] Any face with a vertex index < minimum_valid_vertex_index will be ignored. maximum_valid_vertex_index - [in] Any face with a vertex index > maximum_valid_vertex_index will be ignored. minimum_vertex_index - [out] maximum_vertex_index - [out] If there are no valid faces, then both output values are 0. Returns: Number of valid faces.
◆ IsQuad()
 bool ON_MeshFaceList::IsQuad  |  ( |  unsigned int  |  face_index | ) |   const
inline
◆ QuadFvi()
 unsigned int* ON_MeshFaceList::QuadFvi  |  ( |  unsigned int  |  face_index,
|  unsigned int  |  buffer[4]
) |   |  const
inline
◆ SetFromMesh()
 unsigned int ON_MeshFaceList::SetFromMesh  |  ( |  const ON_Mesh *  |  mesh | )
◆ SetFromQuadList()
 unsigned int ON_MeshFaceList::SetFromQuadList  |  ( |  size_t  |  quad_count,
|  size_t  |  quad_stride,
|  const unsigned int *  |  quads
)
◆ SetFromTriangleList()
 unsigned int ON_MeshFaceList::SetFromTriangleList  |  ( |  size_t  |  triangle_count,
|  size_t  |  triangle_stride,
|  const unsigned int *  |  triangles
)
Member Data Documentation
◆ EmptyFaceList
 const ON_MeshFaceList ON_MeshFaceList::EmptyFaceList
static