Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiColorComboBox Class Reference
RhinoUI
CRhinoUiColorComboBox. More...
#include <RhinoSdkUiColorComboBox.h>
 Inheritance diagram for CRhinoUiColorComboBox:
 Public Member Functions
CRhinoUiColorComboBox ()
virtual  | ~CRhinoUiColorComboBox ()
bool  | AddColorItem (const char *lpsColorName, COLORREF color)
bool  | AddColorItem (const wchar_t *lpsColorName, COLORREF color)
CRhinoUiColorComboBoxItem *  | ItemFromIndex (int nIndex)
void  | SetColorPalette (HPALETTE pal)
 Public Attributes
CObArray  | m_items
 Protected Member Functions
bool  | _AddColorItem (LPCTSTR lpsColorName, COLORREF color)
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
virtual void  | PreSubclassWindow ()
 Protected Attributes
HPALETTE  | m_hPalette
Detailed Description
CRhinoUiColorComboBox.
Constructor & Destructor Documentation
◆ CRhinoUiColorComboBox()
 CRhinoUiColorComboBox::CRhinoUiColorComboBox  |  ( |   | )
◆ ~CRhinoUiColorComboBox()
 virtual CRhinoUiColorComboBox::~CRhinoUiColorComboBox  |  ( |   | )
virtual
Member Function Documentation
◆ _AddColorItem()
 bool CRhinoUiColorComboBox::_AddColorItem  |  ( |  LPCTSTR  |  lpsColorName,
|  COLORREF  |  color
)
protected
◆ AddColorItem() [1/2]
 bool CRhinoUiColorComboBox::AddColorItem  |  ( |  const char *  |  lpsColorName,
|  COLORREF  |  color
)
◆ AddColorItem() [2/2]
 bool CRhinoUiColorComboBox::AddColorItem  |  ( |  const wchar_t *  |  lpsColorName,
|  COLORREF  |  color
)
◆ CompareItem()
 virtual int CRhinoUiColorComboBox::CompareItem  |  ( |  LPCOMPAREITEMSTRUCT  |   | )
protectedvirtual
◆ DrawItem()
 virtual void CRhinoUiColorComboBox::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
protectedvirtual
Reimplemented in CRhinoPlotColorComboBox.
◆ ItemFromIndex()
 CRhinoUiColorComboBoxItem* CRhinoUiColorComboBox::ItemFromIndex  |  ( |  int  |  nIndex | )
◆ PreSubclassWindow()
 virtual void CRhinoUiColorComboBox::PreSubclassWindow  |  ( |   | )
protectedvirtual
Reimplemented in CRhinoObjectColorComboBox, and CRhinoPlotColorComboBox.
◆ SetColorPalette()
 void CRhinoUiColorComboBox::SetColorPalette  |  ( |  HPALETTE  |  pal | )
Member Data Documentation
◆ m_hPalette
 HPALETTE CRhinoUiColorComboBox::m_hPalette
protected
◆ m_items
 CObArray CRhinoUiColorComboBox::m_items