Public Types | Public Member Functions | List of all members
ON_UnicodeTextFile Class Referencefinal
OpenNURBS
#include <opennurbs_file_utilities.h>
 Public Types
enum  | Modes { Modes::Read, Modes::Write }
enum  | Types { Types::Unknown, Types::UTF8, Types::UTF16 }
 Public Member Functions
ON_UnicodeTextFile (const ON_UnicodeTextFile &)=delete
ON_UnicodeTextFile (Types type=Types::Unknown)
~ON_UnicodeTextFile ()
bool  | Close (void)
bool  | Open (const wchar_t *filename, Modes mode)
const ON_UnicodeTextFile &  | operator= (const ON_UnicodeTextFile &)=delete
bool  | ReadString (ON_wString &s)
bool  | WriteString (const wchar_t *s)
Member Enumeration Documentation
◆ Modes
 enum ON_UnicodeTextFile::Modes
strong
Enumerator
Read
Write
◆ Types
 enum ON_UnicodeTextFile::Types
strong
Enumerator
Unknown
UTF8
UTF16
Constructor & Destructor Documentation
◆ ON_UnicodeTextFile() [1/2]
 ON_UnicodeTextFile::ON_UnicodeTextFile  |  ( |  Types  |  type = Types::Unknown | )
◆ ~ON_UnicodeTextFile()
 ON_UnicodeTextFile::~ON_UnicodeTextFile  |  ( |   | )
◆ ON_UnicodeTextFile() [2/2]
 ON_UnicodeTextFile::ON_UnicodeTextFile  |  ( |  const ON_UnicodeTextFile &  |   | )
delete
Member Function Documentation
◆ Close()
 bool ON_UnicodeTextFile::Close  |  ( |  void  |   | )
◆ Open()
 bool ON_UnicodeTextFile::Open  |  ( |  const wchar_t *  |  filename,
|  Modes  |  mode
)
◆ operator=()
 const ON_UnicodeTextFile& ON_UnicodeTextFile::operator=  |  ( |  const ON_UnicodeTextFile &  |   | )
delete
◆ ReadString()
 bool ON_UnicodeTextFile::ReadString  |  ( |  ON_wString &  |  s | )
◆ WriteString()
 bool ON_UnicodeTextFile::WriteString  |  ( |  const wchar_t *  |  s | )