Public Member Functions | List of all members
CRhinoUiUnitSystemComboBox Class Reference
RhinoUI
#include <RhinoSdkUiComboBox.h>
 Inheritance diagram for CRhinoUiUnitSystemComboBox:
 Public Member Functions
CRhinoUiUnitSystemComboBox ()
virtual  | ~CRhinoUiUnitSystemComboBox ()
void  | FillComboBox (bool bIncludeCustomUnits, bool bIncludeNoUnits)
bool  | SetUnitSystem (ON::LengthUnitSystem unit)
ON::LengthUnitSystem  | UnitSystem () const
Detailed Description
Description: The CRhinoUiUnitSystemComboBox control displays a combo box with selectable unit system items. To use this control:
Using the dialog box editor, add a combo box control to your dialog.
Using ClassWizard, create a member variable of type CComboBox for the combo box.
Go to the ClassWizard-generated code and change the type of the variable from CComboBox to CRhinoUiUnitSystemComboBox.
In you dialog's OnInitDialog member, call CRhinoUiUnitSystemComboBox::FillComboBox to fill the combo box with unit system strings.
Call CRhinoUiUnitSystemComboBox::SetUnitSystem to set the unit system.
Call CRhinoUiUnitSystemComboBox::UnitSystem to get the unit system.
Constructor & Destructor Documentation
◆ CRhinoUiUnitSystemComboBox()
 CRhinoUiUnitSystemComboBox::CRhinoUiUnitSystemComboBox  |  ( |   | )
◆ ~CRhinoUiUnitSystemComboBox()
 virtual CRhinoUiUnitSystemComboBox::~CRhinoUiUnitSystemComboBox  |  ( |   | )
virtual
Member Function Documentation
◆ FillComboBox()
 void CRhinoUiUnitSystemComboBox::FillComboBox  |  ( |  bool  |  bIncludeCustomUnits,
|  bool  |  bIncludeNoUnits
)
◆ SetUnitSystem()
 bool CRhinoUiUnitSystemComboBox::SetUnitSystem  |  ( |  ON::LengthUnitSystem  |  unit | )
◆ UnitSystem()
 ON::LengthUnitSystem CRhinoUiUnitSystemComboBox::UnitSystem  |  ( |   | ) |   const