Static Public Member Functions | List of all members
CRhinoWindow Class Reference
Rhino
#include <RhinoSdkPages.h>
 Static Public Member Functions
static void  | MakeChildPage (IRhinoWindow *window, IRhinoWindow *parent)
static void  | MakeChildPage (IRhinoWindow *window, RHINO_WINDOW_HANDLE hwndParent)
static void  | MakeChildPage (RHINO_WINDOW_HANDLE hwnd, RHINO_WINDOW_HANDLE hwndParent)
Detailed Description
class CRhinoWindow
Description: Generic window helpers.
Member Function Documentation
◆ MakeChildPage() [1/3]
 static void CRhinoWindow::MakeChildPage  |  ( |  IRhinoWindow *  |  window,
|  IRhinoWindow *  |  parent
)
static
 Description: Make sure window styles are appropriate when running in Windows, does nothing on Mac.
◆ MakeChildPage() [2/3]
 static void CRhinoWindow::MakeChildPage  |  ( |  IRhinoWindow *  |  window,
|  RHINO_WINDOW_HANDLE  |  hwndParent
)
static
 Description: Make sure window styles are appropriate when running in Windows, does nothing on Mac.
◆ MakeChildPage() [3/3]
 static void CRhinoWindow::MakeChildPage  |  ( |  RHINO_WINDOW_HANDLE  |  hwnd,
|  RHINO_WINDOW_HANDLE  |  hwndParent
)
static
 Description: Make sure window styles are appropriate when running in Windows, does nothing on Mac.