Public Attributes | List of all members
CRhinoDocPageViewGroupTableChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
CRhinoDocPageViewGroupTableChanged::EventType  | m_event_type
The pageview group table event. More...
int  | m_index
The index of the pageview group that was added, deleted, undeleted, or modified. More...
const ON_PageViewGroup *  | m_old_settings
unsigned int  | m_rhino_doc_sn
The serial number of the document which contains the pageview group table. More...
Member Data Documentation
◆ m_event_type
 CRhinoDocPageViewGroupTableChanged::EventType CRhinoDocPageViewGroupTableChanged::CParameters::m_event_type
The pageview group table event.
◆ m_index
 int CRhinoDocPageViewGroupTableChanged::CParameters::m_index
The index of the pageview group that was added, deleted, undeleted, or modified.
◆ m_old_settings
 const ON_PageViewGroup* CRhinoDocPageViewGroupTableChanged::CParameters::m_old_settings
If the event is CRhinoDocPageViewGroupTableChanged::EventType::PageViewGroupModified, then the old section section style. Otherwise, this parameter is nullptr. WARNING: This objects may be deleted at any time after Notify is called. Do not save the pointer and dereference it later.
◆ m_rhino_doc_sn
 unsigned int CRhinoDocPageViewGroupTableChanged::CParameters::m_rhino_doc_sn
The serial number of the document which contains the pageview group table.