Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiFontComboBox Class Reference
Rhino
CRhinoUiFontComboBox. More...
#include <RhinoSkdUiFontComboBox.h>
 Inheritance diagram for CRhinoUiFontComboBox:
 Public Member Functions
CRhinoUiFontComboBox ()
virtual  | ~CRhinoUiFontComboBox ()
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
void  | FillFonts (char *focus)
void  | FillFonts (wchar_t *focus=NULL)
int  | GetFontListIndex (const char *lpsFontFaceName)
int  | GetFontListIndex (const wchar_t *lpsFontFaceName)
LOGFONT *  | GetLogfontFromListIndex (int index)
int  | GetSelFont (LOGFONT &)
bool  | IgnoreZeroTypeFonts () const
virtual void  | MeasureItem (LPMEASUREITEMSTRUCT)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnDestroy ()
bool  | OnlyShowTrueTypeFonts () const
void  | SetHilightColors (COLORREF hilight, COLORREF hilightText)
bool  | SetIgnoreZeroTypeFonts (bool value)
void  | SetNormalColors (COLORREF clrBkgnd, COLORREF clrText)
bool  | SetOnlyShowTrueTypeFonts (bool b)
void  | SetVaries (bool b)
bool  | Varies ()
 Public Attributes
CPtrArray  | m_font_list
 Protected Member Functions
int  | _GetFontListIndex (LPCTSTR lpsFontFaceName)
void  | DrawDefault (LPDRAWITEMSTRUCT)
void  | DrawFont (LPDRAWITEMSTRUCT)
void  | InitFonts ()
 Protected Attributes
bool  | m_bInitOver
bool  | m_bTrueTypeOnly
bool  | m_bVaries
Added varies support 8/2/07 LW. More...
COLORREF  | m_clrBkgnd
COLORREF  | m_clrHilight
COLORREF  | m_clrHilightText
COLORREF  | m_clrNormalText
Detailed Description
CRhinoUiFontComboBox.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiFontComboBox()
 CRhinoUiFontComboBox::CRhinoUiFontComboBox  |  ( |   | )
◆ ~CRhinoUiFontComboBox()
 virtual CRhinoUiFontComboBox::~CRhinoUiFontComboBox  |  ( |   | )
virtual
Member Function Documentation
◆ _GetFontListIndex()
 int CRhinoUiFontComboBox::_GetFontListIndex  |  ( |  LPCTSTR  |  lpsFontFaceName | )
protected
◆ CompareItem()
 virtual int CRhinoUiFontComboBox::CompareItem  |  ( |  LPCOMPAREITEMSTRUCT  |   | )
virtual
◆ DrawDefault()
 void CRhinoUiFontComboBox::DrawDefault  |  ( |  LPDRAWITEMSTRUCT  |   | )
protected
◆ DrawFont()
 void CRhinoUiFontComboBox::DrawFont  |  ( |  LPDRAWITEMSTRUCT  |   | )
protected
◆ DrawItem()
 virtual void CRhinoUiFontComboBox::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
virtual
◆ FillFonts() [1/2]
 void CRhinoUiFontComboBox::FillFonts  |  ( |  char *  |  focus | )
◆ FillFonts() [2/2]
 void CRhinoUiFontComboBox::FillFonts  |  ( |  wchar_t *  |  focus = NULL | )
◆ GetFontListIndex() [1/2]
 int CRhinoUiFontComboBox::GetFontListIndex  |  ( |  const char *  |  lpsFontFaceName | )
◆ GetFontListIndex() [2/2]
 int CRhinoUiFontComboBox::GetFontListIndex  |  ( |  const wchar_t *  |  lpsFontFaceName | )
◆ GetLogfontFromListIndex()
 LOGFONT* CRhinoUiFontComboBox::GetLogfontFromListIndex  |  ( |  int  |  index | )
◆ GetSelFont()
 int CRhinoUiFontComboBox::GetSelFont  |  ( |  LOGFONT &  |   | )
◆ IgnoreZeroTypeFonts()
 bool CRhinoUiFontComboBox::IgnoreZeroTypeFonts  |  ( |   | ) |   const
◆ InitFonts()
 void CRhinoUiFontComboBox::InitFonts  |  ( |   | )
protected
◆ MeasureItem()
 virtual void CRhinoUiFontComboBox::MeasureItem  |  ( |  LPMEASUREITEMSTRUCT  |   | )
virtual
◆ OnCreate()
 afx_msg int CRhinoUiFontComboBox::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnDestroy()
 afx_msg void CRhinoUiFontComboBox::OnDestroy  |  ( |   | )
◆ OnlyShowTrueTypeFonts()
 bool CRhinoUiFontComboBox::OnlyShowTrueTypeFonts  |  ( |   | ) |   const
◆ SetHilightColors()
 void CRhinoUiFontComboBox::SetHilightColors  |  ( |  COLORREF  |  hilight,
|  COLORREF  |  hilightText
)
◆ SetIgnoreZeroTypeFonts()
 bool CRhinoUiFontComboBox::SetIgnoreZeroTypeFonts  |  ( |  bool  |  value | )
◆ SetNormalColors()
 void CRhinoUiFontComboBox::SetNormalColors  |  ( |  COLORREF  |  clrBkgnd,
|  COLORREF  |  clrText
)
◆ SetOnlyShowTrueTypeFonts()
 bool CRhinoUiFontComboBox::SetOnlyShowTrueTypeFonts  |  ( |  bool  |  b | )
◆ SetVaries()
 void CRhinoUiFontComboBox::SetVaries  |  ( |  bool  |  b | )
◆ Varies()
 bool CRhinoUiFontComboBox::Varies  |  ( |   | )
Member Data Documentation
◆ m_bInitOver
 bool CRhinoUiFontComboBox::m_bInitOver
protected
◆ m_bTrueTypeOnly
 bool CRhinoUiFontComboBox::m_bTrueTypeOnly
protected
◆ m_bVaries
 bool CRhinoUiFontComboBox::m_bVaries
protected
Added varies support 8/2/07 LW.
◆ m_clrBkgnd
 COLORREF CRhinoUiFontComboBox::m_clrBkgnd
protected
◆ m_clrHilight
 COLORREF CRhinoUiFontComboBox::m_clrHilight
protected
◆ m_clrHilightText
 COLORREF CRhinoUiFontComboBox::m_clrHilightText
protected
◆ m_clrNormalText
 COLORREF CRhinoUiFontComboBox::m_clrNormalText
protected
◆ m_font_list
 CPtrArray CRhinoUiFontComboBox::m_font_list