Public Member Functions | Protected Attributes | List of all members
CRhinoUiOptionsListCtrlIPAddress Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlIPAddress:
 Public Member Functions
CRhinoUiOptionsListCtrlIPAddress (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlIPAddress ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
DWORD  | IPAddress () const
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
afx_msg void  | OnEnChange ()
virtual bool  | OnEndEdit (LPCTSTR lps) const
afx_msg void  | OnEnKillfocus ()
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
DWORD  | SetIPAddress (DWORD ip)
void  | SetText (LPCTSTR lps)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Protected Attributes
bool  | m_bCancel
DWORD  | m_ip_address
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
 Additional Inherited Members
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
Detailed Description
CRhinoUiOptionsListCtrlIPAddress
Description: IP edit box. See "IP Address Controls" topic in MSDN
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlIPAddress()
 CRhinoUiOptionsListCtrlIPAddress::CRhinoUiOptionsListCtrlIPAddress  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsText = NULL,
|  int  |  iIndentLevel = 0
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
◆ ~CRhinoUiOptionsListCtrlIPAddress()
 virtual CRhinoUiOptionsListCtrlIPAddress::~CRhinoUiOptionsListCtrlIPAddress  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlIPAddress::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description: CRhinoUiOptionsListCtrlItem virtual override
IP edit box. See "IP Address Controls" topic in MSDN /// Microsoft® Internet Explorer Version 4.0 introduces the IP address control, a new control similar to an edit control that allows the user to enter a numeric address in Internet protocol (IP) format. This format consists of four three-digit fields. Each field is treated individually; the field numbers are zero-based and proceed from left to right as shown in this figure. Field 0 | Field 1 | | Field 2 | | | Field 3 | | | | 255 .255 .255 .0
Parameters: See CRhinoUiOptionsListCtrlItem::BeginEditItem()
Returns: Returns true if IP edit box was successfully created; otherwise false.
See Also: "IP Address Controls" topic in MSDN CRhinoUiOptionsListCtrlEditBox::BeginEditItem()
Implements CRhinoUiOptionsListCtrlItem.
◆ IPAddress()
 DWORD CRhinoUiOptionsListCtrlIPAddress::IPAddress  |  ( |   | ) |   const
Description: Get the last valid IP address input.
Returns: Returns a long value which identifies the IP address. The field 3 value will be contained in bits 0 through 7. The field 2 value will be contained in bits 8 through 15. The field 1 value will be contained in bits 16 through 23. The field 0 value will be contained in bits 24 through 31. The FIRST_IPADDRESS, SECOND_IPADDRESS, THIRD_IPADDRESS, and FOURTH_IPADDRESS macros can also be used to extract the address information. Zero will be returned as the address for any blank fields.
See Also: CRhinoUiOptionsListCtrlItem::OnEndEdit() CRhinoUiOptionsListCtrlIPAddress::SetIPAddress() FIRST_IPADDRESS SECOND_IPADDRESS THIRD_IPADDRESS FOURTH_IPADDRESS
◆ MoveItemWindow()
 void CRhinoUiOptionsListCtrlIPAddress::MoveItemWindow  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit
)
virtual
Description: CRhinoUiOptionsListCtrlItem::OnEndEdit() override.
Adjust the IP controls size and position as necessary if the options list controls size is changed while the control is visible.
Parameters: See See CRhinoUiOptionsListCtrlItem::MoveItemWindow()
See Also: CRhinoUiOptionsListCtrlItem::MoveItemWindow()
Implements CRhinoUiOptionsListCtrlItem.
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlIPAddress::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description: CRhinoUiOptionsListCtrlItem override.
Parameters: See CRhinoUiOptionsListCtrlItem::OnDrawItem()
See Also: CRhinoUiOptionsListCtrlItem::OnDrawItem()
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ OnEnChange()
 afx_msg void CRhinoUiOptionsListCtrlIPAddress::OnEnChange  |  ( |   | )
◆ OnEndEdit()
 virtual bool CRhinoUiOptionsListCtrlIPAddress::OnEndEdit  |  ( |  LPCTSTR  |  lps | ) |   const
virtual
Description: CRhinoUiOptionsListCtrlItem::OnEndEdit() override.
Parameters: See CRhinoUiOptionsListCtrlItem::OnEndEdit()
Returns: Returns true since the IP control validates input as it is made.
See Also: CRhinoUiOptionsListCtrlItem::OnEndEdit()
◆ OnEnKillfocus()
 afx_msg void CRhinoUiOptionsListCtrlIPAddress::OnEnKillfocus  |  ( |   | )
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlIPAddress::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiOptionsListCtrlIPAddress::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ SetIPAddress()
 DWORD CRhinoUiOptionsListCtrlIPAddress::SetIPAddress  |  ( |  DWORD  |  ip | )
Description: Sets the address values for all four fields in the IP address control.
Parameters: ip [in] Value that contains the new address. The field 3 value is contained in bits 0 through 7. The field 2 value is contained in bits 8 through 15. The field 1 value is contained in bits 16 through 23. The field 0 value is contained in bits 24 through 31. The MAKEIPADDRESS macro can also be used to create the address information.
Returns: Returns previous value.
See Also: CRhinoUiOptionsListCtrlIPAddress::IPAddress() IPM_SETADDRESS window message MAKEIPADDRESS macro
◆ SetText()
 void CRhinoUiOptionsListCtrlIPAddress::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: This method is used to set text value for this item. This value is displayed in the right column of the options list control.
Parameters: lps [in] New display text for this item.
See Also: CRhinoUiOptionsListCtrl::Text() CRhinoUiOptionsListCtrl::DrawItemText()
Reimplemented from CRhinoUiOptionsListCtrlItem.
Member Data Documentation
◆ m_bCancel
 bool CRhinoUiOptionsListCtrlIPAddress::m_bCancel
protected
◆ m_ip_address
 DWORD CRhinoUiOptionsListCtrlIPAddress::m_ip_address
protected