Public Member Functions | Public Attributes | List of all members
ON_MeshIntersectionCache Class Reference
OpenNURBS
Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change. More...
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshIntersectionCache ()
~ON_MeshIntersectionCache ()
ON_BoundingBox  | GetBoundingBox (const ON_SimpleArray< const ON_Mesh * > &meshes)
if you request a boundingbox in the cache, then [meshes] must be exactly the same ones used later or earlier in the intersection code More...
 Public Attributes
ON_MeshIntersectionCacheImplementation *  | m_impl
Detailed Description
Provides a mechanism for lazily evaluating mesh data. The implementation is private and subject to change.
Constructor & Destructor Documentation
◆ ON_MeshIntersectionCache()
 ON_MeshIntersectionCache::ON_MeshIntersectionCache  |  ( |   | )
◆ ~ON_MeshIntersectionCache()
 ON_MeshIntersectionCache::~ON_MeshIntersectionCache  |  ( |   | )
Member Function Documentation
◆ GetBoundingBox()
 ON_BoundingBox ON_MeshIntersectionCache::GetBoundingBox  |  ( |  const ON_SimpleArray< const ON_Mesh * > &  |  meshes | )
if you request a boundingbox in the cache, then [meshes] must be exactly the same ones used later or earlier in the intersection code
Member Data Documentation
◆ m_impl
 ON_MeshIntersectionCacheImplementation* ON_MeshIntersectionCache::m_impl