Public Member Functions | List of all members
ON_TextLogLevelOfDetail Class Reference
OpenNURBS
#include <opennurbs_textlog.h>
 Public Member Functions
ON_TextLogLevelOfDetail (class ON_TextLog &text_log, int delta_lod)
ON_TextLogLevelOfDetail (class ON_TextLog &text_log, ON_TextLog::LevelOfDetail level_of_detail)
The constructor saves the current level of detail and then sets the level of detail to level_of_detail. More...
~ON_TextLogLevelOfDetail ()
The destructor restores the level ot detail the saved value. More...
ON_TextLog::LevelOfDetail  | SavedLevelOfDetail () const
Detailed Description
Description: ON_TextLogLevelOfDetail is a class used with ON_TextLog to push and pop level of detail.
Constructor & Destructor Documentation
◆ ON_TextLogLevelOfDetail() [1/2]
 ON_TextLogLevelOfDetail::ON_TextLogLevelOfDetail  |  ( |  class ON_TextLog &  |  text_log,
|  ON_TextLog::LevelOfDetail  |  level_of_detail
)
The constructor saves the current level of detail and then sets the level of detail to level_of_detail.
◆ ON_TextLogLevelOfDetail() [2/2]
 ON_TextLogLevelOfDetail::ON_TextLogLevelOfDetail  |  ( |  class ON_TextLog &  |  text_log,
|  int  |  delta_lod
)
Parameters
text_log
delta_lod | Amount to change the level of detail. +1 increases the level of detail by a single level. -1 decreases the level of detail by a single level.
◆ ~ON_TextLogLevelOfDetail()
 ON_TextLogLevelOfDetail::~ON_TextLogLevelOfDetail  |  ( |   | )
The destructor restores the level ot detail the saved value.
Member Function Documentation
◆ SavedLevelOfDetail()
 ON_TextLog::LevelOfDetail ON_TextLogLevelOfDetail::SavedLevelOfDetail  |  ( |   | ) |   const
Returns: Level of detail the text log had when the constructor was called.