Public Types | Public Member Functions | List of all members
ON_RenderChannels Class Reference
OpenNURBS
#include <opennurbs_render_channels.h>
 Public Types
enum  | Modes : unsigned int { Modes::Automatic, Modes::Custom }
 Public Member Functions
ON_RenderChannels ()
ON_RenderChannels (const ON_RenderChannels &rch)
ON_RenderChannels (ON_XMLNode &model_node)
virtual  | ~ON_RenderChannels ()
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual void  | GetCustomList (ON_SimpleArray< ON_UUID > &chan) const
virtual Modes  | Mode (void) const
Get the mode. More...
virtual void  | OnInternalXmlChanged (const ON_RenderChannels *)
For internal use only. More...
virtual bool  | operator!= (const ON_RenderChannels &rch) const
virtual const ON_RenderChannels &  | operator= (const ON_RenderChannels &rch)
virtual bool  | operator== (const ON_RenderChannels &rch) const
virtual void  | SetCustomList (const ON_SimpleArray< ON_UUID > &chan)
virtual void  | SetMode (Modes m)
Set the mode. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Enumeration Documentation
◆ Modes
 enum ON_RenderChannels::Modes : unsigned int
strong
Enumerator
Automatic
Custom
Constructor & Destructor Documentation
◆ ON_RenderChannels() [1/3]
 ON_RenderChannels::ON_RenderChannels  |  ( |   | )
◆ ON_RenderChannels() [2/3]
 ON_RenderChannels::ON_RenderChannels  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_RenderChannels() [3/3]
 ON_RenderChannels::ON_RenderChannels  |  ( |  const ON_RenderChannels &  |  rch | )
◆ ~ON_RenderChannels()
 virtual ON_RenderChannels::~ON_RenderChannels  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* ON_RenderChannels::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ GetCustomList()
 virtual void ON_RenderChannels::GetCustomList  |  ( |  ON_SimpleArray< ON_UUID > &  |  chan | ) |   const
virtual
Get the list of channels to render when in 'custom' mode.
'chan' accepts the channel ids. *‍/
◆ Mode()
 virtual Modes ON_RenderChannels::Mode  |  ( |  void  |   | ) |   const
virtual
Get the mode.
◆ OnInternalXmlChanged()
 virtual void ON_RenderChannels::OnInternalXmlChanged  |  ( |  const ON_RenderChannels *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_RenderChannels::operator!=  |  ( |  const ON_RenderChannels &  |  rch | ) |   const
virtual
◆ operator=()
 virtual const ON_RenderChannels& ON_RenderChannels::operator=  |  ( |  const ON_RenderChannels &  |  rch | )
virtual
◆ operator==()
 virtual bool ON_RenderChannels::operator==  |  ( |  const ON_RenderChannels &  |  rch | ) |   const
virtual
◆ SetCustomList()
 virtual void ON_RenderChannels::SetCustomList  |  ( |  const ON_SimpleArray< ON_UUID > &  |  chan | )
virtual
Set the list of channels to render when in 'custom' mode.
'chan' contains the channel ids.
◆ SetMode()
 virtual void ON_RenderChannels::SetMode  |  ( |  Modes  |  m | )
virtual
Set the mode.