Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiGridListEdit Class Reference
RhinoUI
CRhinoUiGridListEdit. More...
#include <RhinoSdkUiGridListEdit.h>
 Inheritance diagram for CRhinoUiGridListEdit:
 Public Member Functions
CRhinoUiGridListEdit ()
virtual  | ~CRhinoUiGridListEdit ()
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnWindowPosChanging (WINDOWPOS *lpwndpos)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
 Public Attributes
int  | m_cx
int  | m_cy
int  | m_x
int  | m_y
 Protected Member Functions
class CRhinoUiGridListCtrl *  | GetGridListCtrl ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
UINT  | m_nChar
UINT  | m_nFlags
UINT  | m_nRepCnt
Detailed Description
CRhinoUiGridListEdit.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiGridListEdit()
 CRhinoUiGridListEdit::CRhinoUiGridListEdit  |  ( |   | )
◆ ~CRhinoUiGridListEdit()
 virtual CRhinoUiGridListEdit::~CRhinoUiGridListEdit  |  ( |   | )
virtual
Member Function Documentation
◆ GetGridListCtrl()
 class CRhinoUiGridListCtrl* CRhinoUiGridListEdit::GetGridListCtrl  |  ( |   | )
protected
◆ OnKeyDown()
 afx_msg void CRhinoUiGridListEdit::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnWindowPosChanging()
 afx_msg void CRhinoUiGridListEdit::OnWindowPosChanging  |  ( |  WINDOWPOS *  |  lpwndpos | )
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiGridListEdit::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ WindowProc()
 virtual LRESULT CRhinoUiGridListEdit::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protectedvirtual
Member Data Documentation
◆ m_cx
 int CRhinoUiGridListEdit::m_cx
◆ m_cy
 int CRhinoUiGridListEdit::m_cy
◆ m_nChar
 UINT CRhinoUiGridListEdit::m_nChar
protected
◆ m_nFlags
 UINT CRhinoUiGridListEdit::m_nFlags
protected
◆ m_nRepCnt
 UINT CRhinoUiGridListEdit::m_nRepCnt
protected
◆ m_x
 int CRhinoUiGridListEdit::m_x
◆ m_y
 int CRhinoUiGridListEdit::m_y