Public Member Functions | List of all members
ON_TensorProduct Class Referenceabstract
OpenNURBS
#include <opennurbs_nurbssurface.h>
 Public Member Functions
ON_TensorProduct ()
Pure virtual tensor passed to ON_NurbsSurface::TensorProduct() More...
virtual  | ~ON_TensorProduct ()
virtual int  | DimensionA () const =0
dimension of A space More...
virtual int  | DimensionB () const =0
dimension of B space More...
virtual int  | DimensionC () const =0
dimension of range space More...
virtual bool  | Evaluate (double, const double *, double, const double *, double *)=0
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Definition of NURBS surface
Constructor & Destructor Documentation
◆ ON_TensorProduct()
 ON_TensorProduct::ON_TensorProduct  |  ( |   | )
Pure virtual tensor passed to ON_NurbsSurface::TensorProduct()
◆ ~ON_TensorProduct()
 virtual ON_TensorProduct::~ON_TensorProduct  |  ( |   | )
virtual
Member Function Documentation
◆ DimensionA()
 virtual int ON_TensorProduct::DimensionA  |  ( |   | ) |   const
pure virtual
dimension of A space
Evaluate() must define a function T:R^dimA X R^dimB -> R^Dimension() such that
     T(a*A0 + (1-a)*A1, B) = a*T(A0,B) + (1-a)*T(A1,B) and
     T(A, b*B0 + (1-b)*B1) = b*T(A,B0) + (1-b)*T(A,B1).
◆ DimensionB()
 virtual int ON_TensorProduct::DimensionB  |  ( |   | ) |   const
pure virtual
dimension of B space
◆ DimensionC()
 virtual int ON_TensorProduct::DimensionC  |  ( |   | ) |   const
pure virtual
dimension of range space
◆ Evaluate()
 virtual bool ON_TensorProduct::Evaluate  |  ( |  double  |  ,
|  const double *  |  ,
|  double  |  ,
|  const double *  |  ,
|  double *
)
pure virtual