Public Member Functions | Public Attributes | List of all members
CRhinoInstanceObjectPiece Class Reference
Rhino
#include <rhinoSdkInstance.h>
 Public Member Functions
CRhinoInstanceObjectPiece ()
 Public Attributes
ON_3dmObjectAttributes  | m_atts
attributes to apply More...
const CRhinoObject *  | m_object
part of document - do NOT modify More...
ON_Xform  | m_xform
use default destructor, copy constructor, and operator= More...
Detailed Description
Description: CRhinoInstanceObject::Explode uses CRhinoInstanceObjectPiece to return the pieces.
Constructor & Destructor Documentation
◆ CRhinoInstanceObjectPiece()
 CRhinoInstanceObjectPiece::CRhinoInstanceObjectPiece  |  ( |   | )
Member Data Documentation
◆ m_atts
 ON_3dmObjectAttributes CRhinoInstanceObjectPiece::m_atts
attributes to apply
◆ m_object
 const CRhinoObject* CRhinoInstanceObjectPiece::m_object
part of document - do NOT modify
◆ m_xform
 ON_Xform CRhinoInstanceObjectPiece::m_xform
use default destructor, copy constructor, and operator=
transformation to apply