Public Member Functions | Public Attributes | List of all members
ON_SurfaceProperties Class Reference
OpenNURBS
#include <opennurbs_surface.h>
 Public Member Functions
ON_SurfaceProperties ()
Surface properties. More...
void  | Set (const ON_Surface *surface)
 Public Attributes
bool  | m_bHasSeam
true if at least one m_bClosed[] setting is true. More...
bool  | m_bHasSingularity
true if at least one m_bSingular[] setting is true. More...
bool  | m_bIsClosed [2]
m_bClosed[i] = ON_Surface::IsClosed(i) More...
bool  | m_bIsSet
True if Set() has been called with a non-null surface. More...
bool  | m_bIsSingular [4]
m_bSingular[i] = ON_Surface::IsSingular(i) More...
ON_Interval  | m_domain [2]
m_domain[i] = ON_Surface.Domain(i) More...
const ON_Surface *  | m_surface
Last pointer passed to ON_SurfaceProperties::Set(). More...
ON__INT_PTR  | m_tag
Constructor & Destructor Documentation
◆ ON_SurfaceProperties()
 ON_SurfaceProperties::ON_SurfaceProperties  |  ( |   | )
Surface properties.
The constructor sets all fields to zero.
Member Function Documentation
◆ Set()
 void ON_SurfaceProperties::Set  |  ( |  const ON_Surface *  |  surface | )
Parameters: surface - [in] If surface is not null, then it is used to set the surface properties. If surface is null, then all surface properties are set to zero. Remarks: Does not modify the value of m_tag.
Member Data Documentation
◆ m_bHasSeam
 bool ON_SurfaceProperties::m_bHasSeam
true if at least one m_bClosed[] setting is true.
◆ m_bHasSingularity
 bool ON_SurfaceProperties::m_bHasSingularity
true if at least one m_bSingular[] setting is true.
◆ m_bIsClosed
 bool ON_SurfaceProperties::m_bIsClosed[2]
m_bClosed[i] = ON_Surface::IsClosed(i)
◆ m_bIsSet
 bool ON_SurfaceProperties::m_bIsSet
True if Set() has been called with a non-null surface.
◆ m_bIsSingular
 bool ON_SurfaceProperties::m_bIsSingular[4]
m_bSingular[i] = ON_Surface::IsSingular(i)
◆ m_domain
 ON_Interval ON_SurfaceProperties::m_domain[2]
m_domain[i] = ON_Surface.Domain(i)
◆ m_surface
 const ON_Surface* ON_SurfaceProperties::m_surface
Last pointer passed to ON_SurfaceProperties::Set().
◆ m_tag
 ON__INT_PTR ON_SurfaceProperties::m_tag
The constructor sets this value to zero. Nothing in opennurbs modifies or uses this value.