Public Member Functions | List of all members
CRhRdkMarkedObjects Class Reference
RDK
#include <RhRdkMarkedObjects.h>
 Inheritance diagram for CRhRdkMarkedObjects:
 Public Member Functions
CRhRdkMarkedObjects ()
CRhRdkMarkedObjects (CRhinoDoc &doc)
virtual  | ~CRhRdkMarkedObjects ()
virtual bool  | Edit (const ON_wString &sIncludeListCaption, const ON_wString &sExcludeListCaption, bool &bIsExcludeListInOut, bool bAllowChangeIncExc)
virtual bool  | Pick (bool bPreserveSelection, const ON_wString &sPrompt)
CRhinoDoc *  | RhinoDoc (void) const
virtual void  | SetIteratorObjectTypes (UINT uTypes)
virtual void  | SetObjectCategory (CRhinoObjectIterator::object_category c)
virtual void  | SetObjectState (CRhinoObjectIterator::object_state s)
 Public Member Functions inherited from CRhRdkUuidCollection
CRhRdkUuidCollection ()
CRhRdkUuidCollection (const CRhRdkUuidCollection &c)
virtual  | ~CRhRdkUuidCollection ()
virtual void  | Add (const UUID &uuid)
virtual void  | Clear (void)
virtual bool  | Contains (const UUID &uuid) const
virtual int  | Count (void) const
virtual void  | DebugDump (void)
virtual ON_wString  | GetSemicolonDelimitedString (void) const
virtual bool  | IsEmpty (void) const
virtual bool  | Next (UUID &uuidOut) const
const CRhRdkUuidCollection &  | operator= (const CRhRdkUuidCollection &c)
virtual void  | Remove (const UUID &uuid)
virtual void  | ResetIterator (void)
virtual bool  | SetSemicolonDelimitedString (const ON_wString &sUuidList)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class provides a collection of objects that are marked in some way. The existence of the object's UUID in the collection makes the object 'marked'. This can be used for exclusion lists and so on.
Constructor & Destructor Documentation
◆ CRhRdkMarkedObjects() [1/2]
 CRhRdkMarkedObjects::CRhRdkMarkedObjects  |  ( |   | )
DEPRECATED: DO NOT USE. No document context.
◆ CRhRdkMarkedObjects() [2/2]
 CRhRdkMarkedObjects::CRhRdkMarkedObjects  |  ( |  CRhinoDoc &  |  doc | )
Uses supplied Rhino doc.
◆ ~CRhRdkMarkedObjects()
 virtual CRhRdkMarkedObjects::~CRhRdkMarkedObjects  |  ( |   | )
virtual
Member Function Documentation
◆ Edit()
 virtual bool CRhRdkMarkedObjects::Edit  |  ( |  const ON_wString &  |  sIncludeListCaption,
|  const ON_wString &  |  sExcludeListCaption,
|  bool &  |  bIsExcludeListInOut,
|  bool  |  bAllowChangeIncExc
)
virtual
Edit the collection using a modal dialog.
Parameters
sIncludeListCaption | is the caption used when bIsExcludeList is false.
sExcludeListCaption | is the caption used when bIsExcludeList is true.
bIsExcludeListInOut | is true if editing a list of excluded objects or false if editing a list of included objects. After the user has finished editing the list, this parameter is updated to reflect any change.
bAllowChangeIncExc | is true to allow the user to change from 'exclude' to 'include'.
STARTING WITH RHINO 8, THIS METHOD IS DEPRECATED AND DOES NOT WORK. See [DEPCTL]
Note
This function requires the RDK UI plug-in to be loaded.
Returns
true if the user clicked OK, else false.
◆ Pick()
 virtual bool CRhRdkMarkedObjects::Pick  |  ( |  bool  |  bPreserveSelection,
|  const ON_wString &  |  sPrompt
)
virtual
Pick objects in the Rhino viewport.
Parameters
sPrompt | is the prompt to display on the Rhino command line.
Returns
true if the pick succeeded, else false.
◆ RhinoDoc()
 CRhinoDoc* CRhRdkMarkedObjects::RhinoDoc  |  ( |  void  |   | ) |   const
Gets the document, if the object was constructed with one, or null if not.
◆ SetIteratorObjectTypes()
 virtual void CRhRdkMarkedObjects::SetIteratorObjectTypes  |  ( |  UINT  |  uTypes | )
virtual
Set the object types for the Rhino object iterator used in Edit() and Pick(). By default, all types except ON::detail_object, ON::phantom_object and ON::clipplane_object are considered. Call this method to allow other kinds of objects to be considered for picking and display.
Parameters
uTypes | is a combination of bit flags from the ON::object_type enum.
◆ SetObjectCategory()
 virtual void CRhRdkMarkedObjects::SetObjectCategory  |  ( |  CRhinoObjectIterator::object_category  |  c | )
virtual
Set the object category for the Rhino object iterator used in Edit() and Pick(). The default is CRhinoObjectIterator::active_and_reference_objects.
◆ SetObjectState()
 virtual void CRhRdkMarkedObjects::SetObjectState  |  ( |  CRhinoObjectIterator::object_state  |  s | )
virtual
Set the object state for the Rhino object iterator used in Edit() and Pick(). The default is CRhinoObjectIterator::undeleted_objects.