Public Attributes | List of all members
ON_SquishConstraint Class Reference
OpenNURBS
#include <opennurbs_plus_squish.h>
 Public Attributes
unsigned int  | m_constraint_type
double  | m_v [4]
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Data Documentation
◆ m_constraint_type
 unsigned int ON_SquishConstraint::m_constraint_type
0 = none 1 = 2d point: (m_v[0],m_v[1]) 2 = 2d line: 0 = m_v[0]*x + m_v[1]*y + m_v[2]
◆ m_v
 double ON_SquishConstraint::m_v[4]