Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | Friends | List of all members
CRhinoUiPaintColorSettings Class Reference
Rhino
Colors for the general windows user interface elements. More...
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoUiPaintColorSettings ()
CRhinoUiPaintColorSettings (const CRhinoUiPaintColorSettings &)
~CRhinoUiPaintColorSettings ()
void  | Defaults ()
ON_Color  | EditBoxBackground () const
Background fill for input elements (edit box, checkbox). More...
ON_Color  | EditBoxBackground (bool computeIfUnset) const
ON_Color  | GridLineColor (bool onEditBackground) const
void  | LoadProfile (CRhinoProfileContext &pc)
ON_Color  | ModifiedValueControlColor () const
Modified property value label text color. More...
bool  | operator!= (const CRhinoUiPaintColorSettings &) const
CRhinoUiPaintColorSettings &  | operator= (const CRhinoUiPaintColorSettings &)
bool  | operator== (const CRhinoUiPaintColorSettings &) const
bool  | RunningInDarkMode () const
Returns true if Rhino is running in dark-theme mode. More...
void  | SaveProfile (CRhinoProfileContext &) const
void  | SetEditBoxBackground (const ON_Color &color)
void  | SetTabBackground (const ON_Color &color)
void  | SetTabBackground (const ON_Color &color, bool activeTab)
ON_Color  | TabBackground () const
Tab background color. More...
ON_Color  | TabBackground (bool activeTab, bool computeIfUnset) const
void  | Validate ()
 Static Public Member Functions
static const wchar_t *  | ProfileKey ()
 Public Attributes
ON_Color  | m_active_caption
Active floating window non-client area. More...
ON_Color  | m_active_viewport_title
Active viewport title. More...
ON_Color  | m_hot_border
Inactive toolbar tab border. More...
ON_Color  | m_hot_end
Gradient end for inactive toolbar tab. More...
ON_Color  | m_hot_start
Gradient start for inactive toolbar tab. More...
ON_Color  | m_inactive_caption
Inactive floating window non-client area. More...
ON_Color  | m_inactive_viewport_title
Inactive viewport title. More...
ON_Color  | m_mouse_overcontrol_border
Active floating window non-client area. More...
ON_Color  | m_mouse_overcontrol_end
Color for hovering gradient end. More...
ON_Color  | m_mouse_overcontrol_start
Color for hovering gradient start. More...
ON_Color  | m_normal_border
Edge color used for grippers, toolbar border, resize bars, status bar pane borders. More...
ON_Color  | m_normal_end
Gradient end for active toolbar tab and non-client area of Rhino. More...
ON_Color  | m_normal_start
Gradient start for active toolbar tab and non-client area of Rhino. More...
ON_Color  | m_pressed_border
Pressed border. More...
ON_Color  | m_pressed_end
Pressed gradient end. More...
ON_Color  | m_pressed_start
Pressed gradient start. More...
ON_Color  | m_text_disabled
Disabled text color. More...
ON_Color  | m_text_enabled
Toolbar tab text and status bar text. More...
 Static Public Attributes
static const CRhinoUiPaintColorSettings  | Default
 Friends
class  | CRhDefaultColors
Detailed Description
Colors for the general windows user interface elements.
Constructor & Destructor Documentation
◆ CRhinoUiPaintColorSettings() [1/2]
 CRhinoUiPaintColorSettings::CRhinoUiPaintColorSettings  |  ( |   | )
◆ ~CRhinoUiPaintColorSettings()
 CRhinoUiPaintColorSettings::~CRhinoUiPaintColorSettings  |  ( |   | )
◆ CRhinoUiPaintColorSettings() [2/2]
 CRhinoUiPaintColorSettings::CRhinoUiPaintColorSettings  |  ( |  const CRhinoUiPaintColorSettings &  |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoUiPaintColorSettings::Defaults  |  ( |   | )
◆ EditBoxBackground() [1/2]
 ON_Color CRhinoUiPaintColorSettings::EditBoxBackground  |  ( |   | ) |   const
Background fill for input elements (edit box, checkbox).
◆ EditBoxBackground() [2/2]
 ON_Color CRhinoUiPaintColorSettings::EditBoxBackground  |  ( |  bool  |  computeIfUnset | ) |   const
◆ GridLineColor()
 ON_Color CRhinoUiPaintColorSettings::GridLineColor  |  ( |  bool  |  onEditBackground | ) |   const
◆ LoadProfile()
 void CRhinoUiPaintColorSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ ModifiedValueControlColor()
 ON_Color CRhinoUiPaintColorSettings::ModifiedValueControlColor  |  ( |   | ) |   const
Modified property value label text color.
◆ operator!=()
 bool CRhinoUiPaintColorSettings::operator!=  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ operator=()
 CRhinoUiPaintColorSettings& CRhinoUiPaintColorSettings::operator=  |  ( |  const CRhinoUiPaintColorSettings &  |   | )
◆ operator==()
 bool CRhinoUiPaintColorSettings::operator==  |  ( |  const CRhinoUiPaintColorSettings &  |   | ) |   const
◆ ProfileKey()
 static const wchar_t* CRhinoUiPaintColorSettings::ProfileKey  |  ( |   | )
static
◆ RunningInDarkMode()
 bool CRhinoUiPaintColorSettings::RunningInDarkMode  |  ( |   | ) |   const
Returns true if Rhino is running in dark-theme mode.
◆ SaveProfile()
 void CRhinoUiPaintColorSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ SetEditBoxBackground()
 void CRhinoUiPaintColorSettings::SetEditBoxBackground  |  ( |  const ON_Color &  |  color | )
◆ SetTabBackground() [1/2]
 void CRhinoUiPaintColorSettings::SetTabBackground  |  ( |  const ON_Color &  |  color | )
◆ SetTabBackground() [2/2]
 void CRhinoUiPaintColorSettings::SetTabBackground  |  ( |  const ON_Color &  |  color,
|  bool  |  activeTab
)
◆ TabBackground() [1/2]
 ON_Color CRhinoUiPaintColorSettings::TabBackground  |  ( |   | ) |   const
Tab background color.
◆ TabBackground() [2/2]
 ON_Color CRhinoUiPaintColorSettings::TabBackground  |  ( |  bool  |  activeTab,
|  bool  |  computeIfUnset
) |   |  const
◆ Validate()
 void CRhinoUiPaintColorSettings::Validate  |  ( |   | )
Friends And Related Function Documentation
◆ CRhDefaultColors
 friend class CRhDefaultColors
friend
Member Data Documentation
◆ Default
 const CRhinoUiPaintColorSettings CRhinoUiPaintColorSettings::Default
static
◆ m_active_caption
 ON_Color CRhinoUiPaintColorSettings::m_active_caption
Active floating window non-client area.
◆ m_active_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_active_viewport_title
Active viewport title.
◆ m_hot_border
 ON_Color CRhinoUiPaintColorSettings::m_hot_border
Inactive toolbar tab border.
◆ m_hot_end
 ON_Color CRhinoUiPaintColorSettings::m_hot_end
Gradient end for inactive toolbar tab.
◆ m_hot_start
 ON_Color CRhinoUiPaintColorSettings::m_hot_start
Gradient start for inactive toolbar tab.
◆ m_inactive_caption
 ON_Color CRhinoUiPaintColorSettings::m_inactive_caption
Inactive floating window non-client area.
◆ m_inactive_viewport_title
 ON_Color CRhinoUiPaintColorSettings::m_inactive_viewport_title
Inactive viewport title.
◆ m_mouse_overcontrol_border
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_border
Active floating window non-client area.
◆ m_mouse_overcontrol_end
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_end
Color for hovering gradient end.
◆ m_mouse_overcontrol_start
 ON_Color CRhinoUiPaintColorSettings::m_mouse_overcontrol_start
Color for hovering gradient start.
◆ m_normal_border
 ON_Color CRhinoUiPaintColorSettings::m_normal_border
Edge color used for grippers, toolbar border, resize bars, status bar pane borders.
◆ m_normal_end
 ON_Color CRhinoUiPaintColorSettings::m_normal_end
Gradient end for active toolbar tab and non-client area of Rhino.
◆ m_normal_start
 ON_Color CRhinoUiPaintColorSettings::m_normal_start
Gradient start for active toolbar tab and non-client area of Rhino.
◆ m_pressed_border
 ON_Color CRhinoUiPaintColorSettings::m_pressed_border
Pressed border.
◆ m_pressed_end
 ON_Color CRhinoUiPaintColorSettings::m_pressed_end
Pressed gradient end.
◆ m_pressed_start
 ON_Color CRhinoUiPaintColorSettings::m_pressed_start
Pressed gradient start.
◆ m_text_disabled
 ON_Color CRhinoUiPaintColorSettings::m_text_disabled
Disabled text color.
◆ m_text_enabled
 ON_Color CRhinoUiPaintColorSettings::m_text_enabled
Toolbar tab text and status bar text.