Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiPopDownLayerListCtrl Class Reference
RhinoUI
CRhinoUiPopDownLayerListCtrl. More...
#include <rhinoSdkUiLayerListCtrl.h>
 Inheritance diagram for CRhinoUiPopDownLayerListCtrl:
 Public Member Functions
CRhinoUiPopDownLayerListCtrl (CComboBox &cb)
virtual  | ~CRhinoUiPopDownLayerListCtrl ()
bool  | CalcSizeAndPosition (CRect &rect, bool &bPopDown)
CComboBox &  | ComboBox ()
bool  | LayerHasChildren (int nItem)
void  | OnItemCollapsed (int nItem)
void  | OnItemExpanded (int nItem)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnNMClick (NMHDR *pNMHDR, LRESULT *pResult)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual overrides More...
class CRhinoUiComboBox *  | RhinoUiComboBox ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Public Member Functions inherited from CRhinoUiLayerListCtrl
CRhinoUiLayerListCtrl ()
virtual  | ~CRhinoUiLayerListCtrl ()
BOOL32  | DeleteAllItems ()
virtual void  | DrawItem (LPDRAWITEMSTRUCT lpDrawItemStruct)
bool  | EnableMultipleSelect () const
int  | GetMaxIndentPixels ()
int  | GetMaxStringPixels ()
void  | Initialize ()
bool  | LayerEditingEnabled () const
int  | LoadLayers (CRhinoDoc *doc, bool bShowReference=true, int set_current=-1)
afx_msg void  | OnChar (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnContextMenu (CWnd *pWnd, CPoint point)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
int  | SelectedLayer () const
int  | SelectedLayers (ON_SimpleArray< int > &layer_list) const
void  | SetEnableMultipleSelect (bool bEnable)
void  | SetLayerEditingEnabled (bool bEnable=true)
void  | SetSelectedLayer (int layer_index)
void  | SetSelectedLayers (const ON_SimpleArray< int > &layer_list)
void  | SizeColumns ()
 Protected Member Functions
void  | ComboBoxSelectLayer (int layer_index)
void  | HidePopUpWindow ()
 Protected Member Functions inherited from CRhinoUiLayerListCtrl
void  | AppendItem (CRhinoDoc *doc, const CRhinoLayer *layer, bool bExpanded)
void  | AppendLayer (CRhinoDoc *doc, const CRhinoLayer *layer, bool bExpanded)
void  | Collapse (int nPos, int nItem)
int  | DoExpand (int nItem, bool bRecursive, int &nCounterInsert)
int  | Expand (int nPos, int nItem, bool bRecurse=false)
int  | GetItemIndent (int nItem) const
int  | InsertItem (int nItem, int nPos, const CRhinoUiLayerListCtrlItem &item)
const CRhinoUiLayerListCtrlItem *  | LayerFromItem (int nItem) const
int  | LayerIndexFromItem (int nItem) const
void  | OnClickColorColumn (int nItem)
void  | OnClickCurrentColumn (int nItem)
void  | OnClickLockedColumn (int nItem)
void  | OnClickNameColumn (int nItem)
void  | OnClickVisibleColumn (int nItem)
virtual void  | PreSubclassWindow ()
 Protected Attributes
CComboBox &  | m_ComboBox
class CRhinoUiPopDownLayerWnd *  | m_PopDownLayerWnd
 Protected Attributes inherited from CRhinoUiLayerListCtrl
bool  | m_bDrawHorzizontalGridLines
bool  | m_bKeepFocus
bool  | m_bLayerEditingEnabled
bool  | m_bShowReference
CRhinoUiImageList  | m_ilEmpty
CRhinoUiImageList  | m_ilImage
CRhinoUiImageList  | m_ilTree
ON_ClassArray< CRhinoUiLayerListCtrlItem >  | m_layers
unsigned int  | m_rhino_doc_sn
 Friends
class  | CRhinoUiPopDownLayerWnd
 Additional Inherited Members
 Public Types inherited from CRhinoUiLayerListCtrl
enum  | columns {
 name_column = 0, color_column, current_column, visible_column,
 locked_column, column_count
 }
enum  | layer_images {
 no_layer_image = 0, current_image, visible_image, invisible_image,
 locked_image, unlocked_image, cached_visible_image, cached_locked_image,
 image_count
 }
enum  | state_images { no_state_image = 0, collapsed_image, expanded_image }
Detailed Description
CRhinoUiPopDownLayerListCtrl.
Constructor & Destructor Documentation
◆ CRhinoUiPopDownLayerListCtrl()
 CRhinoUiPopDownLayerListCtrl::CRhinoUiPopDownLayerListCtrl  |  ( |  CComboBox &  |  cb | )
◆ ~CRhinoUiPopDownLayerListCtrl()
 virtual CRhinoUiPopDownLayerListCtrl::~CRhinoUiPopDownLayerListCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ CalcSizeAndPosition()
 bool CRhinoUiPopDownLayerListCtrl::CalcSizeAndPosition  |  ( |  CRect &  |  rect,
|  bool &  |  bPopDown
)
◆ ComboBox()
 CComboBox& CRhinoUiPopDownLayerListCtrl::ComboBox  |  ( |   | )
inline
◆ ComboBoxSelectLayer()
 void CRhinoUiPopDownLayerListCtrl::ComboBoxSelectLayer  |  ( |  int  |  layer_index | )
protected
◆ HidePopUpWindow()
 void CRhinoUiPopDownLayerListCtrl::HidePopUpWindow  |  ( |   | )
protected
◆ LayerHasChildren()
 bool CRhinoUiPopDownLayerListCtrl::LayerHasChildren  |  ( |  int  |  nItem | )
◆ OnItemCollapsed()
 void CRhinoUiPopDownLayerListCtrl::OnItemCollapsed  |  ( |  int  |  nItem | )
virtual
Description Override this virtual function if you want to be notified when an item was collapsed.
Reimplemented from CRhinoUiLayerListCtrl.
◆ OnItemExpanded()
 void CRhinoUiPopDownLayerListCtrl::OnItemExpanded  |  ( |  int  |  nItem | )
virtual
Description Override this virtual function if you want to be notified when an item was expanded.
Reimplemented from CRhinoUiLayerListCtrl.
◆ OnKeyDown()
 afx_msg void CRhinoUiPopDownLayerListCtrl::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnKillFocus()
 afx_msg void CRhinoUiPopDownLayerListCtrl::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnLButtonUp()
 afx_msg void CRhinoUiPopDownLayerListCtrl::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseMove()
 afx_msg void CRhinoUiPopDownLayerListCtrl::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnNMClick()
 afx_msg void CRhinoUiPopDownLayerListCtrl::OnNMClick  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiPopDownLayerListCtrl::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
virtual overrides
◆ RhinoUiComboBox()
 class CRhinoUiComboBox* CRhinoUiPopDownLayerListCtrl::RhinoUiComboBox  |  ( |   | )
◆ WindowProc()
 virtual LRESULT CRhinoUiPopDownLayerListCtrl::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
Friends And Related Function Documentation
◆ CRhinoUiPopDownLayerWnd
 friend class CRhinoUiPopDownLayerWnd
friend
Member Data Documentation
◆ m_ComboBox
 CComboBox& CRhinoUiPopDownLayerListCtrl::m_ComboBox
protected
◆ m_PopDownLayerWnd
 class CRhinoUiPopDownLayerWnd* CRhinoUiPopDownLayerListCtrl::m_PopDownLayerWnd
protected