Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiOptionsListCtrlPointEditBox Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlPointEditBox:
 Public Member Functions
CRhinoUiOptionsListCtrlPointEditBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlPointEditBox ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
virtual BOOL32  | OnCommand (WPARAM wParam, LPARAM lParam)
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
virtual bool  | OnEndEdit (LPCTSTR lps) const
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | SetNumber (double d)
void  | SetNumber (int i)
void  | SetText (LPCTSTR lps)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
CWnd overrides. More...
 Public Member Functions inherited from CRhinoUiPointEdit
CRhinoUiPointEdit ()
virtual  | ~CRhinoUiPointEdit ()
bool  | CreatePointEdit (CWnd *pParent, DWORD dwStyle, DWORD dwStyleEx, const CRect &r, UINT nID=0)
const wchar_t *  | EditFieldLabelText (int ef) const
ON_3dPoint  | GetPoint () const
void  | GetPoint (CString &x, CString &y, CString &z) const
void  | GetPoint (double &x, double &y, double &z) const
COLORREF  | LabelBkGrndColor () const
COLORREF  | LabelTextColor () const
void  | ModifyEditFieldsStyle (int remove, int add)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
virtual BOOL32  | OnNotify (WPARAM wParam, LPARAM lParam, LRESULT *pResult)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
bool  | ReplaceDlgItem (CDialog *pParent, UINT nID)
COLORREF  | SetLabelBkGrndColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
void  | SetNumber (int ef, double d)
void  | SetPoint (double x, double y, double z)
void  | SetPoint (ON_3dPoint pt)
int  | TextPadding () const
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Protected Member Functions
bool  | GetTextFromEditControl ()
 Protected Member Functions inherited from CRhinoUiPointEdit
void  | ComputeControlRects (CDC &dc, CRect rCtrl)
void  | DrawItemLabels (CDC &dc, CRect rClient) const
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
 Protected Attributes
bool  | m_bCancel
bool  | m_bInOnBeginEdit
 Protected Attributes inherited from CRhinoUiPointEdit
COLORREF  | m_crLabelBkGrndColor
COLORREF  | m_crLabelTextColor
int  | m_iEditFieldStyles
CRect  | m_redit [edit_wnd_cnt]
CRect  | m_rtext [edit_wnd_cnt]
CRhinoUiEdit  | m_xyz [edit_wnd_cnt]
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
 Additional Inherited Members
 Public Types inherited from CRhinoUiPointEdit
enum  | edit_field_styles { efs_borders = 1, force_32bit_edit_field_styles = 0xFFFFFFFF }
enum  | edit_fields {
 x_field = 0, y_field, z_field, edit_wnd_cnt = 3,
 force_32bit_edit_fields = 0xFFFFFFFF
 }
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
Detailed Description
CRhinoUiOptionsListCtrlPointEditBox
Description: Edit box for point input.
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlPointEditBox()
 CRhinoUiOptionsListCtrlPointEditBox::CRhinoUiOptionsListCtrlPointEditBox  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsText = NULL,
|  int  |  iIndentLevel = 0
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
See Also: CRhinoUiOptionsListCtrlItem constructor
◆ ~CRhinoUiOptionsListCtrlPointEditBox()
 virtual CRhinoUiOptionsListCtrlPointEditBox::~CRhinoUiOptionsListCtrlPointEditBox  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlPointEditBox::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description: CRhinoUiOptionsListCtrlItem virtual override
Create CRhinoUiEdit control for editing the Text() value associated with this item.
Parameters: See CRhinoUiOptionsListCtrlItem::BeginEditItem()
Returns: Returns true if edit control was created; otherwise false.
See Also: CRhinoUiOptionsListCtrlItem::BeginEditItem()
Implements CRhinoUiOptionsListCtrlItem.
◆ GetTextFromEditControl()
 bool CRhinoUiOptionsListCtrlPointEditBox::GetTextFromEditControl  |  ( |   | )
protected
◆ MoveItemWindow()
 void CRhinoUiOptionsListCtrlPointEditBox::MoveItemWindow  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit
)
virtual
Description: CRhinoUiOptionsListCtrlItem virtual override
See CRhinoUiOptionsListCtrlItem::MoveItemWindow() Parameters: See CRhinoUiOptionsListCtrlItem::MoveItemWindow()
See Also: CRhinoUiOptionsListCtrlItem::MoveItemWindow()
Implements CRhinoUiOptionsListCtrlItem.
◆ OnCommand()
 virtual BOOL32 CRhinoUiOptionsListCtrlPointEditBox::OnCommand  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
Reimplemented from CRhinoUiPointEdit.
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlPointEditBox::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description: CRhinoUiOptionsListCtrlItem override
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ OnEndEdit()
 virtual bool CRhinoUiOptionsListCtrlPointEditBox::OnEndEdit  |  ( |  LPCTSTR  |  lps | ) |   const
virtual
Description: This method is called when this edit control looses focus to validate the new control value prior to saving.
Parameters: lps [in] New text value
Returns: Returns true if lps is valid and should be saved; otherwise false.
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlPointEditBox::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlPointEditBox::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiOptionsListCtrlPointEditBox::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ SetNumber() [1/2]
 void CRhinoUiOptionsListCtrlPointEditBox::SetNumber  |  ( |  double  |  d | )
Description: Convert double to string and put string in edit control.
Parameters: d [in] Value to place in edit control
◆ SetNumber() [2/2]
 void CRhinoUiOptionsListCtrlPointEditBox::SetNumber  |  ( |  int  |  i | )
Description: Convert int to string and put string in edit control.
Parameters: i [in] Value to place in edit control
◆ SetText()
 void CRhinoUiOptionsListCtrlPointEditBox::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: CRhinoUiOptionsListCtrlItem override
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ WindowProc()
 virtual LRESULT CRhinoUiOptionsListCtrlPointEditBox::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
CWnd overrides.
Reimplemented from CRhinoUiPointEdit.
Member Data Documentation
◆ m_bCancel
 bool CRhinoUiOptionsListCtrlPointEditBox::m_bCancel
protected
◆ m_bInOnBeginEdit
 bool CRhinoUiOptionsListCtrlPointEditBox::m_bInOnBeginEdit
protected