Public Member Functions | Static Public Member Functions | Public Attributes | Friends | List of all members
CRhinoLayer Class Reference
Rhino
#include <rhinoSdkLayer.h>
 Inheritance diagram for CRhinoLayer:
 Public Member Functions
void  | DeleteSavedSettings ()
CRhinoDoc &  | Document () const
bool  | GetSavedSettings (ON_Layer &saved_settings)
bool  | IsLinkedInstanceDefinitionParentLayer () const
bool  | IsModified () const
bool  | IsReference () const
bool  | IsReferenceParentLayer () const
bool  | IsVisibleInRhinoUserInterface () const
bool  | IsWorkSessionReferenceParentLayer () const
const CRhinoLinetype &  | LayerLinetype () const
const CRhinoMaterial &  | LayerMaterial () const
const CRhRdkMaterial *  | LayerRdkMaterial () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
const CRhinoLayer *  | ParentLayer (bool bRootLevelParent) const
int  | RemapIndex () const
void  | SaveSettings ()
void  | SetVisibleInRhinoUserInterface (bool bSet)
unsigned int  | WorksessionReferenceModelSerialNumber () const
 Public Member Functions inherited from ON_Layer
ON_Layer () ON_NOEXCEPT
ON_Layer (const ON_Layer &)
~ON_Layer ()
ON_Color  | Color () const
bool  | CopyPerViewportSettings (const ON_Layer &source_layer, ON_UUID viewport_id, unsigned int settings_mask)
bool  | CopyPerViewportSettings (ON_UUID source_viewport_id, ON_UUID destination_viewport_id)
void  | CullPerViewportSettings (int viewport_id_count, const ON_UUID *viewport_id_list)
const ON_SectionStyle *  | CustomSectionStyle (ON_SectionStyle *sectionStyle=nullptr) const
void  | DeleteModelVisible ()
void  | DeletePerViewportColor (const ON_UUID &viewport_id)
void  | DeletePerViewportPlotColor (const ON_UUID &viewport_id)
void  | DeletePerViewportPlotWeight (const ON_UUID &viewport_id)
void  | DeletePerViewportSettings (const ON_UUID &viewport_id) const
void  | DeletePerViewportVisible (const ON_UUID &viewport_id)
ON_wString  | Description () const
void  | Dump (ON_TextLog &) const override
for debugging More...
void  | GetPerViewportVisibilityViewportIds (ON_SimpleArray< ON_UUID > &viewport_id_list) const
bool  | HasPerViewportSettings (const ON_UUID &viewport_id) const
bool  | HasPerViewportSettings (ON_UUID viewport_id, unsigned int settings_mask) const
int  | IgesLevel () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
bool  | IsVisible (const class ON_3dmView *view) const
bool  | IsVisibleAndLocked () const
bool  | IsVisibleAndNotLocked () const
ON_Layer::Style  | LayerStyle () const
int  | LinetypeIndex () const
bool  | ModelIsVisible () const
bool  | ModelPersistentVisibility () const
ON::object_type  | ObjectType () const override
ON_Layer &  | operator= (const ON_Layer &)
ON_UUID  | ParentLayerId () const
bool  | PersistentLocking () const
bool  | PersistentVisibility () const
ON_Color  | PerViewportColor (ON_UUID viewport_id) const
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
bool  | PerViewportIsVisibleInNewDetails () const
bool  | PerViewportPersistentVisibility (ON_UUID viewport_id) const
ON_Color  | PerViewportPlotColor (ON_UUID viewport_id) const
double  | PerViewportPlotWeight (ON_UUID viewport_id) const
ON__UINT32  | PerViewportSettingsCRC () const
ON_Color  | PlotColor () const
double  | PlotWeight () const
bool  | Read (ON_BinaryArchive &) override
void  | RemoveCustomSectionStyle ()
int  | RenderMaterialIndex () const
int  | SectionStyleIndex () const
void  | SetColor (ON_Color layer_color)
layer display color More...
void  | SetCustomSectionStyle (const ON_SectionStyle &sectionStyle)
void  | SetDescription (const wchar_t *description)
bool  | SetIgesLevel (int)
IGES level for this layer. More...
void  | SetLayerStyle (ON_Layer::Style layer_style)
bool  | SetLinetypeIndex (int linetype_index)
void  | SetLocked (bool bLocked)
void  | SetModelPersistentVisibility (bool bPersistentVisibility)
void  | SetModelVisible (bool bVisible)
void  | SetParentLayerId (ON_UUID parent_layer_id)
void  | SetPersistentLocking (bool bPersistentLocking)
void  | SetPersistentVisibility (bool bPersistentVisibility)
void  | SetPerViewportColor (ON_UUID viewport_id, ON_Color layer_color)
void  | SetPerViewportIsVisibleInNewDetails (bool bVisible)
void  | SetPerViewportPersistentVisibility (ON_UUID viewport_id, bool bPersistentVisibility)
void  | SetPerViewportPlotColor (ON_UUID viewport_id, ON_Color plot_color)
void  | SetPerViewportPlotWeight (ON_UUID viewport_id, double plot_weight_mm)
void  | SetPerViewportVisible (ON_UUID viewport_id, bool bVisible)
void  | SetPlotColor (ON_Color plot_color)
plotting color More...
void  | SetPlotWeight (double plot_weight_mm)
bool  | SetRenderMaterialIndex (int)
index of layer's rendering material More...
void  | SetSectionStyleIndex (int index)
void  | SetVisible (bool bVisible)
void  | UnsetModelPersistentVisibility ()
void  | UnsetPersistentLocking ()
void  | UnsetPersistentVisibility ()
void  | UnsetPerViewportPersistentVisibility (ON_UUID viewport_id)
bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map) override
int  | UpdateViewportIds (const ON_UuidPairList &viewport_id_map)
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
void  | Dump (ON_TextLog &) const override
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
int  | UserStringCount () const
 Static Public Member Functions
static unsigned int  | NextRuntimeSerialNumber ()
 Static Public Member Functions inherited from ON_Layer
static const ON_Layer *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_Layer *none_return_value)
static ON_Layer::Style  | LayerStyleFromUnsigned (unsigned int layer_style_as_unsigned)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Public Attributes
const class CRhinoLayerTable &  | m_doc_layer_table
const unsigned int  | m_layer_sn
int  | m_sort_index = -1
Runtime index used to sort layers in layer dialog. More...
bool  | m_sublayer_bLocked
bool  | m_sublayer_bVisible
 Public Attributes inherited from ON_Layer
bool  | m_bExpanded = true
ON_Color  | m_color = ON_Color::Black
ON_UUID  | m_display_material_id = ON_nil_uuid
int  | m_iges_level = -1
IGES level number if this layer was made during IGES import. More...
int  | m_linetype_index = -1
index of linetype More...
int  | m_material_index = -1
ON_Color  | m_plot_color = ON_Color::UnsetColor
Layer printing (plotting) attributes. More...
double  | m_plot_weight_mm = 0.0
ON_UNSET_COLOR means use layer color. More...
ON_RenderingAttributes  | m_rendering_attributes
 Friends
class  | CRhinoLayerNode
class  | CRhinoLayerTable
 Additional Inherited Members
 Public Types inherited from ON_Layer
enum  | PER_VIEWPORT_SETTINGS : unsigned int {
 per_viewport_none = 0, per_viewport_id = 1, per_viewport_color = 2, per_viewport_plot_color = 4,
 per_viewport_plot_weight = 8, per_viewport_visible = 16, per_viewport_persistent_visibility = 32, per_viewport_all_settings = 0xFFFFFFFF
 }
enum  | Style : unsigned char { Style::Unset = 0, Style::Markup = 1 }
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Layer
static const ON_Layer  | Default
index = -1, id set, unique and persistent More...
static const ON_Layer  | Unset
index = ON_UNSET_INT_INDEX, id = nil More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Member Function Documentation
◆ DeleteSavedSettings()
 void CRhinoLayer::DeleteSavedSettings  |  ( |   | )
Description: Delete any saved settings.
◆ Document()
 CRhinoDoc& CRhinoLayer::Document  |  ( |   | ) |   const
Description: Layers are always in the Document().m_layer_table. Returns: CRhinoDoc that owns this layer.
◆ GetSavedSettings()
 bool CRhinoLayer::GetSavedSettings  |  ( |  ON_Layer &  |  saved_settings | )
Description: Get the settings that were saved by the last call to SaveSettings(). Returns: true if settings had been saved.
◆ IsLinkedInstanceDefinitionParentLayer()
 bool CRhinoLayer::IsLinkedInstanceDefinitionParentLayer  |  ( |   | ) |   const
Returns: True if the layer is a parent layer of the layer tree from a linked instance definition model. See Also: CRhinoLayer::WorksessionReferenceModelSerialNumber CRhinoLayer::LinkedInstanceDefinitionSerialNumber CRhinoLayer::IsReference CRhinoLayer::IsReferenceParentLayer CRhinoLayer::IsWorkSessionReferenceParentLayer
◆ IsModified()
 bool CRhinoLayer::IsModified  |  ( |   | ) |   const
Description: Rhino provides the ability to undo layer modifications.
Returns: true if this layer has been modified by CRhinoLayerTable::ModifyLayer()and the modifications can be undone.
See Also: UndoModify.
◆ IsReference()
 bool CRhinoLayer::IsReference  |  ( |   | ) |   const
Description: Rhino allows files to be used as the definitions for linked block instances and to be uses as reference models in worksessions. When a linked instance definition or worksession reference model is present, additional parent layers are added to the layer tree to contain the layer tables of the referenced file. If a layer is any of these types of layers, then IsReference() returns true. If IsReference() returns true, then the layer is never saved in a file. Returns: true if the layer is a "reference" layer as described above. Remarks: If you need to know what type of reference the layer is used for, use the WorksessionReferenceModelSerialNumber(), LinkedInstanceDefinitionSerialNumber() and IsReferenceParentLayer() functions. See Also: CRhinoLayer::WorksessionReferenceModelSerialNumber CRhinoLayer::LinkedInstanceDefinitionSerialNumber CRhinoLayer::IsReferenceParentLayer CRhinoLayer::IsWorkSessionReferenceParentLayer CRhinoLayer::IsLinkedInstanceDefinitionParentLayer
◆ IsReferenceParentLayer()
 bool CRhinoLayer::IsReferenceParentLayer  |  ( |   | ) |   const
Returns: True if the layer is a parent layer of the layer tree from a linked instance definition or the layer tree from a worksession reference model. See Also: CRhinoLayer::WorksessionReferenceModelSerialNumber CRhinoLayer::LinkedInstanceDefinitionSerialNumber CRhinoLayer::IsReference CRhinoLayer::IsWorkSessionReferenceParentLayer CRhinoLayer::IsLinkedInstanceDefinitionParentLayer
◆ IsVisibleInRhinoUserInterface()
 bool CRhinoLayer::IsVisibleInRhinoUserInterface  |  ( |   | ) |   const
Returns: True if the layer is visible in the layer manager dialog and other Rhino user interfaces the display layers. Otherwise the layer is filtered.
◆ IsWorkSessionReferenceParentLayer()
 bool CRhinoLayer::IsWorkSessionReferenceParentLayer  |  ( |   | ) |   const
Returns: True if the layer is a parent layer of the layer tree from a worksession reference model. See Also: CRhinoLayer::WorksessionReferenceModelSerialNumber CRhinoLayer::LinkedInstanceDefinitionSerialNumber CRhinoLayer::IsReference CRhinoLayer::IsReferenceParentLayer CRhinoLayer::IsLinkedInstanceDefinitionParentLayer
◆ LayerLinetype()
 const CRhinoLinetype& CRhinoLayer::LayerLinetype  |  ( |   | ) |   const
Description: Gets the linetype for this layer.
Returns: The linetype associated with this layer.
◆ LayerMaterial()
 const CRhinoMaterial& CRhinoLayer::LayerMaterial  |  ( |   | ) |   const
Description: Gets the rendering material for this layer. The default layer material is RhinoApp().AppSettings().DefaultMaterial()
Returns: The rendering material associated with this layer.
◆ LayerRdkMaterial()
 const CRhRdkMaterial* CRhinoLayer::LayerRdkMaterial  |  ( |   | ) |   const
Description: Gets the RDK rendering material for this layer.
Returns: The rendering material associated with this layer.
◆ LinkedInstanceDefinitionSerialNumber()
 unsigned int CRhinoLayer::LinkedInstanceDefinitionSerialNumber  |  ( |   | ) |   const
Returns: 0: The layer is not part of a linked instance definition 1-1000: These numbers are reserved for future use. >1000: CRhinoDoc::m_instance_defintion_table.FindBySerialNumber() can be used to find the instance definition. Remarks: The linked instance definition serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read. See Also: CRhinoLayer::WorksessionReferenceModelSerialNumber CRhinoLayer::IsReferenceParentLayer CRhinoLayer::IsWorkSessionReferenceParentLayer CRhinoLayer::IsLinkedInstanceDefinitionParentLayer
◆ NextRuntimeSerialNumber()
 static unsigned int CRhinoLayer::NextRuntimeSerialNumber  |  ( |   | )
static
◆ ParentLayer()
 const CRhinoLayer* CRhinoLayer::ParentLayer  |  ( |  bool  |  bRootLevelParent | ) |   const
Description: Returns parent of a layer. Parameters: bRootLevelParent - [in] If true, the root level parent is returned. The root level parent never has a parent. If false, the immediate parent is returned. The immediate parent may have a parent. Returns: A pointer to the parent or NULL if this layer does not have a parent. Calls to CRhinoLayerTable::AddLayer() may make this pointer invalid.
◆ RemapIndex()
 int CRhinoLayer::RemapIndex  |  ( |   | ) |   const
◆ SaveSettings()
 void CRhinoLayer::SaveSettings  |  ( |   | )
Description: Save the current layer settings.
◆ SetVisibleInRhinoUserInterface()
 void CRhinoLayer::SetVisibleInRhinoUserInterface  |  ( |  bool  |  bSet | )
◆ WorksessionReferenceModelSerialNumber()
 unsigned int CRhinoLayer::WorksessionReferenceModelSerialNumber  |  ( |   | ) |   const
Returns: Worksession reference model id. 0: layer is not in a reference model. 1: layer is in an unidentified worksession reference model. 2-1000: reserved for future use >1000: Serial number of the worksession reference model.
 Remarks: The reference model serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read. See Also: CRhinoLayer::LinkedInstanceDefinitionSerialNumber CRhinoLayer::IsReferenceParentLayer CRhinoLayer::IsWorkSessionReferenceParentLayer CRhinoLayer::IsLinkedInstanceDefinitionParentLayer
Friends And Related Function Documentation
◆ CRhinoLayerNode
 friend class CRhinoLayerNode
friend
◆ CRhinoLayerTable
 friend class CRhinoLayerTable
friend
Member Data Documentation
◆ m_doc_layer_table
 const class CRhinoLayerTable& CRhinoLayer::m_doc_layer_table
◆ m_layer_sn
 const unsigned int CRhinoLayer::m_layer_sn
Runtime serial number of this layer. This serial number is unique for each layer in an instance of a Rhino application. This serial number is not saved in files and it is generally different the next time a file is read.
◆ m_sort_index
 int CRhinoLayer::m_sort_index = -1
Runtime index used to sort layers in layer dialog.
◆ m_sublayer_bLocked
 bool CRhinoLayer::m_sublayer_bLocked
never use or set this value
◆ m_sublayer_bVisible
 bool CRhinoLayer::m_sublayer_bVisible
If you have code that sets these values, delete it. If you have code that uses these values, call ON_Layer::IsVisible() or ON_Layer::IsLocked() instead. never use or set this value