Public Member Functions | List of all members
IRhinoSnapshotsClientEx Class Referenceabstract
Rhino
#include <rhinoSdkSnapshots.h>
 Inheritance diagram for IRhinoSnapshotsClientEx:
 Public Member Functions
virtual  | ~IRhinoSnapshotsClientEx (void)
virtual bool  | ConvertData (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Buffer &bufferIn, ON_Buffer &bufferOut, int iSaveAsVersion)=0
virtual bool  | ConvertData (CRhinoDoc &doc, const ON_Buffer &bufferIn, ON_Buffer &bufferOut, int iSaveAsVersion)=0
virtual bool  | SupportsDataConversion (CRhinoDoc &doc, int iSaveAsVersion) const =0
 Public Member Functions inherited from IRhinoSnapshotsClient
virtual  | ~IRhinoSnapshotsClient (void)
virtual bool  | AnimateDocument (CRhinoDoc &doc, double dPos, const ON_Buffer &start, const ON_Buffer &stop)=0
virtual bool  | AnimateObject (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, double dPos, const ON_Buffer &start, const ON_Buffer &stop)=0
virtual void  | AnimationStart (CRhinoDoc &doc, int iFrames)=0
virtual void  | AnimationStop (CRhinoDoc &doc)=0
virtual ON_wString  | Category (void) const =0
virtual UUID  | ClientId (void) const =0
virtual void *  | EVF (const wchar_t *, void *)
virtual void  | ExtendBoundingBoxForDocumentAnimation (CRhinoDoc &doc, const ON_Buffer &start, const ON_Buffer &stop, ON_BoundingBox &bb)=0
virtual void  | ExtendBoundingBoxForObjectAnimation (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, const ON_Buffer &start, const ON_Buffer &stop, ON_BoundingBox &bb)=0
virtual bool  | IsCurrentModelStateInAnySnapshot (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Buffer &bufferModel, const ON_SimpleArray< const ON_Buffer * > &aSnapShots, ON_TextLog *pReportMissing=nullptr) const =0
virtual bool  | IsCurrentModelStateInAnySnapshot (CRhinoDoc &doc, const ON_Buffer &bufferModel, const ON_SimpleArray< const ON_Buffer * > &aSnapShots, ON_TextLog *pReportMissing=nullptr) const =0
virtual ON_wString  | Name (void) const =0
virtual bool  | ObjectTransformNotification (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, ON_Buffer &buffer)=0
virtual UUID  | PlugInId (void) const =0
virtual bool  | PrepareForDocumentAnimation (CRhinoDoc &doc, const ON_Buffer &start, const ON_Buffer &stop)=0
virtual bool  | PrepareForObjectAnimation (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, const ON_Buffer &start, const ON_Buffer &stop)=0
virtual bool  | RestoreDocument (CRhinoDoc &doc, const ON_Buffer &buffer)=0
virtual bool  | RestoreObject (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, const ON_Buffer &buffer)=0
virtual bool  | SaveDocument (CRhinoDoc &doc, ON_Buffer &buffer)=0
virtual bool  | SaveObject (CRhinoDoc &doc, const CRhinoObject &obj, const ON_Xform &xformObject, ON_Buffer &buffer)=0
virtual void  | SnapshotRestored (CRhinoDoc &doc)=0
virtual bool  | SupportsAnimation (void) const =0
virtual bool  | SupportsDocument (void) const =0
virtual bool  | SupportsObject (const CRhinoObject &obj) const =0
virtual bool  | SupportsObjects (void) const =0
 Additional Inherited Members
 Static Public Member Functions inherited from IRhinoSnapshotsClient
static ON_wString  | ApplicationCategory (void)
static ON_wString  | DocumentCategory (void)
static ON_wString  | LayersCategory (void)
static ON_wString  | LightsCategory (void)
static ON_wString  | MeshModifiersCategory (void)
static ON_wString  | ObjectsCategory (void)
static bool  | Register (IRhinoSnapshotsClient &client)
static ON_wString  | RenderingCategory (void)
static bool  | Unregister (IRhinoSnapshotsClient &client)
static UUID  | ViewClientId (void)
static ON_wString  | ViewsCategory (void)
Constructor & Destructor Documentation
◆ ~IRhinoSnapshotsClientEx()
 virtual IRhinoSnapshotsClientEx::~IRhinoSnapshotsClientEx  |  ( |  void  |   | )
inlinevirtual
Member Function Documentation
◆ ConvertData() [1/2]
 virtual bool IRhinoSnapshotsClientEx::ConvertData  |  ( |  CRhinoDoc &  |  doc,
|  const CRhinoObject &  |  obj,
|  const ON_Buffer &  |  bufferIn,
|  ON_Buffer &  |  bufferOut,
|  int  |  iSaveAsVersion
)
pure virtual
Called before saving too a file. For example when Rhino v7 saves as a v6 file.
Parameters
doc | is the current document.
obj | is the object the data is associated with.
bufferIn | is the data to convert.
bufferOut | is the converted data.
iSaveAsVersion | is the Rhino version to convert too. For Example 6,7,...
Returns
true if successful, otherwise false.
◆ ConvertData() [2/2]
 virtual bool IRhinoSnapshotsClientEx::ConvertData  |  ( |  CRhinoDoc &  |  doc,
|  const ON_Buffer &  |  bufferIn,
|  ON_Buffer &  |  bufferOut,
|  int  |  iSaveAsVersion
)
pure virtual
Called before saving too a file. For example when Rhino v7 saves as a v6 file.
Parameters
doc | is the current document.
bufferIn | is the data to convert.
bufferOut | is the converted data.
iSaveAsVersion | is the Rhino version to convert too. For Example 6,7,...
Returns
true if successful, otherwise false.
◆ SupportsDataConversion()
 virtual bool IRhinoSnapshotsClientEx::SupportsDataConversion  |  ( |  CRhinoDoc &  |  doc,
|  int  |  iSaveAsVersion
) |   |  const
pure virtual
Called before saving too a file. For example when Rhino v7 saves as a v6 file.
Parameters
doc | is the current document.
iSaveAsVersion | is the Rhino version to convert too. For Example 6,7,...
Returns
true if the client wants to save its data into a different format, otherwise false.