Public Member Functions | Public Attributes | List of all members
CRhinoSporphSpaceMorph Class Reference
Rhino
Flow along surface morph. More...
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoSporphSpaceMorph:
 Public Member Functions
CRhinoSporphSpaceMorph ()
~CRhinoSporphSpaceMorph ()
ON_3dPoint  | MorphPoint (ON_3dPoint pt) const
virtual ON_SpaceMorph override More...
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
virtual bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
ON_3dVector  | m_N1
If set defines a normal to use instead of target surface normal. More...
ON_Interval  | m_s [2]
Length of the surface plane. More...
ON_Surface *  | m_srf [2]
The surface planes to flow along surface. More...
ON_Interval  | m_t [2]
Width of the surface plane. More...
Detailed Description
Flow along surface morph.
Constructor & Destructor Documentation
◆ CRhinoSporphSpaceMorph()
 CRhinoSporphSpaceMorph::CRhinoSporphSpaceMorph  |  ( |   | )
◆ ~CRhinoSporphSpaceMorph()
 CRhinoSporphSpaceMorph::~CRhinoSporphSpaceMorph  |  ( |   | )
Member Function Documentation
◆ MorphPoint()
 ON_3dPoint CRhinoSporphSpaceMorph::MorphPoint  |  ( |  ON_3dPoint  |  pt | ) |   const
virtual
virtual ON_SpaceMorph override
Implements ON_SpaceMorph.
Member Data Documentation
◆ m_N1
 ON_3dVector CRhinoSporphSpaceMorph::m_N1
If set defines a normal to use instead of target surface normal.
◆ m_s
 ON_Interval CRhinoSporphSpaceMorph::m_s[2]
Length of the surface plane.
◆ m_srf
 ON_Surface* CRhinoSporphSpaceMorph::m_srf[2]
The surface planes to flow along surface.
◆ m_t
 ON_Interval CRhinoSporphSpaceMorph::m_t[2]
Width of the surface plane.