Public Member Functions | Public Attributes | List of all members
CRhRdkCustomRenderMeshes Class Reference
RDK
#include <IRhRdkCustomRenderMeshManager.h>
 Inheritance diagram for CRhRdkCustomRenderMeshes:
 Public Member Functions
RDK_DEPRECATED  | CRhRdkCustomRenderMeshes (const CRhinoObject *pObject)
virtual  | ~CRhRdkCustomRenderMeshes ()
virtual void  | Add (const ON_Cone &cone, const ON_Plane &truncation, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_PlaneSurface &plane, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_PlaneSurface &plane, const ON_Interval &cz, const CRhRdkMaterial *pMaterial)
virtual void  | Add (const ON_Sphere &sphere, const CRhRdkMaterial *pMaterial)
virtual void  | Add (ON_Mesh *pMesh, const CRhRdkMaterial *pMaterial)
void  | Add (ON_Mesh *pMesh, const CRhRdkMaterial *pMaterial, const ON_Xform *xform)
void  | AddEx (const ON_Cone &cone, const ON_Plane &truncation, const CRhRdkMaterial *pMaterial, std::shared_ptr< CRhinoCacheHandle > handle)
void  | AddEx (const ON_PlaneSurface &plane, const CRhRdkMaterial *pMaterial, std::shared_ptr< CRhinoCacheHandle > handle)
void  | AddEx (const ON_PlaneSurface &plane, const ON_Interval &cz, const CRhRdkMaterial *pMaterial, std::shared_ptr< CRhinoCacheHandle > handle)
void  | AddEx (const ON_Sphere &sphere, const CRhRdkMaterial *pMaterial, std::shared_ptr< CRhinoCacheHandle > handle)
void  | AddEx (ON_Mesh *pMesh, const CRhRdkMaterial *pMaterial, const ON_Xform *xform, std::shared_ptr< CRhinoCacheHandle > handle)
void  | AddEx (ON_Mesh *pMesh, const CRhRdkMaterial *pMaterial, std::shared_ptr< CRhinoCacheHandle > handle)
virtual void  | AddOnTheFlyMeshFromCache (int index, const ON_Mesh *pMesh)
virtual const CRhRdkObjectAncestry *  | Ancestry (void) const
virtual bool  | AutoDeleteMaterialsOn (void) const
virtual bool  | AutoDeleteMeshesOn (void) const
virtual bool  | Box (int iIndex, ON_PlaneSurface &plane, ON_Interval &z_interval) const
virtual void  | Clear (void)
virtual bool  | Cone (int iIndex, ON_Cone &cone, ON_Plane &truncation) const
virtual void  | ConvertMeshesToTriangles (void)
virtual int  | Count (void) const
std::shared_ptr< CRhinoCacheHandle >  | DisplayCacheHandle (int iIndex) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual const ON_Xform &  | GetInstanceTransform (void) const
IRhRdkCustomRenderMeshes2 &  | I2 (void)
const IRhRdkCustomRenderMeshes2 &  | I2 (void) const
virtual const CRhRdkMaterial *  | Material (int iIndex) const
virtual const ON_Mesh *  | Mesh (int iIndex) const
const ON_Mesh *  | MeshInstance (int iIndex, ON_Xform &instance_transform) const
virtual const CRhinoObject *  | Object (void) const
virtual const UUID &  | OriginalMaterialId (int iIndex) const
void  | OriginalTextureMappingIds (ON_SimpleArray< UUID > &ids) const
virtual bool  | Plane (int iIndex, ON_PlaneSurface &plane) const
virtual void  | PrepareRenderMeshesForMapping (void)
virtual RhRdkRenderMeshPrimitiveTypes  | PrimitiveType (int iIndex) const
virtual UUID  | ProviderId (void) const
virtual void  | SetAncestry (const class CRhRdkObjectAncestry &pAncestry)
virtual void  | SetAutoDeleteMaterialsOn (void)
virtual void  | SetAutoDeleteMeshesOn (void)
virtual void  | SetInstanceTransform (const ON_Xform &xformInstance)
virtual void  | SetProviderId (const UUID &uuidRMP)
virtual void  | SetUseObjectsMappingChannels (bool bSet)
virtual bool  | Sphere (int iIndex, ON_Sphere &sphere) const
virtual bool  | UseObjectsMappingChannels (void) const
 Public Member Functions inherited from IRhRdkCustomRenderMeshes
virtual  | ~IRhRdkCustomRenderMeshes ()
 Public Attributes
CImpl *  | m_pImpl
 Additional Inherited Members
 Static Public Member Functions inherited from IRhRdkCustomRenderMeshes
static void  | Delete (IRhRdkCustomRenderMeshes *)
static IRhRdkCustomRenderMeshes *  | New (const CRhinoObject *pObject)
Detailed Description
Built-in implementation of IRhRdkCustomRenderMeshes. This is now DEPRECATED. Use the creator functions in the interface classes.
Constructor & Destructor Documentation
◆ CRhRdkCustomRenderMeshes()
 RDK_DEPRECATED CRhRdkCustomRenderMeshes::CRhRdkCustomRenderMeshes  |  ( |  const CRhinoObject *  |  pObject | )
◆ ~CRhRdkCustomRenderMeshes()
 virtual CRhRdkCustomRenderMeshes::~CRhRdkCustomRenderMeshes  |  ( |   | )
virtual
Member Function Documentation
◆ Add() [1/6]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_Cone &  |  cone,
|  const ON_Plane &  |  truncation,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Add() [2/6]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_PlaneSurface &  |  plane,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Add() [3/6]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_PlaneSurface &  |  plane,
|  const ON_Interval &  |  cz,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Add() [4/6]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  const ON_Sphere &  |  sphere,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Add() [5/6]
 virtual void CRhRdkCustomRenderMeshes::Add  |  ( |  ON_Mesh *  |  pMesh,
|  const CRhRdkMaterial *  |  pMaterial
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Add() [6/6]
 void CRhRdkCustomRenderMeshes::Add  |  ( |  ON_Mesh *  |  pMesh,
|  const CRhRdkMaterial *  |  pMaterial,
|  const ON_Xform *  |  xform
)
Deprecated. See IRhRdkCustomRenderMeshes
◆ AddEx() [1/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  const ON_Cone &  |  cone,
|  const ON_Plane &  |  truncation,
|  const CRhRdkMaterial *  |  pMaterial,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
◆ AddEx() [2/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  const ON_PlaneSurface &  |  plane,
|  const CRhRdkMaterial *  |  pMaterial,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
◆ AddEx() [3/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  const ON_PlaneSurface &  |  plane,
|  const ON_Interval &  |  cz,
|  const CRhRdkMaterial *  |  pMaterial,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
◆ AddEx() [4/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  const ON_Sphere &  |  sphere,
|  const CRhRdkMaterial *  |  pMaterial,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
◆ AddEx() [5/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  ON_Mesh *  |  pMesh,
|  const CRhRdkMaterial *  |  pMaterial,
|  const ON_Xform *  |  xform,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
Deprecated. See IRhRdkCustomRenderMeshes
◆ AddEx() [6/6]
 void CRhRdkCustomRenderMeshes::AddEx  |  ( |  ON_Mesh *  |  pMesh,
|  const CRhRdkMaterial *  |  pMaterial,
|  std::shared_ptr< CRhinoCacheHandle >  |  handle
)
◆ AddOnTheFlyMeshFromCache()
 virtual void CRhRdkCustomRenderMeshes::AddOnTheFlyMeshFromCache  |  ( |  int  |  index,
|  const ON_Mesh *  |  pMesh
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ Ancestry()
 virtual const CRhRdkObjectAncestry* CRhRdkCustomRenderMeshes::Ancestry  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ AutoDeleteMaterialsOn()
 virtual bool CRhRdkCustomRenderMeshes::AutoDeleteMaterialsOn  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ AutoDeleteMeshesOn()
 virtual bool CRhRdkCustomRenderMeshes::AutoDeleteMeshesOn  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ Box()
 virtual bool CRhRdkCustomRenderMeshes::Box  |  ( |  int  |  iIndex,
|  ON_PlaneSurface &  |  plane,
|  ON_Interval &  |  z_interval
) |   |  const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Clear()
 virtual void CRhRdkCustomRenderMeshes::Clear  |  ( |  void  |   | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ Cone()
 virtual bool CRhRdkCustomRenderMeshes::Cone  |  ( |  int  |  iIndex,
|  ON_Cone &  |  cone,
|  ON_Plane &  |  truncation
) |   |  const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ ConvertMeshesToTriangles()
 virtual void CRhRdkCustomRenderMeshes::ConvertMeshesToTriangles  |  ( |  void  |   | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Count()
 virtual int CRhRdkCustomRenderMeshes::Count  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ DisplayCacheHandle()
 std::shared_ptr<CRhinoCacheHandle> CRhRdkCustomRenderMeshes::DisplayCacheHandle  |  ( |  int  |  iIndex | ) |   const
◆ EVF()
 virtual void* CRhRdkCustomRenderMeshes::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ GetInstanceTransform()
 virtual const ON_Xform& CRhRdkCustomRenderMeshes::GetInstanceTransform  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ I2() [1/2]
 IRhRdkCustomRenderMeshes2& CRhRdkCustomRenderMeshes::I2  |  ( |  void  |   | )
Deprecated. See IRhRdkCustomRenderMeshes
◆ I2() [2/2]
 const IRhRdkCustomRenderMeshes2& CRhRdkCustomRenderMeshes::I2  |  ( |  void  |   | ) |   const
Deprecated. See IRhRdkCustomRenderMeshes
◆ Material()
 virtual const CRhRdkMaterial* CRhRdkCustomRenderMeshes::Material  |  ( |  int  |  iIndex | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Mesh()
 virtual const ON_Mesh* CRhRdkCustomRenderMeshes::Mesh  |  ( |  int  |  iIndex | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ MeshInstance()
 const ON_Mesh* CRhRdkCustomRenderMeshes::MeshInstance  |  ( |  int  |  iIndex,
|  ON_Xform &  |  instance_transform
) |   |  const
◆ Object()
 virtual const CRhinoObject* CRhRdkCustomRenderMeshes::Object  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ OriginalMaterialId()
 virtual const UUID& CRhRdkCustomRenderMeshes::OriginalMaterialId  |  ( |  int  |  iIndex | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ OriginalTextureMappingIds()
 void CRhRdkCustomRenderMeshes::OriginalTextureMappingIds  |  ( |  ON_SimpleArray< UUID > &  |  ids | ) |   const
Deprecated. See IRhRdkCustomRenderMeshes3
◆ Plane()
 virtual bool CRhRdkCustomRenderMeshes::Plane  |  ( |  int  |  iIndex,
|  ON_PlaneSurface &  |  plane
) |   |  const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ PrepareRenderMeshesForMapping()
 virtual void CRhRdkCustomRenderMeshes::PrepareRenderMeshesForMapping  |  ( |  void  |   | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ PrimitiveType()
 virtual RhRdkRenderMeshPrimitiveTypes CRhRdkCustomRenderMeshes::PrimitiveType  |  ( |  int  |  iIndex | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ ProviderId()
 virtual UUID CRhRdkCustomRenderMeshes::ProviderId  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ SetAncestry()
 virtual void CRhRdkCustomRenderMeshes::SetAncestry  |  ( |  const class CRhRdkObjectAncestry &  |  pAncestry | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
◆ SetAutoDeleteMaterialsOn()
 virtual void CRhRdkCustomRenderMeshes::SetAutoDeleteMaterialsOn  |  ( |  void  |   | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ SetAutoDeleteMeshesOn()
 virtual void CRhRdkCustomRenderMeshes::SetAutoDeleteMeshesOn  |  ( |  void  |   | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ SetInstanceTransform()
 virtual void CRhRdkCustomRenderMeshes::SetInstanceTransform  |  ( |  const ON_Xform &  |  xformInstance | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ SetProviderId()
 virtual void CRhRdkCustomRenderMeshes::SetProviderId  |  ( |  const UUID &  |  uuidRMP | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ SetUseObjectsMappingChannels()
 virtual void CRhRdkCustomRenderMeshes::SetUseObjectsMappingChannels  |  ( |  bool  |  bSet | )
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ Sphere()
 virtual bool CRhRdkCustomRenderMeshes::Sphere  |  ( |  int  |  iIndex,
|  ON_Sphere &  |  sphere
) |   |  const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
◆ UseObjectsMappingChannels()
 virtual bool CRhRdkCustomRenderMeshes::UseObjectsMappingChannels  |  ( |  void  |   | ) |   const
virtual
Deprecated. See IRhRdkCustomRenderMeshes
Implements IRhRdkCustomRenderMeshes.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkCustomRenderMeshes::m_pImpl