Public Member Functions | List of all members
CRhinoPropertiesPanelPageCollection Class Reference
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
CRhinoPropertiesPanelPageCollection (unsigned int documentRuntimeSerialNumber)
~CRhinoPropertiesPanelPageCollection ()
void  | Add (IRhinoPropertiesPanelPage *page)
int  | Count () const
CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
IRhinoPropertiesPanelPage *  | operator[] (int index) const
Detailed Description
class CRhinoPropertiesPanelPageCollection
Description: Passed to CRhinoPlugIn::AddObjectPropertiesPages and is used to add plug-in provided object properties pages.
Constructor & Destructor Documentation
◆ CRhinoPropertiesPanelPageCollection()
 CRhinoPropertiesPanelPageCollection::CRhinoPropertiesPanelPageCollection  |  ( |  unsigned int  |  documentRuntimeSerialNumber | )
 Description: Constructor
◆ ~CRhinoPropertiesPanelPageCollection()
 CRhinoPropertiesPanelPageCollection::~CRhinoPropertiesPanelPageCollection  |  ( |   | )
 Description: Destructor
Member Function Documentation
◆ Add()
 void CRhinoPropertiesPanelPageCollection::Add  |  ( |  IRhinoPropertiesPanelPage *  |  page | )
 Description: Call this method to add a plug-in provided page to the collection
◆ Count()
 int CRhinoPropertiesPanelPageCollection::Count  |  ( |   | ) |   const
 Description: Number of items in this collection
◆ Document()
 CRhinoDoc* CRhinoPropertiesPanelPageCollection::Document  |  ( |   | ) |   const
 Description: Document displaying the options dialog.
◆ DocumentRuntimeSerialNumber()
 unsigned int CRhinoPropertiesPanelPageCollection::DocumentRuntimeSerialNumber  |  ( |   | ) |   const
 Description: Runtime serial for document displaying the options dialog.
◆ operator[]()
 IRhinoPropertiesPanelPage* CRhinoPropertiesPanelPageCollection::operator[]  |  ( |  int  |  index | ) |   const
 Description: Provide operator[] access to collection array