Public Attributes | List of all members
CRhinoDocMarkupTableChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
CRhinoDocMarkupTableChanged::EventType  | m_event_type
The markup table event. More...
int  | m_markup_index
The index of the markup that was added, deleted, undeleted, or modified. More...
const ON_Markup *  | m_old_settings
unsigned int  | m_rhino_doc_sn
The serial number of the document which contains the markup table. More...
Member Data Documentation
◆ m_event_type
 CRhinoDocMarkupTableChanged::EventType CRhinoDocMarkupTableChanged::CParameters::m_event_type
The markup table event.
◆ m_markup_index
 int CRhinoDocMarkupTableChanged::CParameters::m_markup_index
The index of the markup that was added, deleted, undeleted, or modified.
◆ m_old_settings
 const ON_Markup* CRhinoDocMarkupTableChanged::CParameters::m_old_settings
If the event is CRhinoDocMarkupTableChanged::EventType::MarkupModified, then the old markup. Otherwise, this parameter is nullptr. WARNING: This objects may be deleted at any time after Notify is called. Do not save the pointer and dereference it later.
◆ m_rhino_doc_sn
 unsigned int CRhinoDocMarkupTableChanged::CParameters::m_rhino_doc_sn
The serial number of the document which contains the markup table.