Public Member Functions | Public Attributes | List of all members
CRhinoUiDockBarManager::CSortDockBarsByName Class Reference
#include <RhinoSdkUiDockBarManager.h>
 Public Member Functions
CSortDockBarsByName (int language_id=1033, bool ascending=true)
 Public Attributes
bool  | m_ascending
int  | m_language_id
Detailed Description
Description: This function is provided to simplify sorting by name. To use pass this function to CRhinoUiDockBarManager::Sort as the compar parameter and pass a CSortDockBarsByName pointer as p.
Example: RhinoUiDockBarManager().Sort( CRhinoUiDockBarManager::SortDockBarsByName, NULL, &CRhinoUiDockBarManager::CSortDockBarsByName() ); ON_SimpleArray<CRhinoUiDockBar*>sorted_list; RhinoUiDockBarManager().GetSortedList( sorted_list);
See Also: CRhinoUiDockBarManager::Sort CRhinoUiDockBarManager::GetSortedList CRhinoUiDockBarManager::CullNotCreatedDockBars
Constructor & Destructor Documentation
◆ CSortDockBarsByName()
 CRhinoUiDockBarManager::CSortDockBarsByName::CSortDockBarsByName  |  ( |  int  |  language_id = 1033,
|  bool  |  ascending = true
)
inline
Member Data Documentation
◆ m_ascending
 bool CRhinoUiDockBarManager::CSortDockBarsByName::m_ascending
◆ m_language_id
 int CRhinoUiDockBarManager::CSortDockBarsByName::m_language_id