Public Member Functions | Public Attributes | List of all members
CRhinoUndoEventHandler Class Referenceabstract
Rhino
Use CRhinoUndoEventHandlerEx instead. More...
#include <rhinoSdkDoc.h>
 Inheritance diagram for CRhinoUndoEventHandler:
 Public Member Functions
CRhinoUndoEventHandler ()
virtual  | ~CRhinoUndoEventHandler ()
virtual void  | Undo (const CRhinoCommand *cmd, const wchar_t *action_description, bool bCreatedByRedo, unsigned int undo_event_sn)=0
 Public Attributes
ON_wString  | m_description
The AuditUndo command prints this description. More...
Detailed Description
Use CRhinoUndoEventHandlerEx instead.
Constructor & Destructor Documentation
◆ CRhinoUndoEventHandler()
 CRhinoUndoEventHandler::CRhinoUndoEventHandler  |  ( |   | )
◆ ~CRhinoUndoEventHandler()
 virtual CRhinoUndoEventHandler::~CRhinoUndoEventHandler  |  ( |   | )
virtual
Member Function Documentation
◆ Undo()
 virtual void CRhinoUndoEventHandler::Undo  |  ( |  const CRhinoCommand *  |  cmd,
|  const wchar_t *  |  action_description,
|  bool  |  bCreatedByRedo,
|  unsigned int  |  undo_event_sn
)
pure virtual
Description: The Rhino Undo command will call this virtual Undo function when the event needs to be undone. You should override this function to undo changes in your plug-in data,
NEVER change any setting in the Rhino document or application. Rhino handles ALL changes to the application and document and you will break the Undo/Redo commands if you make any changes to the application or document. Parameters: cmd - [in] Command being undone. Can be NULL. action_description - [in] Description of what is being undone. Can be NULL. bCreatedByRedo - [in] True if a "Redo" was responsible for creating this record. undo_event_sn - [in] Runtime serial number Rhino assigned to the event.
Member Data Documentation
◆ m_description
 ON_wString CRhinoUndoEventHandler::m_description
The AuditUndo command prints this description.