Public Member Functions | Friends | List of all members
ON_SubDFaceIdIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDFaceIdIterator:
 Public Member Functions
ON_SubDFaceIdIterator ()=default
ON_SubDFaceIdIterator (const ON_SubD &subd)
ON_SubDFaceIdIterator (const ON_SubDFaceIdIterator &)=default
ON_SubDFaceIdIterator (const ON_SubDRef &subd_ref)
~ON_SubDFaceIdIterator ()=default
const ON_SubDFace *  | CurrentFace () const
const ON_SubDFace *  | FirstFace ()
const ON_SubDFace *  | FirstFaceOnLevel (unsigned int level_index)
const ON_SubDFace *  | NextFace ()
const ON_SubDFace *  | NextFaceOnLevel (unsigned int level_index)
ON_SubDFaceIdIterator &  | operator= (const ON_SubDFaceIdIterator &)=default
 Friends
class  | ON_SubDHeap
Detailed Description
ON_SubDFaceIdIterator
Constructor & Destructor Documentation
◆ ON_SubDFaceIdIterator() [1/4]
 ON_SubDFaceIdIterator::ON_SubDFaceIdIterator  |  ( |   | )
default
◆ ~ON_SubDFaceIdIterator()
 ON_SubDFaceIdIterator::~ON_SubDFaceIdIterator  |  ( |   | )
default
◆ ON_SubDFaceIdIterator() [2/4]
 ON_SubDFaceIdIterator::ON_SubDFaceIdIterator  |  ( |  const ON_SubDFaceIdIterator &  |   | )
default
◆ ON_SubDFaceIdIterator() [3/4]
 ON_SubDFaceIdIterator::ON_SubDFaceIdIterator  |  ( |  const ON_SubDRef &  |  subd_ref | )
◆ ON_SubDFaceIdIterator() [4/4]
 ON_SubDFaceIdIterator::ON_SubDFaceIdIterator  |  ( |  const ON_SubD &  |  subd | )
Member Function Documentation
◆ CurrentFace()
 const ON_SubDFace* ON_SubDFaceIdIterator::CurrentFace  |  ( |   | ) |   const
Returns: The most recently returned face from a call to FirstFace() or NextFace().
◆ FirstFace()
 const ON_SubDFace* ON_SubDFaceIdIterator::FirstFace  |  ( |   | )
Description: In general, you want to use a ON_SubDFaceIterator to loop through SubD faces. This is a special tool for unusual sitiations when it is necessary to iteratate through every face on every level of a SubD in order of increasing m_id value. Returns: The face with the smallest id.
◆ FirstFaceOnLevel()
 const ON_SubDFace* ON_SubDFaceIdIterator::FirstFaceOnLevel  |  ( |  unsigned int  |  level_index | )
◆ NextFace()
 const ON_SubDFace* ON_SubDFaceIdIterator::NextFace  |  ( |   | )
Description: In general, you want to use a ON_SubDFaceIterator to loop through SubD faces. This is a special tool for unusual sitiations when it is necessary to iteratate through every face on every level of a SubD in order of increasing m_id value. Returns: The face in order of increasing id.
◆ NextFaceOnLevel()
 const ON_SubDFace* ON_SubDFaceIdIterator::NextFaceOnLevel  |  ( |  unsigned int  |  level_index | )
◆ operator=()
 ON_SubDFaceIdIterator& ON_SubDFaceIdIterator::operator=  |  ( |  const ON_SubDFaceIdIterator &  |   | )
default
Friends And Related Function Documentation
◆ ON_SubDHeap
 friend class ON_SubDHeap
friend