Public Member Functions | List of all members
CRhinoUiOptionsListCtrlCheckBox Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlCheckBox:
 Public Member Functions
CRhinoUiOptionsListCtrlCheckBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsButtonCaption=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlCheckBox ()
bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
bool  | CreateTriStateCeckBox () const
bool  | DrawCheckBox () const
int  | GetCheck () const
LPCTSTR  | GetCheckText () const
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
afx_msg void  | OnBnClicked ()
afx_msg void  | OnDestroy ()
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
virtual bool  | OnItemButtonClicked ()
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
afx_msg void  | OnPaint ()
int  | SetCheck (int bst_state)
void  | SetCheckText (LPCTSTR lps)
bool  | SetCreateTriStateCeckBox (bool b)
bool  | SetDrawCheckBox (bool b)
void  | SetText (LPCTSTR lps)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Additional Inherited Members
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
Detailed Description
CRhinoUiOptionsListCtrlCheckBox
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlCheckBox()
 CRhinoUiOptionsListCtrlCheckBox::CRhinoUiOptionsListCtrlCheckBox  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsButtonCaption = NULL,
|  int  |  iIndentLevel = 0
)
Description:
Parameters:
Returns:
See Also:
◆ ~CRhinoUiOptionsListCtrlCheckBox()
 virtual CRhinoUiOptionsListCtrlCheckBox::~CRhinoUiOptionsListCtrlCheckBox  |  ( |   | )
virtual
Description:
Parameters:
Returns:
See Also:
Member Function Documentation
◆ BeginEditItem()
 bool CRhinoUiOptionsListCtrlCheckBox::BeginEditItem  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit,
|  begin_edit_item_reason  |  eir
)
virtual
Description:
Parameters:
Returns:
See Also:
Implements CRhinoUiOptionsListCtrlItem.
◆ CreateTriStateCeckBox()
 bool CRhinoUiOptionsListCtrlCheckBox::CreateTriStateCeckBox  |  ( |   | ) |   const
Description:
Parameters:
Returns:
See Also:
◆ DrawCheckBox()
 bool CRhinoUiOptionsListCtrlCheckBox::DrawCheckBox  |  ( |   | ) |   const
Description:
Parameters:
Returns:
See Also:
◆ GetCheck()
 int CRhinoUiOptionsListCtrlCheckBox::GetCheck  |  ( |   | ) |   const
Description:
Parameters:
Returns:
See Also:
◆ GetCheckText()
 LPCTSTR CRhinoUiOptionsListCtrlCheckBox::GetCheckText  |  ( |   | ) |   const
Description:
Parameters:
Returns:
See Also:
◆ MoveItemWindow()
 void CRhinoUiOptionsListCtrlCheckBox::MoveItemWindow  |  ( |  CRhinoUiOptionsListCtrl &  |  list_ctrl,
|  const CRect  |  rEdit
)
virtual
Description:
Parameters:
Returns:
See Also:
Implements CRhinoUiOptionsListCtrlItem.
◆ OnBnClicked()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnBnClicked  |  ( |   | )
◆ OnDestroy()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnDestroy  |  ( |   | )
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlCheckBox::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description:
Parameters:
Returns:
See Also:
Reimplemented from CRhinoUiOptionsListCtrlItem.
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlCheckBox::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnItemButtonClicked()
 virtual bool CRhinoUiOptionsListCtrlCheckBox::OnItemButtonClicked  |  ( |   | )
virtual
Description:
Parameters:
Returns:
See Also:
◆ OnKillFocus()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnLButtonDown()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonUp()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseMove()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiOptionsListCtrlCheckBox::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ OnPaint()
 afx_msg void CRhinoUiOptionsListCtrlCheckBox::OnPaint  |  ( |   | )
◆ SetCheck()
 int CRhinoUiOptionsListCtrlCheckBox::SetCheck  |  ( |  int  |  bst_state | )
Description:
Parameters:
Returns:
See Also:
BST_UNCHECKED BST_CHECKED BST_INDETERMINATE
◆ SetCheckText()
 void CRhinoUiOptionsListCtrlCheckBox::SetCheckText  |  ( |  LPCTSTR  |  lps | )
Description:
Parameters:
Returns:
See Also:
◆ SetCreateTriStateCeckBox()
 bool CRhinoUiOptionsListCtrlCheckBox::SetCreateTriStateCeckBox  |  ( |  bool  |  b | )
Description:
Parameters:
Returns:
See Also:
◆ SetDrawCheckBox()
 bool CRhinoUiOptionsListCtrlCheckBox::SetDrawCheckBox  |  ( |  bool  |  b | )
Description:
Parameters:
Returns:
See Also:
◆ SetText()
 void CRhinoUiOptionsListCtrlCheckBox::SetText  |  ( |  LPCTSTR  |  lps | )
virtual
Description: This method is used to set text value for this item. This value is displayed in the right column of the options list control.
Parameters: lps [in] New display text for this item.
See Also: CRhinoUiOptionsListCtrl::Text() CRhinoUiOptionsListCtrl::DrawItemText()
Reimplemented from CRhinoUiOptionsListCtrlItem.