Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiTabCtrlPage Class Reference
RhinoUI
CRhinoUiTabCtrlPage dialog. More...
#include <RhinoSdkUiTabCtrlPage.h>
 Inheritance diagram for CRhinoUiTabCtrlPage:
 Public Member Functions
CRhinoUiTabCtrlPage (LPCTSTR lpszTemplateName=NULL)
CRhinoUiTabCtrlPage (UINT nIDTemplate)
virtual  | ~CRhinoUiTabCtrlPage ()
class CRhinoUiTabPageCtrl *  | GetTabCtrl () const
bool  | IsModified () const
virtual bool  | OnApply ()
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
virtual bool  | OnKillActive ()
virtual void  | OnOK ()
virtual bool  | OnSetActive ()
LRESULT  | QuerySiblings (WPARAM wParam, LPARAM lParam)
void  | SetModified (bool bChanged=true)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
virtual BOOL32  | OnInitDialog ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
void  | EndDialog (int nEndID)
called for error scenarios More...
void  | InitializeBackgroundBrush ()
virtual void  | OnCancel ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
bool  | m_bAutoDelete
bool  | m_bFirstSetActive
bool  | m_bIsModified
CBrush  | m_bkGrndBrush
COLORREF  | m_crBkGrndBrush
CRhinoUiTabPageCtrl *  | m_pTC
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
 Friends
class  | CRhinoUiTabCtrl
class  | CRhinoUiTabPageCtrl
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
Detailed Description
CRhinoUiTabCtrlPage dialog.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiTabCtrlPage() [1/2]
 CRhinoUiTabCtrlPage::CRhinoUiTabCtrlPage  |  ( |  LPCTSTR  |  lpszTemplateName = NULL | )
◆ CRhinoUiTabCtrlPage() [2/2]
 CRhinoUiTabCtrlPage::CRhinoUiTabCtrlPage  |  ( |  UINT  |  nIDTemplate | )
◆ ~CRhinoUiTabCtrlPage()
 virtual CRhinoUiTabCtrlPage::~CRhinoUiTabCtrlPage  |  ( |   | )
virtual
Member Function Documentation
◆ DoDataExchange()
 virtual void CRhinoUiTabCtrlPage::DoDataExchange  |  ( |  CDataExchange *  |  pDX | )
protectedvirtual
DDX/DDV support.
Reimplemented from CRhinoUiDialog.
◆ EndDialog()
 void CRhinoUiTabCtrlPage::EndDialog  |  ( |  int  |  nEndID | )
protected
called for error scenarios
◆ GetTabCtrl()
 class CRhinoUiTabPageCtrl* CRhinoUiTabCtrlPage::GetTabCtrl  |  ( |   | ) |   const
Description: Call this method to get the CRhinoUiTabPageCtrl that this page belongs to.
 This method will do nothing until the page has been added to the tab control by calling CRhinoUiTabPageCtrl::AddPage.
Returns: Returns pointer to CRhinoUiTabPageCtrl that owns this page. This will return NULL until CRhinoUiTabPageCtrl::AddPage() has been called for this page.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabPageCtrl::AddPage()
◆ InitializeBackgroundBrush()
 void CRhinoUiTabCtrlPage::InitializeBackgroundBrush  |  ( |   | )
protected
◆ IsModified()
 bool CRhinoUiTabCtrlPage::IsModified  |  ( |   | ) |   const
Description: Current "dirty" state of this page, see SetModified() for details.
Returns: Returns true if this page has been modified; otherwise, returns false.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabCtrlPage::SetModified()
◆ OnApply()
 virtual bool CRhinoUiTabCtrlPage::OnApply  |  ( |   | )
virtual
Description: This method is called by CRhinoUiTabPageCtrl when the user chooses the OK or the Apply Now button. When CRhinoUiTabPageCtrl calls this method, changes made on all tab control pages in the CRhinoUiTabPageCtrl are accepted, the tab control page retains focus, and OnApply returns true. Before OnApply can be called by the framework, you must have called CRhinoUiTabCtrlPage::SetModified and set its parameter to true. This will activate the Apply Now button as soon as the user makes a change on the tab control page.
Override this method to specify what action your program takes when the user clicks the Apply Now button. When overriding, the method should return true to accept changes and false to prevent changes from taking effect.
The default implementation of OnApply calls CRhinoUiTabCtrlPage::OnOK().
Returns: Return true if the changes are accepted; otherwise, returns false.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabCtrlPage::OnOK()
◆ OnCancel()
 virtual void CRhinoUiTabCtrlPage::OnCancel  |  ( |   | )
protectedvirtual
Description: This method is called by the framework when the Cancel button is selected. Override this method to perform Cancel button actions. The default negates any changes that have been made. DO NOT call EndDialog( IDCANCEL) or base class OnCancel().
See Also: CRhinoUiTabPageCtrl
◆ OnCreate()
 afx_msg int CRhinoUiTabCtrlPage::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiTabCtrlPage::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiTabCtrlPage::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnKillActive()
 virtual bool CRhinoUiTabCtrlPage::OnKillActive  |  ( |   | )
virtual
Description: This method is called by CRhinoUiTabPageCtrl when the page is no longer the active page. Override this method to perform special data validation tasks. The default implementation of this method copies settings from the controls in the property page to the member variables of the property page. If the data was not updated successfully due to a dialog data validation (DDV) error, the page retains focus.
Returns: Returns true if data was updated successfully; otherwise, returns false.
See Also: CRhinoUiTabPageCtrl
◆ OnOK()
 virtual void CRhinoUiTabCtrlPage::OnOK  |  ( |   | )
virtual
Description: This method is called by the CRhinoUiTabPageCtrl when the user chooses either the OK or Apply Now button, immediately after CRhinoUiTabPageCtrl calls OnKillActive. Override this method to implement additional behavior specific to the currently active page when the user dismisses the CRhinoUiTabPageCtrl.
The default implementation of this method marks the page as clean to reflect that the data was updated in the OnKillActive method.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabCtrlPage::OnKillActive() CRhinoUiTabCtrlPage::OnApply()
◆ OnSetActive()
 virtual bool CRhinoUiTabCtrlPage::OnSetActive  |  ( |   | )
virtual
Description: This method is called by the CRhinoUiTabPageCtrl when the page is chosen by the user and becomes the active page. Override this method to perform tasks when a page is activated. Your override of this method should call the default version before any other processing is done.
Returns: Return true if the page was successfully set active; otherwise, returns false.
See Also: CRhinoUiTabPageCtrl
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiTabCtrlPage::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreSubclassWindow()
 virtual void CRhinoUiTabCtrlPage::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ QuerySiblings()
 LRESULT CRhinoUiTabCtrlPage::QuerySiblings  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
Description: Call this method to forward a message to each page in the property sheet. If a page returns a nonzero value, the property sheet does not send the message to subsequent pages.
Returns: Returns the nonzero value from a page in the tab control, or zero if all pages return a value of zero.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabPageCtrl::AddPage()
◆ SetModified()
 void CRhinoUiTabCtrlPage::SetModified  |  ( |  bool  |  bChanged = true | )
Description: Call this method to enable or disable the Apply Now button, based on whether the settings in the tab control page should be applied to the appropriate external object. The framework keeps track of which pages are dirty; that is, tab control pages for which you have called SetModified( true). The Apply Now button is always enabled if you call SetModified( true) for one of the pages. The Apply Now button is disabled when you call SetModified( false) for one of the pages, but only if none of the other pages is dirty.
Parameters: bChanged [in] If this is true then page is dirty otherwise it is clean.
See Also: CRhinoUiTabPageCtrl CRhinoUiTabCtrlPage::IsModified()
Friends And Related Function Documentation
◆ CRhinoUiTabCtrl
 friend class CRhinoUiTabCtrl
friend
◆ CRhinoUiTabPageCtrl
 friend class CRhinoUiTabPageCtrl
friend
Member Data Documentation
◆ m_bAutoDelete
 bool CRhinoUiTabCtrlPage::m_bAutoDelete
protected
◆ m_bFirstSetActive
 bool CRhinoUiTabCtrlPage::m_bFirstSetActive
protected
◆ m_bIsModified
 bool CRhinoUiTabCtrlPage::m_bIsModified
protected
◆ m_bkGrndBrush
 CBrush CRhinoUiTabCtrlPage::m_bkGrndBrush
protected
◆ m_crBkGrndBrush
 COLORREF CRhinoUiTabCtrlPage::m_crBkGrndBrush
protected
◆ m_pTC
 CRhinoUiTabPageCtrl* CRhinoUiTabCtrlPage::m_pTC
protected