Public Member Functions | List of all members
CRhRdkPreviewSceneElement Class Referenceabstract
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkPreviewSceneElement:
 Public Member Functions
CRhRdkPreviewSceneElement ()
virtual  | ~CRhRdkPreviewSceneElement ()
virtual CRhRdkPreviewSceneElement *  | Duplicate (void) const =0
virtual const wchar_t *  | ElementKind (void) const =0
virtual UUID  | TypeId (void) const =0
virtual const wchar_t *  | XmlTag (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class represents a scene element which provides information about an element in the scene necessary to render a preview of a material or an environment. These elements are typically backgrounds, lighting, or simple objects like sphere, cube etc.
Constructor & Destructor Documentation
◆ CRhRdkPreviewSceneElement()
 CRhRdkPreviewSceneElement::CRhRdkPreviewSceneElement  |  ( |   | )
◆ ~CRhRdkPreviewSceneElement()
 virtual CRhRdkPreviewSceneElement::~CRhRdkPreviewSceneElement  |  ( |   | )
virtual
Member Function Documentation
◆ Duplicate()
 virtual CRhRdkPreviewSceneElement* CRhRdkPreviewSceneElement::Duplicate  |  ( |  void  |   | ) |   const
pure virtual
◆ ElementKind()
 virtual const wchar_t* CRhRdkPreviewSceneElement::ElementKind  |  ( |  void  |   | ) |   const
pure virtual
Implemented in CRhRdkPreviewLighting, CRhRdkPreviewBackground, and CRhRdkPreviewGeometry.
◆ TypeId()
 virtual UUID CRhRdkPreviewSceneElement::TypeId  |  ( |  void  |   | ) |   const
pure virtual
◆ XmlTag()
 virtual const wchar_t* CRhRdkPreviewSceneElement::XmlTag  |  ( |  void  |   | ) |   const
pure virtual