Public Member Functions | Protected Attributes | List of all members
CRhinoProfileContextIterator Class Referenceabstract
RhinoUI
#include <RhinoSdkUiProfileContextIterator.h>
 Inheritance diagram for CRhinoProfileContextIterator:
 Public Member Functions
CRhinoProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoProfileContextIterator ()
virtual const wchar_t *  | FirstSection ()=0
Must override. More...
virtual const wchar_t *  | FirstValue ()=0
int  | IterateAllSections (bool(*cull)(const wchar_t *)=NULL)
int  | IterateAllValues (bool(*cull)(ON_wString &value_name, ON_wString &value)=NULL)
virtual const wchar_t *  | NextSection ()=0
virtual const wchar_t *  | NextValue ()=0
const wchar_t *  | Section (int index) const
int  | SectionCount () const
const ON_ClassArray< ON_wString > &  | Sections () const
const wchar_t *  | Value () const
bool  | Value (bool &result) const
bool  | Value (double &result) const
bool  | Value (int &result) const
bool  | Value (int index, bool &result) const
bool  | Value (int index, double &result) const
bool  | Value (int index, int &result) const
bool  | Value (int index, ON_3dPoint &result) const
bool  | Value (int index, ON_3dVector &result) const
bool  | Value (int index, ON_Color &result) const
bool  | Value (int index, ON_wString &result) const
bool  | Value (int index, POINT &result) const
bool  | Value (int index, RECT &result) const
bool  | Value (ON_3dPoint &result) const
bool  | Value (ON_3dVector &result) const
bool  | Value (ON_Color &result) const
bool  | Value (ON_wString &result) const
bool  | Value (POINT &result) const
bool  | Value (RECT &result) const
int  | ValueCount () const
const wchar_t *  | ValueName (int index) const
const ON_ClassArray< ON_wString > &  | ValueNames () const
const ON_ClassArray< ON_wString > &  | Values () const
 Protected Attributes
int  | m_item
CRhinoProfileContext &  | m_pc
ON_wString  | m_section
ON_ClassArray< ON_wString >  | m_sections
ON_wString  | m_value
ON_wString  | m_value_name
ON_ClassArray< ON_wString >  | m_value_names
ON_ClassArray< ON_wString >  | m_values
ON_wString  | m_w
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoProfileContextIterator()
 CRhinoProfileContextIterator::CRhinoProfileContextIterator  |  ( |  const wchar_t *  |  section,
|  CRhinoProfileContext &  |  pc
)
◆ ~CRhinoProfileContextIterator()
 virtual CRhinoProfileContextIterator::~CRhinoProfileContextIterator  |  ( |   | )
virtual
Member Function Documentation
◆ FirstSection()
 virtual const wchar_t* CRhinoProfileContextIterator::FirstSection  |  ( |   | )
pure virtual
Must override.
Implemented in CRhinoIniProfileContextIterator, CRhinoRegProfileContextIterator, and CRhinoPropListProfileContextIterator.
◆ FirstValue()
 virtual const wchar_t* CRhinoProfileContextIterator::FirstValue  |  ( |   | )
pure virtual
Implemented in CRhinoIniProfileContextIterator, CRhinoRegProfileContextIterator, and CRhinoPropListProfileContextIterator.
◆ IterateAllSections()
 int CRhinoProfileContextIterator::IterateAllSections  |  ( |  bool(*)(const wchar_t *)  |  cull = NULL | )
◆ IterateAllValues()
 int CRhinoProfileContextIterator::IterateAllValues  |  ( |  bool(*)(ON_wString &value_name, ON_wString &value)  |  cull = NULL | )
◆ NextSection()
 virtual const wchar_t* CRhinoProfileContextIterator::NextSection  |  ( |   | )
pure virtual
Implemented in CRhinoIniProfileContextIterator, CRhinoRegProfileContextIterator, and CRhinoPropListProfileContextIterator.
◆ NextValue()
 virtual const wchar_t* CRhinoProfileContextIterator::NextValue  |  ( |   | )
pure virtual
Implemented in CRhinoIniProfileContextIterator, CRhinoRegProfileContextIterator, and CRhinoPropListProfileContextIterator.
◆ Section()
 const wchar_t* CRhinoProfileContextIterator::Section  |  ( |  int  |  index | ) |   const
◆ SectionCount()
 int CRhinoProfileContextIterator::SectionCount  |  ( |   | ) |   const
inline
◆ Sections()
 const ON_ClassArray<ON_wString>& CRhinoProfileContextIterator::Sections  |  ( |   | ) |   const
◆ Value() [1/19]
 const wchar_t* CRhinoProfileContextIterator::Value  |  ( |   | ) |   const
◆ Value() [2/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  bool &  |  result | ) |   const
◆ Value() [3/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  double &  |  result | ) |   const
◆ Value() [4/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int &  |  result | ) |   const
◆ Value() [5/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  bool &  |  result
) |   |  const
◆ Value() [6/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  double &  |  result
) |   |  const
◆ Value() [7/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  int &  |  result
) |   |  const
◆ Value() [8/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  ON_3dPoint &  |  result
) |   |  const
◆ Value() [9/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  ON_3dVector &  |  result
) |   |  const
◆ Value() [10/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  ON_Color &  |  result
) |   |  const
◆ Value() [11/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  ON_wString &  |  result
) |   |  const
◆ Value() [12/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  POINT &  |  result
) |   |  const
◆ Value() [13/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  int  |  index,
|  RECT &  |  result
) |   |  const
◆ Value() [14/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  ON_3dPoint &  |  result | ) |   const
◆ Value() [15/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  ON_3dVector &  |  result | ) |   const
◆ Value() [16/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  ON_Color &  |  result | ) |   const
◆ Value() [17/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  ON_wString &  |  result | ) |   const
◆ Value() [18/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  POINT &  |  result | ) |   const
◆ Value() [19/19]
 bool CRhinoProfileContextIterator::Value  |  ( |  RECT &  |  result | ) |   const
◆ ValueCount()
 int CRhinoProfileContextIterator::ValueCount  |  ( |   | ) |   const
◆ ValueName()
 const wchar_t* CRhinoProfileContextIterator::ValueName  |  ( |  int  |  index | ) |   const
◆ ValueNames()
 const ON_ClassArray<ON_wString>& CRhinoProfileContextIterator::ValueNames  |  ( |   | ) |   const
◆ Values()
 const ON_ClassArray<ON_wString>& CRhinoProfileContextIterator::Values  |  ( |   | ) |   const
Member Data Documentation
◆ m_item
 int CRhinoProfileContextIterator::m_item
protected
◆ m_pc
 CRhinoProfileContext& CRhinoProfileContextIterator::m_pc
protected
◆ m_section
 ON_wString CRhinoProfileContextIterator::m_section
protected
◆ m_sections
 ON_ClassArray<ON_wString> CRhinoProfileContextIterator::m_sections
protected
◆ m_value
 ON_wString CRhinoProfileContextIterator::m_value
protected
◆ m_value_name
 ON_wString CRhinoProfileContextIterator::m_value_name
protected
◆ m_value_names
 ON_ClassArray<ON_wString> CRhinoProfileContextIterator::m_value_names
protected
◆ m_values
 ON_ClassArray<ON_wString> CRhinoProfileContextIterator::m_values
protected
◆ m_w
 ON_wString CRhinoProfileContextIterator::m_w
protected