Public Member Functions | List of all members
CRhinoGetMeshes Class Reference
RhinoGet
#include <rhinoSdkGetObject.h>
 Inheritance diagram for CRhinoGetMeshes:
 Public Member Functions
CRhinoGetMeshes ()
~CRhinoGetMeshes ()
BOOL32  | GetExportMeshes (BOOL32=false)
CRhinoMeshRef  | Mesh (int)
int  | MeshCount () const
 Public Member Functions inherited from CRhinoGet
CRhinoGet (TYPE)
CRhinoGet (TYPE, const CRhinoGet &)
virtual  | ~CRhinoGet ()
bool  | Accept2dPointValue () const
2d screen point (used by CRhinoGet2dPoint) More...
void  | AcceptColor (BOOL32 b=true)
bool  | AcceptColorValue () const
bool  | AcceptCustomWindowsMessage (UINT winmsg_id)
void  | AcceptEnterWhenDone (bool b=true)
bool  | AcceptEnterWhenDoneValue () const
void  | AcceptLiteralString (bool b=true)
bool  | AcceptLiteralStringValue () const
void  | AcceptNothing (BOOL32 b=true)
bool  | AcceptNothingValue () const
used internally by Command UI More...
void  | AcceptNumber (bool b=true, bool bAcceptZero=true)
bool  | AcceptNumberValue () const
bool  | AcceptNumberZeroValue () const
void  | AcceptPoint (BOOL32 b=true)
bool  | AcceptPointValue () const
3d world point More...
void  | AcceptString (BOOL32 b=true)
bool  | AcceptString_0Value () const
bool  | AcceptStringValue () const
void  | AcceptUndo (BOOL32 b=true)
call to allow user undo previous selection. More...
bool  | AcceptUndoValue () const
int  | AddCommandOption (CRhinoCommandOptionName option_name, CRhinoCommandOptionValue option_value=CRhinoCommandOptionValue(nullptr, nullptr), BOOL32 bHiddenOption=false)
int  | AddCommandOption (CRhinoCommandOptionName option_name, double number_value)
int  | AddCommandOption (CRhinoCommandOptionName option_name, int number_value)
int  | AddCommandOptionColor (CRhinoCommandOptionName option_name, ON_Color *color_value, const wchar_t *option_prompt=nullptr)
int  | AddCommandOptionInteger (CRhinoCommandOptionName option_name, int *integer_value, const wchar_t *option_prompt=nullptr, double lower_limit=ON_UNSET_VALUE, double upper_limit=ON_UNSET_VALUE)
int  | AddCommandOptionList (CRhinoCommandOptionName option_name, const ON_SimpleArray< CRhinoCommandOptionValue > &list_values, int list_current_index)
int  | AddCommandOptionList (CRhinoCommandOptionName option_name, int list_current_index, CRhinoCommandOptionValue list0_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list1_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list2_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list3_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list4_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list5_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list6_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list7_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list8_value=CRhinoCommandOptionValue(nullptr, nullptr), CRhinoCommandOptionValue list9_value=CRhinoCommandOptionValue(nullptr, nullptr))
int  | AddCommandOptionList (CRhinoCommandOptionName option_name, int list_values_count, const CRhinoCommandOptionValue *list_values, int list_current_index)
int  | AddCommandOptionNumber (CRhinoCommandOptionName option_name, double *number_value, const wchar_t *option_prompt=nullptr, BOOL32 bIntegerValue=false, double lower_limit=ON_UNSET_VALUE, double upper_limit=ON_UNSET_VALUE, int number_format=0)
int  | AddCommandOptionString (CRhinoCommandOptionName option_name, ON_wString *string_value, const wchar_t *get_string_prompt=nullptr, bool bAllowEmptyString=false)
int  | AddCommandOptionToggle (CRhinoCommandOptionName option_name, CRhinoCommandOptionValue option_off_value, CRhinoCommandOptionValue option_on_value, bool bToggleState, bool *bCurrentToggleState=nullptr)
int  | AddCommandOptionToggle (CRhinoCommandOptionName option_name, CRhinoCommandOptionValue option_off_value, CRhinoCommandOptionValue option_on_value, BOOL32 bToggleState, BOOL32 *bCurrentToggleState=nullptr)
void  | AddHiddenCommandOptionAlias (int option_index, const wchar_t *alias1, const wchar_t *alias2=nullptr, const wchar_t *alias3=nullptr, const wchar_t *alias4=nullptr)
low level tool More...
void  | ClearCommandOptions ()
Clear all command line options. More...
void  | ClearDefault ()
ON_Color  | Color () const
Used to get color if Get*() returns CRhinoGet::color. More...
CRhinoCommand::result  | CommandResult () const
const ON_Color &  | DefaultColor () const
double  | DefaultNumber () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | EnableTransparentCommands (BOOL32 bEnableTransparentCommands)
void  | GetPrompt (ON_wString &prompt, ON_wString &prompt_default, ON_ClassArray< CRhinoCommandOption > &options)
BOOL32  | GotDefault () const
bool  | In2dGet () const
these functions are used by CRhinoView::OnMouseDown/Move/Up - pretend they don't exist More...
bool  | IsGetColor () const
bool  | IsGetMeshes () const
bool  | IsGetNumber () const
bool  | IsGetObject () const
bool  | IsGetOption () const
bool  | IsGetPoint () const
bool  | IsGetString () const
RH_LINE  | Line2d () const
double  | Number () const
const CRhinoCommandOption *  | Option () const
int  | OptionCount () const
Get the number of available command line options. This information is useful when command flow depends on the existence of command line options. More...
int  | OptionCurrentListOptionIndex () const
int  | OptionIndex () const
CRhinoCommandOption::COMMAND_OPTION_TYPE  | OptionType () const
ON_4iRect  | PickRect () const
ON_3dPoint  | Point () const
Used to get point if Get*() returns CRhinoGet::point. More...
ON_2iPoint  | Point2d () const
ON_4iRect  | Rectangle2d () const
CRhinoGet::result  | Result () const
returns result of the Get*() call More...
unsigned int  | SerialNumber () const
low level tool used to identify the get More...
void  | SetCommandPrompt (const wchar_t *prompt)
void  | SetCommandPromptDefault (const wchar_t *default_value)
void  | SetDefaultColor (ON_Color default_color)
void  | SetDefaultColor (ON_Color default_color, bool bUseAlpha)
void  | SetDefaultInteger (int default_integer)
void  | SetDefaultNumber (double default_number, const wchar_t *format=nullptr)
void  | SetDefaultPoint (ON_3dPoint default_point)
void  | SetDefaultString (const wchar_t *default_string)
void  | SetDocument (unsigned int rhino_doc_sn)
void  | SetImmediateTimeout ()
void  | SetOptionVaries (int option_index, bool bVaries)
Set option that uses "option_name=value" format to show the value as "Varies". More...
void  | SetVector (const ON_3dVector &v)
void  | SetWaitDuration (double seconds)
const wchar_t *  | String () const
TYPE  | Type () const
ON_3dVector  | Vector () const
CRhinoView *  | View () const
unsigned int  | WaitDuration () const
MSG  | WindowsMessage () const
ON_3dPoint  | WorldPoint1 () const
ON_3dPoint  | WorldPoint2 () const
 Additional Inherited Members
 Public Types inherited from CRhinoGet
enum  | result {
 no_result = 0, cancel = 1, nothing = 2, option,
 number, color, undo, miss,
 point, point2d, line2d, rect2d,
 object, string, winmsg, timeout,
 circle, plane, cylinder, sphere,
 angle, distance, direction, frame,
 number_preview, point_preview, string_preview, user1 = 0xFFFFFFFF,
 user2 = 0xFFFFFFFE, user3 = 0xFFFFFFFD, user4 = 0xFFFFFFFC, user5 = 0xFFFFFFFB,
 exit_rhino = 0x0FFFFFFF
 }
enum  | TYPE {
 get_string = 1, get_point = 2, get_object = 3, get_meshes = 4,
 get_option = 5, get_number = 6, get_color = 7, force_32bit_enum = 0xFFFFFFFF
 }
 Static Public Member Functions inherited from CRhinoGet
static BOOL32  | IsValidOptionName (const wchar_t *option_name)
static BOOL32  | IsValidOptionValueName (const wchar_t *option_value)
static void  | PostCustomWindowsMessage (UINT Msg, WPARAM wParam, LPARAM lParam)
 Public Attributes inherited from CRhinoGet
class CRhGetSdkExtension *  | m__rhino_get_sdk_extension
 Protected Member Functions inherited from CRhinoGet
CRhinoGet::result  | AutoProcessOption ()
const CRhinoCommandOption *  | CommandOptionAtIndex (int option_index) const
int  | CommandOptionCount () const
see source for comments More...
virtual ON_Plane  | GetCS (bool bWorldCoordinates, bool bRelativeCoordinates)
Helper used by IsAcceptableInput when parsing points. More...
CRhinoGet::result  | IsAcceptableInput (const class CRhEventToken &, BOOL32 bAcceptNumber, BOOL32 *bUpdatedOptionValue, CRhinoHistory *history)
CRhinoGet &  | operator= (const CRhinoGet &)
void  | PreGet ()
void  | RemoveCommandOptions (int option_index)
see source for comments More...
virtual void  | SetCommandWndPrompt () const
void  | SetOptionAccelerators ()
 Protected Attributes inherited from CRhinoGet
bool  | m_2dClamp
true to clamp 2d coordinates to window More...
int  | m_2dget_mode
int  | m_2dget_pen_style
ON_2iPoint  | m_2dget_point1
first 2d rect corner-center / 2d line end More...
ON_2iPoint  | m_2dget_point2
second 2d rect corner / 2d line end More...
ON_wString  | m_2dget_second_prompt
int  | m_2dget_step
0 = none, 1 = get first point, 2 get second point, 3 = done More...
ON_3dPoint  | m_2dget_wpoint1
first 3d world point input during 2d get point More...
ON_3dPoint  | m_2dget_wpoint2
second 3d world point input during 2d get point More...
ON_2iPoint  | m_2dpoint
2d window point (used by CRhinoGetPoint::Get2dPoint) More...
bool  | m_bAccept2dPoint
2d screen point (used by CRhinoGet2dPoint) More...
BOOL32  | m_bAcceptColor
BOOL32  | m_bAcceptNothing
bool  | m_bAcceptNumber
bool  | m_bAcceptNumberZero
BOOL32  | m_bAcceptPoint
3d world point More...
BOOL32  | m_bAcceptString
BOOL32  | m_bAcceptString_0
BOOL32  | m_bAcceptUndo
BOOL32  | m_bEnableTransparentCommands
bool  | m_bGetPointOnMouseUp
true if getting point on mouse up More...
ON_Color  | m_color
double  | m_number
CRhinoView *  | m_p2dPointView
if not NULL, Get2dPoint()/Get2dRectangle() will use this view More...
ON_4iRect  | m_pick_rect
ON_3dPoint  | m_point
3d world point More...
ON_wString  | m_prompt
ON_wString  | m_prompt_default
CRhinoGet::result  | m_result
unsigned int  | m_rhino_view_sn = 0
ON_wString  | m_string
const TYPE  | m_type
ON_3dVector  | m_vector
3d world vector (from some digitizers) More...
UINT  | m_wait_duration
milliseconds More...
ON_SimpleArray< UINT >  | m_winmsg_id_list
Detailed Description
 CLASS CRhinoGetExportMeshes
OVERVIEW TEXT Interactively gets meshes for commands that export meshes to other file formats.
KEYWORDS
mesh, export, get_object
Constructor & Destructor Documentation
◆ CRhinoGetMeshes()
 CRhinoGetMeshes::CRhinoGetMeshes  |  ( |   | )
◆ ~CRhinoGetMeshes()
 CRhinoGetMeshes::~CRhinoGetMeshes  |  ( |   | )
Member Function Documentation
◆ GetExportMeshes()
 BOOL32 CRhinoGetMeshes::GetExportMeshes  |  ( |  BOOL32  |   = false | )
STEP 1: Interactively get meshes.
◆ Mesh()
 CRhinoMeshRef CRhinoGetMeshes::Mesh  |  ( |  int  |   | )
STEP 3: Mesh(i) (0 <= i < MeshCount() to get the meshes. Note that the meshes will automatically be destroyed by ~CRhinoGetMeshes(), so you must copy them if you need them after ~CRhinoGetMeshes().
◆ MeshCount()
 int CRhinoGetMeshes::MeshCount  |  ( |   | ) |   const
STEP 2: call MeshCount() to see how many meshes you have