Public Attributes | List of all members
CRhinoPurgeHistoryStatistics Class Reference
Rhino
#include <RhinoSdkHistoryRecordTable.h>
 Public Attributes
int  | m_hidden_count = 0
int  | m_purged_count = 0
The number of objects that had a history record purged. More...
Detailed Description
26-Jul-2026 Bill Cook, https://mcneel.myjetbrains.com/youtrack/issue/RH-64038 The HistoryPurge command's logic, moved here so it can be called by the SDK. Description: Statistics that describe what RhinoPurgeObjectHistory() purged. See Also: RhinoPurgeObjectHistory
Member Data Documentation
◆ m_hidden_count
 int CRhinoPurgeHistoryStatistics::m_hidden_count = 0
The number of purged objects that were hidden or on a hidden layer. Only counted when purging every object in the document.
◆ m_purged_count
 int CRhinoPurgeHistoryStatistics::m_purged_count = 0
The number of objects that had a history record purged.