Public Types | Public Member Functions | Public Attributes | List of all members
CArgsRhinoSweep2 Class Reference
Rhino
#include <rhinoSdkSweep.h>
 Public Types
enum  | eSweep2Simplify { ess_Nothing = 0, ess_Rebuild = 1, ess_Refit = 2 }
 Public Member Functions
CArgsRhinoSweep2 ()
~CArgsRhinoSweep2 ()
bool  | TestForSimpleSweep ()
See if inputs are perfect enough to do greville interpolate. More...
 Public Attributes
double  | m_angle_tolerance
tolerance to pass to TL sweeper as AngleTolerance More...
BOOL32  | m_bClosed
Open or closed sweep if both rails are closed. More...
BOOL32  | m_bSameHeight
maintain height between shapes - don't scale it the same as width More...
BOOL32  | m_bSimpleSweep
Make a simple surface by greville interpolation of shapes. More...
ON_SimpleArray< ON_3dPoint >  | m_points
start and end points More...
void *  | m_pUser
const CRhinoPolyEdge *  | m_rail_curves [2]
input rail curves More...
ON_SimpleArray< double >  | m_rail_params [2]
ON_3dPoint  | m_rail_pick_points [2]
first pick points for rails or ON_UNSET_POINT if not point picked More...
int  | m_rebuild_count
Sample point count for rebuilding shapes. More...
double  | m_refit_tolerance
tolerance to refit shape curves More...
ON_SimpleArray< const ON_Curve * >  | m_shape_curves
array of input shapes More...
int  | m_simplify
Simplify method for shape curves. More...
double  | m_sweep_tolerance
tolerance to pass to TL sweeper as SweepTolerance More...
Member Enumeration Documentation
◆ eSweep2Simplify
 enum CArgsRhinoSweep2::eSweep2Simplify
Enumerator
ess_Nothing
Use the shapes as is.
ess_Rebuild
Rebuild interpolating equally spaced points.
ess_Refit
Refit to a tolerance.
Constructor & Destructor Documentation
◆ CArgsRhinoSweep2()
 CArgsRhinoSweep2::CArgsRhinoSweep2  |  ( |   | )
◆ ~CArgsRhinoSweep2()
 CArgsRhinoSweep2::~CArgsRhinoSweep2  |  ( |   | )
Member Function Documentation
◆ TestForSimpleSweep()
 bool CArgsRhinoSweep2::TestForSimpleSweep  |  ( |   | )
See if inputs are perfect enough to do greville interpolate.
Member Data Documentation
◆ m_angle_tolerance
 double CArgsRhinoSweep2::m_angle_tolerance
tolerance to pass to TL sweeper as AngleTolerance
◆ m_bClosed
 BOOL32 CArgsRhinoSweep2::m_bClosed
Open or closed sweep if both rails are closed.
◆ m_bSameHeight
 BOOL32 CArgsRhinoSweep2::m_bSameHeight
maintain height between shapes - don't scale it the same as width
◆ m_bSimpleSweep
 BOOL32 CArgsRhinoSweep2::m_bSimpleSweep
Make a simple surface by greville interpolation of shapes.
◆ m_points
 ON_SimpleArray<ON_3dPoint> CArgsRhinoSweep2::m_points
start and end points
◆ m_pUser
 void* CArgsRhinoSweep2::m_pUser
◆ m_rail_curves
 const CRhinoPolyEdge* CArgsRhinoSweep2::m_rail_curves[2]
input rail curves
◆ m_rail_params
 ON_SimpleArray<double> CArgsRhinoSweep2::m_rail_params[2]
params on the rail that correspond to each shape these don't include start or end points or invented shapes
◆ m_rail_pick_points
 ON_3dPoint CArgsRhinoSweep2::m_rail_pick_points[2]
first pick points for rails or ON_UNSET_POINT if not point picked
◆ m_rebuild_count
 int CArgsRhinoSweep2::m_rebuild_count
Sample point count for rebuilding shapes.
◆ m_refit_tolerance
 double CArgsRhinoSweep2::m_refit_tolerance
tolerance to refit shape curves
◆ m_shape_curves
 ON_SimpleArray<const ON_Curve*> CArgsRhinoSweep2::m_shape_curves
array of input shapes
◆ m_simplify
 int CArgsRhinoSweep2::m_simplify
Simplify method for shape curves.
◆ m_sweep_tolerance
 double CArgsRhinoSweep2::m_sweep_tolerance
tolerance to pass to TL sweeper as SweepTolerance