Public Member Functions | List of all members
CRhinoComponentNameConflictUI Class Reference
Rhino
#include <rhinoSdkFileOptions.h>
 Public Member Functions
CRhinoComponentNameConflictUI ()=default
CRhinoComponentNameConflictUI (const CRhinoComponentNameConflictUI &)=default
~CRhinoComponentNameConflictUI ()=default
CRhinoCommand::result  | CommandResult () const
ON_UUID  | ComponentParentId () const
ON_ModelComponent::Type  | ComponentType () const
const ON_wString &  | DefaultNewComponentName () const
ON::ComponentNameConflictResolution  | DefaultResolutionMethod () const
CRhinoCommand::result  | DialogQuery ()
const ON_wString &  | DialogTitle () const
CRhinoDoc *  | Document () const
const ON_ComponentManifest &  | DocumentManifest () const
const ON_wString &  | NameWithConflict () const
const ON_wString &  | NewComponentName () const
const ON_wString &  | NewNameEditBoxDescription () const
bool  | NewNameIsValidAndUnique (const wchar_t *new_name_candidate) const
CRhinoComponentNameConflictUI &  | operator= (const CRhinoComponentNameConflictUI &)=default
bool  | PermitCancel () const
const ON_wString &  | QueryMessage () const
ON::ComponentNameConflictResolution  | ResolutionMethod () const
CRhinoCommand::result  | ScriptGetNewNameQuery ()
CRhinoCommand::result  | ScriptQuery ()
const ON_wString &  | ScriptQueryGetGetNamePrompt () const
const ON_wString &  | ScriptQueryGetGetOptionPrompt () const
void  | SetComponentWithNameConflict (const ON_ModelComponent &component)
bool  | SetDefaultNewComponentName (const wchar_t *default_new_component_name)
void  | SetDefaultResolutionMethod (ON::ComponentNameConflictResolution default_resolution_method)
void  | SetDialogTitle (const wchar_t *dialog_title)
void  | SetDocument (const CRhinoDoc &doc)
void  | SetDocument (const CRhinoDoc *doc)
void  | SetDocument (unsigned int rhino_doc_sn)
bool  | SetNewComponentName (const wchar_t *new_component_name)
void  | SetNewNameEditBoxDescription (const wchar_t *new_name_edit_box_description)
void  | SetPermitCancel (bool bPermitCancel)
void  | SetQueryMessage (const wchar_t *query_message)
void  | SetResolutionMethod (ON::ComponentNameConflictResolution resolution_method)
void  | SetScriptQueryGetGetNamePrompt (const wchar_t *script_query_get_name_prompt)
void  | SetScriptQueryGetGetOptionPrompt (const wchar_t *script_query_get_option_prompt)
void  | SetUpdateModelComponentRadioButtonDescription (const wchar_t *update_model_component_radio_button_description)
void  | SetUseBothComponentsRadioButtonDescription (const wchar_t *use_both_components_radio_button_description)
void  | SetUseForAllCheckBoxDescription (const wchar_t *for_all_check_box_description)
void  | SetUseModelComponentRadioButtonDescription (const wchar_t *use_model_component_radio_button_description)
void  | SetUseResolutionMethodForFutureConflicts (bool bUseResolutionMethodForFutureConflicts)
const ON_wString &  | UpdateModelComponentRadioButtonDescription () const
const ON_wString &  | UseBothComponentsRadioButtonDescription () const
const ON_wString &  | UseForAllCheckBoxDescription () const
const ON_wString &  | UseModelComponentRadioButtonDescription () const
bool  | UseResolutionMethodForFutureConflicts () const
Constructor & Destructor Documentation
◆ CRhinoComponentNameConflictUI() [1/2]
 CRhinoComponentNameConflictUI::CRhinoComponentNameConflictUI  |  ( |   | )
default
◆ ~CRhinoComponentNameConflictUI()
 CRhinoComponentNameConflictUI::~CRhinoComponentNameConflictUI  |  ( |   | )
default
◆ CRhinoComponentNameConflictUI() [2/2]
 CRhinoComponentNameConflictUI::CRhinoComponentNameConflictUI  |  ( |  const CRhinoComponentNameConflictUI &  |   | )
default
Member Function Documentation
◆ CommandResult()
 CRhinoCommand::result CRhinoComponentNameConflictUI::CommandResult  |  ( |   | ) |   const
◆ ComponentParentId()
 ON_UUID CRhinoComponentNameConflictUI::ComponentParentId  |  ( |   | ) |   const
◆ ComponentType()
 ON_ModelComponent::Type CRhinoComponentNameConflictUI::ComponentType  |  ( |   | ) |   const
◆ DefaultNewComponentName()
 const ON_wString& CRhinoComponentNameConflictUI::DefaultNewComponentName  |  ( |   | ) |   const
◆ DefaultResolutionMethod()
 ON::ComponentNameConflictResolution CRhinoComponentNameConflictUI::DefaultResolutionMethod  |  ( |   | ) |   const
◆ DialogQuery()
 CRhinoCommand::result CRhinoComponentNameConflictUI::DialogQuery  |  ( |   | )
Description: Use a modal dialog interface to resolve the component name conflict. Returns: CRhinoCommand::result::success: Query was successful. The results are availailable from ResolutionMethod(), UseResolutionMethodForFutureConflicts(), and NewComponentName(). Otherwise: Query was canceled or unable to get an answer.
◆ DialogTitle()
 const ON_wString& CRhinoComponentNameConflictUI::DialogTitle  |  ( |   | ) |   const
◆ Document()
 CRhinoDoc* CRhinoComponentNameConflictUI::Document  |  ( |   | ) |   const
◆ DocumentManifest()
 const ON_ComponentManifest& CRhinoComponentNameConflictUI::DocumentManifest  |  ( |   | ) |   const
Returns: The manifest for the current document.
◆ NameWithConflict()
 const ON_wString& CRhinoComponentNameConflictUI::NameWithConflict  |  ( |   | ) |   const
◆ NewComponentName()
 const ON_wString& CRhinoComponentNameConflictUI::NewComponentName  |  ( |   | ) |   const
◆ NewNameEditBoxDescription()
 const ON_wString& CRhinoComponentNameConflictUI::NewNameEditBoxDescription  |  ( |   | ) |   const
◆ NewNameIsValidAndUnique()
 bool CRhinoComponentNameConflictUI::NewNameIsValidAndUnique  |  ( |  const wchar_t *  |  new_name_candidate | ) |   const
tools to determine how to resolve the name conflict Description: Tests new_name_candidate to see if it is valid and unique. If it is, both components can be used by changing the name of one to new_name_candidate. Parameters: new_name_candidate - [in] component name to test. Returns: True: new_name can be used to resolve the component name conflict.
◆ operator=()
 CRhinoComponentNameConflictUI& CRhinoComponentNameConflictUI::operator=  |  ( |  const CRhinoComponentNameConflictUI &  |   | )
default
◆ PermitCancel()
 bool CRhinoComponentNameConflictUI::PermitCancel  |  ( |   | ) |   const
Returns: true: The query user interface should permit canceling. false: The user must provide an answer.
◆ QueryMessage()
 const ON_wString& CRhinoComponentNameConflictUI::QueryMessage  |  ( |   | ) |   const
◆ ResolutionMethod()
 ON::ComponentNameConflictResolution CRhinoComponentNameConflictUI::ResolutionMethod  |  ( |   | ) |   const
◆ ScriptGetNewNameQuery()
 CRhinoCommand::result CRhinoComponentNameConflictUI::ScriptGetNewNameQuery  |  ( |   | )
Description: Script interface to get a new component name.
◆ ScriptQuery()
 CRhinoCommand::result CRhinoComponentNameConflictUI::ScriptQuery  |  ( |   | )
Description: Use Rhino command script interface to resolve the component name conflict. Returns: CRhinoCommand::result::success: Query was successful. The results are availailable from ResolutionMethod(), UseResolutionMethodForFutureConflicts(), and NewComponentName(). Otherwise: Query was canceled or unable to get an answer.
◆ ScriptQueryGetGetNamePrompt()
 const ON_wString& CRhinoComponentNameConflictUI::ScriptQueryGetGetNamePrompt  |  ( |   | ) |   const
◆ ScriptQueryGetGetOptionPrompt()
 const ON_wString& CRhinoComponentNameConflictUI::ScriptQueryGetGetOptionPrompt  |  ( |   | ) |   const
◆ SetComponentWithNameConflict()
 void CRhinoComponentNameConflictUI::SetComponentWithNameConflict  |  ( |  const ON_ModelComponent &  |  component | )
◆ SetDefaultNewComponentName()
 bool CRhinoComponentNameConflictUI::SetDefaultNewComponentName  |  ( |  const wchar_t *  |  default_new_component_name | )
◆ SetDefaultResolutionMethod()
 void CRhinoComponentNameConflictUI::SetDefaultResolutionMethod  |  ( |  ON::ComponentNameConflictResolution  |  default_resolution_method | )
◆ SetDialogTitle()
 void CRhinoComponentNameConflictUI::SetDialogTitle  |  ( |  const wchar_t *  |  dialog_title | )
input for dialog query Description: If no title is set, a default title is generated.
◆ SetDocument() [1/3]
 void CRhinoComponentNameConflictUI::SetDocument  |  ( |  const CRhinoDoc &  |  doc | )
input information for script and dialog query
◆ SetDocument() [2/3]
 void CRhinoComponentNameConflictUI::SetDocument  |  ( |  const CRhinoDoc *  |  doc | )
◆ SetDocument() [3/3]
 void CRhinoComponentNameConflictUI::SetDocument  |  ( |  unsigned int  |  rhino_doc_sn | )
◆ SetNewComponentName()
 bool CRhinoComponentNameConflictUI::SetNewComponentName  |  ( |  const wchar_t *  |  new_component_name | )
◆ SetNewNameEditBoxDescription()
 void CRhinoComponentNameConflictUI::SetNewNameEditBoxDescription  |  ( |  const wchar_t *  |  new_name_edit_box_description | )
If a script new name edit box description is not set, an appropriate one will be automatically generated.
◆ SetPermitCancel()
 void CRhinoComponentNameConflictUI::SetPermitCancel  |  ( |  bool  |  bPermitCancel | )
◆ SetQueryMessage()
 void CRhinoComponentNameConflictUI::SetQueryMessage  |  ( |  const wchar_t *  |  query_message | )
If a query message is not set, an appropriate one will be automatically generated.
◆ SetResolutionMethod()
 void CRhinoComponentNameConflictUI::SetResolutionMethod  |  ( |  ON::ComponentNameConflictResolution  |  resolution_method | )
output information
◆ SetScriptQueryGetGetNamePrompt()
 void CRhinoComponentNameConflictUI::SetScriptQueryGetGetNamePrompt  |  ( |  const wchar_t *  |  script_query_get_name_prompt | )
If a script get name prompt is not set, an appropriate one will be automatically generated.
◆ SetScriptQueryGetGetOptionPrompt()
 void CRhinoComponentNameConflictUI::SetScriptQueryGetGetOptionPrompt  |  ( |  const wchar_t *  |  script_query_get_option_prompt | )
input for script query If a script get option prompt is not set, an appropriate one will be automatically generated.
◆ SetUpdateModelComponentRadioButtonDescription()
 void CRhinoComponentNameConflictUI::SetUpdateModelComponentRadioButtonDescription  |  ( |  const wchar_t *  |  update_model_component_radio_button_description | )
Description: If no radio button description is set, one is automatically generated.
◆ SetUseBothComponentsRadioButtonDescription()
 void CRhinoComponentNameConflictUI::SetUseBothComponentsRadioButtonDescription  |  ( |  const wchar_t *  |  use_both_components_radio_button_description | )
Description: If no radio button description is set, one is automatically generated.
◆ SetUseForAllCheckBoxDescription()
 void CRhinoComponentNameConflictUI::SetUseForAllCheckBoxDescription  |  ( |  const wchar_t *  |  for_all_check_box_description | )
If a use all check box description is not set, an appropriate one will be automatically generated.
◆ SetUseModelComponentRadioButtonDescription()
 void CRhinoComponentNameConflictUI::SetUseModelComponentRadioButtonDescription  |  ( |  const wchar_t *  |  use_model_component_radio_button_description | )
Description: If no radio button description is set, one is automatically generated.
◆ SetUseResolutionMethodForFutureConflicts()
 void CRhinoComponentNameConflictUI::SetUseResolutionMethodForFutureConflicts  |  ( |  bool  |  bUseResolutionMethodForFutureConflicts | )
◆ UpdateModelComponentRadioButtonDescription()
 const ON_wString& CRhinoComponentNameConflictUI::UpdateModelComponentRadioButtonDescription  |  ( |   | ) |   const
◆ UseBothComponentsRadioButtonDescription()
 const ON_wString& CRhinoComponentNameConflictUI::UseBothComponentsRadioButtonDescription  |  ( |   | ) |   const
◆ UseForAllCheckBoxDescription()
 const ON_wString& CRhinoComponentNameConflictUI::UseForAllCheckBoxDescription  |  ( |   | ) |   const
◆ UseModelComponentRadioButtonDescription()
 const ON_wString& CRhinoComponentNameConflictUI::UseModelComponentRadioButtonDescription  |  ( |   | ) |   const
◆ UseResolutionMethodForFutureConflicts()
 bool CRhinoComponentNameConflictUI::UseResolutionMethodForFutureConflicts  |  ( |   | ) |   const