Public Member Functions | List of all members
ON_BoundingBoxAndHash Class Reference
OpenNURBS
#include <opennurbs_bounding_box.h>
 Public Member Functions
ON_BoundingBoxAndHash ()=default
ON_BoundingBoxAndHash (const ON_BoundingBoxAndHash &)=default
~ON_BoundingBoxAndHash ()=default
const ON_BoundingBox &  | BoundingBox () const
const ON_SHA1_Hash &  | Hash () const
bool  | IsSet () const
ON_BoundingBoxAndHash &  | operator= (const ON_BoundingBoxAndHash &)=default
bool  | Read (class ON_BinaryArchive &archive)
void  | Set (const ON_BoundingBox &bbox, const ON_SHA1_Hash &hash)
bool  | Write (class ON_BinaryArchive &archive) const
Constructor & Destructor Documentation
◆ ON_BoundingBoxAndHash() [1/2]
 ON_BoundingBoxAndHash::ON_BoundingBoxAndHash  |  ( |   | )
default
◆ ~ON_BoundingBoxAndHash()
 ON_BoundingBoxAndHash::~ON_BoundingBoxAndHash  |  ( |   | )
default
◆ ON_BoundingBoxAndHash() [2/2]
 ON_BoundingBoxAndHash::ON_BoundingBoxAndHash  |  ( |  const ON_BoundingBoxAndHash &  |   | )
default
Member Function Documentation
◆ BoundingBox()
 const ON_BoundingBox& ON_BoundingBoxAndHash::BoundingBox  |  ( |   | ) |   const
◆ Hash()
 const ON_SHA1_Hash& ON_BoundingBoxAndHash::Hash  |  ( |   | ) |   const
◆ IsSet()
 bool ON_BoundingBoxAndHash::IsSet  |  ( |   | ) |   const
Returns: True if bounding box IsSet() is true and hash is not EmptyContentHash.
◆ operator=()
 ON_BoundingBoxAndHash& ON_BoundingBoxAndHash::operator=  |  ( |  const ON_BoundingBoxAndHash &  |   | )
default
◆ Read()
 bool ON_BoundingBoxAndHash::Read  |  ( |  class ON_BinaryArchive &  |  archive | )
◆ Set()
 void ON_BoundingBoxAndHash::Set  |  ( |  const ON_BoundingBox &  |  bbox,
|  const ON_SHA1_Hash &  |  hash
)
This hash depends on the context and is a hash of the information used to calculate the bounding box. It is not the hash of the box values
◆ Write()
 bool ON_BoundingBoxAndHash::Write  |  ( |  class ON_BinaryArchive &  |  archive | ) |   const