Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoUiLinetypeListCtrl Class Reference
RhinoUI
CRhinoUiLinetypeListCtrl. More...
#include <RhinoSdkUiLineTypeListCtrl.h>
 Inheritance diagram for CRhinoUiLinetypeListCtrl:
 Public Types
enum  | columns { name_column = 0, appearance_column, column_count, force_32bit_columns = 0xFFFFFFFF }
 Public Member Functions
CRhinoUiLinetypeListCtrl ()
virtual  | ~CRhinoUiLinetypeListCtrl ()
int  | AppendLinetype (const ON_Linetype &linetype)
int  | AppendNewLinetype (const ON_Linetype &linetype)
bool  | DeleteLinetype (const wchar_t *linetype_name)
bool  | DeleteLinetype (int item)
bool  | EnableEditLabel () const
bool  | EnableMultipleSelect () const
int  | FindLinetype (const wchar_t *linetype_name)
int  | GetAddedLinetypes (ON_ClassArray< ON_Linetype > &linetypes)
int  | GetAddedLinetypes (ON_ObjectArray< ON_Linetype > &linetypes)
int  | GetAllLinetypes (ON_ClassArray< ON_Linetype > &linetypes)
int  | GetAllLinetypes (ON_ObjectArray< ON_Linetype > &linetypes)
int  | GetDeletedLinetypes (ON_ClassArray< ON_Linetype > &linetypes)
int  | GetDeletedLinetypes (ON_ObjectArray< ON_Linetype > &linetypes)
bool  | GetLinetype (const wchar_t *linetype_name, ON_Linetype &linetype)
bool  | GetLinetype (int item, ON_Linetype &linetype)
int  | GetModifiedLinetypes (ON_ClassArray< ON_Linetype > &linetypes)
int  | GetModifiedLinetypes (ON_ObjectArray< ON_Linetype > &linetypes)
bool  | GetSelectedLinetype (ON_Linetype &linetype)
int  | GetSelectedLinetypes (ON_ClassArray< ON_Linetype > &linetypes)
int  | GetSelectedLinetypes (ON_ObjectArray< ON_Linetype > &linetypes)
void  | Initialize ()
int  | InsertLinetype (int item, const ON_Linetype &linetype)
int  | InsertNewLinetype (int item, const ON_Linetype &linetype)
bool  | ModifyLinetype (const wchar_t *linetype_name, const ON_Linetype &linetype)
bool  | ModifyLinetype (int item, const ON_Linetype &linetype)
afx_msg void  | OnBeginLabelEdit (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnColumnClick (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnCustomDraw (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg BOOL32  | OnDblClk (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnEndLabelEdit (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnHeaderEndTrack (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnSize (UINT nType, int cx, int cy)
void  | SelectLinetype (const wchar_t *linetype_name)
void  | SelectLinetypeIndex (int linetype_index)
void  | SetEnableEditLabel (bool bEnable=true)
void  | SetEnableMultipleSelect (bool bEnable=true)
void  | SetSortAscending (bool bAscending=true)
void  | SizeAppearanceColumn ()
void  | SizeNameColumn ()
bool  | SortAscending () const
 Protected Member Functions
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual void  | PreSubclassWindow ()
Detailed Description
CRhinoUiLinetypeListCtrl.
Member Enumeration Documentation
◆ columns
 enum CRhinoUiLinetypeListCtrl::columns
Enumerator
name_column
appearance_column
column_count
force_32bit_columns
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiLinetypeListCtrl()
 CRhinoUiLinetypeListCtrl::CRhinoUiLinetypeListCtrl  |  ( |   | )
◆ ~CRhinoUiLinetypeListCtrl()
 virtual CRhinoUiLinetypeListCtrl::~CRhinoUiLinetypeListCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AppendLinetype()
 int CRhinoUiLinetypeListCtrl::AppendLinetype  |  ( |  const ON_Linetype &  |  linetype | )
Description: Appends a linetype to the end of the control. Parameters: linetype - [in] the linetype to append. Returns: >=0 - index of the inserted item. -1 - linetype with the same name already exist. Remarks: Use this member to add linetypes that already exist in the document's linetype table.
◆ AppendNewLinetype()
 int CRhinoUiLinetypeListCtrl::AppendNewLinetype  |  ( |  const ON_Linetype &  |  linetype | )
Description: Appends a new linetype to the end of the control. Parameters: linetype - [in] the linetype to insert. Returns: >=0 - index of the inserted item. -1 - linetype with the same name already exist. Remarks: This does not add a new linetype to the document's linetype taable. Use this member to add linetypes that do not already exist in the document's linetype table.
◆ DeleteLinetype() [1/2]
 bool CRhinoUiLinetypeListCtrl::DeleteLinetype  |  ( |  const wchar_t *  |  linetype_name | )
Description: Deletes a linetype from the control. Parameters: linetype_name - [in] name of the linetype to delete. Returns: TRUE - if successful. FALSE - if item is out of range. Remarks: This does not delete linetypes as it exists in the document's linetype table.
◆ DeleteLinetype() [2/2]
 bool CRhinoUiLinetypeListCtrl::DeleteLinetype  |  ( |  int  |  item | )
Description: Deletes a linetype from the control. Parameters: item - [in] index of the item to delete. Returns: TRUE - if successful. FALSE - if item is out of range. Remarks: This does not delete linetypes as it exists in the document's linetype table.
◆ EnableEditLabel()
 bool CRhinoUiLinetypeListCtrl::EnableEditLabel  |  ( |   | ) |   const
Description: Verifies that label editing is enabled. Returns: TRUE - if label editing is enabled. FALSE - if label editing is disabled. See Also: SetEnableEditLabel
◆ EnableMultipleSelect()
 bool CRhinoUiLinetypeListCtrl::EnableMultipleSelect  |  ( |   | ) |   const
Description: Verifies that multiple selection is enabled. Returns: TRUE - if multiple selection is enabled. FALSE - if multiple selection is disabled. See Also: SetEnableMultipleSelect
◆ FindLinetype()
 int CRhinoUiLinetypeListCtrl::FindLinetype  |  ( |  const wchar_t *  |  linetype_name | )
Description: Finds a linetype that is displayed in the control. Parameters: linetype - [in] the linetype to find. Returns: >=0 - index of the item. -1 - linetype name cannot be found.
◆ GetAddedLinetypes() [1/2]
 int CRhinoUiLinetypeListCtrl::GetAddedLinetypes  |  ( |  ON_ClassArray< ON_Linetype > &  |  linetypes | )
Description: Returns a list of the linetype added while the control was displayed. These linetype definitions do not exist in the document's linetype table. Linetypes that were add and then later deleted are ignored. Parameters: linetypes - [out] the linetypes to retrieve. Returns: >0 - the number of linetypes returned. 0 - if no items are returned.
Deprecated:
use version with ON_ObjectArray parameter
◆ GetAddedLinetypes() [2/2]
 int CRhinoUiLinetypeListCtrl::GetAddedLinetypes  |  ( |  ON_ObjectArray< ON_Linetype > &  |  linetypes | )
◆ GetAllLinetypes() [1/2]
 int CRhinoUiLinetypeListCtrl::GetAllLinetypes  |  ( |  ON_ClassArray< ON_Linetype > &  |  linetypes | )
Description: Returns of list of all linetypes that are maintained by the control, whether they are displayed or not. Parameters: linetypes - [out] the linetype to retrieve. Returns: >0 - the number of linetypes returned. 0 - if no items are returned.
Deprecated:
use version with ON_ObjectArray parameter
◆ GetAllLinetypes() [2/2]
 int CRhinoUiLinetypeListCtrl::GetAllLinetypes  |  ( |  ON_ObjectArray< ON_Linetype > &  |  linetypes | )
◆ GetDeletedLinetypes() [1/2]
 int CRhinoUiLinetypeListCtrl::GetDeletedLinetypes  |  ( |  ON_ClassArray< ON_Linetype > &  |  linetypes | )
Description: Returns of list of the linetypes that were deleted while the control was displayed. These linetype definitions exist in the document's linetype table. New linetypes that were added and then later deleted are ignored. Parameters: linetypes - [out] the linetype to retrieve. Returns: >0 - the number of linetypes returned. 0 - if no items are returned.
Deprecated:
use version with ON_ObjectArray parameter
◆ GetDeletedLinetypes() [2/2]
 int CRhinoUiLinetypeListCtrl::GetDeletedLinetypes  |  ( |  ON_ObjectArray< ON_Linetype > &  |  linetypes | )
◆ GetLinetype() [1/2]
 bool CRhinoUiLinetypeListCtrl::GetLinetype  |  ( |  const wchar_t *  |  linetype_name,
|  ON_Linetype &  |  linetype
)
Description: Returns a linetype that is displayed in the control. Parameters: linetype_name - [in] name of the linetype to retrieve. linetype - [out] the linetypes to retrieve. Returns: TRUE - if successful. FALSE - if item is out of range.
◆ GetLinetype() [2/2]
 bool CRhinoUiLinetypeListCtrl::GetLinetype  |  ( |  int  |  item,
|  ON_Linetype &  |  linetype
)
Description: Returns a linetype that is displayed in the control. Parameters: item - [in] index of the item to retrieve. linetype - [out] the linetype to retrieve. Returns: TRUE - if successful. FALSE - if item is out of range.
◆ GetModifiedLinetypes() [1/2]
 int CRhinoUiLinetypeListCtrl::GetModifiedLinetypes  |  ( |  ON_ClassArray< ON_Linetype > &  |  linetypes | )
Description: Returns of list of the linetypes that were modified while the control was displayed. These linetype definitions exist in the document's linetype table. New linetypes that were added and then later modified are ignored. Parameters: linetypes - [out] the linetype to retrieve. Returns: >0 - the number of linetypes returned. 0 - if no items are returned.
Deprecated:
use version with ON_ObjectArray parameter
◆ GetModifiedLinetypes() [2/2]
 int CRhinoUiLinetypeListCtrl::GetModifiedLinetypes  |  ( |  ON_ObjectArray< ON_Linetype > &  |  linetypes | )
◆ GetSelectedLinetype()
 bool CRhinoUiLinetypeListCtrl::GetSelectedLinetype  |  ( |  ON_Linetype &  |  linetype | )
Description: Returns the selected linetype. Parameters: linetype - [out] the linetype to retrieve. Returns: TRUE - if an item is selected. FALSE - if an item is not selected. Remarks: Use this member when the control is set for "single selection."
◆ GetSelectedLinetypes() [1/2]
 int CRhinoUiLinetypeListCtrl::GetSelectedLinetypes  |  ( |  ON_ClassArray< ON_Linetype > &  |  linetypes | )
Description: Returns the selected linetypes. Parameters: linetypes - [out] the linetypes to retrieve. Returns: >0 - the number of selected items. 0 - if no items are selected. Remarks: Use this member when the control is set for "multiple selection."
Deprecated:
use version with ON_ObjectArray parameter
◆ GetSelectedLinetypes() [2/2]
 int CRhinoUiLinetypeListCtrl::GetSelectedLinetypes  |  ( |  ON_ObjectArray< ON_Linetype > &  |  linetypes | )
◆ Initialize()
 void CRhinoUiLinetypeListCtrl::Initialize  |  ( |   | )
Description: Initializes the control. Remarks: Call this member from CDialog::OnInitDialog().
◆ InsertLinetype()
 int CRhinoUiLinetypeListCtrl::InsertLinetype  |  ( |  int  |  item,
|  const ON_Linetype &  |  linetype
)
Description: Inserts a linetype into the control. Parameters: item - [in] index of the item to insert. linetype - [in] the linetype to insert. Returns: >=0 - index of the inserted item. -1 - linetype with the same name already exist. Remarks: Use this member to add linetypes that already exist in the document's linetype table.
◆ InsertNewLinetype()
 int CRhinoUiLinetypeListCtrl::InsertNewLinetype  |  ( |  int  |  item,
|  const ON_Linetype &  |  linetype
)
Description: Inserts a new linetype into the control. Parameters: item - [in] index of the item to insert. linetype - [in] the linetype to insert. Returns: >=0 - index of the inserted item -1 - linetype with the same name already exist Remarks: This does not add a new linetype to the document's linetype table. Use this member to add linetypes that do not already exist in the document's linetype table.
◆ ModifyLinetype() [1/2]
 bool CRhinoUiLinetypeListCtrl::ModifyLinetype  |  ( |  const wchar_t *  |  linetype_name,
|  const ON_Linetype &  |  linetype
)
Description: Modifies a linetype in the control. Parameters: linetype_name - [in] name of the linetype to modify. linetype - [in] the modified linetype. Returns: TRUE - if successful. FALSE - if item is out of range or if the linetype name is invalid. Remarks: This does not modify linetypes as it exists in the document's linetype table.
◆ ModifyLinetype() [2/2]
 bool CRhinoUiLinetypeListCtrl::ModifyLinetype  |  ( |  int  |  item,
|  const ON_Linetype &  |  linetype
)
Description: Modifies a linetype in the control. Parameters: item - [in] index of the item to modify. linetype - [in] the modified linetype. Returns: TRUE - if successful. FALSE - if item is out of range or if the linetype name is invalid. Remarks: This does not modify linetypes as it exists in the document's linetype table.
◆ OnBeginLabelEdit()
 afx_msg void CRhinoUiLinetypeListCtrl::OnBeginLabelEdit  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnColumnClick()
 afx_msg void CRhinoUiLinetypeListCtrl::OnColumnClick  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnCustomDraw()
 afx_msg void CRhinoUiLinetypeListCtrl::OnCustomDraw  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnDblClk()
 afx_msg BOOL32 CRhinoUiLinetypeListCtrl::OnDblClk  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnEndLabelEdit()
 afx_msg void CRhinoUiLinetypeListCtrl::OnEndLabelEdit  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnHeaderEndTrack()
 afx_msg void CRhinoUiLinetypeListCtrl::OnHeaderEndTrack  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnSize()
 afx_msg void CRhinoUiLinetypeListCtrl::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiLinetypeListCtrl::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
◆ PreSubclassWindow()
 virtual void CRhinoUiLinetypeListCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ SelectLinetype()
 void CRhinoUiLinetypeListCtrl::SelectLinetype  |  ( |  const wchar_t *  |  linetype_name | )
Description: Selects a linetype in the control by its name. Parameters: linetype - [in] the linetype to select.
◆ SelectLinetypeIndex()
 void CRhinoUiLinetypeListCtrl::SelectLinetypeIndex  |  ( |  int  |  linetype_index | )
Description: Selects a linetype in the control by its linetype index. Parameters: linetype_index - [in] the index of the linetype to select.
◆ SetEnableEditLabel()
 void CRhinoUiLinetypeListCtrl::SetEnableEditLabel  |  ( |  bool  |  bEnable = true | )
Description: Enables or disables label editing. Parameters: bEnable - [in] TRUE to enable label editing, otherwise FALSE. See Also: EnableEditLabel
◆ SetEnableMultipleSelect()
 void CRhinoUiLinetypeListCtrl::SetEnableMultipleSelect  |  ( |  bool  |  bEnable = true | )
Description: Enables or disables multiple selection. Parameters: bEnable - [in] TRUE to enable multiple select, otherwise FALSE. See Also: EnableMultipleSelect
◆ SetSortAscending()
 void CRhinoUiLinetypeListCtrl::SetSortAscending  |  ( |  bool  |  bAscending = true | )
Description: Sets the current sort method. Parameters: bAscending - [in] TRUE for ascending, FALSE for descending.
◆ SizeAppearanceColumn()
 void CRhinoUiLinetypeListCtrl::SizeAppearanceColumn  |  ( |   | )
Description: Automatically sizes the appearance column.
◆ SizeNameColumn()
 void CRhinoUiLinetypeListCtrl::SizeNameColumn  |  ( |   | )
Description: Automatically sizes the name column.
◆ SortAscending()
 bool CRhinoUiLinetypeListCtrl::SortAscending  |  ( |   | ) |   const
Description: Returns the current sort method. Returns: TRUE - sort ascending. FALSE - sort descending.