Public Member Functions | Public Attributes | List of all members
ON_MeshCurveParameters Class Reference
OpenNURBS
#include <opennurbs_curve.h>
 Public Member Functions
ON_MeshCurveParameters ()
 Public Attributes
int  | m_main_seg_count
double  | m_max_ang_radians
double  | m_max_aspect
double  | m_max_chr
double  | m_max_edge_length
double  | m_min_edge_length
int  | m_reserved1
int  | m_reserved2
double  | m_reserved3
double  | m_reserved4
int  | m_sub_seg_count
double  | m_tolerance
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Definition of virtual parametric curve
Constructor & Destructor Documentation
◆ ON_MeshCurveParameters()
 ON_MeshCurveParameters::ON_MeshCurveParameters  |  ( |   | )
Member Data Documentation
◆ m_main_seg_count
 int ON_MeshCurveParameters::m_main_seg_count
If main_seg_count <= 0, then both these parameters are ignored. If main_seg_count > 0, then sub_seg_count must be >= 1. In this case the curve will be broken into main_seg_count equally spaced chords. If needed, each of these chords can be split into as many sub_seg_count sub-parts if the subdivision is necessary for the mesh to meet the other meshing constraints. In particular, if sub_seg_count = 0, then the curve is broken into main_seg_count pieces and no further testing is performed.
◆ m_max_ang_radians
 double ON_MeshCurveParameters::m_max_ang_radians
Maximum angle (in radians) between unit tangents at adjacent vertices.
◆ m_max_aspect
 double ON_MeshCurveParameters::m_max_aspect
If max_aspect < 1.0, the parameter is ignored. If 1 <= max_aspect < sqrt(2), it is treated as if max_aspect = sqrt(2). This parameter controls the maximum permitted value of (length of longest chord) / (length of shortest chord)
◆ m_max_chr
 double ON_MeshCurveParameters::m_max_chr
Maximum permitted value of distance chord midpoint to curve) / (length of chord)
◆ m_max_edge_length
 double ON_MeshCurveParameters::m_max_edge_length
If max_edge_length = 0, the parameter is ignored. This parameter controls the maximum permitted edge length.
◆ m_min_edge_length
 double ON_MeshCurveParameters::m_min_edge_length
If m_min_edge_length = 0, the parameter is ignored. This parameter controls the minimum permitted edge length.
◆ m_reserved1
 int ON_MeshCurveParameters::m_reserved1
◆ m_reserved2
 int ON_MeshCurveParameters::m_reserved2
◆ m_reserved3
 double ON_MeshCurveParameters::m_reserved3
◆ m_reserved4
 double ON_MeshCurveParameters::m_reserved4
◆ m_sub_seg_count
 int ON_MeshCurveParameters::m_sub_seg_count
◆ m_tolerance
 double ON_MeshCurveParameters::m_tolerance
If tolerance = 0, the parameter is ignored. This parameter controls the maximum permitted value of the distance from the curve to the mesh.