Public Attributes | List of all members
CRhinoModelessUserInterfaceDocChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
unsigned int  | m_previous_modeless_ui_rhino_doc_sn
Member Data Documentation
◆ m_previous_modeless_ui_rhino_doc_sn
 unsigned int CRhinoModelessUserInterfaceDocChanged::CParameters::m_previous_modeless_ui_rhino_doc_sn