Public Attributes | List of all members
CRhinoDocMarkupViewChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
int  | m_markup_index
CRhinoDocMarkupViewChanged::MarkupMode  | m_markup_mode
The markup mode the document is now in. More...
unsigned int  | m_rhino_doc_sn
The serial number of the document whose markup view state changed. More...
Member Data Documentation
◆ m_markup_index
 int CRhinoDocMarkupViewChanged::CParameters::m_markup_index
The table index of the markup being viewed/edited, or -1 if none (e.g. when leaving markup mode or while creating a new markup).
◆ m_markup_mode
 CRhinoDocMarkupViewChanged::MarkupMode CRhinoDocMarkupViewChanged::CParameters::m_markup_mode
The markup mode the document is now in.
◆ m_rhino_doc_sn
 unsigned int CRhinoDocMarkupViewChanged::CParameters::m_rhino_doc_sn
The serial number of the document whose markup view state changed.