Public Member Functions | List of all members
CRhinoAppUiResourceManager Class Reference
RhinoUI
#include <RhinoSdkUiLibManagers.h>
 Inheritance diagram for CRhinoAppUiResourceManager:
 Public Member Functions
CRhinoAppUiResourceManager ()=default
virtual  | ~CRhinoAppUiResourceManager ()
void  | CreateTextCursors ()
bool  | GetBitmap (bitmaps, CRhinoDib &) override
HCURSOR  | GetCursor (cursors) override
bool  | GetImageList (images, CRhinoUiImageList &) override
COLORREF  | GetImageMaskingColor () override
 Public Member Functions inherited from CRhinoUiResourceManager
CRhinoUiResourceManager ()=default
virtual  | ~CRhinoUiResourceManager (void)
HCURSOR  | CreateTextCursor (HCURSOR hCursorTemplate, ON_wString wCustomText, bool bBlackTextOnWhiteBkgrnd=true, int iTextLeft=4, int iTextTop=1, LPRECT lpTextWrittenToRect=NULL)
 Additional Inherited Members
 Public Types inherited from CRhinoUiResourceManager
enum  | bitmaps { bmp_tb_drag_not = 0, bmp_tb_drag_del }
enum  | cursors {
 cursor_tb_shift = 0, cursor_tb_ctrl, cursor_tb_shift_ctrl, cursor_tb_move,
 cursor_tb_link, cursor_tb_copy, cursor_tb_delete
 }
enum  | images { image_tb_tt_lr = 0, image_layer_manager_state, image_layer_manager_state_empty, image_layer_manager_image }
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoAppUiResourceManager()
 CRhinoAppUiResourceManager::CRhinoAppUiResourceManager  |  ( |   | )
default
◆ ~CRhinoAppUiResourceManager()
 virtual CRhinoAppUiResourceManager::~CRhinoAppUiResourceManager  |  ( |   | )
virtual
Member Function Documentation
◆ CreateTextCursors()
 void CRhinoAppUiResourceManager::CreateTextCursors  |  ( |   | )
◆ GetBitmap()
 bool CRhinoAppUiResourceManager::GetBitmap  |  ( |  bitmaps  |  ,
|  CRhinoDib &
)
overridevirtual
Implements CRhinoUiResourceManager.
◆ GetCursor()
 HCURSOR CRhinoAppUiResourceManager::GetCursor  |  ( |  cursors  |   | )
overridevirtual
Implements CRhinoUiResourceManager.
◆ GetImageList()
 bool CRhinoAppUiResourceManager::GetImageList  |  ( |  images  |  ,
|  CRhinoUiImageList &
)
overridevirtual
Implements CRhinoUiResourceManager.
◆ GetImageMaskingColor()
 COLORREF CRhinoAppUiResourceManager::GetImageMaskingColor  |  ( |   | )
overridevirtual
Implements CRhinoUiResourceManager.