Public Member Functions | List of all members
ON_BrepLoopArray Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Inheritance diagram for ON_BrepLoopArray:
 Public Member Functions
ON_BrepLoopArray ()
~ON_BrepLoopArray ()
bool  | Read (ON_BinaryArchive &)
unsigned int  | SizeOf () const
bool  | Write (ON_BinaryArchive &) const
 Public Member Functions inherited from ON_ObjectArray< ON_BrepLoop >
ON_ObjectArray ()
Class ON_ObjectArray<> More...
ON_ObjectArray (const ON_ObjectArray< ON_BrepLoop > &)
ON_ObjectArray (size_t)
size_t parameter = initial capacity More...
~ON_ObjectArray ()
override for struct member deallocation, etc. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
bool  | HeapSort (int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *))
ON_ObjectArray< ON_BrepLoop > &  | operator= (const ON_ObjectArray< ON_BrepLoop > &)
bool  | QuickSort (int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *))
ON_BrepLoop *  | Realloc (ON_BrepLoop *, int)
 Public Member Functions inherited from ON_ClassArray< ON_BrepLoop >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< ON_BrepLoop > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const ON_BrepLoop &)
void  | Append (int, const ON_BrepLoop *)
Append copy of an array T[count]. More...
ON_BrepLoop &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
ON_BrepLoop *  | Array ()
The Array() function return the. More...
const ON_BrepLoop *  | Array () const
m_a pointer value. More...
ON_BrepLoop *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const ON_BrepLoop *  | At (int) const
ON_BrepLoop *  | At (ON__INT64)
const ON_BrepLoop *  | At (ON__INT64) const
ON_BrepLoop *  | At (ON__UINT64)
const ON_BrepLoop *  | At (ON__UINT64) const
ON_BrepLoop *  | At (unsigned int)
const ON_BrepLoop *  | At (unsigned int) const
ON_BrepLoop *  | begin ()
Support STL iterators and algorithms. More...
ON_BrepLoop const *  | begin () const
int  | BinarySearch (const ON_BrepLoop *, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const ON_BrepLoop *, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *), int) const
int  | Capacity () const
capacity of array More...
ON_BrepLoop const *  | cbegin () const
ON_BrepLoop const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
ON_BrepLoop *  | end ()
ON_BrepLoop const *  | end () const
ON_BrepLoop *  | First ()
const ON_BrepLoop *  | First () const
returns nullptr if count = 0 More...
void  | Insert (int, const ON_BrepLoop &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const ON_BrepLoop &, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *))
int  | InsertInSortedList (const ON_BrepLoop &, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *), int)
ON_BrepLoop *  | KeepArray ()
ON_BrepLoop *  | Last ()
const ON_BrepLoop *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const ON_BrepLoop * () const
operator ON_BrepLoop * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< ON_BrepLoop > &other) const=delete
ON_ClassArray< ON_BrepLoop > &  | operator= (const ON_ClassArray< ON_BrepLoop > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< ON_BrepLoop > &other) const=delete
ON_BrepLoop &  | operator[] (int)
const ON_BrepLoop &  | operator[] (int) const
ON_BrepLoop &  | operator[] (ON__INT64)
const ON_BrepLoop &  | operator[] (ON__INT64) const
ON_BrepLoop &  | operator[] (ON__UINT64)
const ON_BrepLoop &  | operator[] (ON__UINT64) const
ON_BrepLoop &  | operator[] (unsigned int)
const ON_BrepLoop &  | operator[] (unsigned int) const
bool  | Permute (const int *)
void  | Remove ()
void  | Remove (int)
ON_BrepLoop *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const ON_BrepLoop *, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *)) const
void  | SetArray (ON_BrepLoop *p)
void  | SetArray (ON_BrepLoop *p, int count, int capacity)
ON_BrepLoop *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const ON_BrepLoop *, const ON_BrepLoop *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< ON_BrepLoop >
void  | ConstructDefaultElement (ON_BrepLoop *)
void  | DestroyElement (ON_BrepLoop &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< ON_BrepLoop >
ON_BrepLoop *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Constructor & Destructor Documentation
◆ ON_BrepLoopArray()
 ON_BrepLoopArray::ON_BrepLoopArray  |  ( |   | )
◆ ~ON_BrepLoopArray()
 ON_BrepLoopArray::~ON_BrepLoopArray  |  ( |   | )
Member Function Documentation
◆ Read()
 bool ON_BrepLoopArray::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SizeOf()
 unsigned int ON_BrepLoopArray::SizeOf  |  ( |   | ) |   const
◆ Write()
 bool ON_BrepLoopArray::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const