Classes | Public Member Functions | List of all members
ON_Thickening Class Reference
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_Thickening:
 Classes
class  | Defaults
 Public Member Functions
ON_Thickening ()
ON_Thickening (const ON_Thickening &t)
ON_Thickening (const ON_XMLNode &node)
bool  | BothSides (void) const
Specifies whether to thicken to both sides of the surface. More...
double  | Distance (void) const
Specifies how thick meshes will be made. More...
bool  | OffsetOnly (void) const
Specifies whether to only offset the original surface. More...
bool  | On (void) const
Specifies whether the feature is enabled or not. More...
bool  | operator!= (const ON_Thickening &t) const
const ON_Thickening &  | operator= (const ON_Thickening &t)
bool  | operator== (const ON_Thickening &t) const
void  | SetBothSides (bool b)
void  | SetDistance (double d)
void  | SetOffsetOnly (bool b)
void  | SetOn (bool b)
void  | SetSolid (bool b)
bool  | Solid (void) const
Specifies whether to make open meshes solid by adding walls when thickening. More...
virtual ON_UUID  | Uuid (void) const override
Return the unique identifier of this mesh modifier. More...
 Public Member Functions inherited from ON_MeshModifier
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const
< For internal use only. More...
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
 Additional Inherited Members
 Static Public Member Functions inherited from ON_MeshModifier
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes inherited from ON_MeshModifier
CImpl *  | m_impl
Constructor & Destructor Documentation
◆ ON_Thickening() [1/3]
 ON_Thickening::ON_Thickening  |  ( |   | )
◆ ON_Thickening() [2/3]
 ON_Thickening::ON_Thickening  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_Thickening() [3/3]
 ON_Thickening::ON_Thickening  |  ( |  const ON_Thickening &  |  t | )
Member Function Documentation
◆ BothSides()
 bool ON_Thickening::BothSides  |  ( |  void  |   | ) |   const
Specifies whether to thicken to both sides of the surface.
◆ Distance()
 double ON_Thickening::Distance  |  ( |  void  |   | ) |   const
Specifies how thick meshes will be made.
◆ OffsetOnly()
 bool ON_Thickening::OffsetOnly  |  ( |  void  |   | ) |   const
Specifies whether to only offset the original surface.
◆ On()
 bool ON_Thickening::On  |  ( |  void  |   | ) |   const
Specifies whether the feature is enabled or not.
◆ operator!=()
 bool ON_Thickening::operator!=  |  ( |  const ON_Thickening &  |  t | ) |   const
◆ operator=()
 const ON_Thickening& ON_Thickening::operator=  |  ( |  const ON_Thickening &  |  t | )
◆ operator==()
 bool ON_Thickening::operator==  |  ( |  const ON_Thickening &  |  t | ) |   const
◆ SetBothSides()
 void ON_Thickening::SetBothSides  |  ( |  bool  |  b | )
◆ SetDistance()
 void ON_Thickening::SetDistance  |  ( |  double  |  d | )
◆ SetOffsetOnly()
 void ON_Thickening::SetOffsetOnly  |  ( |  bool  |  b | )
◆ SetOn()
 void ON_Thickening::SetOn  |  ( |  bool  |  b | )
◆ SetSolid()
 void ON_Thickening::SetSolid  |  ( |  bool  |  b | )
◆ Solid()
 bool ON_Thickening::Solid  |  ( |  void  |   | ) |   const
Specifies whether to make open meshes solid by adding walls when thickening.
◆ Uuid()
 virtual ON_UUID ON_Thickening::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Return the unique identifier of this mesh modifier.
Implements ON_MeshModifier.