Public Member Functions | Public Attributes | Protected Attributes | List of all members
CRhinoVarSrfConstraintCurve Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Inheritance diagram for CRhinoVarSrfConstraintCurve:
 Public Member Functions
CRhinoVarSrfConstraintCurve (const ON_Curve *curve, ON::continuity continuity)
virtual  | ~CRhinoVarSrfConstraintCurve ()
const ON_Curve *  | Curve () const
virtual std::shared_ptr< CRhinoVarSrfConstraintCurve >  | Duplicate (const ON_Xform *xform=nullptr)
void  | Reverse ()
bool  | Reversed () const
 Public Attributes
ON::continuity  | m_continuity
commmand can change these continuities More...
ON::continuity  | m_endContinuity
ON::continuity  | m_startContinuity
 Protected Attributes
const ON_Curve *  | m_curve
ON_SimpleArray< const ON_Geometry * >  | m_geos
bool  | m_reversed
Constructor & Destructor Documentation
◆ CRhinoVarSrfConstraintCurve()
 CRhinoVarSrfConstraintCurve::CRhinoVarSrfConstraintCurve  |  ( |  const ON_Curve *  |  curve,
|  ON::continuity  |  continuity
)
◆ ~CRhinoVarSrfConstraintCurve()
 virtual CRhinoVarSrfConstraintCurve::~CRhinoVarSrfConstraintCurve  |  ( |   | )
virtual
Member Function Documentation
◆ Curve()
 const ON_Curve* CRhinoVarSrfConstraintCurve::Curve  |  ( |   | ) |   const
inline
◆ Duplicate()
 virtual std::shared_ptr<CRhinoVarSrfConstraintCurve> CRhinoVarSrfConstraintCurve::Duplicate  |  ( |  const ON_Xform *  |  xform = nullptr | )
virtual
Reimplemented in CRhinoVarSrfEdgeCurve.
◆ Reverse()
 void CRhinoVarSrfConstraintCurve::Reverse  |  ( |   | )
inline
◆ Reversed()
 bool CRhinoVarSrfConstraintCurve::Reversed  |  ( |   | ) |   const
inline
Member Data Documentation
◆ m_continuity
 ON::continuity CRhinoVarSrfConstraintCurve::m_continuity
commmand can change these continuities
◆ m_curve
 const ON_Curve* CRhinoVarSrfConstraintCurve::m_curve
protected
◆ m_endContinuity
 ON::continuity CRhinoVarSrfConstraintCurve::m_endContinuity
◆ m_geos
 ON_SimpleArray<const ON_Geometry*> CRhinoVarSrfConstraintCurve::m_geos
protected
any geometry that was created when this curve was created (e.g. by .Duplicate()) that needs to stay alive and be deleted when this object goes out of scope.
◆ m_reversed
 bool CRhinoVarSrfConstraintCurve::m_reversed
protected
◆ m_startContinuity
 ON::continuity CRhinoVarSrfConstraintCurve::m_startContinuity