Public Member Functions | List of all members
CRhinoMeshCageMorph Class Reference
Rhino
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoMeshCageMorph:
 Public Member Functions
CRhinoMeshCageMorph (const CRhinoMeshCageMorph &other)=delete
CRhinoMeshCageMorph (const ON_Mesh &referenceMesh, const ON_Mesh &targetMesh)
virtual  | ~CRhinoMeshCageMorph ()
ON_3dPoint  | MorphPoint (ON_3dPoint pt) const override
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
virtual bool  | IsIdentity (const ON_BoundingBox &bbox) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
Constructor & Destructor Documentation
◆ CRhinoMeshCageMorph() [1/2]
 CRhinoMeshCageMorph::CRhinoMeshCageMorph  |  ( |  const ON_Mesh &  |  referenceMesh,
|  const ON_Mesh &  |  targetMesh
)
◆ CRhinoMeshCageMorph() [2/2]
 CRhinoMeshCageMorph::CRhinoMeshCageMorph  |  ( |  const CRhinoMeshCageMorph &  |  other | )
delete
◆ ~CRhinoMeshCageMorph()
 virtual CRhinoMeshCageMorph::~CRhinoMeshCageMorph  |  ( |   | )
virtual
Member Function Documentation
◆ MorphPoint()
 ON_3dPoint CRhinoMeshCageMorph::MorphPoint  |  ( |  ON_3dPoint  |  point | ) |   const
overridevirtual
Description: Morphs euclidean point. Parameters: point - [in] Returns: Morphed point.
 Remarks: If you are morphing simple objects like points and meshes, then you can simply morph the locations. If you are morphing more complicated objects like NURBS geometry, then your override should pay attention to the values of m_bQuickPreview, m_bPreserveStructure, and m_tolerance.
Implements ON_SpaceMorph.