Public Member Functions | List of all members
ON_MeshVertexFaceMap Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshVertexFaceMap () ON_NOEXCEPT
ON_MeshVertexFaceMap (const ON_MeshVertexFaceMap &)
~ON_MeshVertexFaceMap ()
void  | Destroy ()
unsigned int  | FaceCount () const
ON_MeshVertexFaceMap &  | operator= (const ON_MeshVertexFaceMap &)
bool  | SetFromFaceList (unsigned int vertex_count, const class ON_MeshFaceList &face_list, bool bMapInvalidFaces)
bool  | SetFromMesh (const ON_Mesh *mesh, bool bMapInvalidFaces)
unsigned int  | VertexCount () const
unsigned int  | VertexFaceCount (unsigned int vertex_index) const
const unsigned int *  | VertexFaceList (unsigned int vertex_index) const
const unsigned int *const *  | VertexFaceMap () const
Constructor & Destructor Documentation
◆ ON_MeshVertexFaceMap() [1/2]
 ON_MeshVertexFaceMap::ON_MeshVertexFaceMap  |  ( |   | )
◆ ~ON_MeshVertexFaceMap()
 ON_MeshVertexFaceMap::~ON_MeshVertexFaceMap  |  ( |   | )
◆ ON_MeshVertexFaceMap() [2/2]
 ON_MeshVertexFaceMap::ON_MeshVertexFaceMap  |  ( |  const ON_MeshVertexFaceMap &  |   | )
Member Function Documentation
◆ Destroy()
 void ON_MeshVertexFaceMap::Destroy  |  ( |   | )
◆ FaceCount()
 unsigned int ON_MeshVertexFaceMap::FaceCount  |  ( |   | ) |   const
Returns: Number a faces.
◆ operator=()
 ON_MeshVertexFaceMap& ON_MeshVertexFaceMap::operator=  |  ( |  const ON_MeshVertexFaceMap &  |   | )
◆ SetFromFaceList()
 bool ON_MeshVertexFaceMap::SetFromFaceList  |  ( |  unsigned int  |  vertex_count,
|  const class ON_MeshFaceList &  |  face_list,
|  bool  |  bMapInvalidFaces
)
◆ SetFromMesh()
 bool ON_MeshVertexFaceMap::SetFromMesh  |  ( |  const ON_Mesh *  |  mesh,
|  bool  |  bMapInvalidFaces
)
◆ VertexCount()
 unsigned int ON_MeshVertexFaceMap::VertexCount  |  ( |   | ) |   const
Returns: Number a vertices.
◆ VertexFaceCount()
 unsigned int ON_MeshVertexFaceMap::VertexFaceCount  |  ( |  unsigned int  |  vertex_index | ) |   const
Parameters: vertex_index - [in] Index of a vertex. Returns: The number of faces that reference the vertex. Remarks: If vertex_index is out of range, then zero is returned.
◆ VertexFaceList()
 const unsigned int* ON_MeshVertexFaceMap::VertexFaceList  |  ( |  unsigned int  |  vertex_index | ) |   const
Parameters: vertex_index - [in] Index of a vertex. Returns: An array of indices of faces that reference the vertex. The array has length VertexFaceCount(vertex_index). When the value of VertexFaceCount(vertex_index) is zero, this function returns a null pointer. Remarks: If vertex_index is out of range, then null is returned.
◆ VertexFaceMap()
 const unsigned int* const* ON_MeshVertexFaceMap::VertexFaceMap  |  ( |   | ) |   const
Description: Expert user function for situations where rapid access to the vertex face list information is required. Returns: An array of VertexCount() unsigned int arrays that list the indices of faces that reference each vertex. VertexFaceMap()[vertex_index] is null if zero faces reference the indicated vertex. Otherwise, VertexFaceMap()[vertex_index][0] is the number of faces that reference the vertex and VertexFaceMap()[vertex_index][1,...,n] are the indices of those faces, where "n" is the value of VertexFaceMap()[vertex_index][0].