Public Member Functions | Public Attributes | List of all members
ON_OffsetSurfaceValue Class Reference
OpenNURBS
#include <opennurbs_offsetsurface.h>
 Public Member Functions
ON_OffsetSurfaceValue ()=default
ON_OffsetSurfaceValue (const ON_OffsetSurfaceValue &)=default
~ON_OffsetSurfaceValue ()=default
ON_OffsetSurfaceValue &  | operator= (const ON_OffsetSurfaceValue &)=default
 Public Attributes
double  | m_distance = ON_DBL_QNAN
int  | m_index = ON_UNSET_INT_INDEX
double  | m_radius = ON_DBL_QNAN
double  | m_s = ON_DBL_QNAN
double  | m_t = ON_DBL_QNAN
Constructor & Destructor Documentation
◆ ON_OffsetSurfaceValue() [1/2]
 ON_OffsetSurfaceValue::ON_OffsetSurfaceValue  |  ( |   | )
default
◆ ~ON_OffsetSurfaceValue()
 ON_OffsetSurfaceValue::~ON_OffsetSurfaceValue  |  ( |   | )
default
◆ ON_OffsetSurfaceValue() [2/2]
 ON_OffsetSurfaceValue::ON_OffsetSurfaceValue  |  ( |  const ON_OffsetSurfaceValue &  |   | )
default
Member Function Documentation
◆ operator=()
 ON_OffsetSurfaceValue& ON_OffsetSurfaceValue::operator=  |  ( |  const ON_OffsetSurfaceValue &  |   | )
default
Member Data Documentation
◆ m_distance
 double ON_OffsetSurfaceValue::m_distance = ON_DBL_QNAN
◆ m_index
 int ON_OffsetSurfaceValue::m_index = ON_UNSET_INT_INDEX
◆ m_radius
 double ON_OffsetSurfaceValue::m_radius = ON_DBL_QNAN
◆ m_s
 double ON_OffsetSurfaceValue::m_s = ON_DBL_QNAN
◆ m_t
 double ON_OffsetSurfaceValue::m_t = ON_DBL_QNAN