Public Member Functions | Public Attributes | List of all members
CRhinoTwistSpaceMorph Class Reference
Rhino
Twist morph. More...
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoTwistSpaceMorph:
 Public Member Functions
CRhinoTwistSpaceMorph ()
bool  | IsIdentity (const ON_BoundingBox &bbox) const override
virtual ON_SpaceMorph override More...
ON_3dPoint  | MorphPoint (ON_3dPoint pt) const override
virtual ON_SpaceMorph override More...
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
bool  | m_bInfiniteTwist
double  | m_twist_angle
radians More...
ON_Line  | m_twist_axis
Axis about which to twist. More...
Detailed Description
Twist morph.
Constructor & Destructor Documentation
◆ CRhinoTwistSpaceMorph()
 CRhinoTwistSpaceMorph::CRhinoTwistSpaceMorph  |  ( |   | )
Member Function Documentation
◆ IsIdentity()
 bool CRhinoTwistSpaceMorph::IsIdentity  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
overridevirtual
virtual ON_SpaceMorph override
Reimplemented from ON_SpaceMorph.
◆ MorphPoint()
 ON_3dPoint CRhinoTwistSpaceMorph::MorphPoint  |  ( |  ON_3dPoint  |  pt | ) |   const
overridevirtual
virtual ON_SpaceMorph override
Implements ON_SpaceMorph.
Member Data Documentation
◆ m_bInfiniteTwist
 bool CRhinoTwistSpaceMorph::m_bInfiniteTwist
◆ m_twist_angle
 double CRhinoTwistSpaceMorph::m_twist_angle
radians
◆ m_twist_axis
 ON_Line CRhinoTwistSpaceMorph::m_twist_axis
Axis about which to twist.