Public Attributes | List of all members
CRhRdkCustomRenderSaveInfo Class Reference
RDK
#include <RhRdkDeprecated.h>
 Public Attributes
bool  | m_bSaveAlpha
CRhRdkCustomRenderSaveFileType  | m_FileType
ON_wString  | m_sFilename
UUID  | m_uuidRenderSession
Member Data Documentation
◆ m_bSaveAlpha
 bool CRhRdkCustomRenderSaveInfo::m_bSaveAlpha
◆ m_FileType
 CRhRdkCustomRenderSaveFileType CRhRdkCustomRenderSaveInfo::m_FileType
◆ m_sFilename
 ON_wString CRhRdkCustomRenderSaveInfo::m_sFilename
◆ m_uuidRenderSession
 UUID CRhRdkCustomRenderSaveInfo::m_uuidRenderSession