Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiManager Class Referenceabstract
RhinoUI
#include <RhinoSdkUiManager.h>
 Inheritance diagram for CRhinoUiManager:
 Public Member Functions
CRhinoUiManager ()
virtual  | ~CRhinoUiManager ()
virtual bool  | ColorDialog (CWnd *pWndParent, ON_Color &color, bool include_button_colors=false, const wchar_t *dialog_title=NULL)
virtual void  | DisplayDockLocationContextDialog (CDockBar &dock_bar, CPoint pt)=0
virtual CRhinoUiDockBarManager &  | DockBarManager ()
virtual bool  | IsPlugInLoaded (const UUID &plug_in_id) const =0
virtual bool  | LoadPlugIn (const UUID &plug_in_id, bool fail_quietly=false, bool ignore_load_failed=false)=0
virtual CRhinoUiModlessDockingDialogManager &  | ModlessDockingDialogManager ()
virtual CRhinoUiPageDockBarManager &  | PageDockBarManager ()
virtual CRhinoUiPaintManager &  | PaintManager ()
virtual CRhinoUiResourceManager &  | ResourceManager ()=0
virtual CRuntimeClass *  | RuntimeClassFromName (const UUID &plug_in_id, const wchar_t *lpsClassName)=0
 Protected Member Functions
void  | OnDestroyMainFrame ()
 Protected Attributes
CRhinoUiDockBarManager *  | m_dock_bar_manager = nullptr
CRhinoUiModlessDockingDialogManager *  | m_modless_docking_dialog_manager = nullptr
CRhinoUiPageDockBarManager *  | m_page_dock_bar_manager = nullptr
CRhinoUiPaintManager *  | m_paint_manager = nullptr
 Friends
void  | RhOnDestroyMainFrame ()
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoUiManager()
 CRhinoUiManager::CRhinoUiManager  |  ( |   | )
◆ ~CRhinoUiManager()
 virtual CRhinoUiManager::~CRhinoUiManager  |  ( |   | )
virtual
Member Function Documentation
◆ ColorDialog()
 virtual bool CRhinoUiManager::ColorDialog  |  ( |  CWnd *  |  pWndParent,
|  ON_Color &  |  color,
|  bool  |  include_button_colors = false,
|  const wchar_t *  |  dialog_title = NULL
)
virtual
Reimplemented in CRhinoAppUiManager.
◆ DisplayDockLocationContextDialog()
 virtual void CRhinoUiManager::DisplayDockLocationContextDialog  |  ( |  CDockBar &  |  dock_bar,
|  CPoint  |  pt
)
pure virtual
Implemented in CRhinoAppUiManager.
◆ DockBarManager()
 virtual CRhinoUiDockBarManager& CRhinoUiManager::DockBarManager  |  ( |   | )
virtual
Reimplemented in CRhinoAppUiManager.
◆ IsPlugInLoaded()
 virtual bool CRhinoUiManager::IsPlugInLoaded  |  ( |  const UUID &  |  plug_in_id | ) |   const
pure virtual
Implemented in CRhinoAppUiManager.
◆ LoadPlugIn()
 virtual bool CRhinoUiManager::LoadPlugIn  |  ( |  const UUID &  |  plug_in_id,
|  bool  |  fail_quietly = false,
|  bool  |  ignore_load_failed = false
)
pure virtual
Implemented in CRhinoAppUiManager.
◆ ModlessDockingDialogManager()
 virtual CRhinoUiModlessDockingDialogManager& CRhinoUiManager::ModlessDockingDialogManager  |  ( |   | )
virtual
◆ OnDestroyMainFrame()
 void CRhinoUiManager::OnDestroyMainFrame  |  ( |   | )
protected
◆ PageDockBarManager()
 virtual CRhinoUiPageDockBarManager& CRhinoUiManager::PageDockBarManager  |  ( |   | )
virtual
◆ PaintManager()
 virtual CRhinoUiPaintManager& CRhinoUiManager::PaintManager  |  ( |   | )
virtual
Reimplemented in CRhinoAppUiManager.
◆ ResourceManager()
 virtual CRhinoUiResourceManager& CRhinoUiManager::ResourceManager  |  ( |   | )
pure virtual
Implemented in CRhinoAppUiManager.
◆ RuntimeClassFromName()
 virtual CRuntimeClass* CRhinoUiManager::RuntimeClassFromName  |  ( |  const UUID &  |  plug_in_id,
|  const wchar_t *  |  lpsClassName
)
pure virtual
Implemented in CRhinoAppUiManager.
Friends And Related Function Documentation
◆ RhOnDestroyMainFrame
 void RhOnDestroyMainFrame  |  ( |   | )
friend
Member Data Documentation
◆ m_dock_bar_manager
 CRhinoUiDockBarManager* CRhinoUiManager::m_dock_bar_manager = nullptr
protected
◆ m_modless_docking_dialog_manager
 CRhinoUiModlessDockingDialogManager* CRhinoUiManager::m_modless_docking_dialog_manager = nullptr
protected
◆ m_page_dock_bar_manager
 CRhinoUiPageDockBarManager* CRhinoUiManager::m_page_dock_bar_manager = nullptr
protected
◆ m_paint_manager
 CRhinoUiPaintManager* CRhinoUiManager::m_paint_manager = nullptr
protected