Public Types | Public Member Functions | List of all members
ON_Dithering Class Reference
OpenNURBS
#include <opennurbs_dithering.h>
 Public Types
enum  | Methods { Methods::SimpleNoise, Methods::FloydSteinberg }
 Public Member Functions
ON_Dithering ()
ON_Dithering (const ON_Dithering &dit)
ON_Dithering (ON_XMLNode &model_node)
virtual  | ~ON_Dithering ()
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns the CRC of the dithering state. More...
virtual bool  | Enabled (void) const
Get the dithering enabled state. More...
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual Methods  | Method (void) const
Get the dithering method. More...
virtual void  | OnInternalXmlChanged (const ON_Dithering *)
For internal use only. More...
virtual bool  | operator!= (const ON_Dithering &dit) const
virtual const ON_Dithering &  | operator= (const ON_Dithering &dit)
virtual bool  | operator== (const ON_Dithering &dit) const
virtual void  | SetEnabled (bool b)
Enable or disable dithering. More...
virtual void  | SetMethod (Methods m)
Set the dithering method. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Enumeration Documentation
◆ Methods
 enum ON_Dithering::Methods
strong
Enumerator
SimpleNoise
FloydSteinberg
Constructor & Destructor Documentation
◆ ON_Dithering() [1/3]
 ON_Dithering::ON_Dithering  |  ( |   | )
◆ ON_Dithering() [2/3]
 ON_Dithering::ON_Dithering  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_Dithering() [3/3]
 ON_Dithering::ON_Dithering  |  ( |  const ON_Dithering &  |  dit | )
◆ ~ON_Dithering()
 virtual ON_Dithering::~ON_Dithering  |  ( |   | )
virtual
Member Function Documentation
◆ DataCRC()
 virtual ON__UINT32 ON_Dithering::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
virtual
Returns the CRC of the dithering state.
◆ Enabled()
 virtual bool ON_Dithering::Enabled  |  ( |  void  |   | ) |   const
virtual
Get the dithering enabled state.
◆ EVF()
 virtual void* ON_Dithering::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ Method()
 virtual Methods ON_Dithering::Method  |  ( |  void  |   | ) |   const
virtual
Get the dithering method.
◆ OnInternalXmlChanged()
 virtual void ON_Dithering::OnInternalXmlChanged  |  ( |  const ON_Dithering *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_Dithering::operator!=  |  ( |  const ON_Dithering &  |  dit | ) |   const
virtual
◆ operator=()
 virtual const ON_Dithering& ON_Dithering::operator=  |  ( |  const ON_Dithering &  |  dit | )
virtual
◆ operator==()
 virtual bool ON_Dithering::operator==  |  ( |  const ON_Dithering &  |  dit | ) |   const
virtual
◆ SetEnabled()
 virtual void ON_Dithering::SetEnabled  |  ( |  bool  |  b | )
virtual
Enable or disable dithering.
◆ SetMethod()
 virtual void ON_Dithering::SetMethod  |  ( |  Methods  |  m | )
virtual
Set the dithering method.