Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiGridListCtrl Class Reference
RhinoUI
CRhinoUiGridListCtrl. More...
#include <RhinoSdkUiGridListCtrl.h>
 Inheritance diagram for CRhinoUiGridListCtrl:
 Public Member Functions
CRhinoUiGridListCtrl ()
virtual  | ~CRhinoUiGridListCtrl ()
bool  | AllowColumnResizing ()
void  | AllowColumnResizing (bool b)
bool  | AllowColumnSwapping ()
void  | AllowColumnSwapping (bool b)
void  | ClearAllSelectedItems ()
Make sure nothing is selected. More...
void  | ClearListSelection ()
int  | ColumnFromPoint (CPoint pt)
int  | CurrentEditItem ()
void  | DestroyEditCtrl ()
void  | DisableColumnResizing (int nInColumn)
void  | DisableColumnSwapping (int nInColumn)
virtual BOOL32  | DoneEditing (long nItem, int nSubItem, LPCTSTR lpszText)
BOOL32  | EditGridItem (long nItem, int nSubItem)
BOOL32  | EditOnClick ()
void  | EditOnClick (BOOL32 b)
CRhinoUiGridListEdit *  | GetEditCtrl ()
long  | getSelectedCount ()
return the number of items currently selected in list More...
bool  | IsColumnResizable (int nColumn)
bool  | IsColumnSwapable (int nColumn)
bool  | IsMouseTracking ()
bool  | IsMultiSelect ()
void  | KillTracking ()
CComboBox *  | ListGridItem (long nItem, int nSubItem, CStringList &lstItems, int nSel)
int  | MinimumColumnWidth (int col)
Get the minimum column width for the specified column. More...
void  | MinimumColumnWidth (int col, int cx)
Set the minimum column width for the specified column. More...
virtual BOOL32  | ModifyGridItem (long nItem, int nSubItem)
BOOL32  | NotifyOnListChange ()
Call done editing only if different list item selected. More...
void  | NotifyOnListChange (BOOL32 b)
afx_msg void  | OnHScroll (UINT nSBCode, UINT nPos, CScrollBar *pScrollBar)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
virtual bool  | OnLButtonDownOnItem (bool bShiftButtonIsDown, int nRow, int nColumn)
A return value of true means continue processing the mouse down event, false means bail. More...
virtual void  | OnLButtonDownWithControlSelectItem (int nRow, int nColumn)
For extended selection. More...
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
virtual void  | OnLButtonUpDragSelect (int nRow, int nColumn)
afx_msg void  | OnLvnBeginlabeledit (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnLvnEndlabeledit (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
afx_msg void  | OnNMClick (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnNMDblclk (NMHDR *pNMHDR, LRESULT *pResult)
afx_msg void  | OnTimer (UINT_PTR nIDEvent)
afx_msg void  | OnVScroll (UINT nSBCode, UINT nPos, CScrollBar *pScrollBar)
int  | RuntimeListColumn (int nOriginalColumn)
bool  | SelectionContiguous (int &nFirst, int &nLast)
void  | SelectItem (int nItem, bool bClearSelection=false)
Set items selected state and set focus to it. if !bClearSelection then select item. More...
void  | SelectItemIndex (int nItem, int nMode=LVIS_SELECTED)
void  | Setup (BOOL32 bFullRowSelect, BOOL32 bEditOnClick=TRUE, BOOL32 bListChange=TRUE)
Calll this function from OnInitDialog prior to creating columns. More...
bool  | SubclassHeaderCtrl ()
void  | SubclassHeaderCtrl (bool b)
 Protected Member Functions
virtual BOOL32  | OnNotify (WPARAM wParam, LPARAM lParam, LRESULT *pResult)
virtual void  | PreSubclassWindow ()
 Friends
class  | CRhinoUiGridListEdit
Detailed Description
CRhinoUiGridListCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiGridListCtrl()
 CRhinoUiGridListCtrl::CRhinoUiGridListCtrl  |  ( |   | )
◆ ~CRhinoUiGridListCtrl()
 virtual CRhinoUiGridListCtrl::~CRhinoUiGridListCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ AllowColumnResizing() [1/2]
 bool CRhinoUiGridListCtrl::AllowColumnResizing  |  ( |   | )
inline
◆ AllowColumnResizing() [2/2]
 void CRhinoUiGridListCtrl::AllowColumnResizing  |  ( |  bool  |  b | )
inline
◆ AllowColumnSwapping() [1/2]
 bool CRhinoUiGridListCtrl::AllowColumnSwapping  |  ( |   | )
inline
◆ AllowColumnSwapping() [2/2]
 void CRhinoUiGridListCtrl::AllowColumnSwapping  |  ( |  bool  |  b | )
◆ ClearAllSelectedItems()
 void CRhinoUiGridListCtrl::ClearAllSelectedItems  |  ( |   | )
Make sure nothing is selected.
◆ ClearListSelection()
 void CRhinoUiGridListCtrl::ClearListSelection  |  ( |   | )
◆ ColumnFromPoint()
 int CRhinoUiGridListCtrl::ColumnFromPoint  |  ( |  CPoint  |  pt | )
◆ CurrentEditItem()
 int CRhinoUiGridListCtrl::CurrentEditItem  |  ( |   | )
inline
◆ DestroyEditCtrl()
 void CRhinoUiGridListCtrl::DestroyEditCtrl  |  ( |   | )
◆ DisableColumnResizing()
 void CRhinoUiGridListCtrl::DisableColumnResizing  |  ( |  int  |  nInColumn | )
◆ DisableColumnSwapping()
 void CRhinoUiGridListCtrl::DisableColumnSwapping  |  ( |  int  |  nInColumn | )
◆ DoneEditing()
 virtual BOOL32 CRhinoUiGridListCtrl::DoneEditing  |  ( |  long  |  nItem,
|  int  |  nSubItem,
|  LPCTSTR  |  lpszText
)
virtual
This function is called after editing is completed, if you don't override it then the list item text is updated.
◆ EditGridItem()
 BOOL32 CRhinoUiGridListCtrl::EditGridItem  |  ( |  long  |  nItem,
|  int  |  nSubItem
)
Display edit box in row and column specified. DoneEditing is called if text has changed.
◆ EditOnClick() [1/2]
 BOOL32 CRhinoUiGridListCtrl::EditOnClick  |  ( |   | )
inline
Determines if items will be edited on a single or double click. Single is default.
◆ EditOnClick() [2/2]
 void CRhinoUiGridListCtrl::EditOnClick  |  ( |  BOOL32  |  b | )
inline
◆ GetEditCtrl()
 CRhinoUiGridListEdit* CRhinoUiGridListCtrl::GetEditCtrl  |  ( |   | )
◆ getSelectedCount()
 long CRhinoUiGridListCtrl::getSelectedCount  |  ( |   | )
return the number of items currently selected in list
◆ IsColumnResizable()
 bool CRhinoUiGridListCtrl::IsColumnResizable  |  ( |  int  |  nColumn | )
◆ IsColumnSwapable()
 bool CRhinoUiGridListCtrl::IsColumnSwapable  |  ( |  int  |  nColumn | )
◆ IsMouseTracking()
 bool CRhinoUiGridListCtrl::IsMouseTracking  |  ( |   | )
inline
◆ IsMultiSelect()
 bool CRhinoUiGridListCtrl::IsMultiSelect  |  ( |   | )
◆ KillTracking()
 void CRhinoUiGridListCtrl::KillTracking  |  ( |   | )
◆ ListGridItem()
 CComboBox* CRhinoUiGridListCtrl::ListGridItem  |  ( |  long  |  nItem,
|  int  |  nSubItem,
|  CStringList &  |  lstItems,
|  int  |  nSel
)
Display combo box in row and column specified. ComboBox will contain lstItems and will default to nSel. DoneEditing is called when user selects something. (see NotifyOnListChange)
◆ MinimumColumnWidth() [1/2]
 int CRhinoUiGridListCtrl::MinimumColumnWidth  |  ( |  int  |  col | )
Get the minimum column width for the specified column.
◆ MinimumColumnWidth() [2/2]
 void CRhinoUiGridListCtrl::MinimumColumnWidth  |  ( |  int  |  col,
|  int  |  cx
)
Set the minimum column width for the specified column.
◆ ModifyGridItem()
 virtual BOOL32 CRhinoUiGridListCtrl::ModifyGridItem  |  ( |  long  |  nItem,
|  int  |  nSubItem
)
virtual
This function is called when an item is clicked (if EditOnClick( TRUE)) or double clicked. You should call EditGridItem or ListGridItem as needed.
◆ NotifyOnListChange() [1/2]
 BOOL32 CRhinoUiGridListCtrl::NotifyOnListChange  |  ( |   | )
inline
Call done editing only if different list item selected.
◆ NotifyOnListChange() [2/2]
 void CRhinoUiGridListCtrl::NotifyOnListChange  |  ( |  BOOL32  |  b | )
inline
◆ OnHScroll()
 afx_msg void CRhinoUiGridListCtrl::OnHScroll  |  ( |  UINT  |  nSBCode,
|  UINT  |  nPos,
|  CScrollBar *  |  pScrollBar
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiGridListCtrl::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDownOnItem()
 virtual bool CRhinoUiGridListCtrl::OnLButtonDownOnItem  |  ( |  bool  |  bShiftButtonIsDown,
|  int  |  nRow,
|  int  |  nColumn
)
virtual
A return value of true means continue processing the mouse down event, false means bail.
◆ OnLButtonDownWithControlSelectItem()
 virtual void CRhinoUiGridListCtrl::OnLButtonDownWithControlSelectItem  |  ( |  int  |  nRow,
|  int  |  nColumn
)
virtual
For extended selection.
◆ OnLButtonUp()
 afx_msg void CRhinoUiGridListCtrl::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonUpDragSelect()
 virtual void CRhinoUiGridListCtrl::OnLButtonUpDragSelect  |  ( |  int  |  nRow,
|  int  |  nColumn
)
virtual
◆ OnLvnBeginlabeledit()
 afx_msg void CRhinoUiGridListCtrl::OnLvnBeginlabeledit  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnLvnEndlabeledit()
 afx_msg void CRhinoUiGridListCtrl::OnLvnEndlabeledit  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnMouseMove()
 afx_msg void CRhinoUiGridListCtrl::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiGridListCtrl::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ OnNMClick()
 afx_msg void CRhinoUiGridListCtrl::OnNMClick  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnNMDblclk()
 afx_msg void CRhinoUiGridListCtrl::OnNMDblclk  |  ( |  NMHDR *  |  pNMHDR,
|  LRESULT *  |  pResult
)
◆ OnNotify()
 virtual BOOL32 CRhinoUiGridListCtrl::OnNotify  |  ( |  WPARAM  |  wParam,
|  LPARAM  |  lParam,
|  LRESULT *  |  pResult
)
protectedvirtual
◆ OnTimer()
 afx_msg void CRhinoUiGridListCtrl::OnTimer  |  ( |  UINT_PTR  |  nIDEvent | )
◆ OnVScroll()
 afx_msg void CRhinoUiGridListCtrl::OnVScroll  |  ( |  UINT  |  nSBCode,
|  UINT  |  nPos,
|  CScrollBar *  |  pScrollBar
)
◆ PreSubclassWindow()
 virtual void CRhinoUiGridListCtrl::PreSubclassWindow  |  ( |   | )
protectedvirtual
◆ RuntimeListColumn()
 int CRhinoUiGridListCtrl::RuntimeListColumn  |  ( |  int  |  nOriginalColumn | )
Convert original column index to current index. Used to keep column indexes in synch when allowing column re-arranging.
◆ SelectionContiguous()
 bool CRhinoUiGridListCtrl::SelectionContiguous  |  ( |  int &  |  nFirst,
|  int &  |  nLast
)
Get range of contiguous selection, return true if there are items selected and the items are contiguous otherwise false
◆ SelectItem()
 void CRhinoUiGridListCtrl::SelectItem  |  ( |  int  |  nItem,
|  bool  |  bClearSelection = false
)
Set items selected state and set focus to it. if !bClearSelection then select item.
◆ SelectItemIndex()
 void CRhinoUiGridListCtrl::SelectItemIndex  |  ( |  int  |  nItem,
|  int  |  nMode = LVIS_SELECTED
)
◆ Setup()
 void CRhinoUiGridListCtrl::Setup  |  ( |  BOOL32  |  bFullRowSelect,
|  BOOL32  |  bEditOnClick = TRUE,
|  BOOL32  |  bListChange = TRUE
)
Calll this function from OnInitDialog prior to creating columns.
◆ SubclassHeaderCtrl() [1/2]
 bool CRhinoUiGridListCtrl::SubclassHeaderCtrl  |  ( |   | )
inline
◆ SubclassHeaderCtrl() [2/2]
 void CRhinoUiGridListCtrl::SubclassHeaderCtrl  |  ( |  bool  |  b | )
inline
Call this if you want to provide your own header control otherwise this classes OnPreSubclass method will connect to it's own CRhinoUiGridListHeaderCtrl object.
Friends And Related Function Documentation
◆ CRhinoUiGridListEdit
 friend class CRhinoUiGridListEdit
friend