Public Member Functions | Public Attributes | List of all members
CRhinoPrintPageDefinition Class Reference
Rhino
#include <rhinoSdkPrintInfo.h>
 Public Member Functions
CRhinoPrintPageDefinition ()
~CRhinoPrintPageDefinition ()
 Public Attributes
ON_wString  | m_description
double  | m_height = 0
ON::LengthUnitSystem  | m_units = ON::LengthUnitSystem::None
double  | m_width = 0
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoPrintPageDefinition()
 CRhinoPrintPageDefinition::CRhinoPrintPageDefinition  |  ( |   | )
◆ ~CRhinoPrintPageDefinition()
 CRhinoPrintPageDefinition::~CRhinoPrintPageDefinition  |  ( |   | )
Member Data Documentation
◆ m_description
 ON_wString CRhinoPrintPageDefinition::m_description
◆ m_height
 double CRhinoPrintPageDefinition::m_height = 0
◆ m_units
 ON::LengthUnitSystem CRhinoPrintPageDefinition::m_units = ON::LengthUnitSystem::None
◆ m_width
 double CRhinoPrintPageDefinition::m_width = 0