Public Member Functions | List of all members
CRhRdkDisplayUpdate Class Referencefinal
RDK
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkDisplayUpdate (int iNumItems=-1, bool bAllowWaitCursor=true)
~CRhRdkDisplayUpdate ()
Detailed Description
This class is used to optimize display updates during batch operations. If you perform a repeated sequence of content operations such as attaching or detaching, deleting, etc., you should put one of these on the stack at the top of your function. While one or more of these objects is in scope, various UI elements in the RDK will not update. Instead, they will update when the object goes out of scope. This prevents repeated UI updates and can drastically improve performance when operating on a lot of contents.
See also
RhRdkIsDisplayUpdateEnabled()
Constructor & Destructor Documentation
◆ CRhRdkDisplayUpdate()
 CRhRdkDisplayUpdate::CRhRdkDisplayUpdate  |  ( |  int  |  iNumItems = -1,
|  bool  |  bAllowWaitCursor = true
)
◆ ~CRhRdkDisplayUpdate()
 CRhRdkDisplayUpdate::~CRhRdkDisplayUpdate  |  ( |   | )