Public Member Functions | Protected Member Functions | List of all members
CRhRdkResizingDialog Class Reference
RDK
#include <RhRdkResizingDialog.h>
 Inheritance diagram for CRhRdkResizingDialog:
 Public Member Functions
CRhRdkResizingDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
CRhRdkResizingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhRdkResizingDialog ()
virtual BOOL32  | AddControlString (HWND hwnd, const TCHAR *szText)
virtual void  | DisplayData (void)
virtual void  | EnableDisableControls (void)
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual BOOL32  | IsControlClipped (CWnd *pWnd)
virtual void  | OnPreInitResizing (void)
virtual void  | SetAutoSubclassGroupBoxes (BOOL32 bSubclass)
virtual void  | SetFillBackground (BOOL32 bFill)
virtual void  | SetReleaseClipping (BOOL32 bRelease)
virtual void  | SetResizingConstraints (BOOL32 bAllowResizeWidth, BOOL32 bAllowResizeHeight)
 Public Member Functions inherited from CRhinoDialog
CRhinoDialog (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr)
Modal construct. More...
CRhinoDialog (UINT nIDTemplate, CWnd *pParentWnd=nullptr)
virtual  | ~CRhinoDialog ()
CSize  | CalcDialogSize (INT nResourceId)
BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=nullptr) override
Modeless construct. More...
BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=nullptr) override
UINT  | DialogID ()
LPCTSTR  | DialogStringID ()
unsigned int  | DocumentSerialNumber () const
virtual INT_PTR  | DoModal () override
bool  | EnableDisplayCommands () const
void  | EnableSaveDialogPositionAndSize (bool bEnable=true, const wchar_t *wRegistryTitle=nullptr)
bool  | InDoModal () const
bool  | IsSaveDialogPositionAndSizeEnabled () const
void  | Localize ()
virtual void  | OnColorButtonClicked (UINT nBtnID)
Called by CRhColorButton if button clicked and color changed;. More...
void  | OnRhinoHelpButton ()
Dialog Utilities. More...
BOOL32  | PreTranslateMessage (MSG *pMsg) override
Overrides. More...
bool  | PushPickButton (bool hide_this_dialog)
void  | SetEnableDisplayCommands (bool b)
void  | SetEnableDisplayCommands (bool b, unsigned int documentRuntimeSerialNumber)
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
virtual void  | HideControl (UINT id, int width)
virtual void  | InitControl (UINT id, int l, int t, int r, int b, int o, int iPos)
afx_msg LRESULT  | OnCtlColorBtn (WPARAM, LPARAM)
afx_msg LRESULT  | OnCtlColorEdit (WPARAM, LPARAM)
afx_msg LRESULT  | OnCtlColorListBox (WPARAM, LPARAM)
afx_msg LRESULT  | OnCtlColorStatic (WPARAM, LPARAM)
afx_msg void  | OnDestroy (void)
virtual BOOL32  | OnEraseBkgnd (CDC *pDC)
virtual BOOL32  | OnInitDialog () override
afx_msg LRESULT  | OnNcHitTest (CPoint)
afx_msg LRESULT  | OnRdkPaintColors (WPARAM, LPARAM)
afx_msg void  | OnSize (UINT, int, int)
afx_msg void  | OnSysCommand (UINT, LPARAM)
afx_msg BOOL32  | OnToolTipNotify (UINT, NMHDR *, LRESULT *)
virtual void  | RepositionControls (BOOL32 bInit)
virtual void  | SizeControl (UINT id, int l, int t, int r, int b, int o, int iPos)
virtual void  | SubclassGroupBoxes ()
virtual void  | UnsubclassGroupBoxes ()
 Protected Member Functions inherited from CRhinoDialog
virtual BOOL32  | ContinueModal ()
Implementation. More...
void  | DoDataExchange (CDataExchange *pDX) override
DDX/DDV support. More...
virtual void  | OnCancel ()
virtual BOOL32  | OnCommand (WPARAM wParam, LPARAM lParam)
override; ///<not an override on OSX More...
afx_msg void  | OnDestroy ()
afx_msg BOOL32  | OnHelpInfo (HELPINFO *pHelpInfo)
virtual void  | OnOK ()
LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam) override
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Static Public Member Functions inherited from CRhinoDialog
static int  | CheckSemiModalMessagePump ()
static bool  | InDoSemiModal ()
 Public Attributes inherited from CRhinoDialog
class CRhDialogSdkExtension *  | m__rhino_dialog_sdk_extension
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Constructor & Destructor Documentation
◆ CRhRdkResizingDialog() [1/2]
 CRhRdkResizingDialog::CRhRdkResizingDialog  |  ( |  LPCTSTR  |  lpszTemplateName,
|  CWnd *  |  pParentWnd = NULL
)
explicit
◆ CRhRdkResizingDialog() [2/2]
 CRhRdkResizingDialog::CRhRdkResizingDialog  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
explicit
◆ ~CRhRdkResizingDialog()
 virtual CRhRdkResizingDialog::~CRhRdkResizingDialog  |  ( |   | )
virtual
Member Function Documentation
◆ AddControlString()
 virtual BOOL32 CRhRdkResizingDialog::AddControlString  |  ( |  HWND  |  hwnd,
|  const TCHAR *  |  szText
)
virtual
◆ DisplayData()
 virtual void CRhRdkResizingDialog::DisplayData  |  ( |  void  |   | )
virtual
Override this method to transfer data into the UI. Typically used to read data from storage and display it in edit boxes, check boxes, combo boxes and so on. The default implementation does nothing.
◆ EnableDisableControls()
 virtual void CRhRdkResizingDialog::EnableDisableControls  |  ( |  void  |   | )
virtual
Override this method to enable or disable the controls on the dialog. This is typically used for 'graying in and out' controls using EnableWindow(). The default implementation does nothing.
◆ EVF()
 virtual void* CRhRdkResizingDialog::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
◆ HideControl()
 virtual void CRhRdkResizingDialog::HideControl  |  ( |  UINT  |  id,
|  int  |  width
)
protectedvirtual
◆ InitControl()
 virtual void CRhRdkResizingDialog::InitControl  |  ( |  UINT  |  id,
|  int  |  l,
|  int  |  t,
|  int  |  r,
|  int  |  b,
|  int  |  o,
|  int  |  iPos
)
protectedvirtual
◆ IsControlClipped()
 virtual BOOL32 CRhRdkResizingDialog::IsControlClipped  |  ( |  CWnd *  |  pWnd | )
virtual
Override this method to stop certain controls from being automatically shortened. Call the base class if you don't know.
◆ OnCtlColorBtn()
 afx_msg LRESULT CRhRdkResizingDialog::OnCtlColorBtn  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnCtlColorEdit()
 afx_msg LRESULT CRhRdkResizingDialog::OnCtlColorEdit  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnCtlColorListBox()
 afx_msg LRESULT CRhRdkResizingDialog::OnCtlColorListBox  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnCtlColorStatic()
 afx_msg LRESULT CRhRdkResizingDialog::OnCtlColorStatic  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnDestroy()
 afx_msg void CRhRdkResizingDialog::OnDestroy  |  ( |  void  |   | )
protected
◆ OnEraseBkgnd()
 virtual BOOL32 CRhRdkResizingDialog::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
protectedvirtual
◆ OnInitDialog()
 virtual BOOL32 CRhRdkResizingDialog::OnInitDialog  |  ( |   | )
overrideprotectedvirtual
Generated message map functions {{AFX_MSG(CRhinoDialog)
Reimplemented from CRhinoDialog.
◆ OnNcHitTest()
 afx_msg LRESULT CRhRdkResizingDialog::OnNcHitTest  |  ( |  CPoint  |   | )
protected
◆ OnPreInitResizing()
 virtual void CRhRdkResizingDialog::OnPreInitResizing  |  ( |  void  |   | )
virtual
Called from OnInitDialog() just after calling the base class but before anything else.
◆ OnRdkPaintColors()
 afx_msg LRESULT CRhRdkResizingDialog::OnRdkPaintColors  |  ( |  WPARAM  |  ,
|  LPARAM
)
protected
◆ OnSize()
 afx_msg void CRhRdkResizingDialog::OnSize  |  ( |  UINT  |  ,
|  int  |  ,
|  int
)
protected
◆ OnSysCommand()
 afx_msg void CRhRdkResizingDialog::OnSysCommand  |  ( |  UINT  |  ,
|  LPARAM
)
protected
◆ OnToolTipNotify()
 afx_msg BOOL32 CRhRdkResizingDialog::OnToolTipNotify  |  ( |  UINT  |  ,
|  NMHDR *  |  ,
|  LRESULT *
)
protected
◆ RepositionControls()
 virtual void CRhRdkResizingDialog::RepositionControls  |  ( |  BOOL32  |  bInit | )
protectedvirtual
◆ SetAutoSubclassGroupBoxes()
 virtual void CRhRdkResizingDialog::SetAutoSubclassGroupBoxes  |  ( |  BOOL32  |  bSubclass | )
virtual
◆ SetFillBackground()
 virtual void CRhRdkResizingDialog::SetFillBackground  |  ( |  BOOL32  |  bFill | )
virtual
◆ SetReleaseClipping()
 virtual void CRhRdkResizingDialog::SetReleaseClipping  |  ( |  BOOL32  |  bRelease | )
virtual
◆ SetResizingConstraints()
 virtual void CRhRdkResizingDialog::SetResizingConstraints  |  ( |  BOOL32  |  bAllowResizeWidth,
|  BOOL32  |  bAllowResizeHeight
)
virtual
◆ SizeControl()
 virtual void CRhRdkResizingDialog::SizeControl  |  ( |  UINT  |  id,
|  int  |  l,
|  int  |  t,
|  int  |  r,
|  int  |  b,
|  int  |  o,
|  int  |  iPos
)
protectedvirtual
◆ SubclassGroupBoxes()
 virtual void CRhRdkResizingDialog::SubclassGroupBoxes  |  ( |   | )
protectedvirtual
◆ UnsubclassGroupBoxes()
 virtual void CRhRdkResizingDialog::UnsubclassGroupBoxes  |  ( |   | )
protectedvirtual