Public Member Functions | List of all members
CRhinoMouseEventArgs Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Public Member Functions
CRhinoMouseEventArgs ()=default
CRhinoMouseEventArgs (const CRhinoMouseEventArgs &other)
CRhinoMouseEventArgs (int mouseX, int mouseY, CRhinoMouseCallback::mouse_button button, CRhinoViewport *viewport)
~CRhinoMouseEventArgs ()
CRhinoDoc *  | Document () const
float  | DpiScale () const
bool  | IsMouseOver (const CRhinoObject *rhinoObject) const
bool  | IsMouseOver (const ON_3dPoint &point) const
bool  | IsMouseOver (const ON_4iRect &rect, bool logicalPixels) const
bool  | IsMouseOver (const ON_Curve &curve, double &t) const
bool  | IsMouseOver (const ON_Line &line) const
CRhinoMouseCallback::mouse_button  | MouseButton () const
ON_Line  | MouseFrustumLine () const
ON_3dPoint  | MousePosition3d () const
ON_2fPoint  | MousePositionClientLP (const ON_4iRect &rect) const
ON_2fPoint  | MousePositionDP () const
ON_2fPoint  | MousePositionLP () const
CRhinoMouseEventArgs &  | operator= (const CRhinoMouseEventArgs &other)
CRhinoDisplayPipeline *  | Pipeline () const
CRhinoView *  | View () const
CRhinoViewport *  | Viewport () const
Constructor & Destructor Documentation
◆ CRhinoMouseEventArgs() [1/3]
 CRhinoMouseEventArgs::CRhinoMouseEventArgs  |  ( |   | )
default
◆ CRhinoMouseEventArgs() [2/3]
 CRhinoMouseEventArgs::CRhinoMouseEventArgs  |  ( |  int  |  mouseX,
|  int  |  mouseY,
|  CRhinoMouseCallback::mouse_button  |  button,
|  CRhinoViewport *  |  viewport
)
◆ CRhinoMouseEventArgs() [3/3]
 CRhinoMouseEventArgs::CRhinoMouseEventArgs  |  ( |  const CRhinoMouseEventArgs &  |  other | )
◆ ~CRhinoMouseEventArgs()
 CRhinoMouseEventArgs::~CRhinoMouseEventArgs  |  ( |   | )
Member Function Documentation
◆ Document()
 CRhinoDoc* CRhinoMouseEventArgs::Document  |  ( |   | ) |   const
◆ DpiScale()
 float CRhinoMouseEventArgs::DpiScale  |  ( |   | ) |   const
Description: Device pixels per logical pixel for the surface this event came from. 1.0 when unknown.
◆ IsMouseOver() [1/5]
 bool CRhinoMouseEventArgs::IsMouseOver  |  ( |  const CRhinoObject *  |  rhinoObject | ) |   const
◆ IsMouseOver() [2/5]
 bool CRhinoMouseEventArgs::IsMouseOver  |  ( |  const ON_3dPoint &  |  point | ) |   const
◆ IsMouseOver() [3/5]
 bool CRhinoMouseEventArgs::IsMouseOver  |  ( |  const ON_4iRect &  |  rect,
|  bool  |  logicalPixels
) |   |  const
◆ IsMouseOver() [4/5]
 bool CRhinoMouseEventArgs::IsMouseOver  |  ( |  const ON_Curve &  |  curve,
|  double &  |  t
) |   |  const
◆ IsMouseOver() [5/5]
 bool CRhinoMouseEventArgs::IsMouseOver  |  ( |  const ON_Line &  |  line | ) |   const
◆ MouseButton()
 CRhinoMouseCallback::mouse_button CRhinoMouseEventArgs::MouseButton  |  ( |   | ) |   const
Description: Which mouse button(s) are actively pressed
◆ MouseFrustumLine()
 ON_Line CRhinoMouseEventArgs::MouseFrustumLine  |  ( |   | ) |   const
◆ MousePosition3d()
 ON_3dPoint CRhinoMouseEventArgs::MousePosition3d  |  ( |   | ) |   const
◆ MousePositionClientLP()
 ON_2fPoint CRhinoMouseEventArgs::MousePositionClientLP  |  ( |  const ON_4iRect &  |  rect | ) |   const
◆ MousePositionDP()
 ON_2fPoint CRhinoMouseEventArgs::MousePositionDP  |  ( |   | ) |   const
Description: Returns mouse position in on screen device pixel units
◆ MousePositionLP()
 ON_2fPoint CRhinoMouseEventArgs::MousePositionLP  |  ( |   | ) |   const
Description: Returns mouse position in logical pixel units
◆ operator=()
 CRhinoMouseEventArgs& CRhinoMouseEventArgs::operator=  |  ( |  const CRhinoMouseEventArgs &  |  other | )
◆ Pipeline()
 CRhinoDisplayPipeline* CRhinoMouseEventArgs::Pipeline  |  ( |   | ) |   const
Description: The pipeline drawing this surface, whether or not it is a view.
◆ View()
 CRhinoView* CRhinoMouseEventArgs::View  |  ( |   | ) |   const
Description: The view this event came from, or nullptr when it came from a surface that is not a view. Prefer Pipeline() in code that has to work in both.
◆ Viewport()
 CRhinoViewport* CRhinoMouseEventArgs::Viewport  |  ( |   | ) |   const
Description: The viewport this event happened in