Static Public Member Functions | List of all members
ON_Thickening::Defaults Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Static Public Member Functions
static bool  | BothSides (void)
static double  | Distance (void)
static bool  | OffsetOnly (void)
static bool  | Solid (void)
Member Function Documentation
◆ BothSides()
 static bool ON_Thickening::Defaults::BothSides  |  ( |  void  |   | )
static
◆ Distance()
 static double ON_Thickening::Defaults::Distance  |  ( |  void  |   | )
static
◆ OffsetOnly()
 static bool ON_Thickening::Defaults::OffsetOnly  |  ( |  void  |   | )
static
◆ Solid()
 static bool ON_Thickening::Defaults::Solid  |  ( |  void  |   | )
static