Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_UserStringList Class Reference
OpenNURBS
#include <opennurbs_userdata.h>
 Inheritance diagram for ON_UserStringList:
 Public Member Functions
ON_UserStringList ()
~ON_UserStringList ()
bool  | Archive () const override
override virtual ON_UserData::Archive function More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
override virtual ON_Object::DataCRC function More...
void  | Dump (ON_TextLog &text_log) const override
override virtual ON_Object::Dump function More...
bool  | GetDescription (ON_wString &description) override
override virtual ON_UserData::GetDescription function More...
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
bool  | Read (ON_BinaryArchive &binary_archive) override
override virtual ON_Object::Read function More...
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *us, bool bReplace)
unsigned int  | SizeOf () const override
override virtual ON_Object::SizeOf function More...
bool  | Write (ON_BinaryArchive &binary_archive) const override
override virtual ON_Object::Write function More...
 Public Member Functions inherited from ON_UserData
ON_UserData ()
ON_UserData (const ON_UserData &src)
The copy constructor copies every ON_UserData member variable except the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next and m_userdata_copycount. the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next are set to nullptr; in particular, the new instance of ON_UserData is not attached to any object immediately after copy constrtuction. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. More...
ON_UserData (ON_UUID userdata_uuid, ON_UUID application_uuid, unsigned int userdata_copycount)
~ON_UserData ()
virtual bool  | DeleteAfterRead (const class ON_BinaryArchive &archive, class ON_Object *parent_object) const
virtual bool  | DeleteAfterWrite (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
bool  | IsUnknownUserData () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UserData *  | Next () const
ON_UserData &  | operator= (const ON_UserData &src)
The operator= copies m_userdata_xform. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. All other ON_UserData member variables (m_userdata_uuid, m_application_uuid, m_userdata_owner, and m_userdata_next) are not changed. In particular, operator= does not change the parent object nor does it change the ids that specify what the user data is (m_userdata_uuid) and what appication is using it (m_application_uuid). More...
ON_Object *  | Owner () const
Returns object that owns the user data. More...
virtual bool  | Transform (const ON_Xform &)
ON_UUID  | UserDataClassUuid () const
virtual bool  | WriteToArchive (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static ON_UserStringList *  | FromObject (const ON_Object *)
 Public Attributes
ON_ClassArray< ON_UserString >  | m_e
 Public Attributes inherited from ON_UserData
ON_UUID  | m_application_uuid
unsigned int  | m_userdata_copycount
ON_UUID  | m_userdata_uuid
ON_Xform  | m_userdata_xform
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Constructor & Destructor Documentation
◆ ON_UserStringList()
 ON_UserStringList::ON_UserStringList  |  ( |   | )
◆ ~ON_UserStringList()
 ON_UserStringList::~ON_UserStringList  |  ( |   | )
Member Function Documentation
◆ Archive()
 bool ON_UserStringList::Archive  |  ( |   | ) |   const
overridevirtual
override virtual ON_UserData::Archive function
Reimplemented from ON_UserData.
◆ DataCRC()
 ON__UINT32 ON_UserStringList::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
override virtual ON_Object::DataCRC function
Reimplemented from ON_Object.
◆ Dump()
 void ON_UserStringList::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
overridevirtual
override virtual ON_Object::Dump function
Reimplemented from ON_UserData.
◆ FromObject()
 static ON_UserStringList* ON_UserStringList::FromObject  |  ( |  const ON_Object *  |   | )
static
◆ GetDescription()
 bool ON_UserStringList::GetDescription  |  ( |  ON_wString &  |  description | )
overridevirtual
override virtual ON_UserData::GetDescription function
Reimplemented from ON_UserData.
◆ GetUserString()
 bool ON_UserStringList::GetUserString  |  ( |  const wchar_t *  |  key,
|  ON_wString &  |  string_value
) |   |  const
◆ Read()
 bool ON_UserStringList::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
override virtual ON_Object::Read function
Reimplemented from ON_Object.
◆ SetUserString()
 bool ON_UserStringList::SetUserString  |  ( |  const wchar_t *  |  key,
|  const wchar_t *  |  string_value
)
Description: Add, replace or remove a user string. Parameters: key - [in] must be a non-empty string. If an entry with the same key (case insensitive compares are used) exists, the existing entry is updated. string_value - [in] If string_value is empty and an entry with a matching key exists, the entry is deleted. Returns: True if the key is valid.
◆ SetUserStrings()
 int ON_UserStringList::SetUserStrings  |  ( |  int  |  count,
|  const ON_UserString *  |  us,
|  bool  |  bReplace
)
Description: Append entries to the user string list Parameters: count - [in] number of element in us[] array us - [in] entries to append. bReplace - [in] If bReplace is true, then existing entries with the same key are updated with the new entry's value. If bReplace is false, then existing entries are not updated. Returns: Number of entries added, deleted, or modified.
◆ SizeOf()
 unsigned int ON_UserStringList::SizeOf  |  ( |   | ) |   const
overridevirtual
override virtual ON_Object::SizeOf function
Reimplemented from ON_UserData.
◆ Write()
 bool ON_UserStringList::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
override virtual ON_Object::Write function
Reimplemented from ON_Object.
Member Data Documentation
◆ m_e
 ON_ClassArray<ON_UserString> ON_UserStringList::m_e