Public Member Functions | List of all members
CRhinoPageViewIterator Class Reference
Rhino
#include <rhinoSdkView.h>
 Public Member Functions
CRhinoPageViewIterator (unsigned int rhino_doc_sn)
class CRhinoPageView *  | CurrentView () const
unsigned int  | CurrentViewRuntimeSerialNumber () const
unsigned int  | DocRuntimeSerialNumber () const
class CRhinoPageView *  | First ()
class CRhinoPageView *  | Next ()
Constructor & Destructor Documentation
◆ CRhinoPageViewIterator()
 CRhinoPageViewIterator::CRhinoPageViewIterator  |  ( |  unsigned int  |  rhino_doc_sn | )
Parameters: rhino_doc_sn - [in] 0: iterate all views of all documents. >0: iteration all views of the specified doc.
Member Function Documentation
◆ CurrentView()
 class CRhinoPageView* CRhinoPageViewIterator::CurrentView  |  ( |   | ) |   const
Returns: The current value of the iterator. Remarks:
If First() or Next() has not been called, then Current() will return null.
If the view returned by First() or Next() has been deleted since the call to First() or Next(), then CurrentView() will return a null pointer.
◆ CurrentViewRuntimeSerialNumber()
 unsigned int CRhinoPageViewIterator::CurrentViewRuntimeSerialNumber  |  ( |   | ) |   const
◆ DocRuntimeSerialNumber()
 unsigned int CRhinoPageViewIterator::DocRuntimeSerialNumber  |  ( |   | ) |   const
Example: Iteratate all page views: unsigned int rhino_doc_sn = 0 or doc->RuntimeSerialNumber(); CRhinoDocIterator doc_it(rhino_doc_sn); for ( CRhinoPageView* rhino_page_view = view_it.First(); 0 != rhino_page_view; rhino_page_view = view_it.Next() ) { ... }
◆ First()
 class CRhinoPageView* CRhinoPageViewIterator::First  |  ( |   | )
Returns: The first page view that exists. Remarks: You may call First() multiple times on the same iterator.
◆ Next()
 class CRhinoPageView* CRhinoPageViewIterator::Next  |  ( |   | )
Returns: The next page view that exists. Remarks:
Once Next() returns null, it will continue to return null until First() is called.
If First() has not be called, the first call to Next() returns the first view in Rhino. This is done so that people can write while loops like CRhinoViewIterator it(rhino_doc_sn); while ( CRhinoView* rhino_view = it.Next() ) { ... }