Public Member Functions | List of all members
CRhinoScriptCommand Class Reference
Rhino
#include <rhinoSdkCommand.h>
 Inheritance diagram for CRhinoScriptCommand:
 Public Member Functions
CRhinoScriptCommand (bool bTransparent=false, bool bDoNotRepeat=false, const class CRhinoPlugIn *pPlugIn=nullptr, bool bTestCommand=false)
 Public Member Functions inherited from CRhinoCommand
CRhinoCommand (bool bTransparent=false, bool bDoNotRepeat=false, const class CRhinoPlugIn *pPlugIn=nullptr, bool bTestCommand=false)
virtual  | ~CRhinoCommand ()
const unsigned int &  | CommandFlags () const
UUID  | CommandId () const
virtual UUID  | CommandUUID ()=0
!! See cmdExample.cpp for instructions on the use of this class. !! ///< More...
virtual bool  | ContextHelpURL (ON_wString &url) const
virtual void  | DoHelp ()
Override this function to display help for this command. More...
virtual void  | DynamicDraw (class CRhinoView &)
virtual CRhinoObject *  | EditObjects (const class CRhinoHistoryRecord &history_record, ON_SimpleArray< CRhinoObjectPair > &results)
void  | EnableHistoryReplayOnObjectAttributeChange (bool bEnable=true)
void  | EnableRepeatable (BOOL32 bRepeatable=true)
void  | EnableSystem (bool bSystem)
void  | EnableUndo (bool bUndoable=true)
virtual const wchar_t *  | EnglishCommandName () const
virtual const wchar_t *  | EnglishCommandName ()=0
bool  | HistoryReplayOnObjectAttributeChange () const
bool  | IsAlphaCommand () const
Returns true if a command is an "alpha" command. More...
bool  | IsRepeatable () const
bool  | IsScriptRunnerCommand () const
bool  | IsSystem () const
bool  | IsTestCommand () const
bool  | IsTransparent () const
bool  | IsUndoable () const
virtual void  | LoadProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
virtual const wchar_t *  | LocalCommandName () const
const class CRhinoPlugIn *  | PlugIn () const
virtual CRhinoObject *  | ReplayHistory (const class CRhinoHistoryRecord &history_record)
virtual bool  | ReplayHistory (const class CRhinoHistoryRecord &history_record, ON_SimpleArray< CRhinoObjectPair > &results)
virtual CRhinoCommand::result  | RunCommand (const CRhinoCommandContext &)=0
virtual void  | SaveProfile (LPCTSTR lpszSection, CRhinoProfileContext &pc)
CRhinoSettings &  | Settings ()
 Additional Inherited Members
 Public Types inherited from CRhinoCommand
enum  | result {
 success = 0, cancel = 1, nothing = 2, failure,
 unknown_command, cancel_modeless_dialog, exit_rhino = 0x0FFFFFFF
 }
 Static Public Member Functions inherited from CRhinoCommand
static bool  | IsValidCommandName (const wchar_t *)
Detailed Description
Description: For advanced users only. Support is not available. Commands like the RhinoScript plug-in's RunScript() that want to run scripts as if they were typed at the command line, should be derived from CRhinoScriptCommand.
Constructor & Destructor Documentation
◆ CRhinoScriptCommand()
 CRhinoScriptCommand::CRhinoScriptCommand  |  ( |  bool  |  bTransparent = false,
|  bool  |  bDoNotRepeat = false,
|  const class CRhinoPlugIn *  |  pPlugIn = nullptr,
|  bool  |  bTestCommand = false
)