Public Member Functions | Protected Member Functions | List of all members
IRhinoWindow Class Referenceabstract
Rhino
#include <RhinoSdkPages.h>
 Inheritance diagram for IRhinoWindow:
 Public Member Functions
virtual  | ~IRhinoWindow ()=default
virtual bool  | Create (const CRhinoWindowCreateOptions &options)=0
virtual bool  | Created () const =0
virtual bool  | Destroy ()=0
virtual const wchar_t *  | EnglishCaption () const =0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual RHINO_WINDOW_HANDLE  | Handle (void)=0
virtual bool  | IsEnabled () const =0
virtual bool  | IsVisible () const =0
virtual const wchar_t *  | LocalCaption () const
virtual ON_2iPoint  | Location () const =0
virtual RHINO_WINDOW_HANDLE  | Parent () const =0
virtual void  | Refresh (bool immediate=false)=0
virtual void  | Release ()=0
virtual void  | SetFocused ()=0
virtual void  | SetIsEnabled (bool enable)=0
virtual void  | SetIsVisible (bool visible)=0
virtual void  | SetLocation (ON_2iPoint location)=0
virtual void  | SetParent (RHINO_WINDOW_HANDLE parent)=0
virtual void  | SetSize (ON_2iSize size, bool redraw=false, bool redrawBorder=false)=0
virtual ON_2iSize  | Size () const =0
virtual LPARAM  | WindowProc (unsigned int message, WPARAM wParam, LPARAM lParam)
 Protected Member Functions
IRhinoWindow ()=default
IRhinoWindow (const IRhinoWindow &)=delete
IRhinoWindow &  | operator= (const IRhinoWindow &)=delete
Detailed Description
class IRhinoWindow
Description: Generic window representation.
Constructor & Destructor Documentation
◆ ~IRhinoWindow()
 virtual IRhinoWindow::~IRhinoWindow  |  ( |   | )
virtualdefault
◆ IRhinoWindow() [1/2]
 IRhinoWindow::IRhinoWindow  |  ( |   | )
protecteddefault
 Description: Default constructor.
◆ IRhinoWindow() [2/2]
 IRhinoWindow::IRhinoWindow  |  ( |  const IRhinoWindow &  |   | )
protecteddelete
Description: Delete the default copy constructor
Member Function Documentation
◆ Create()
 virtual bool IRhinoWindow::Create  |  ( |  const CRhinoWindowCreateOptions &  |  options | )
pure virtual
 Description: Create window Parameters: options - Create window options Returns: Return true if the window was created else return false.
◆ Created()
 virtual bool IRhinoWindow::Created  |  ( |   | ) |   const
pure virtual
 Description: Return true if the underlying window has been created, else false. Returns: Return true if the underlying window has been created, else false.
◆ Destroy()
 virtual bool IRhinoWindow::Destroy  |  ( |   | )
pure virtual
 Description: Destroy the window if it has been created otherwise don't do anything.
◆ EnglishCaption()
 virtual const wchar_t* IRhinoWindow::EnglishCaption  |  ( |   | ) |   const
pure virtual
 Description: Called to get the English caption for this window. Returns: The English name for this page.
◆ GetScreenCoords()
 virtual void IRhinoWindow::GetScreenCoords  |  ( |  ON_4iRect &  |  rectOut | ) |   const
pure virtual
 Description: Get the screen coordinates of the underlying window. Parameters: rectOut accepts the coordinates.
◆ Handle()
 virtual RHINO_WINDOW_HANDLE IRhinoWindow::Handle  |  ( |  void  |   | )
pure virtual
 Description: If this is a Windows window the window handle, trying not to need this
◆ IsEnabled()
 virtual bool IRhinoWindow::IsEnabled  |  ( |   | ) |   const
pure virtual
 Description: Return true if the window is enabled, else false. Returns: Return true if the window is enabled, else false.
◆ IsVisible()
 virtual bool IRhinoWindow::IsVisible  |  ( |   | ) |   const
pure virtual
 Description: Return true if the window is visible, else false. Returns: Return true if the window is visible, else false.
◆ LocalCaption()
 virtual const wchar_t* IRhinoWindow::LocalCaption  |  ( |   | ) |   const
virtual
 Description: Called to get the localized caption for this window using the current Rhino language Id. Returns: The localized name for this page using the current Rhino language Id.
◆ Location()
 virtual ON_2iPoint IRhinoWindow::Location  |  ( |   | ) |   const
pure virtual
 Description: Gets the top left corner of this window.
◆ operator=()
 IRhinoWindow& IRhinoWindow::operator=  |  ( |  const IRhinoWindow &  |   | )
protecteddelete
 Description: Delete the default operator=
◆ Parent()
 virtual RHINO_WINDOW_HANDLE IRhinoWindow::Parent  |  ( |   | ) |   const
pure virtual
 Description: Get the parent (host) window. This will return null unless a parent has been set in SetParent.
◆ Refresh()
 virtual void IRhinoWindow::Refresh  |  ( |  bool  |  immediate = false | )
pure virtual
 Description: Refreshes the window by repainting it. Parameters: immediate is true if the window should be repainted immediately, else false. Note: On Microsoft Windows, Refresh(true) is equivalent to RedrawWindow() and Refresh(false) is equivalent to Invalidate().
◆ Release()
 virtual void IRhinoWindow::Release  |  ( |   | )
pure virtual
 Description: Destroys the underlying window and deletes the object.
◆ SetFocused()
 virtual void IRhinoWindow::SetFocused  |  ( |   | )
pure virtual
 Description: Sets the keyboard focus to the window.
◆ SetIsEnabled()
 virtual void IRhinoWindow::SetIsEnabled  |  ( |  bool  |  enable | )
pure virtual
 Description: Enables or disables the window. Parameters: enable is true to enable the window or false to disable it.
◆ SetIsVisible()
 virtual void IRhinoWindow::SetIsVisible  |  ( |  bool  |  visible | )
pure virtual
 Description: Shows or hides the window. Parameters: visible is true to show the window or false to hide it.
◆ SetLocation()
 virtual void IRhinoWindow::SetLocation  |  ( |  ON_2iPoint  |  location | )
pure virtual
 Description: Sets the top left corner of this window. Parameters: location is the point to move to within the parent.
◆ SetParent()
 virtual void IRhinoWindow::SetParent  |  ( |  RHINO_WINDOW_HANDLE  |  parent | )
pure virtual
 Description: Set the parent (host) window. Parameters: parent is the parent to host the window on. Note: When the object uses a controller, the controller must be set before calling SetParent() otherwise creation of the underlying control may fail.
◆ SetSize()
 virtual void IRhinoWindow::SetSize  |  ( |  ON_2iSize  |  size,
|  bool  |  redraw = false,
|  bool  |  redrawBorder = false
)
pure virtual
 Description: Sets the window size. Parameters: size - is the new size for the window. redraw - if true then repaint the window after resizing else just resize it without redrawing. redrawBorder - if true then redraw the window border else do not.
◆ Size()
 virtual ON_2iSize IRhinoWindow::Size  |  ( |   | ) |   const
pure virtual
 Description: Gets the current window size.
◆ WindowProc()
 virtual LPARAM IRhinoWindow::WindowProc  |  ( |  unsigned int  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
virtual
 Description: Reserved for future use to extend class without breaking the SDK