Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmApplication Class Reference
OpenNURBS
#include <opennurbs_3dm_properties.h>
 Public Member Functions
ON_3dmApplication ()
application that created the 3dm file More...
~ON_3dmApplication ()
void  | Dump (ON_TextLog &) const
bool  | IsEmpty () const
bool  | IsValid () const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
ON_wString  | m_application_details
whatever you want More...
ON_wString  | m_application_name
short name like "Rhino 2.0" More...
ON_wString  | m_application_URL
URL. More...
 Static Public Attributes
static const ON_3dmApplication  | Empty
Constructor & Destructor Documentation
◆ ON_3dmApplication()
 ON_3dmApplication::ON_3dmApplication  |  ( |   | )
application that created the 3dm file
◆ ~ON_3dmApplication()
 ON_3dmApplication::~ON_3dmApplication  |  ( |   | )
Member Function Documentation
◆ Dump()
 void ON_3dmApplication::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ IsEmpty()
 bool ON_3dmApplication::IsEmpty  |  ( |   | ) |   const
◆ IsValid()
 bool ON_3dmApplication::IsValid  |  ( |   | ) |   const
◆ Read()
 bool ON_3dmApplication::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmApplication::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_3dmApplication ON_3dmApplication::Empty
static
◆ m_application_details
 ON_wString ON_3dmApplication::m_application_details
whatever you want
◆ m_application_name
 ON_wString ON_3dmApplication::m_application_name
short name like "Rhino 2.0"
◆ m_application_URL
 ON_wString ON_3dmApplication::m_application_URL
URL.