Public Attributes | List of all members
CRhinoAfterTransformObject::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
unsigned int  | m_transform_event_id
Member Data Documentation
◆ m_transform_event_id
 unsigned int CRhinoAfterTransformObject::CParameters::m_transform_event_id
This serial number identifies the transform objects event and is the same value passed to the CRhinoOnTransformObject::Notify().