Public Attributes | List of all members
ON_SortKeyIndex Class Reference
OpenNURBS
#include <opennurbs_string.h>
 Public Attributes
unsigned int  | m_index = 0
ON__UINT64  | m_key = 0
Detailed Description
Description: A (key, index) pair for the distribution sorts below. The point of sorting these rather than the values themselves is that the values are usually much bigger than 16 bytes, and a distribution sort moves every element on every pass.
Member Data Documentation
◆ m_index
 unsigned int ON_SortKeyIndex::m_index = 0
◆ m_key
 ON__UINT64 ON_SortKeyIndex::m_key = 0