Public Attributes | List of all members
CRhinoGetDimLinear::RhDocDimension Class Reference
Undo record for GetDimLinear baseline and continue modes. More...
#include <RhinoSdkDimLinear.h>
 Public Attributes
ON_UUID  | m_dim_id = ON_nil_uuid
int  | m_direction = 0
unsigned int  | m_doc_sn = 0
Detailed Description
Undo record for GetDimLinear baseline and continue modes.
Member Data Documentation
◆ m_dim_id
 ON_UUID CRhinoGetDimLinear::RhDocDimension::m_dim_id = ON_nil_uuid
◆ m_direction
 int CRhinoGetDimLinear::RhDocDimension::m_direction = 0
◆ m_doc_sn
 unsigned int CRhinoGetDimLinear::RhDocDimension::m_doc_sn = 0