Public Member Functions | List of all members
CRhRdkSimulatedTexture Class Reference
RDK
#include <RhRdkSimulatedTexture.h>
 Inheritance diagram for CRhRdkSimulatedTexture:
 Public Member Functions
RDK_DEPRECATED  | CRhRdkSimulatedTexture ()
CRhRdkSimulatedTexture (const CRhinoDoc *pDocAssoc)
CRhRdkSimulatedTexture (const CRhinoDoc *pDocAssoc, const ON_Texture &src)
CRhRdkSimulatedTexture (const CRhRdkSimulatedTexture &src)
RDK_DEPRECATED  | CRhRdkSimulatedTexture (const ON_Texture &src)
virtual  | ~CRhRdkSimulatedTexture ()
const CRhinoDoc *  | DocumentAssoc (void) const
virtual ON_wString  | Filename (void) const
virtual bool  | Filtered (void) const
virtual CRhRdkTexture::IColorAdjuster *  | GetColorAdjuster (void) const
virtual bool  | HasTransparentColor (void) const
virtual ON_Xform  | LocalMappingTransform (void) const
virtual int  | MappingChannel (void) const
virtual double  | MetersToUnits (const CRhinoDoc &doc, double dMeters) const
RDK_DEPRECATED double  | MetersToUnits (double dMeters) const
virtual ON_2dVector  | Offset (void) const
virtual ON_Texture &  | OnTexture (void)
virtual const ON_Texture &  | OnTexture (void) const
const CRhRdkSimulatedTexture &  | operator= (const CRhRdkSimulatedTexture &src)
bool  | operator== (const CRhRdkSimulatedTexture &src) const
virtual ON_wString  | OriginalFilename (void) const
virtual CRhRdkTexture::ProjectionModes  | ProjectionMode (void) const
virtual ON_2dVector  | Repeat (void) const
virtual double  | Rotation (void) const
virtual void  | SetColorAdjuster (CRhRdkTexture::IColorAdjuster *)
void  | SetDocumentAssoc (const CRhinoDoc *)
virtual RDK_DEPRECATED void  | SetFilename (const ON_wString &sFilename, bool bAllowSearch=true)
virtual_su void  | SetFilename (const ON_wString &sFilename, const CRhinoDoc *doc, bool bAllowSearch=true)
virtual void  | SetFiltered (bool)
virtual void  | SetHasTransparentColor (bool)
virtual void  | SetMappingAndProjection (CRhRdkTexture::ProjectionModes pm, int iMappingChannel, CRhRdkTexture::EnvironmentMappingModes e)
virtual RDK_DEPRECATED void  | SetMappingChannel (int iChannel)
virtual void  | SetOffset (const ON_2dVector &offset)
virtual void  | SetOffset (double s, double t)
virtual RDK_DEPRECATED void  | SetProjectionMode (CRhRdkTexture::ProjectionModes)
virtual void  | SetRepeat (const ON_2dVector &repeat)
virtual void  | SetRepeat (double s, double t)
virtual void  | SetRotation (double dRotation)
virtual void  | SetTransparentColor (const CRhRdkColor &)
virtual void  | SetTransparentColorSensitivity (double)
virtual void  | SetWrapType (CRhRdkTexture::WrapTypes wt)
virtual CRhRdkColor  | TransparentColor (void) const
virtual double  | TransparentColorSensitivity () const
virtual double  | UnitsToMeters (const CRhinoDoc &doc, double dUnits) const
RDK_DEPRECATED double  | UnitsToMeters (double dUnits) const
virtual CRhRdkTexture::WrapTypes  | WrapType (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkSimulatedTexture() [1/5]
 RDK_DEPRECATED CRhRdkSimulatedTexture::CRhRdkSimulatedTexture  |  ( |   | )
◆ ~CRhRdkSimulatedTexture()
 virtual CRhRdkSimulatedTexture::~CRhRdkSimulatedTexture  |  ( |   | )
virtual
◆ CRhRdkSimulatedTexture() [2/5]
 CRhRdkSimulatedTexture::CRhRdkSimulatedTexture  |  ( |  const CRhinoDoc *  |  pDocAssoc | )
◆ CRhRdkSimulatedTexture() [3/5]
 RDK_DEPRECATED CRhRdkSimulatedTexture::CRhRdkSimulatedTexture  |  ( |  const ON_Texture &  |  src | )
◆ CRhRdkSimulatedTexture() [4/5]
 CRhRdkSimulatedTexture::CRhRdkSimulatedTexture  |  ( |  const CRhinoDoc *  |  pDocAssoc,
|  const ON_Texture &  |  src
)
◆ CRhRdkSimulatedTexture() [5/5]
 CRhRdkSimulatedTexture::CRhRdkSimulatedTexture  |  ( |  const CRhRdkSimulatedTexture &  |  src | )
Member Function Documentation
◆ DocumentAssoc()
 const CRhinoDoc* CRhRdkSimulatedTexture::DocumentAssoc  |  ( |  void  |   | ) |   const
◆ Filename()
 virtual ON_wString CRhRdkSimulatedTexture::Filename  |  ( |  void  |   | ) |   const
virtual
◆ Filtered()
 virtual bool CRhRdkSimulatedTexture::Filtered  |  ( |  void  |   | ) |   const
virtual
◆ GetColorAdjuster()
 virtual CRhRdkTexture::IColorAdjuster* CRhRdkSimulatedTexture::GetColorAdjuster  |  ( |  void  |   | ) |   const
virtual
Calling GetColorAdjuster() can only be done once - it will return NULL the second time. The call transfers ownership of the IColorAdjuster object to the caller.
◆ HasTransparentColor()
 virtual bool CRhRdkSimulatedTexture::HasTransparentColor  |  ( |  void  |   | ) |   const
virtual
OBSOLETE; returns false.
◆ LocalMappingTransform()
 virtual ON_Xform CRhRdkSimulatedTexture::LocalMappingTransform  |  ( |  void  |   | ) |   const
virtual
◆ MappingChannel()
 virtual int CRhRdkSimulatedTexture::MappingChannel  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to 1.
◆ MetersToUnits() [1/2]
 virtual double CRhRdkSimulatedTexture::MetersToUnits  |  ( |  const CRhinoDoc &  |  doc,
|  double  |  dMeters
) |   |  const
virtual
◆ MetersToUnits() [2/2]
 RDK_DEPRECATED double CRhRdkSimulatedTexture::MetersToUnits  |  ( |  double  |  dMeters | ) |   const
◆ Offset()
 virtual ON_2dVector CRhRdkSimulatedTexture::Offset  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to (0.0, 0.0) - offset in texture UV space.
◆ OnTexture() [1/2]
 virtual ON_Texture& CRhRdkSimulatedTexture::OnTexture  |  ( |  void  |   | )
virtual
◆ OnTexture() [2/2]
 virtual const ON_Texture& CRhRdkSimulatedTexture::OnTexture  |  ( |  void  |   | ) |   const
virtual
◆ operator=()
 const CRhRdkSimulatedTexture& CRhRdkSimulatedTexture::operator=  |  ( |  const CRhRdkSimulatedTexture &  |  src | )
◆ operator==()
 bool CRhRdkSimulatedTexture::operator==  |  ( |  const CRhRdkSimulatedTexture &  |  src | ) |   const
◆ OriginalFilename()
 virtual ON_wString CRhRdkSimulatedTexture::OriginalFilename  |  ( |  void  |   | ) |   const
virtual
◆ ProjectionMode()
 virtual CRhRdkTexture::ProjectionModes CRhRdkSimulatedTexture::ProjectionMode  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to mapping_channel.
◆ Repeat()
 virtual ON_2dVector CRhRdkSimulatedTexture::Repeat  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to (1.0, 1.0) - texture repeat (ie - 1.0 / scale).
◆ Rotation()
 virtual double CRhRdkSimulatedTexture::Rotation  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to 0.0 - radians, anti-clockwise.
◆ SetColorAdjuster()
 virtual void CRhRdkSimulatedTexture::SetColorAdjuster  |  ( |  CRhRdkTexture::IColorAdjuster *  |   | )
virtual
The call transfers ownership of the IColorAdjuster object to this object.
◆ SetDocumentAssoc()
 void CRhRdkSimulatedTexture::SetDocumentAssoc  |  ( |  const CRhinoDoc *  |   | )
◆ SetFilename() [1/2]
 virtual RDK_DEPRECATED void CRhRdkSimulatedTexture::SetFilename  |  ( |  const ON_wString &  |  sFilename,
|  bool  |  bAllowSearch = true
)
virtual
◆ SetFilename() [2/2]
 virtual_su void CRhRdkSimulatedTexture::SetFilename  |  ( |  const ON_wString &  |  sFilename,
|  const CRhinoDoc *  |  doc,
|  bool  |  bAllowSearch = true
)
◆ SetFiltered()
 virtual void CRhRdkSimulatedTexture::SetFiltered  |  ( |  bool  |   | )
virtual
◆ SetHasTransparentColor()
 virtual void CRhRdkSimulatedTexture::SetHasTransparentColor  |  ( |  bool  |   | )
virtual
OBSOLETE; not implemented.
◆ SetMappingAndProjection()
 virtual void CRhRdkSimulatedTexture::SetMappingAndProjection  |  ( |  CRhRdkTexture::ProjectionModes  |  pm,
|  int  |  iMappingChannel,
|  CRhRdkTexture::EnvironmentMappingModes  |  e
)
virtual
◆ SetMappingChannel()
 virtual RDK_DEPRECATED void CRhRdkSimulatedTexture::SetMappingChannel  |  ( |  int  |  iChannel | )
virtual
◆ SetOffset() [1/2]
 virtual void CRhRdkSimulatedTexture::SetOffset  |  ( |  const ON_2dVector &  |  offset | )
virtual
◆ SetOffset() [2/2]
 virtual void CRhRdkSimulatedTexture::SetOffset  |  ( |  double  |  s,
|  double  |  t
)
virtual
◆ SetProjectionMode()
 virtual RDK_DEPRECATED void CRhRdkSimulatedTexture::SetProjectionMode  |  ( |  CRhRdkTexture::ProjectionModes  |   | )
virtual
◆ SetRepeat() [1/2]
 virtual void CRhRdkSimulatedTexture::SetRepeat  |  ( |  const ON_2dVector &  |  repeat | )
virtual
◆ SetRepeat() [2/2]
 virtual void CRhRdkSimulatedTexture::SetRepeat  |  ( |  double  |  s,
|  double  |  t
)
virtual
◆ SetRotation()
 virtual void CRhRdkSimulatedTexture::SetRotation  |  ( |  double  |  dRotation | )
virtual
◆ SetTransparentColor()
 virtual void CRhRdkSimulatedTexture::SetTransparentColor  |  ( |  const CRhRdkColor &  |   | )
virtual
OBSOLETE; not implemented.
◆ SetTransparentColorSensitivity()
 virtual void CRhRdkSimulatedTexture::SetTransparentColorSensitivity  |  ( |  double  |   | )
virtual
OBSOLETE; not implemented.
◆ SetWrapType()
 virtual void CRhRdkSimulatedTexture::SetWrapType  |  ( |  CRhRdkTexture::WrapTypes  |  wt | )
virtual
◆ TransparentColor()
 virtual CRhRdkColor CRhRdkSimulatedTexture::TransparentColor  |  ( |  void  |   | ) |   const
virtual
OBSOLETE; returns black.
◆ TransparentColorSensitivity()
 virtual double CRhRdkSimulatedTexture::TransparentColorSensitivity  |  ( |   | ) |   const
virtual
OBSOLETE; returns 0.0
◆ UnitsToMeters() [1/2]
 virtual double CRhRdkSimulatedTexture::UnitsToMeters  |  ( |  const CRhinoDoc &  |  doc,
|  double  |  dUnits
) |   |  const
virtual
◆ UnitsToMeters() [2/2]
 RDK_DEPRECATED double CRhRdkSimulatedTexture::UnitsToMeters  |  ( |  double  |  dUnits | ) |   const
◆ WrapType()
 virtual CRhRdkTexture::WrapTypes CRhRdkSimulatedTexture::WrapType  |  ( |  void  |   | ) |   const
virtual
Note
Initialized to CRhRdkTexture::repeating.