Public Member Functions | Static Public Attributes | List of all members
ON_SubDComponentIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentIterator ()=default
ON_SubDComponentIterator (const class ON_SubD &subd)
ON_SubDComponentIterator (const class ON_SubDRef &subd_ref)
ON_SubDComponentIterator (const ON_SubDComponentIterator &)=default
const class ON_SubDComponentPtr  | CurrentComponent () const
const class ON_SubDComponentPtr  | FirstComponent ()
const class ON_SubDComponentPtr  | LastComponent ()
const class ON_SubDComponentPtr  | NextComponent ()
const class ON_SubDComponentPtr  | operator++ ()
ON_SubDComponentIterator &  | operator= (const ON_SubDComponentIterator &)=default
const class ON_SubD &  | SubD () const
unsigned int  | SubDLevel () const
const class ON_SubDRef &  | SubDRef () const
 Static Public Attributes
static const ON_SubDComponentIterator  | Empty
Detailed Description
ON_SubDComponentIterator
Constructor & Destructor Documentation
◆ ON_SubDComponentIterator() [1/4]
 ON_SubDComponentIterator::ON_SubDComponentIterator  |  ( |  const class ON_SubD &  |  subd | )
The ON_SubD member function ON_SubDComponentIterator ON_SubD::ComponentIterator(subd_level_index) is the best way to get a component iterator for a subd level.
◆ ON_SubDComponentIterator() [2/4]
 ON_SubDComponentIterator::ON_SubDComponentIterator  |  ( |  const class ON_SubDRef &  |  subd_ref | )
◆ ON_SubDComponentIterator() [3/4]
 ON_SubDComponentIterator::ON_SubDComponentIterator  |  ( |   | )
default
◆ ON_SubDComponentIterator() [4/4]
 ON_SubDComponentIterator::ON_SubDComponentIterator  |  ( |  const ON_SubDComponentIterator &  |   | )
default
Member Function Documentation
◆ CurrentComponent()
 const class ON_SubDComponentPtr ON_SubDComponentIterator::CurrentComponent  |  ( |   | ) |   const
inline
Returns: Current component;
◆ FirstComponent()
 const class ON_SubDComponentPtr ON_SubDComponentIterator::FirstComponent  |  ( |   | )
Description: Set the iterator to the beginning of the component list. Returns: First component in the list.
◆ LastComponent()
 const class ON_SubDComponentPtr ON_SubDComponentIterator::LastComponent  |  ( |   | )
Description: Set the iterator to the end of the component list. Returns: Last component in the list.
◆ NextComponent()
 const class ON_SubDComponentPtr ON_SubDComponentIterator::NextComponent  |  ( |   | )
Description: Returns the next component and increments the iterator. Returns: Next component. Remarks: operator++ and NextComponent() behave differently.
◆ operator++()
 const class ON_SubDComponentPtr ON_SubDComponentIterator::operator++  |  ( |   | )
inline
Description: Returns the current component and increment the iterator. Returns: Current component. Remarks: operator++ and NextComponent() behave differently.
◆ operator=()
 ON_SubDComponentIterator& ON_SubDComponentIterator::operator=  |  ( |  const ON_SubDComponentIterator &  |   | )
default
◆ SubD()
 const class ON_SubD& ON_SubDComponentIterator::SubD  |  ( |   | ) |   const
inline
Returns: The subD object for this iterator.
◆ SubDLevel()
 unsigned int ON_SubDComponentIterator::SubDLevel  |  ( |   | ) |   const
inline
Returns: The subD level for this iterator.
◆ SubDRef()
 const class ON_SubDRef& ON_SubDComponentIterator::SubDRef  |  ( |   | ) |   const
inline
Member Data Documentation
◆ Empty
 const ON_SubDComponentIterator ON_SubDComponentIterator::Empty
static