Public Member Functions | List of all members
CRhRdkCurveGraphEvaluator Class Reference
RDK
#include <RhRdkCurveGraph.h>
 Public Member Functions
CRhRdkCurveGraphEvaluator (const wchar_t *wszXML)
virtual  | ~CRhRdkCurveGraphEvaluator ()
virtual int  | CurveCount (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual double  | GetCurveY (int iCurveIndex, double dX) const
Detailed Description
Calculates the Y coordinate of a curve graph at any X coordinate.
See also
CRhRdkCurveGraph
Constructor & Destructor Documentation
◆ CRhRdkCurveGraphEvaluator()
 CRhRdkCurveGraphEvaluator::CRhRdkCurveGraphEvaluator  |  ( |  const wchar_t *  |  wszXML | )
◆ ~CRhRdkCurveGraphEvaluator()
 virtual CRhRdkCurveGraphEvaluator::~CRhRdkCurveGraphEvaluator  |  ( |   | )
virtual
Member Function Documentation
◆ CurveCount()
 virtual int CRhRdkCurveGraphEvaluator::CurveCount  |  ( |  void  |   | ) |   const
virtual
Returns
The number of curves available to the evaluator.
◆ EVF()
 virtual void* CRhRdkCurveGraphEvaluator::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
virtual
Emergency virtual function for future expansion.
◆ GetCurveY()
 virtual double CRhRdkCurveGraphEvaluator::GetCurveY  |  ( |  int  |  iCurveIndex,
|  double  |  dX
) |   |  const
virtual
Calculates the Y coordinate of a curve at the given X coordinate.
Parameters
iCurveIndex | is the curve index of one of the curves on the graph.
dX | is the X value to get the Y value for.
Returns
The Y coordinate at the given X coordinate or ON_UNSET_VALUE if the curve index is invalid.