Public Member Functions | Protected Attributes | List of all members
CRhinoUiImageList Class Reference
RhinoUI
#include <RhinoSdkUiImageList.h>
 Inheritance diagram for CRhinoUiImageList:
 Public Member Functions
CRhinoUiImageList (void)
~CRhinoUiImageList (void)
bool  | DeleteTrueColorImageList ()
DO NOT call DeleteImageList() directly!!!!! More...
bool  | LoadTrueColorImageList (LPCTSTR lpszBitmapID, int cx, bool grow, COLORREF crMask, AFX_MODULE_STATE *pPlugInModuleState=NULL)
bool  | LoadTrueColorImageList (UINT nID, int cx, bool grow, COLORREF crMask, AFX_MODULE_STATE *pPlugInModuleState=NULL)
 Protected Attributes
AFX_MODULE_STATE *  | m_pPlugInModuleState
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiImageList()
 CRhinoUiImageList::CRhinoUiImageList  |  ( |  void  |   | )
◆ ~CRhinoUiImageList()
 CRhinoUiImageList::~CRhinoUiImageList  |  ( |  void  |   | )
Member Function Documentation
◆ DeleteTrueColorImageList()
 bool CRhinoUiImageList::DeleteTrueColorImageList  |  ( |   | )
DO NOT call DeleteImageList() directly!!!!!
◆ LoadTrueColorImageList() [1/2]
 bool CRhinoUiImageList::LoadTrueColorImageList  |  ( |  LPCTSTR  |  lpszBitmapID,
|  int  |  cx,
|  bool  |  grow,
|  COLORREF  |  crMask,
|  AFX_MODULE_STATE *  |  pPlugInModuleState = NULL
)
◆ LoadTrueColorImageList() [2/2]
 bool CRhinoUiImageList::LoadTrueColorImageList  |  ( |  UINT  |  nID,
|  int  |  cx,
|  bool  |  grow,
|  COLORREF  |  crMask,
|  AFX_MODULE_STATE *  |  pPlugInModuleState = NULL
)
Member Data Documentation
◆ m_pPlugInModuleState
 AFX_MODULE_STATE* CRhinoUiImageList::m_pPlugInModuleState
protected