Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ON_RdkMaterialInstanceIdObsoleteUserData Class Reference
OpenNURBS
#include <opennurbs_userdata.h>
 Inheritance diagram for ON_RdkMaterialInstanceIdObsoleteUserData:
 Public Member Functions
ON_RdkMaterialInstanceIdObsoleteUserData ()
ON_RdkMaterialInstanceIdObsoleteUserData (const ON_RdkMaterialInstanceIdObsoleteUserData &)
virtual  | ~ON_RdkMaterialInstanceIdObsoleteUserData ()
bool  | DeleteAfterRead (const ON_BinaryArchive &archive, ON_Object *parent_object) const override
virtual ON_UserData override More...
bool  | DeleteAfterWrite (const ON_BinaryArchive &archive, const ON_Object *parent_object) const override
virtual ON_UserData override More...
bool  | GetDescription (ON_wString &description) override
virtual ON_UserData override More...
ON_RdkMaterialInstanceIdObsoleteUserData &  | operator= (const ON_RdkMaterialInstanceIdObsoleteUserData &)
bool  | Read (ON_BinaryArchive &) override
virtual ON_Object override More...
bool  | Write (ON_BinaryArchive &) const override
virtual ON_Object override More...
bool  | WriteToArchive (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const override
virtual ON_UserData override More...
 Public Member Functions inherited from ON_ObsoleteUserData
ON_ObsoleteUserData ()
ON_ObsoleteUserData (const ON_ObsoleteUserData &)
virtual  | ~ON_ObsoleteUserData ()
ON_ObsoleteUserData &  | operator= (const ON_ObsoleteUserData &)
 Public Member Functions inherited from ON_UserData
ON_UserData ()
ON_UserData (const ON_UserData &src)
The copy constructor copies every ON_UserData member variable except the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next and m_userdata_copycount. the pointers ON_Object* m_userdata_owner and ON_UserData* m_userdata_next are set to nullptr; in particular, the new instance of ON_UserData is not attached to any object immediately after copy constrtuction. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. More...
ON_UserData (ON_UUID userdata_uuid, ON_UUID application_uuid, unsigned int userdata_copycount)
~ON_UserData ()
virtual bool  | Archive () const
virtual bool  | DeleteAfterRead (const class ON_BinaryArchive &archive, class ON_Object *parent_object) const
virtual bool  | DeleteAfterWrite (const class ON_BinaryArchive &archive, const class ON_Object *parent_object) const
void  | Dump (ON_TextLog &text_log) const override
bool  | IsUnknownUserData () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_UserData *  | Next () const
ON_UserData &  | operator= (const ON_UserData &src)
The operator= copies m_userdata_xform. If src.m_userdata_copycount is zero, then this->m_userdata_copycount = 0. Otherwise this->m_userdata_copycount = src->m_userdata_copycount + 1. All other ON_UserData member variables (m_userdata_uuid, m_application_uuid, m_userdata_owner, and m_userdata_next) are not changed. In particular, operator= does not change the parent object nor does it change the ids that specify what the user data is (m_userdata_uuid) and what appication is using it (m_application_uuid). More...
ON_Object *  | Owner () const
Returns object that owns the user data. More...
unsigned int  | SizeOf () const override
virtual bool  | Transform (const ON_Xform &)
ON_UUID  | UserDataClassUuid () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static bool  | IsRdkMaterialInstanceIdUserData (ON_UUID class_id, ON_UUID userdata_id, ON_UUID app_id, ON_Object *object)
 Public Attributes
ON_UUID  | m_rdk_material_instance_id
 Public Attributes inherited from ON_ObsoleteUserData
ON_UUID  | m_archive_class_uuid
This is the user data class id that will be saved in the 3dm archive. More...
 Public Attributes inherited from ON_UserData
ON_UUID  | m_application_uuid
unsigned int  | m_userdata_copycount
ON_UUID  | m_userdata_uuid
ON_Xform  | m_userdata_xform
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Detailed Description
Do not export this class It is used internally to read and write 3dm archives with versions < 60.
Constructor & Destructor Documentation
◆ ON_RdkMaterialInstanceIdObsoleteUserData() [1/2]
 ON_RdkMaterialInstanceIdObsoleteUserData::ON_RdkMaterialInstanceIdObsoleteUserData  |  ( |   | )
◆ ~ON_RdkMaterialInstanceIdObsoleteUserData()
 virtual ON_RdkMaterialInstanceIdObsoleteUserData::~ON_RdkMaterialInstanceIdObsoleteUserData  |  ( |   | )
virtual
◆ ON_RdkMaterialInstanceIdObsoleteUserData() [2/2]
 ON_RdkMaterialInstanceIdObsoleteUserData::ON_RdkMaterialInstanceIdObsoleteUserData  |  ( |  const ON_RdkMaterialInstanceIdObsoleteUserData &  |   | )
Member Function Documentation
◆ DeleteAfterRead()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::DeleteAfterRead  |  ( |  const ON_BinaryArchive &  |  archive,
|  ON_Object *  |  parent_object
) |   |  const
override
virtual ON_UserData override
◆ DeleteAfterWrite()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::DeleteAfterWrite  |  ( |  const ON_BinaryArchive &  |  archive,
|  const ON_Object *  |  parent_object
) |   |  const
override
virtual ON_UserData override
◆ GetDescription()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::GetDescription  |  ( |  ON_wString &  |  description | )
overridevirtual
virtual ON_UserData override
Reimplemented from ON_UserData.
◆ IsRdkMaterialInstanceIdUserData()
 static bool ON_RdkMaterialInstanceIdObsoleteUserData::IsRdkMaterialInstanceIdUserData  |  ( |  ON_UUID  |  class_id,
|  ON_UUID  |  userdata_id,
|  ON_UUID  |  app_id,
|  ON_Object *  |  object
)
static
◆ operator=()
 ON_RdkMaterialInstanceIdObsoleteUserData& ON_RdkMaterialInstanceIdObsoleteUserData::operator=  |  ( |  const ON_RdkMaterialInstanceIdObsoleteUserData &  |   | )
◆ Read()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::Read  |  ( |  ON_BinaryArchive &  |   | )
overridevirtual
virtual ON_Object override
Reimplemented from ON_Object.
◆ Write()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
overridevirtual
virtual ON_Object override
Reimplemented from ON_Object.
◆ WriteToArchive()
 bool ON_RdkMaterialInstanceIdObsoleteUserData::WriteToArchive  |  ( |  const class ON_BinaryArchive &  |  archive,
|  const class ON_Object *  |  parent_object
) |   |  const
overridevirtual
virtual ON_UserData override
Reimplemented from ON_UserData.
Member Data Documentation
◆ m_rdk_material_instance_id
 ON_UUID ON_RdkMaterialInstanceIdObsoleteUserData::m_rdk_material_instance_id