Public Member Functions | Public Attributes | List of all members
ON_3dmPageSettings Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmPageSettings ()
~ON_3dmPageSettings ()
void  | Default ()
bool  | IsValid (ON_TextLog *text_log=0) const
bool  | Read (ON_BinaryArchive &archive)
bool  | Write (ON_BinaryArchive &archive) const
 Public Attributes
double  | m_bottom_margin_mm
double  | m_height_mm
double  | m_left_margin_mm
Page margins in millimeters. More...
int  | m_page_number
ON_wString  | m_printer_name
double  | m_right_margin_mm
double  | m_top_margin_mm
double  | m_width_mm
Overall size of the page in millimeters. More...
Detailed Description
ON_3dmView
Constructor & Destructor Documentation
◆ ON_3dmPageSettings()
 ON_3dmPageSettings::ON_3dmPageSettings  |  ( |   | )
◆ ~ON_3dmPageSettings()
 ON_3dmPageSettings::~ON_3dmPageSettings  |  ( |   | )
Member Function Documentation
◆ Default()
 void ON_3dmPageSettings::Default  |  ( |   | )
◆ IsValid()
 bool ON_3dmPageSettings::IsValid  |  ( |  ON_TextLog *  |  text_log = 0 | ) |   const
◆ Read()
 bool ON_3dmPageSettings::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_3dmPageSettings::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ m_bottom_margin_mm
 double ON_3dmPageSettings::m_bottom_margin_mm
◆ m_height_mm
 double ON_3dmPageSettings::m_height_mm
◆ m_left_margin_mm
 double ON_3dmPageSettings::m_left_margin_mm
Page margins in millimeters.
◆ m_page_number
 int ON_3dmPageSettings::m_page_number
◆ m_printer_name
 ON_wString ON_3dmPageSettings::m_printer_name
◆ m_right_margin_mm
 double ON_3dmPageSettings::m_right_margin_mm
◆ m_top_margin_mm
 double ON_3dmPageSettings::m_top_margin_mm
◆ m_width_mm
 double ON_3dmPageSettings::m_width_mm
Overall size of the page in millimeters.