Public Types | Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppGeneralSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | middle_mouse_mode { popup_menu, popup_toolbar, run_macro }
enum  | mouse_select_mode { crossing, window, combo }
 Public Member Functions
CRhinoAppGeneralSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const class CRhinoUiToolBar *  | MiddleMouseToolBar () const
bool  | operator!= (const CRhinoAppGeneralSettings &src) const
bool  | operator== (const CRhinoAppGeneralSettings &src) const
int  | ParseStartUpCommandList (ON_ClassArray< ON_wString > &result) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
 Public Attributes
bool  | m_bAutomaticPointsOn
When true single selecting objects (currently curves and annotations) automatically turns on control points. More...
bool  | m_bAutoUpdateCommandContext
CommandContext dialog auto-update feature. More...
bool  | m_bControlShiftSubObjectSelect
when true Control+Shift+click/window selects subobjects in addition to group members More...
bool  | m_bEnableContextMenu
Right mouse button. More...
bool  | m_bEnableParentLayerControl
bool  | m_bMiddleMousePlainButtonRotate
If true plain middle mouse button rotates the view instead of pans. More...
bool  | m_bMiddleMouseShiftControlSwap
If true middle mouse button zoom is activated with Shift key instead of Control. More...
bool  | m_bMiddleMouseViewManipulation
If true middle mouse button manipulates the view, emulating other CAD apps. More...
bool  | m_bPickableControlPolygon
When true control points can be selected by picking the connecting control polygon. More...
bool  | m_bPointsOnObjectSelect
When true object can be selected even if control points are on. More...
bool  | m_bSaveUnreferencedMaterials
Material persistence. More...
bool  | m_bShareMaterials
DEPRECATED - materials are no longer shared in Rhino. This value will always be false. More...
bool  | m_bShareTextureMappings
bool  | m_bSplitCreasedSurfaces
bool  | m_bUseExtrusions
when true commands that create objects use extrusions instead of breps whenever possible. More...
int  | m_context_menu_delay
int  | m_max_popup_menu_lines
Popup menu. More...
int  | m_max_undo_memory_mb
in MB megabytes More...
ON_wString  | m_middle_mouse_macro
middle_mouse_mode  | m_middle_mouse_mode
Middle mouse button. More...
ON_wString  | m_middle_mouse_toolbar_name
int  | m_min_undo_steps
mouse_select_mode  | m_mouse_select_mode
int  | m_new_object_isoparm_count
Surface isoparm density. More...
ON_ClassArray< ON_wString >  | m_popup_favorites
bool  | m_show_surface_isoparms
ON_wString  | m_startup_commands
Commands. More...
 Static Public Attributes
static const CRhinoAppGeneralSettings  | Default
Detailed Description
Member Enumeration Documentation
◆ middle_mouse_mode
 enum CRhinoAppGeneralSettings::middle_mouse_mode
Enumerator
popup_menu
popup_toolbar
run_macro
◆ mouse_select_mode
 enum CRhinoAppGeneralSettings::mouse_select_mode
Enumerator
crossing
window
combo
Constructor & Destructor Documentation
◆ CRhinoAppGeneralSettings()
 CRhinoAppGeneralSettings::CRhinoAppGeneralSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppGeneralSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppGeneralSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ MiddleMouseToolBar()
 const class CRhinoUiToolBar* CRhinoAppGeneralSettings::MiddleMouseToolBar  |  ( |   | ) |   const
Description: Call this method to get the tool bar that will be displayed if popup_toolbar == m_middle_mouse_mode Returns: Returns pointer to tool bar to pop-up if found otherwise NULL
◆ operator!=()
 bool CRhinoAppGeneralSettings::operator!=  |  ( |  const CRhinoAppGeneralSettings &  |  src | ) |   const
◆ operator==()
 bool CRhinoAppGeneralSettings::operator==  |  ( |  const CRhinoAppGeneralSettings &  |  src | ) |   const
◆ ParseStartUpCommandList()
 int CRhinoAppGeneralSettings::ParseStartUpCommandList  |  ( |  ON_ClassArray< ON_wString > &  |  result | ) |   const
◆ SaveProfile()
 void CRhinoAppGeneralSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
Member Data Documentation
◆ Default
 const CRhinoAppGeneralSettings CRhinoAppGeneralSettings::Default
static
◆ m_bAutomaticPointsOn
 bool CRhinoAppGeneralSettings::m_bAutomaticPointsOn
When true single selecting objects (currently curves and annotations) automatically turns on control points.
◆ m_bAutoUpdateCommandContext
 bool CRhinoAppGeneralSettings::m_bAutoUpdateCommandContext
CommandContext dialog auto-update feature.
◆ m_bControlShiftSubObjectSelect
 bool CRhinoAppGeneralSettings::m_bControlShiftSubObjectSelect
when true Control+Shift+click/window selects subobjects in addition to group members
◆ m_bEnableContextMenu
 bool CRhinoAppGeneralSettings::m_bEnableContextMenu
Right mouse button.
True if right mouse down + delay will pop up context menu on a mouse up if no move happens.
◆ m_bEnableParentLayerControl
 bool CRhinoAppGeneralSettings::m_bEnableParentLayerControl
If true, then parent layers control the visible and locked modes of sublayers. Otherwise, layers operate independently.
◆ m_bMiddleMousePlainButtonRotate
 bool CRhinoAppGeneralSettings::m_bMiddleMousePlainButtonRotate
If true plain middle mouse button rotates the view instead of pans.
◆ m_bMiddleMouseShiftControlSwap
 bool CRhinoAppGeneralSettings::m_bMiddleMouseShiftControlSwap
If true middle mouse button zoom is activated with Shift key instead of Control.
◆ m_bMiddleMouseViewManipulation
 bool CRhinoAppGeneralSettings::m_bMiddleMouseViewManipulation
If true middle mouse button manipulates the view, emulating other CAD apps.
◆ m_bPickableControlPolygon
 bool CRhinoAppGeneralSettings::m_bPickableControlPolygon
When true control points can be selected by picking the connecting control polygon.
◆ m_bPointsOnObjectSelect
 bool CRhinoAppGeneralSettings::m_bPointsOnObjectSelect
When true object can be selected even if control points are on.
◆ m_bSaveUnreferencedMaterials
 bool CRhinoAppGeneralSettings::m_bSaveUnreferencedMaterials
Material persistence.
If true, the "Save" command will save every material including the ones that are not used by any object or layer.
◆ m_bShareMaterials
 bool CRhinoAppGeneralSettings::m_bShareMaterials
DEPRECATED - materials are no longer shared in Rhino. This value will always be false.
DEPRECATED
◆ m_bShareTextureMappings
 bool CRhinoAppGeneralSettings::m_bShareTextureMappings
If true, objects with texture mappings that are copied from other objects will get the same texture mapping. Otherwise the new object gets a duplicate of the original texture mapping so that the object's mappings can be independently modified. The default is false.
◆ m_bSplitCreasedSurfaces
 bool CRhinoAppGeneralSettings::m_bSplitCreasedSurfaces
If m_bSplitCreasedSurfaces is true, then surfaces are automatically split into polysurfaces with smooth faces when they are added to the CRhinoDoc. Never perminantly change the value of this setting. It was a mistake to put this setting in the public SDK.
To temporarily set m_bSplitCreasedSurfaces to false, create a CRhinoKeepKinkySurfaces on the stack like this: {
 CRhinoKeepKinkySurfaces keep_kinky_surfaces; ... code that adds kinky surfaces to CRhinoDoc ... }
◆ m_bUseExtrusions
 bool CRhinoAppGeneralSettings::m_bUseExtrusions
when true commands that create objects use extrusions instead of breps whenever possible.
◆ m_context_menu_delay
 int CRhinoAppGeneralSettings::m_context_menu_delay
number of milliseconds to wait before permitting context menu display
◆ m_max_popup_menu_lines
 int CRhinoAppGeneralSettings::m_max_popup_menu_lines
Popup menu.
◆ m_max_undo_memory_mb
 int CRhinoAppGeneralSettings::m_max_undo_memory_mb
in MB megabytes
◆ m_middle_mouse_macro
 ON_wString CRhinoAppGeneralSettings::m_middle_mouse_macro
◆ m_middle_mouse_mode
 middle_mouse_mode CRhinoAppGeneralSettings::m_middle_mouse_mode
Middle mouse button.
◆ m_middle_mouse_toolbar_name
 ON_wString CRhinoAppGeneralSettings::m_middle_mouse_toolbar_name
◆ m_min_undo_steps
 int CRhinoAppGeneralSettings::m_min_undo_steps
Undo Undo records will be purged if there are more than m_min_undo_steps AND they use more than m_max_undo_memory_kb. When the records are purged there will always be at least m_min_undo_steps. saved.
◆ m_mouse_select_mode
 mouse_select_mode CRhinoAppGeneralSettings::m_mouse_select_mode
◆ m_new_object_isoparm_count
 int CRhinoAppGeneralSettings::m_new_object_isoparm_count
Surface isoparm density.
◆ m_popup_favorites
 ON_ClassArray<ON_wString> CRhinoAppGeneralSettings::m_popup_favorites
◆ m_show_surface_isoparms
 bool CRhinoAppGeneralSettings::m_show_surface_isoparms
◆ m_startup_commands
 ON_wString CRhinoAppGeneralSettings::m_startup_commands
Commands.