Public Member Functions | Protected Member Functions | List of all members
CRhinoUiSeparator Class Reference
RhinoUI
CRhinoUiSeparator. More...
#include <RhinoSdkUiSeparator.h>
 Inheritance diagram for CRhinoUiSeparator:
 Public Member Functions
CRhinoUiSeparator ()
virtual  | ~CRhinoUiSeparator ()
 Public Member Functions inherited from CRhinoUiStatic
CRhinoUiStatic ()
virtual  | ~CRhinoUiStatic ()
CString  | GetText ()
Returns the static window text. More...
afx_msg void  | OnPaint ()
void  | SetText (const char *lpsText)
Sets the static window text. More...
void  | SetText (const wchar_t *lpsText)
void  | SetTextIsFilePath (bool)
bool  | TextIsFilePath ()
 Protected Member Functions
afx_msg void  | OnEnable (BOOL32 bEnable)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
 Additional Inherited Members
 Protected Attributes inherited from CRhinoUiStatic
bool  | m_bIsFilePath
Detailed Description
CRhinoUiSeparator.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// Description CRhinoUiSeparator is an enhancement to the MFC CRhinoUiStatic that, in addition to displaying text, draws a separator line. This class as an alternative to using two statistics when displaying text w/ separator lines in options and properties dialog boxes and property pages.
Remarks: When laying out horizontal separators, place your static controls as usual, but make them as wide as you want the horizontal line to draw. You can also set the alignment of the text (left, center, or right), and set the No Prefix style. Those are the only static control styles currently supported.
Each static control that will be used as a separator should have a real, unique ID (not IDC_STATIC). Using ClassWizard, create member variables of type CRhinoUiStatic for each separator, and then go to the ClassWizard-generated code and change the type of the variables to CRhinoUiSeparator.
Constructor & Destructor Documentation
◆ CRhinoUiSeparator()
 CRhinoUiSeparator::CRhinoUiSeparator  |  ( |   | )
◆ ~CRhinoUiSeparator()
 virtual CRhinoUiSeparator::~CRhinoUiSeparator  |  ( |   | )
virtual
Member Function Documentation
◆ OnEnable()
 afx_msg void CRhinoUiSeparator::OnEnable  |  ( |  BOOL32  |  bEnable | )
protected
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiSeparator::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
protected
◆ OnPaint()
 afx_msg void CRhinoUiSeparator::OnPaint  |  ( |   | )
protected
◆ OnSize()
 afx_msg void CRhinoUiSeparator::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
protected