Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmNotes Class Reference
OpenNURBS
#include <opennurbs_3dm_properties.h>
 Public Member Functions
ON_3dmNotes ()
~ON_3dmNotes ()
void  | Dump (ON_TextLog &) const
bool  | IsEmpty () const
bool  | IsValid () const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bHTML
true if notes are in HTML More...
bool  | m_bLocked = false
bool  | m_bVisible
true if notes window is showing More...
ON_wString  | m_notes
int  | m_window_bottom
int  | m_window_left
last window position More...
int  | m_window_right
int  | m_window_top
unsigned char  | reserved1 = 0
 Static Public Attributes
static const ON_3dmNotes  | Empty
Constructor & Destructor Documentation
◆ ON_3dmNotes()
 ON_3dmNotes::ON_3dmNotes  |  ( |   | )
◆ ~ON_3dmNotes()
 ON_3dmNotes::~ON_3dmNotes  |  ( |   | )
Member Function Documentation
◆ Dump()
 void ON_3dmNotes::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ IsEmpty()
 bool ON_3dmNotes::IsEmpty  |  ( |   | ) |   const
◆ IsValid()
 bool ON_3dmNotes::IsValid  |  ( |   | ) |   const
◆ Read()
 bool ON_3dmNotes::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmNotes::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Empty
 const ON_3dmNotes ON_3dmNotes::Empty
static
◆ m_bHTML
 bool ON_3dmNotes::m_bHTML
true if notes are in HTML
◆ m_bLocked
 bool ON_3dmNotes::m_bLocked = false
◆ m_bVisible
 bool ON_3dmNotes::m_bVisible
true if notes window is showing
◆ m_notes
 ON_wString ON_3dmNotes::m_notes
Interface - this information is serialized. Applications may want to derive a runtime class that has additional window and font information.
◆ m_window_bottom
 int ON_3dmNotes::m_window_bottom
◆ m_window_left
 int ON_3dmNotes::m_window_left
last window position
◆ m_window_right
 int ON_3dmNotes::m_window_right
◆ m_window_top
 int ON_3dmNotes::m_window_top
◆ reserved1
 unsigned char ON_3dmNotes::reserved1 = 0