Public Types | Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppModelAidSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | cursor_mode { no_osnap_cursor = 0, black_on_white_osnap_cursor, white_on_black_osnap_cursor }
enum  | point_display_mode { world_point = 0, cplane_point, invalid_point_display_mode }
 Public Member Functions
CRhinoAppModelAidSettings ()
CRhinoAppModelAidSettings (const CRhinoAppModelAidSettings &src)
CRhinoAppModelAidSettings (CRhinoAppModelAidSettings &&)
~CRhinoAppModelAidSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppModelAidSettings &src) const
CRhinoAppModelAidSettings &  | operator= (const CRhinoAppModelAidSettings &src)
CRhinoAppModelAidSettings &  | operator= (CRhinoAppModelAidSettings &&)
bool  | operator== (const CRhinoAppModelAidSettings &src) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | SetUvIndicatorSize (double size)
double  | UvIndicatorSize () const
 Public Attributes
bool  | m_alt_plus_arrows
nudge keys and direction More...
bool  | m_center_snap_to_approximations
int  | m_control_polygon_display_density
double  | m_ctrl_nudge_key_step
int  | m_cursor_mode
See enum cursor_mode. More...
double  | m_digitizer_osnap_pickbox_radius
object snaps More...
bool  | m_display_control_polygon
control polygon display More...
bool  | m_extend_to_apparent_int
bool  | m_extend_trim_lines
trim / extend More...
bool  | m_grid_snap_on
Grid snap. More...
bool  | m_highlight_control_polygon
int  | m_mouse_pickbox_radius
radius of mouse pick box in pixels More...
bool  | m_nearmidintperp_snap_to_meshes
osnapping to mesh objects More...
double  | m_nudge_key_step
nudge steps in units More...
int  | m_nudge_mode
bool  | m_only_snap_to_selected
double  | m_ortho_angle
bool  | m_ortho_on
ortho More...
unsigned int  | m_osnap_mode
bits set using osnap_mode enum More...
int  | m_osnap_pickbox_radius
bool  | m_planar_on
planar mode More...
point_display_mode  | m_point_display_mode
bool  | m_project_snap_to_cplane
bool  | m_project_snap_to_cplane_in_plan_parallel_views
Projecting osnaps in plan parallel views. More...
double  | m_shift_nudge_key_step
bool  | m_snap_to_filtered
bool  | m_snap_to_locked
bool  | m_snap_to_occluded
bool  | m_suspend_osnap
osnap More...
bool  | m_uplane_mode
Universal construction plane mode. More...
bool  | m_use_horizontal_dialog
 Static Public Attributes
static const CRhinoAppModelAidSettings  | Default
Detailed Description
Member Enumeration Documentation
◆ cursor_mode
 enum CRhinoAppModelAidSettings::cursor_mode
Enumerator
no_osnap_cursor
black_on_white_osnap_cursor
white_on_black_osnap_cursor
◆ point_display_mode
 enum CRhinoAppModelAidSettings::point_display_mode
Enumerator
world_point
points are displayed in world coordinates
cplane_point
points are displayed in cplane coordinates
invalid_point_display_mode
invalid, unset value.
Constructor & Destructor Documentation
◆ CRhinoAppModelAidSettings() [1/3]
 CRhinoAppModelAidSettings::CRhinoAppModelAidSettings  |  ( |   | )
◆ CRhinoAppModelAidSettings() [2/3]
 CRhinoAppModelAidSettings::CRhinoAppModelAidSettings  |  ( |  const CRhinoAppModelAidSettings &  |  src | )
◆ ~CRhinoAppModelAidSettings()
 CRhinoAppModelAidSettings::~CRhinoAppModelAidSettings  |  ( |   | )
◆ CRhinoAppModelAidSettings() [3/3]
 CRhinoAppModelAidSettings::CRhinoAppModelAidSettings  |  ( |  CRhinoAppModelAidSettings &&  |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppModelAidSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppModelAidSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppModelAidSettings::operator!=  |  ( |  const CRhinoAppModelAidSettings &  |  src | ) |   const
◆ operator=() [1/2]
 CRhinoAppModelAidSettings& CRhinoAppModelAidSettings::operator=  |  ( |  const CRhinoAppModelAidSettings &  |  src | )
◆ operator=() [2/2]
 CRhinoAppModelAidSettings& CRhinoAppModelAidSettings::operator=  |  ( |  CRhinoAppModelAidSettings &&  |   | )
◆ operator==()
 bool CRhinoAppModelAidSettings::operator==  |  ( |  const CRhinoAppModelAidSettings &  |  src | ) |   const
◆ SaveProfile()
 void CRhinoAppModelAidSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ SetUvIndicatorSize()
 void CRhinoAppModelAidSettings::SetUvIndicatorSize  |  ( |  double  |  size | )
◆ UvIndicatorSize()
 double CRhinoAppModelAidSettings::UvIndicatorSize  |  ( |   | ) |   const
Member Data Documentation
◆ Default
 const CRhinoAppModelAidSettings CRhinoAppModelAidSettings::Default
static
◆ m_alt_plus_arrows
 bool CRhinoAppModelAidSettings::m_alt_plus_arrows
nudge keys and direction
true mean Alt+arrow is used for nudging.
◆ m_center_snap_to_approximations
 bool CRhinoAppModelAidSettings::m_center_snap_to_approximations
◆ m_control_polygon_display_density
 int CRhinoAppModelAidSettings::m_control_polygon_display_density
◆ m_ctrl_nudge_key_step
 double CRhinoAppModelAidSettings::m_ctrl_nudge_key_step
◆ m_cursor_mode
 int CRhinoAppModelAidSettings::m_cursor_mode
See enum cursor_mode.
◆ m_digitizer_osnap_pickbox_radius
 double CRhinoAppModelAidSettings::m_digitizer_osnap_pickbox_radius
object snaps
◆ m_display_control_polygon
 bool CRhinoAppModelAidSettings::m_display_control_polygon
control polygon display
obsolete, replaced by m_nudge_mode bool m_use_cplane_axes; ///< True means use cplane, false means use world
◆ m_extend_to_apparent_int
 bool CRhinoAppModelAidSettings::m_extend_to_apparent_int
◆ m_extend_trim_lines
 bool CRhinoAppModelAidSettings::m_extend_trim_lines
trim / extend
◆ m_grid_snap_on
 bool CRhinoAppModelAidSettings::m_grid_snap_on
Grid snap.
◆ m_highlight_control_polygon
 bool CRhinoAppModelAidSettings::m_highlight_control_polygon
◆ m_mouse_pickbox_radius
 int CRhinoAppModelAidSettings::m_mouse_pickbox_radius
radius of mouse pick box in pixels
◆ m_nearmidintperp_snap_to_meshes
 bool CRhinoAppModelAidSettings::m_nearmidintperp_snap_to_meshes
osnapping to mesh objects
◆ m_nudge_key_step
 double CRhinoAppModelAidSettings::m_nudge_key_step
nudge steps in units
◆ m_nudge_mode
 int CRhinoAppModelAidSettings::m_nudge_mode
0 = world, 1 = cplane, 2 = view, 3 = uvn, -1 = not set
◆ m_only_snap_to_selected
 bool CRhinoAppModelAidSettings::m_only_snap_to_selected
◆ m_ortho_angle
 double CRhinoAppModelAidSettings::m_ortho_angle
◆ m_ortho_on
 bool CRhinoAppModelAidSettings::m_ortho_on
ortho
◆ m_osnap_mode
 unsigned int CRhinoAppModelAidSettings::m_osnap_mode
bits set using osnap_mode enum
◆ m_osnap_pickbox_radius
 int CRhinoAppModelAidSettings::m_osnap_pickbox_radius
◆ m_planar_on
 bool CRhinoAppModelAidSettings::m_planar_on
planar mode
◆ m_point_display_mode
 point_display_mode CRhinoAppModelAidSettings::m_point_display_mode
◆ m_project_snap_to_cplane
 bool CRhinoAppModelAidSettings::m_project_snap_to_cplane
◆ m_project_snap_to_cplane_in_plan_parallel_views
 bool CRhinoAppModelAidSettings::m_project_snap_to_cplane_in_plan_parallel_views
Projecting osnaps in plan parallel views.
◆ m_shift_nudge_key_step
 double CRhinoAppModelAidSettings::m_shift_nudge_key_step
◆ m_snap_to_filtered
 bool CRhinoAppModelAidSettings::m_snap_to_filtered
◆ m_snap_to_locked
 bool CRhinoAppModelAidSettings::m_snap_to_locked
◆ m_snap_to_occluded
 bool CRhinoAppModelAidSettings::m_snap_to_occluded
◆ m_suspend_osnap
 bool CRhinoAppModelAidSettings::m_suspend_osnap
osnap
◆ m_uplane_mode
 bool CRhinoAppModelAidSettings::m_uplane_mode
Universal construction plane mode.
◆ m_use_horizontal_dialog
 bool CRhinoAppModelAidSettings::m_use_horizontal_dialog