Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
IRhinoPropertiesPanelPage Class Referenceabstract
Rhino
#include <RhinoSdkPages.h>
 Inheritance diagram for IRhinoPropertiesPanelPage:
 Public Member Functions
virtual void  | HostAttached (IRhinoPropertiesPanelPageHost *host)
virtual bool  | IncludeInNavigationControl (IRhinoPropertiesPanelPageEventArgs &args) const =0
virtual int  | Index (void) const
virtual IRhinoPropertiesPanelPage *  | NewNamedViewPage () const
virtual void  | OnModifyPage (IRhinoPropertiesPanelPageEventArgs &args)
= 0; More...
virtual RhinoPropertiesPanelPageType  | PageType () const
virtual bool  | PropertiesDialogPageEvent (IRhinoPropertiesPanelPageEventArgs &args)
virtual CRhinoCommand::result  | RunScript (IRhinoPropertiesPanelPageEventArgs &args)=0
virtual bool  | SupportsSubObjectSelection (void) const
virtual void  | UpdatePage (IRhinoPropertiesPanelPageEventArgs &e)=0
 Public Member Functions inherited from IRhinoPage
virtual  | ~IRhinoPage ()=default
virtual bool  | Activated (const class IRhinoPageHost *host, bool activated) const
virtual ON_2iSize  | DefaultSize () const
virtual const wchar_t *  | EnglishTitle () const =0
virtual void  | HostWindowCreated (const class IRhinoPageHost *host) const
virtual RHINO_WINDOW_IMAGE_HANDLE  | Image (ON_2iSize size)=0
virtual const wchar_t *  | LocalTitle () const
virtual ON_2iSize  | MinimumSize () const
virtual LPARAM  | PageProc (unsigned int message, WPARAM wParam, LPARAM lParam)
virtual void  | Release ()=0
virtual bool  | ShowHelp (const class IRhinoPageHost *host) const
virtual IRhinoWindow *  | Window ()=0
 Static Public Member Functions
static IRhinoPropertiesPanelPageHost *  | GetHost (IRhinoPropertiesPanelPage *page)
 Protected Member Functions
IRhinoPropertiesPanelPage ()=default
IRhinoPropertiesPanelPage (const IRhinoPropertiesPanelPage &)=delete
~IRhinoPropertiesPanelPage ()=default
IRhinoPropertiesPanelPage &  | operator= (const IRhinoPropertiesPanelPage &)=delete
 Protected Member Functions inherited from IRhinoPage
IRhinoPage ()=default
IRhinoPage (const IRhinoPage &)=delete
IRhinoPage &  | operator= (const IRhinoPage &)=delete
Detailed Description
class IRhinoPropertiesPanelPage
Description: Interface used to extend the Rhino object properties panel.
Constructor & Destructor Documentation
◆ IRhinoPropertiesPanelPage() [1/2]
 IRhinoPropertiesPanelPage::IRhinoPropertiesPanelPage  |  ( |   | )
protecteddefault
 Description: Default constructor.
◆ ~IRhinoPropertiesPanelPage()
 IRhinoPropertiesPanelPage::~IRhinoPropertiesPanelPage  |  ( |   | )
protecteddefault
 Description: Default destructor.
◆ IRhinoPropertiesPanelPage() [2/2]
 IRhinoPropertiesPanelPage::IRhinoPropertiesPanelPage  |  ( |  const IRhinoPropertiesPanelPage &  |   | )
protecteddelete
 Description: Delete the default copy constructor
Member Function Documentation
◆ GetHost()
 static IRhinoPropertiesPanelPageHost* IRhinoPropertiesPanelPage::GetHost  |  ( |  IRhinoPropertiesPanelPage *  |  page | )
static
 Description: Returns the IRhinoPropertiesPanelPageHost containing the specified page. Returns: Returns the IRhinoPropertiesPanelPageHost containing the specified page.
◆ HostAttached()
 virtual void IRhinoPropertiesPanelPage::HostAttached  |  ( |  IRhinoPropertiesPanelPageHost *  |  host | )
virtual
 Description: This method gets called after the plug-in returns the pages to add to Rhino and the associated host objects are created. Save this pointer and use it to communicate with the host or just ignore the call if you don't care.
◆ IncludeInNavigationControl()
 virtual bool IRhinoPropertiesPanelPage::IncludeInNavigationControl  |  ( |  IRhinoPropertiesPanelPageEventArgs &  |  args | ) |   const
pure virtual
 Description: This method is called when updating the contents of the view or object properties navigation controls. Parameters: args - [in] Information about the currently selected view or currently selected object list. Returns: Return true to include the page in the navigation panel or false to exclude it.
◆ Index()
 virtual int IRhinoPropertiesPanelPage::Index  |  ( |  void  |   | ) |   const
virtual
 Description: The page navigation control adds buttons in the order the pages are processed, override this method and return a sort index to move the button to the beginning of the list. By default this returns -1 which puts the button at the end of the list.
◆ NewNamedViewPage()
 virtual IRhinoPropertiesPanelPage* IRhinoPropertiesPanelPage::NewNamedViewPage  |  ( |   | ) |   const
virtual
 Description: If you want the page to appear in the modal Named View properties dialog, override this method and return a new instance of this page.
◆ OnModifyPage()
 virtual void IRhinoPropertiesPanelPage::OnModifyPage  |  ( |  IRhinoPropertiesPanelPageEventArgs &  |  args | )
virtual
= 0;
 Description: This method gets called by ModifyPage when it is safe to modify the selected objects or view.
◆ operator=()
 IRhinoPropertiesPanelPage& IRhinoPropertiesPanelPage::operator=  |  ( |  const IRhinoPropertiesPanelPage &  |   | )
protecteddelete
 Description: Delete the default operator=
◆ PageType()
 virtual RhinoPropertiesPanelPageType IRhinoPropertiesPanelPage::PageType  |  ( |   | ) |   const
virtual
 Description: This defaults to custom_page. Override and return the system page you want to replace. Values of material_page and light_page are only meaningful if this page was added by a CRhinoRenderPlugIn and the plug-in is the current renderer.
◆ PropertiesDialogPageEvent()
 virtual bool IRhinoPropertiesPanelPage::PropertiesDialogPageEvent  |  ( |  IRhinoPropertiesPanelPageEventArgs &  |  args | )
virtual
 Description: This method is called in response to a specific event, see CRhinoPropertiesDialogPageEvent for event descriptions. This method has been provided to allow extending the class in the future without breaking the SDK. Parameters: args - [in] Describes this event and provides access to the selected object and/or active view list. Returns: Return value is dependent on the event reason provided in the args parameter.
◆ RunScript()
 virtual CRhinoCommand::result IRhinoPropertiesPanelPage::RunScript  |  ( |  IRhinoPropertiesPanelPageEventArgs &  |  args | )
pure virtual
 Description: Called by the script-able version of the host command when this page is selected. You should use CRhinoGet... methods to interact with users when overriding this method. Returns: The return value notifies the calling command to continue or cancel.
◆ SupportsSubObjectSelection()
 virtual bool IRhinoPropertiesPanelPage::SupportsSubObjectSelection  |  ( |  void  |   | ) |   const
virtual
 Description: Override and return true if this is a object properties and not view properties page and it supports sub object selection. Returns false by default. Returns: Returns false by default.
◆ UpdatePage()
 virtual void IRhinoPropertiesPanelPage::UpdatePage  |  ( |  IRhinoPropertiesPanelPageEventArgs &  |  e | )
pure virtual
 Description: Called by the host when it is time to update the page contents reflecting the current options states. Parameters: e[in] - Event arguments.