Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_TextStyle Class Reference
OpenNURBS
#include <opennurbs_text_style.h>
 Inheritance diagram for ON_TextStyle:
 Public Member Functions
ON_TextStyle ()
ON_TextStyle (const ON_TextStyle &)
~ON_TextStyle ()=default
const ON_wString &  | AppleFontName () const
const wchar_t *  | AppleFontNameAsPointer () const
void  | ClearFont ()
void  | Dump (ON_TextLog &) const override
overrides virtual ON_Object::IsValid More...
const ON_Font &  | Font () const
const ON_wString &  | FontDescription () const
const wchar_t *  | FontDescriptionAsPointer () const
bool  | FontIsLocked () const
bool  | FontIsSet () const
const wchar_t *  | GetNameAndFontDescription (const wchar_t *sSeparator, ON_wString &name_and_font_description) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
overrides virtual ON_Object::IsValid More...
void  | LockFont ()
ON_TextStyle &  | operator= (const ON_TextStyle &)
bool  | Read (ON_BinaryArchive &) override
overrides virtual ON_Object::Read More...
void  | SetFont (const ON_Font &font_characteristics)
void  | SetFont (const ON_Font *font_characteristics)
void  | SetFontFromDescription (const wchar_t *font_description, const wchar_t *apple_font_name, const ON_Font *alternate_font)
bool  | Write (ON_BinaryArchive &) const override
overrides virtual ON_Object::Write More...
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static bool  | EqualTextStyleFontAndName (const ON_TextStyle &a, const ON_TextStyle &b)
static const ON_TextStyle *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_TextStyle *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const unsigned int  | binary_archive_opennurbs_version
static const ON_TextStyle  | ByLayer
index = -2, no font More...
static const ON_TextStyle  | ByParent
index = -3, no font More...
static const ON_TextStyle  | Default
index = -1, font set More...
static const ON_TextStyle  | Unset
All values not set. More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_TextStyle() [1/2]
 ON_TextStyle::ON_TextStyle  |  ( |   | )
◆ ~ON_TextStyle()
 ON_TextStyle::~ON_TextStyle  |  ( |   | )
default
◆ ON_TextStyle() [2/2]
 ON_TextStyle::ON_TextStyle  |  ( |  const ON_TextStyle &  |   | )
Member Function Documentation
◆ AppleFontName()
 const ON_wString& ON_TextStyle::AppleFontName  |  ( |   | ) |   const
◆ AppleFontNameAsPointer()
 const wchar_t* ON_TextStyle::AppleFontNameAsPointer  |  ( |   | ) |   const
◆ ClearFont()
 void ON_TextStyle::ClearFont  |  ( |   | )
◆ Dump()
 void ON_TextStyle::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
overrides virtual ON_Object::IsValid
Reimplemented from ON_ModelComponent.
◆ EqualTextStyleFontAndName()
 static bool ON_TextStyle::EqualTextStyleFontAndName  |  ( |  const ON_TextStyle &  |  a,
|  const ON_TextStyle &  |  b
)
static
◆ Font()
 const ON_Font& ON_TextStyle::Font  |  ( |   | ) |   const
Returns: The managed font for this text style. Returns ON_Font::Default if the font is not set.
◆ FontDescription()
 const ON_wString& ON_TextStyle::FontDescription  |  ( |   | ) |   const
◆ FontDescriptionAsPointer()
 const wchar_t* ON_TextStyle::FontDescriptionAsPointer  |  ( |   | ) |   const
◆ FontIsLocked()
 bool ON_TextStyle::FontIsLocked  |  ( |   | ) |   const
◆ FontIsSet()
 bool ON_TextStyle::FontIsSet  |  ( |   | ) |   const
◆ FromModelComponentRef()
 static const ON_TextStyle* ON_TextStyle::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_TextStyle *  |  none_return_value
)
static
Parameters: model_component_reference - [in] none_return_value - [in] value to return if ON_TextStyle::Cast(model_component_ref.ModelComponent()) is nullptr Returns: If ON_TextStyle::Cast(model_component_ref.ModelComponent()) is not nullptr, that pointer is returned. Otherwise, none_return_value is returned.
◆ GetNameAndFontDescription()
 const wchar_t* ON_TextStyle::GetNameAndFontDescription  |  ( |  const wchar_t *  |  sSeparator,
|  ON_wString &  |  name_and_font_description
) |   |  const
Description: Get a string with the text style name and font description. Parameters: sSeparator - [in] string that separates the text style name and the font description. For example, if sSeparator = " - ", then name_and_font_description = "<text style name> - <font description>". name_and_font_description - [out] Returns: A pointer to the string in name_and_font_description. This pointer is never nullptr.
◆ IsValid()
 bool ON_TextStyle::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
overrides virtual ON_Object::IsValid
Reimplemented from ON_ModelComponent.
◆ LockFont()
 void ON_TextStyle::LockFont  |  ( |   | )
◆ operator=()
 ON_TextStyle& ON_TextStyle::operator=  |  ( |  const ON_TextStyle &  |   | )
◆ Read()
 bool ON_TextStyle::Read  |  ( |  ON_BinaryArchive &  |   | )
overridevirtual
overrides virtual ON_Object::Read
Reimplemented from ON_Object.
◆ SetFont() [1/2]
 void ON_TextStyle::SetFont  |  ( |  const ON_Font &  |  font_characteristics | )
◆ SetFont() [2/2]
 void ON_TextStyle::SetFont  |  ( |  const ON_Font *  |  font_characteristics | )
Parameters: font_characteristics - [in]
◆ SetFontFromDescription()
 void ON_TextStyle::SetFontFromDescription  |  ( |  const wchar_t *  |  font_description,
|  const wchar_t *  |  apple_font_name,
|  const ON_Font *  |  alternate_font
)
Parameters: font_description - [in] If font_description is an empty string, then SetFont( alternate_font ) is called. alternate_font - [in] Font to use if the current runtime environment does not have a font with a matching font description. When alternate_font is nullptr, ON_Font::Default will be used as the alternate font.
◆ Write()
 bool ON_TextStyle::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
overridevirtual
overrides virtual ON_Object::Write
Reimplemented from ON_Object.
Member Data Documentation
◆ binary_archive_opennurbs_version
 const unsigned int ON_TextStyle::binary_archive_opennurbs_version
static
On September 16, 2015 the "V5" ON_Font was split into ON_TextStyle (a document object) and ON_Font (a current runtime resource) = ON_VersionNumberConstruct(6, 0, 2015, 9, 16, 0) Versions of opennurbs before binary_archive_opennurbs_version serialized ON_TextStyle information in the V5 ON_Font format.
◆ ByLayer
 const ON_TextStyle ON_TextStyle::ByLayer
static
index = -2, no font
◆ ByParent
 const ON_TextStyle ON_TextStyle::ByParent
static
index = -3, no font
◆ Default
 const ON_TextStyle ON_TextStyle::Default
static
index = -1, font set
◆ Unset
 const ON_TextStyle ON_TextStyle::Unset
static
All values not set.