Public Member Functions | Static Public Member Functions | Public Attributes | Friends | List of all members
CRhinoHistoryRecord Class Reference
Rhino
#include <RhinoSdkHistoryRecordTable.h>
 Public Member Functions
CRhinoCommand *  | Command () const
CRhinoDoc &  | Document () const
int  | GetAntecedents (ON_SimpleArray< ON_UUID > &uuid_list) const
int  | GetAntecedents (ON_UuidList &uuid_list) const
int  | GetDescendants (ON_SimpleArray< ON_UUID > &descendant_ids) const
int  | GetDescendants (ON_UuidList &descendant_ids) const
bool  | GetPolyEdgeValue (int value_id, class CRhinoPolyEdge *&polyedge) const
int  | GetPolyEdgeValues (int value_id, ON_SimpleArray< class CRhinoPolyEdge * > &polyedges) const
bool  | GetRhinoObjRef (const ON_ObjRef &onref, CRhinoObjRef &objref) const
bool  | GetRhinoObjRef (int value_id, CRhinoObjRef &objref) const
int  | GetRhinoObjRefList (int value_id, ON_ClassArray< CRhinoObjRef > &objref_list) const
bool  | GetRhinoPointOnObject (const CRhinoObjRef &objref, ON_3dPoint &point) const
bool  | GetRhinoPointOnObject (const ON_ObjRef &onref, ON_3dPoint &point) const
bool  | GetRhinoPointOnObject (int value_id, ON_3dPoint &point) const
bool  | GetSubDEdgeChainValue (int value_id, ON_SubDEdgeChain &edge_chain) const
int  | GetSubDEdgeChainValues (int value_id, ON_ClassArray< ON_SubDEdgeChain > &edge_chains) const
ON_UUID  | HistoryRecordId () const
int  | HistoryVersion () const
bool  | IsAntecedent (ON_UUID object_uuid) const
bool  | MissingAntecedents () const
int  | RecordIndex () const
void  | Report (ON_TextLog &text_log) const
 Static Public Member Functions
static int  | CompareIndexAndId (const class CRhinoHistoryRecord &, const class CRhinoHistoryRecord &)
 Public Attributes
const ON_HistoryRecord &  | m_hr
int  | m_remap_index
Runtime index used when marking records for import/export. More...
 Friends
class  | CRhinoHistoryRecordTable
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Function Documentation
◆ Command()
 CRhinoCommand* CRhinoHistoryRecord::Command  |  ( |   | ) |   const
Returns: The command associated with this history record.
◆ CompareIndexAndId()
 static int CRhinoHistoryRecord::CompareIndexAndId  |  ( |  const class CRhinoHistoryRecord &  |  ,
|  const class CRhinoHistoryRecord &
)
static
◆ Document()
 CRhinoDoc& CRhinoHistoryRecord::Document  |  ( |   | ) |   const
Returns: CRhinoDoc this record belongs to.
◆ GetAntecedents() [1/2]
 int CRhinoHistoryRecord::GetAntecedents  |  ( |  ON_SimpleArray< ON_UUID > &  |  uuid_list | ) |   const
Description: Get a list of the antecedent (input) object ids in this history record. Parameters: uuid_list - [out] Antecedent ids are appended to the uuid_list[] array Returns: Returns the number of uuids appended to uuid_list[] array.
◆ GetAntecedents() [2/2]
 int CRhinoHistoryRecord::GetAntecedents  |  ( |  ON_UuidList &  |  uuid_list | ) |   const
◆ GetDescendants() [1/2]
 int CRhinoHistoryRecord::GetDescendants  |  ( |  ON_SimpleArray< ON_UUID > &  |  descendant_ids | ) |   const
Description: Get a list of the descendant (output) object ids in this history record. Parameters: descendant_ids - [out] Descendant ids are appended to the descendant_ids[] array Returns: Returns the number of uuids appended to descendant_ids[] array.
◆ GetDescendants() [2/2]
 int CRhinoHistoryRecord::GetDescendants  |  ( |  ON_UuidList &  |  descendant_ids | ) |   const
◆ GetPolyEdgeValue()
 bool CRhinoHistoryRecord::GetPolyEdgeValue  |  ( |  int  |  value_id,
|  class CRhinoPolyEdge *&  |  polyedge
) |   |  const
Description: Create a polyedges from information saved by SetPolyEdgeValue(). Parameters: value_id - [in] polyedge - [out] New polyedge. The caller is responsible for deleting the returned polyedge. Returns: True if a polyedge is returned.
◆ GetPolyEdgeValues()
 int CRhinoHistoryRecord::GetPolyEdgeValues  |  ( |  int  |  value_id,
|  ON_SimpleArray< class CRhinoPolyEdge * > &  |  polyedges
) |   |  const
Description: Creates polyedges from information saved by SetPolyEdgeValues(). Parameters: value_id - [in] polyedges - [out] New polyedges are appended to this array. The caller is responsible for deleting the returned polyedges. Returns: Number of polyedges added to polyedges[]
◆ GetRhinoObjRef() [1/2]
 bool CRhinoHistoryRecord::GetRhinoObjRef  |  ( |  const ON_ObjRef &  |  onref,
|  CRhinoObjRef &  |  objref
) |   |  const
◆ GetRhinoObjRef() [2/2]
 bool CRhinoHistoryRecord::GetRhinoObjRef  |  ( |  int  |  value_id,
|  CRhinoObjRef &  |  objref
) |   |  const
Description: In ReplayHistory overrides, use GetRhinoObjRef to convert the information in m_hr into a CRhinoObjRef that has up to date CRhinoObject pointers. Parameters: value_id - [in] History record value id or - [in] ON_ObjRef from m_hr. objref - [out] objref_list - [out] Returns True if successful
◆ GetRhinoObjRefList()
 int CRhinoHistoryRecord::GetRhinoObjRefList  |  ( |  int  |  value_id,
|  ON_ClassArray< CRhinoObjRef > &  |  objref_list
) |   |  const
Description: In ReplayHistory overrides, use GetRhinoObjRefList to convert the information in m_hr into an array CRhinoObjRefs that has up to date CRhinoObject pointers. Parameters: value_id - [in] History record value id objref_list - [out] Object references are appended to this list. Returns Number of elements appended to objref_list[].
◆ GetRhinoPointOnObject() [1/3]
 bool CRhinoHistoryRecord::GetRhinoPointOnObject  |  ( |  const CRhinoObjRef &  |  objref,
|  ON_3dPoint &  |  point
) |   |  const
◆ GetRhinoPointOnObject() [2/3]
 bool CRhinoHistoryRecord::GetRhinoPointOnObject  |  ( |  const ON_ObjRef &  |  onref,
|  ON_3dPoint &  |  point
) |   |  const
◆ GetRhinoPointOnObject() [3/3]
 bool CRhinoHistoryRecord::GetRhinoPointOnObject  |  ( |  int  |  value_id,
|  ON_3dPoint &  |  point
) |   |  const
Description: In ReplayHistory overrides, use GetRhinoPointOnObject to use the information in m_hr to find the CRhinoObject and evaluate it to get the point. Parameters: value_id - [in] History record value id or - [in] ON_ObjRef from m_hr. point - [out] Returns True if successful
◆ GetSubDEdgeChainValue()
 bool CRhinoHistoryRecord::GetSubDEdgeChainValue  |  ( |  int  |  value_id,
|  ON_SubDEdgeChain &  |  edge_chain
) |   |  const
Description: Creates edge chain from information saved by SetSubDEdgeChainValue(). Parameters: value_id - [in] edge_chain - [out] The returned edge_chain is updated to reference the current subd in the document. Returns: True if a nonempty edge chain is returned.
◆ GetSubDEdgeChainValues()
 int CRhinoHistoryRecord::GetSubDEdgeChainValues  |  ( |  int  |  value_id,
|  ON_ClassArray< ON_SubDEdgeChain > &  |  edge_chains
) |   |  const
Description: Creates edge chains from information saved by SetSubDEdgeChainValues(). Parameters: value_id - [in] edge_chains - [out] New edge chains are appended to this array. Returns: Number of edge chains added to edge_chains[]
◆ HistoryRecordId()
 ON_UUID CRhinoHistoryRecord::HistoryRecordId  |  ( |   | ) |   const
Description: Each history record has a unique id that Rhino assigns when it adds the history record to the history record table. Returns: History record id.
◆ HistoryVersion()
 int CRhinoHistoryRecord::HistoryVersion  |  ( |   | ) |   const
Description: ReplayHistory overrides check the version number to insure the information saved in the history record is compatible with the current implementation of ReplayHistory. Returns: History record version number.
◆ IsAntecedent()
 bool CRhinoHistoryRecord::IsAntecedent  |  ( |  ON_UUID  |  object_uuid | ) |   const
Description: Determine if object is an antecedent (input) in this history record. Parameters: object_uuid - [in] Returns: Returns true if object_uuid is the id of an input object.
◆ MissingAntecedents()
 bool CRhinoHistoryRecord::MissingAntecedents  |  ( |   | ) |   const
Returns: True if this there are no antecedents or at least one is deleted or purged.
◆ RecordIndex()
 int CRhinoHistoryRecord::RecordIndex  |  ( |   | ) |   const
Description: Index of this record in the CRhinoDoc.m_history_record_table[] array. This index will change during a session. This function is here for creating reports used to study history bugs. Returns: Index of this record in the CRhinoDoc.m_history_record_table[] array.
◆ Report()
 void CRhinoHistoryRecord::Report  |  ( |  ON_TextLog &  |  text_log | ) |   const
Description: Get a technical description of the values stored in the history record. This list is not localized and never will be. It is intended to be used by developers and to technical support staff. Parameters: text_log - [out]
Friends And Related Function Documentation
◆ CRhinoHistoryRecordTable
 friend class CRhinoHistoryRecordTable
friend
Member Data Documentation
◆ m_hr
 const ON_HistoryRecord& CRhinoHistoryRecord::m_hr
Construction history information. Use the ON_HistoryRecord Get...Value() functions to retrieve the values from m_hr.
◆ m_remap_index
 int CRhinoHistoryRecord::m_remap_index
Runtime index used when marking records for import/export.