Public Member Functions | Public Attributes | List of all members
ON_PlugInRef Class Reference
OpenNURBS
#include <opennurbs_pluginlist.h>
 Public Member Functions
ON_PlugInRef ()
void  | Default ()
void  | Dump (ON_TextLog &text_log) const
bool  | Read (ON_BinaryArchive &file)
bool  | Write (ON_BinaryArchive &file) const
 Public Attributes
ON_wString  | m_developer_address
ON_wString  | m_developer_country
ON_wString  | m_developer_email
ON_wString  | m_developer_fax
ON_wString  | m_developer_organization
developer contact information More...
ON_wString  | m_developer_phone
ON_wString  | m_developer_updateurl
ON_wString  | m_developer_website
ON_wString  | m_plugin_filename
name of executable file More...
ON_UUID  | m_plugin_id
executable information More...
ON_wString  | m_plugin_name
int  | m_plugin_platform
0 = unknown, 1 = C++, 2 = .NET More...
int  | m_plugin_sdk_service_release
int  | m_plugin_sdk_version
int  | m_plugin_type
CRhinoPlugIn::plugin_type enum value. More...
ON_wString  | m_plugin_version
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Description: The ON_PluginRef class is used to store a list of application plug-ins that may have saved user data in a 3dm file so they can be loaded as needed for reading their user data.
Constructor & Destructor Documentation
◆ ON_PlugInRef()
 ON_PlugInRef::ON_PlugInRef  |  ( |   | )
Member Function Documentation
◆ Default()
 void ON_PlugInRef::Default  |  ( |   | )
◆ Dump()
 void ON_PlugInRef::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
◆ Read()
 bool ON_PlugInRef::Read  |  ( |  ON_BinaryArchive &  |  file | )
◆ Write()
 bool ON_PlugInRef::Write  |  ( |  ON_BinaryArchive &  |  file | ) |   const
Member Data Documentation
◆ m_developer_address
 ON_wString ON_PlugInRef::m_developer_address
◆ m_developer_country
 ON_wString ON_PlugInRef::m_developer_country
◆ m_developer_email
 ON_wString ON_PlugInRef::m_developer_email
◆ m_developer_fax
 ON_wString ON_PlugInRef::m_developer_fax
◆ m_developer_organization
 ON_wString ON_PlugInRef::m_developer_organization
developer contact information
◆ m_developer_phone
 ON_wString ON_PlugInRef::m_developer_phone
◆ m_developer_updateurl
 ON_wString ON_PlugInRef::m_developer_updateurl
◆ m_developer_website
 ON_wString ON_PlugInRef::m_developer_website
◆ m_plugin_filename
 ON_wString ON_PlugInRef::m_plugin_filename
name of executable file
◆ m_plugin_id
 ON_UUID ON_PlugInRef::m_plugin_id
executable information
◆ m_plugin_name
 ON_wString ON_PlugInRef::m_plugin_name
◆ m_plugin_platform
 int ON_PlugInRef::m_plugin_platform
0 = unknown, 1 = C++, 2 = .NET
◆ m_plugin_sdk_service_release
 int ON_PlugInRef::m_plugin_sdk_service_release
◆ m_plugin_sdk_version
 int ON_PlugInRef::m_plugin_sdk_version
◆ m_plugin_type
 int ON_PlugInRef::m_plugin_type
CRhinoPlugIn::plugin_type enum value.
◆ m_plugin_version
 ON_wString ON_PlugInRef::m_plugin_version