Classes | Public Types | Public Member Functions | List of all members
ON_Displacement Class Reference
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_Displacement:
 Classes
class  | Defaults
class  | SubItem
Sub-items can exist to override the top-level parameters for polysurface/SubD faces. More...
class  | SubItemIterator
 Public Types
enum  | SweepResolutionFormulas : int { SweepResolutionFormulas::Default = 0, SweepResolutionFormulas::AbsoluteToleranceDependent = 1 }
 Public Member Functions
ON_Displacement ()
ON_Displacement (const ON_Displacement &dsp)
ON_Displacement (const ON_XMLNode &node)
~ON_Displacement ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const override
< For internal use only. More...
SubItem &  | AddSubItem (void)
double  | BlackPoint (void) const
Specifies the amount of displacement for the black color in the texture. More...
void  | DeleteAllSubItems (void)
void  | DeleteSubItem (int face_index)
int  | Fairing (void) const
Specifies number of steps for fairing process. This straightens rough feature edges. More...
bool  | FairingOn (void) const
Specifies whether to perform a fairing step. More...
int  | FinalMaxFaces (void) const
Specifies how many faces the reduction post process should target to. More...
bool  | FinalMaxFacesOn (void) const
Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement. More...
SubItem *  | FindSubItem (int face_index) const
int  | FindSubItemArrayIndex (int face_index) const
SubItemIterator  | GetSubItemIterator (void) const
int  | InitialQuality (void) const
int  | MappingChannel (void) const
Specifies which texture mapping channel is used for displacement texture. More...
int  | MeshMemoryLimit (void) const
Specifies in megabytes how much memory can be allocated for use by the displacement mesh. More...
bool  | On (void) const
Specifies whether the feature is enabled or not. More...
bool  | operator!= (const ON_Displacement &dsp) const
const ON_Displacement &  | operator= (const ON_Displacement &dsp)
bool  | operator== (const ON_Displacement &dsp) const
double  | PostWeldAngle (void) const
double  | RefineSensitivity (void) const
int  | RefineSteps (void) const
Specifies the number of refinement passes. More...
void  | SetBlackPoint (double b)
void  | SetFairing (int f)
void  | SetFairingOn (bool b)
void  | SetFinalMaxFaces (int f)
void  | SetFinalMaxFacesOn (bool b)
void  | SetInitialQuality (int q)
void  | SetMappingChannel (int c)
void  | SetMeshMemoryLimit (int l)
void  | SetOn (bool b)
void  | SetPostWeldAngle (double a)
void  | SetRefineSensitivity (double s)
void  | SetRefineSteps (int s)
void  | SetSweepResolutionFormula (SweepResolutionFormulas f)
void  | SetTexture (const ON_UUID &id)
void  | SetWhitePoint (double w)
SweepResolutionFormulas  | SweepResolutionFormula (void) const
ON_UUID  | Texture (void) const
Specifies which texture is used for computing displacement amount. More...
virtual ON_UUID  | Uuid (void) const override
Return the unique identifier of this mesh modifier. More...
double  | WhitePoint (void) const
Specifies the amount of displacement for the white color in the texture. More...
 Public Member Functions inherited from ON_MeshModifier
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
 Additional Inherited Members
 Static Public Member Functions inherited from ON_MeshModifier
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes inherited from ON_MeshModifier
CImpl *  | m_impl
Member Enumeration Documentation
◆ SweepResolutionFormulas
 enum ON_Displacement::SweepResolutionFormulas : int
strong
Specifies which formula is used to calculate sweep resolution from initial quality. Default = Default formula. AbsoluteToleranceDependent = Formula used in Rhino 5. Dependent on absolute tolerance.
Enumerator
Default
AbsoluteToleranceDependent
Constructor & Destructor Documentation
◆ ON_Displacement() [1/3]
 ON_Displacement::ON_Displacement  |  ( |   | )
◆ ON_Displacement() [2/3]
 ON_Displacement::ON_Displacement  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_Displacement() [3/3]
 ON_Displacement::ON_Displacement  |  ( |  const ON_Displacement &  |  dsp | )
◆ ~ON_Displacement()
 ON_Displacement::~ON_Displacement  |  ( |   | )
Member Function Documentation
◆ AddChildXML()
 virtual ON_XMLNode* ON_Displacement::AddChildXML  |  ( |  ON_XMLRootNode &  |  root | ) |   const
overridevirtual
< For internal use only.
Reimplemented from ON_MeshModifier.
◆ AddSubItem()
 SubItem& ON_Displacement::AddSubItem  |  ( |  void  |   | )
◆ BlackPoint()
 double ON_Displacement::BlackPoint  |  ( |  void  |   | ) |   const
Specifies the amount of displacement for the black color in the texture.
◆ DeleteAllSubItems()
 void ON_Displacement::DeleteAllSubItems  |  ( |  void  |   | )
◆ DeleteSubItem()
 void ON_Displacement::DeleteSubItem  |  ( |  int  |  face_index | )
◆ Fairing()
 int ON_Displacement::Fairing  |  ( |  void  |   | ) |   const
Specifies number of steps for fairing process. This straightens rough feature edges.
◆ FairingOn()
 bool ON_Displacement::FairingOn  |  ( |  void  |   | ) |   const
Specifies whether to perform a fairing step.
◆ FinalMaxFaces()
 int ON_Displacement::FinalMaxFaces  |  ( |  void  |   | ) |   const
Specifies how many faces the reduction post process should target to.
◆ FinalMaxFacesOn()
 bool ON_Displacement::FinalMaxFacesOn  |  ( |  void  |   | ) |   const
Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement.
◆ FindSubItem()
 SubItem* ON_Displacement::FindSubItem  |  ( |  int  |  face_index | ) |   const
◆ FindSubItemArrayIndex()
 int ON_Displacement::FindSubItemArrayIndex  |  ( |  int  |  face_index | ) |   const
◆ GetSubItemIterator()
 SubItemIterator ON_Displacement::GetSubItemIterator  |  ( |  void  |   | ) |   const
◆ InitialQuality()
 int ON_Displacement::InitialQuality  |  ( |  void  |   | ) |   const
Specifies how densely the object is initially subdivided. The lower the value, the higher the resolution of the displaced mesh.
◆ MappingChannel()
 int ON_Displacement::MappingChannel  |  ( |  void  |   | ) |   const
Specifies which texture mapping channel is used for displacement texture.
◆ MeshMemoryLimit()
 int ON_Displacement::MeshMemoryLimit  |  ( |  void  |   | ) |   const
Specifies in megabytes how much memory can be allocated for use by the displacement mesh.
◆ On()
 bool ON_Displacement::On  |  ( |  void  |   | ) |   const
Specifies whether the feature is enabled or not.
◆ operator!=()
 bool ON_Displacement::operator!=  |  ( |  const ON_Displacement &  |  dsp | ) |   const
◆ operator=()
 const ON_Displacement& ON_Displacement::operator=  |  ( |  const ON_Displacement &  |  dsp | )
◆ operator==()
 bool ON_Displacement::operator==  |  ( |  const ON_Displacement &  |  dsp | ) |   const
◆ PostWeldAngle()
 double ON_Displacement::PostWeldAngle  |  ( |  void  |   | ) |   const
Specifies the maximum angle between face normals of adjacent faces that will get welded together.
◆ RefineSensitivity()
 double ON_Displacement::RefineSensitivity  |  ( |  void  |   | ) |   const
Specifies how sensitive the divider for contrasts is on the displacement texture. Specify 1 to split all mesh edges on each refine step. Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split. Specifying 0.01 only splits edges where heavy contrast exists.
◆ RefineSteps()
 int ON_Displacement::RefineSteps  |  ( |  void  |   | ) |   const
Specifies the number of refinement passes.
◆ SetBlackPoint()
 void ON_Displacement::SetBlackPoint  |  ( |  double  |  b | )
◆ SetFairing()
 void ON_Displacement::SetFairing  |  ( |  int  |  f | )
◆ SetFairingOn()
 void ON_Displacement::SetFairingOn  |  ( |  bool  |  b | )
◆ SetFinalMaxFaces()
 void ON_Displacement::SetFinalMaxFaces  |  ( |  int  |  f | )
◆ SetFinalMaxFacesOn()
 void ON_Displacement::SetFinalMaxFacesOn  |  ( |  bool  |  b | )
◆ SetInitialQuality()
 void ON_Displacement::SetInitialQuality  |  ( |  int  |  q | )
◆ SetMappingChannel()
 void ON_Displacement::SetMappingChannel  |  ( |  int  |  c | )
◆ SetMeshMemoryLimit()
 void ON_Displacement::SetMeshMemoryLimit  |  ( |  int  |  l | )
◆ SetOn()
 void ON_Displacement::SetOn  |  ( |  bool  |  b | )
◆ SetPostWeldAngle()
 void ON_Displacement::SetPostWeldAngle  |  ( |  double  |  a | )
◆ SetRefineSensitivity()
 void ON_Displacement::SetRefineSensitivity  |  ( |  double  |  s | )
◆ SetRefineSteps()
 void ON_Displacement::SetRefineSteps  |  ( |  int  |  s | )
◆ SetSweepResolutionFormula()
 void ON_Displacement::SetSweepResolutionFormula  |  ( |  SweepResolutionFormulas  |  f | )
◆ SetTexture()
 void ON_Displacement::SetTexture  |  ( |  const ON_UUID &  |  id | )
◆ SetWhitePoint()
 void ON_Displacement::SetWhitePoint  |  ( |  double  |  w | )
◆ SweepResolutionFormula()
 SweepResolutionFormulas ON_Displacement::SweepResolutionFormula  |  ( |  void  |   | ) |   const
◆ Texture()
 ON_UUID ON_Displacement::Texture  |  ( |  void  |   | ) |   const
Specifies which texture is used for computing displacement amount.
◆ Uuid()
 virtual ON_UUID ON_Displacement::Uuid  |  ( |  void  |   | ) |   const
overridevirtual
Return the unique identifier of this mesh modifier.
Implements ON_MeshModifier.
◆ WhitePoint()
 double ON_Displacement::WhitePoint  |  ( |  void  |   | ) |   const
Specifies the amount of displacement for the white color in the texture.