Public Types | Public Member Functions | Public Attributes | List of all members
ON_SIXEvent Class Reference
OpenNURBS
Surface/ImplicitFunction Intersection event. More...
#include <opennurbs_plus_implicitfn.h>
 Public Types
enum  | Type : int {
 Type::Unknown = 0, Type::NoEvent = 1, Type::Point = 2, Type::Curve = 3,
 Type::Surface = 4
 }
 Public Member Functions
ON_SIXEvent ()
 Public Attributes
ON_CurvePair  | m_curves
ON_Surface *  | m_surface
Type  | m_type
ON_2dPoint  | m_uv
Detailed Description
Surface/ImplicitFunction Intersection event.
Member Enumeration Documentation
◆ Type
 enum ON_SIXEvent::Type : int
strong
Enumerator
Unknown
unknown event type
NoEvent
no point, curve or surface overlap
Point
the surface intersects the SDF at a point
Curve
the surface intersects the SDF with a curve
Surface
the surface overlaps the SDF intersection
Constructor & Destructor Documentation
◆ ON_SIXEvent()
 ON_SIXEvent::ON_SIXEvent  |  ( |   | )
inline
Member Data Documentation
◆ m_curves
 ON_CurvePair ON_SIXEvent::m_curves
◆ m_surface
 ON_Surface* ON_SIXEvent::m_surface
◆ m_type
 Type ON_SIXEvent::m_type
◆ m_uv
 ON_2dPoint ON_SIXEvent::m_uv