Public Member Functions | Protected Member Functions | Friends | List of all members
CRhinoUiExpandableTabPage Class Reference
RhinoUI
CRhinoUiExpandableTabPage. More...
#include <RhinoSdkUiExpandableTabPage.h>
 Inheritance diagram for CRhinoUiExpandableTabPage:
 Public Member Functions
CRhinoUiExpandableTabPage (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiExpandableTabPage (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiExpandableTabPage ()
const CRhinoUiExpandableTabCtrlItem *  | GetExpandableTabCtrlItem () const
CRhinoUiExpandableTabCtrl *  | GetTabCtrl () const
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
virtual void  | OnExpandTab (int iTabIndex, bool bExpand)
virtual void  | OnHideTab (int iTabIndex, bool bHide)
virtual BOOL32  | OnInitDialog ()
afx_msg void  | OnSysColorChange ()
LPCTSTR  | PageName () const
bool  | SetUseSpecialColors (bool b)
bool  | UseSpecialColors () const
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Member Functions
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Friends
class  | CRhinoUiExpandableTabCtrl
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Detailed Description
CRhinoUiExpandableTabPage.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiExpandableTabPage() [1/2]
 CRhinoUiExpandableTabPage::CRhinoUiExpandableTabPage  |  ( |  LPCTSTR  |  lpszTemplateName = NULL,
|  CWnd *  |  pParentWnd = NULL
)
Description: Constructors
Parameters: lpszTemplateName [in] Contains a null-terminated string that is the name of a dialog-box template resource. nIDTemplate [in] Contains the identifier of a dialog-box template resource. pParentWnd [in] Pointer to the parent or owner window object of type CWnd to which the dialog object belongs. If it is NULL, the dialog object parent window is set to the main application window.
See Also: class CRhinoUiDialog class CRhinoUiExpandableTab
◆ CRhinoUiExpandableTabPage() [2/2]
 CRhinoUiExpandableTabPage::CRhinoUiExpandableTabPage  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
◆ ~CRhinoUiExpandableTabPage()
 virtual CRhinoUiExpandableTabPage::~CRhinoUiExpandableTabPage  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ GetExpandableTabCtrlItem()
 const CRhinoUiExpandableTabCtrlItem* CRhinoUiExpandableTabPage::GetExpandableTabCtrlItem  |  ( |   | ) |   const
Description: Get expandable tab item record associated with this page. This pointer can be changed and should not be saved.
Returns: Temporary pointer to expandable tab item record that controls this dialog.
See Also: class CRhinoUiExpandableTabCtrlItem
◆ GetTabCtrl()
 CRhinoUiExpandableTabCtrl* CRhinoUiExpandableTabPage::GetTabCtrl  |  ( |   | ) |   const
Description: Get tab control that owns this tab page.
Returns: Tab control that this page is inserted in.
See Also: class CRhinoUiExpandableTabCtrl
◆ OnCreate()
 afx_msg int CRhinoUiExpandableTabPage::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
protected
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiExpandableTabPage::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiExpandableTabPage::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnExpandTab()
 virtual void CRhinoUiExpandableTabPage::OnExpandTab  |  ( |  int  |  iTabIndex,
|  bool  |  bExpand
)
virtual
Description: Event notification which is called when a tabs has been expanded or contracted.
Parameters: iTabIndex [in] Tab control index for this item bExpand [in] If true then tab has been expanded otherwise tab has been contracted.
See Also: CRhinoUiExpandableTabCtrl::ExpandItem()
Reimplemented in CRhinoUiModelessDockingDialog.
◆ OnHideTab()
 virtual void CRhinoUiExpandableTabPage::OnHideTab  |  ( |  int  |  iTabIndex,
|  bool  |  bHide
)
virtual
Description: Event notification which is called when a tabs hidden state changes.
Parameters: iTabIndex [in] Tab control index for this item bHide [in] If true then tab is hidden otherwise tab is no longer hidden.
See Also: CRhinoUiExpandableTabCtrl::HideTab()
Reimplemented in CRhinoUiModelessDockingDialog.
◆ OnInitDialog()
 virtual BOOL32 CRhinoUiExpandableTabPage::OnInitDialog  |  ( |   | )
virtual
Reimplemented from CRhinoUiDialog.
Reimplemented in CRhinoUiModelessDockingDialog.
◆ OnSysColorChange()
 afx_msg void CRhinoUiExpandableTabPage::OnSysColorChange  |  ( |   | )
◆ PageName()
 LPCTSTR CRhinoUiExpandableTabPage::PageName  |  ( |   | ) |   const
Description: Get expandable tab control item label
Returns: Name displayed on expandable control tab.
◆ PreCreateWindow()
 virtual BOOL32 CRhinoUiExpandableTabPage::PreCreateWindow  |  ( |  CREATESTRUCT &  |  cs | )
protectedvirtual
Reimplemented in CRhinoUiModelessDockingDialog.
◆ SetUseSpecialColors()
 bool CRhinoUiExpandableTabPage::SetUseSpecialColors  |  ( |  bool  |  b | )
◆ UseSpecialColors()
 bool CRhinoUiExpandableTabPage::UseSpecialColors  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoUiExpandableTabCtrl
 friend class CRhinoUiExpandableTabCtrl
friend