Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoGumballAppearance Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumballAppearance ()
CRhinoGumballAppearance (const CRhinoGumballAppearance &src)
CRhinoGumballAppearance (CRhinoGumballAppearance &&)
~CRhinoGumballAppearance ()
bool  | IsUvnGumball () const
const CRhinoGumballAppearance &  | operator= (const CRhinoGumballAppearance &src)
CRhinoGumballAppearance &  | operator= (CRhinoGumballAppearance &&)
bool  | Read (LPCTSTR lpszSection, CRhinoProfileContext &pc)
bool  | Read (ON_BinaryArchive &binary_archive)
void  | SetEnableScale (const ON_3dVector &frame_scale_grip_distance)
void  | SetIsUvnGumball (bool bUvn)
void  | SetToDefaultAppearance ()
bool  | Write (LPCTSTR lpszSection, CRhinoProfileContext &pc) const
bool  | Write (ON_BinaryArchive &binary_archive) const
 Public Attributes
bool  | m_bEnableMenu
bool  | m_bEnableRelocate
bool  | m_bEnableXExtrude
bool  | m_bEnableXRotate
bool  | m_bEnableXScale
bool  | m_bEnableXTranslate
bool  | m_bEnableXYTranslate
bool  | m_bEnableYExtrude
bool  | m_bEnableYRotate
bool  | m_bEnableYScale
bool  | m_bEnableYTranslate
bool  | m_bEnableYZTranslate
bool  | m_bEnableZExtrude
bool  | m_bEnableZRotate
bool  | m_bEnableZScale
bool  | m_bEnableZTranslate
bool  | m_bEnableZXTranslate
CRhinoGumballColors  | m_colors
signed char  | m_iCutAxis
signed char  | m_iExtendAxis
-1 = unset, 0 = x, 1 = y, 2 = z, corresponding to the axis face extension is supported along More...
int  | m_nEnableFreeTranslate
CRhinoGumballSizes  | m_sizes
 Static Public Attributes
static bool  | default_bSnappy
Detailed Description
CRhinoGumballAppearance class - gumball appearance settings
Constructor & Destructor Documentation
◆ CRhinoGumballAppearance() [1/3]
 CRhinoGumballAppearance::CRhinoGumballAppearance  |  ( |   | )
◆ ~CRhinoGumballAppearance()
 CRhinoGumballAppearance::~CRhinoGumballAppearance  |  ( |   | )
◆ CRhinoGumballAppearance() [2/3]
 CRhinoGumballAppearance::CRhinoGumballAppearance  |  ( |  const CRhinoGumballAppearance &  |  src | )
◆ CRhinoGumballAppearance() [3/3]
 CRhinoGumballAppearance::CRhinoGumballAppearance  |  ( |  CRhinoGumballAppearance &&  |   | )
Member Function Documentation
◆ IsUvnGumball()
 bool CRhinoGumballAppearance::IsUvnGumball  |  ( |   | ) |   const
◆ operator=() [1/2]
 const CRhinoGumballAppearance& CRhinoGumballAppearance::operator=  |  ( |  const CRhinoGumballAppearance &  |  src | )
◆ operator=() [2/2]
 CRhinoGumballAppearance& CRhinoGumballAppearance::operator=  |  ( |  CRhinoGumballAppearance &&  |   | )
◆ Read() [1/2]
 bool CRhinoGumballAppearance::Read  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
)
Description: Reads the CRhinoGumballAppearance settings from a CRhinoProfileContext. Any settings that are not in the profile context are set to the default values. Parameters: lpszSection - [in] pc - [in]; Returns: True if the read was successful.
◆ Read() [2/2]
 bool CRhinoGumballAppearance::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
Description: Reads the CRhinoGumballAppearance from an ON_BinaryArchive. Parameters: binary_archive - [in] The CRhinoGumballAppearance information is read from the archive. Reading begins at the current location in the archive. Returns: True if the read was successful.
◆ SetEnableScale()
 void CRhinoGumballAppearance::SetEnableScale  |  ( |  const ON_3dVector &  |  frame_scale_grip_distance | )
◆ SetIsUvnGumball()
 void CRhinoGumballAppearance::SetIsUvnGumball  |  ( |  bool  |  bUvn | )
◆ SetToDefaultAppearance()
 void CRhinoGumballAppearance::SetToDefaultAppearance  |  ( |   | )
Description: Set all CRhinoGumballAppearance fields to their default values. Everything is enabled, colors are set calling m_colors.SetToDefaultColors() and sizes are set by calling m_sizes.SetToDefaultSizes();
◆ Write() [1/2]
 bool CRhinoGumballAppearance::Write  |  ( |  LPCTSTR  |  lpszSection,
|  CRhinoProfileContext &  |  pc
) |   |  const
Description: Saves the CRhinoGumballAppearance settings to a CRhinoProfileContext. Parameters: lpszSection - [in] pc - [in]; Returns: True if the write was successful.
◆ Write() [2/2]
 bool CRhinoGumballAppearance::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
Description: Saves the CRhinoGumballAppearance in an ON_BinaryArchive. This Write function includes a versioned chunk wrapper. Parameters: binary_archive - [in/out] The CRhinoGumballAppearance information is appended to this archive. Returns: True if the write was successful.
Member Data Documentation
◆ default_bSnappy
 bool CRhinoGumballAppearance::default_bSnappy
static
This static value is used by the CRhinoGumballAppearance constructor to set the m_bSnappy value. It is set by CRhinoApp.AppSettings().SetSnappyGumball().
◆ m_bEnableMenu
 bool CRhinoGumballAppearance::m_bEnableMenu
When m_bEnableMenu is true, the menu "button" is drawn on the gumball. The default setting is true.
◆ m_bEnableRelocate
 bool CRhinoGumballAppearance::m_bEnableRelocate
When m_bEnableRelocation is true, the user can reposition the gumball by tapping the control key while dragging. Once the repostion drag is terminated by releasing the mouse button, ordinary editing resumes. The default setting is true.
◆ m_bEnableXExtrude
 bool CRhinoGumballAppearance::m_bEnableXExtrude
When m_bEnableX/Y/ZExtrude is true, the X/Y/Z axis extrude control is available. The default setting is false.
◆ m_bEnableXRotate
 bool CRhinoGumballAppearance::m_bEnableXRotate
When m_bEnableX/Y/ZRotate is true, the X/Y/Z rotation control is available. The default setting is true.
◆ m_bEnableXScale
 bool CRhinoGumballAppearance::m_bEnableXScale
When m_bEnableX/Y/ZScale is true, the X/Y/Z scale control is available. The default setting is true.
◆ m_bEnableXTranslate
 bool CRhinoGumballAppearance::m_bEnableXTranslate
When m_bEnableX/Y/ZTranslate is true, the X/Y/Z axis translation control is available. The default setting is true.
◆ m_bEnableXYTranslate
 bool CRhinoGumballAppearance::m_bEnableXYTranslate
When m_bEnableXY/YZ/ZXTranslate is true, the XY/YZ/ZX plane translation control is available in appropriate views. The default setting is true.
◆ m_bEnableYExtrude
 bool CRhinoGumballAppearance::m_bEnableYExtrude
◆ m_bEnableYRotate
 bool CRhinoGumballAppearance::m_bEnableYRotate
◆ m_bEnableYScale
 bool CRhinoGumballAppearance::m_bEnableYScale
◆ m_bEnableYTranslate
 bool CRhinoGumballAppearance::m_bEnableYTranslate
◆ m_bEnableYZTranslate
 bool CRhinoGumballAppearance::m_bEnableYZTranslate
◆ m_bEnableZExtrude
 bool CRhinoGumballAppearance::m_bEnableZExtrude
◆ m_bEnableZRotate
 bool CRhinoGumballAppearance::m_bEnableZRotate
◆ m_bEnableZScale
 bool CRhinoGumballAppearance::m_bEnableZScale
◆ m_bEnableZTranslate
 bool CRhinoGumballAppearance::m_bEnableZTranslate
◆ m_bEnableZXTranslate
 bool CRhinoGumballAppearance::m_bEnableZXTranslate
◆ m_colors
 CRhinoGumballColors CRhinoGumballAppearance::m_colors
At the moment, all gumballs use the same app setting CRhinoGumball::default_bSnappy. CRhinoGumballAppearance::default_bSnappy; bool m_bSnappy; ///< true = snappy, false = smooth setting
◆ m_iCutAxis
 signed char CRhinoGumballAppearance::m_iCutAxis
Used for quickly making a cut out of a brep with a selected curve 0 unsupported on selection m_iCutAxis & 1 supported on X m_iCutAxis & 2 supported on Y m_iCutAxis & 4 supported on Z
◆ m_iExtendAxis
 signed char CRhinoGumballAppearance::m_iExtendAxis
-1 = unset, 0 = x, 1 = y, 2 = z, corresponding to the axis face extension is supported along
◆ m_nEnableFreeTranslate
 int CRhinoGumballAppearance::m_nEnableFreeTranslate
When m_nEnableFreeTranslate is 1, the center translation control can be dragged in any direction and moves the object the gumball controls. When m_nEnableFreeTranslate is 2, the center translation control can be dragged in any direction and moves the object the gumball itself. The default value is 2.
◆ m_sizes
 CRhinoGumballSizes CRhinoGumballAppearance::m_sizes