Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoWidgetColorSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoWidgetColorSettings ()
Initializes to factory defaults. More...
void  | Defaults (void)
Sets the members from the factory defaults. More...
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoWidgetColorSettings &) const
bool  | operator== (const CRhinoWidgetColorSettings &) const
LPCTSTR  | ProfileKey (void) const
void  | SaveProfile (CRhinoProfileContext &context) const
void  | SetFromCurrent (void)
Sets the members from the current color cache. More...
void  | SetToCurrent (void) const
Copies the members to the current color cache. More...
 Public Attributes
ON_Color  | m_u_color
ON_Color  | m_v_color
ON_Color  | m_w_color
 Static Public Attributes
static ON_Color  | current_u_color
static ON_Color  | current_v_color
static ON_Color  | current_w_color
static CRhinoWidgetColorSettings  | Default
Factory defaults. More...
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoWidgetColorSettings()
 CRhinoWidgetColorSettings::CRhinoWidgetColorSettings  |  ( |   | )
Initializes to factory defaults.
Member Function Documentation
◆ Defaults()
 void CRhinoWidgetColorSettings::Defaults  |  ( |  void  |   | )
Sets the members from the factory defaults.
◆ LoadProfile()
 void CRhinoWidgetColorSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoWidgetColorSettings::operator!=  |  ( |  const CRhinoWidgetColorSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoWidgetColorSettings::operator==  |  ( |  const CRhinoWidgetColorSettings &  |   | ) |   const
◆ ProfileKey()
 LPCTSTR CRhinoWidgetColorSettings::ProfileKey  |  ( |  void  |   | ) |   const
◆ SaveProfile()
 void CRhinoWidgetColorSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |  context | ) |   const
◆ SetFromCurrent()
 void CRhinoWidgetColorSettings::SetFromCurrent  |  ( |  void  |   | )
Sets the members from the current color cache.
◆ SetToCurrent()
 void CRhinoWidgetColorSettings::SetToCurrent  |  ( |  void  |   | ) |   const
Copies the members to the current color cache.
Member Data Documentation
◆ current_u_color
 ON_Color CRhinoWidgetColorSettings::current_u_color
static
These static members are a cache to optimize the retrieval of the current system widget colors. This optimization is needed because these values are used during view-port drawing. These are the colors set in the color options dialog.
◆ current_v_color
 ON_Color CRhinoWidgetColorSettings::current_v_color
static
◆ current_w_color
 ON_Color CRhinoWidgetColorSettings::current_w_color
static
◆ Default
 CRhinoWidgetColorSettings CRhinoWidgetColorSettings::Default
static
Factory defaults.
◆ m_u_color
 ON_Color CRhinoWidgetColorSettings::m_u_color
◆ m_v_color
 ON_Color CRhinoWidgetColorSettings::m_v_color
◆ m_w_color
 ON_Color CRhinoWidgetColorSettings::m_w_color