Public Attributes | List of all members
CRhinoDisplayModeSettingsChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
ON_UUID  | m_changed_display_mode_id
The id of the display mode whose settings have just changed. More...
Member Data Documentation
◆ m_changed_display_mode_id
 ON_UUID CRhinoDisplayModeSettingsChanged::CParameters::m_changed_display_mode_id
The id of the display mode whose settings have just changed.