Public Member Functions | Protected Member Functions | List of all members
CRhRdkContentFileWatcher Class Reference
RDK
#include <RhRdkContent.h>
 Public Member Functions
CRhRdkContentFileWatcher (CRhRdkContent &content, const CRhRdkContentField &fieldToWatch)
virtual  | ~CRhRdkContentFileWatcher ()
ON_wString  | FieldInternalName (void) const
virtual void  | OnDocumentRegister (void) const
virtual void  | OnDocumentUnregister (void) const
virtual void  | OnFieldChanged (const CRhRdkContentField &field, const CRhRdkVariant &vOldValue, RhRdkChangeContext cc, void *pReserved)
 Protected Member Functions
void  | OnFileChanged (const wchar_t *wszFullPath) const
Constructor & Destructor Documentation
◆ CRhRdkContentFileWatcher()
 CRhRdkContentFileWatcher::CRhRdkContentFileWatcher  |  ( |  CRhRdkContent &  |  content,
|  const CRhRdkContentField &  |  fieldToWatch
)
◆ ~CRhRdkContentFileWatcher()
 virtual CRhRdkContentFileWatcher::~CRhRdkContentFileWatcher  |  ( |   | )
virtual
Member Function Documentation
◆ FieldInternalName()
 ON_wString CRhRdkContentFileWatcher::FieldInternalName  |  ( |  void  |   | ) |   const
◆ OnDocumentRegister()
 virtual void CRhRdkContentFileWatcher::OnDocumentRegister  |  ( |  void  |   | ) |   const
virtual
◆ OnDocumentUnregister()
 virtual void CRhRdkContentFileWatcher::OnDocumentUnregister  |  ( |  void  |   | ) |   const
virtual
◆ OnFieldChanged()
 virtual void CRhRdkContentFileWatcher::OnFieldChanged  |  ( |  const CRhRdkContentField &  |  field,
|  const CRhRdkVariant &  |  vOldValue,
|  RhRdkChangeContext  |  cc,
|  void *  |  pReserved
)
virtual
◆ OnFileChanged()
 void CRhRdkContentFileWatcher::OnFileChanged  |  ( |  const wchar_t *  |  wszFullPath | ) |   const
protected