Public Member Functions | Public Attributes | Friends | List of all members
CRhRdkBasicMaterial::CTextureSlot Class Referencefinal
#include <RhRdkBasicMaterial.h>
 Inheritance diagram for CRhRdkBasicMaterial::CTextureSlot:
 Public Member Functions
CTextureSlot (const CTextureSlot &slot)
double  | Amount (void) const
ON_wString  | ChildSlotName (void) const
bool  | FilterOn (void) const
ON_wString  | InternalName (void) const
bool  | On (void) const
bool  | operator!= (const CTextureSlot &slot)
const CTextureSlot &  | operator= (const CTextureSlot &slot)
bool  | operator== (const CTextureSlot &slot)
void  | ReadParametersFromSection (const IRhRdk_XMLSection &section, CRhRdkContent::ReadParamsContext context)
void  | SetAmount (double d)
void  | SetField (CRhRdkTexturedContentField *p)
void  | SetFilterOn (bool b)
void  | SetOn (bool b)
void  | SetSimulation (IRhRdk_XMLSection &section) const
void  | WriteParametersToSection (IRhRdk_XMLSection &section, CRhRdkContent::WriteParamsContext context) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Attributes
RDK_DEPRECATED bool  | m_bFilterOn
RDK_DEPRECATED bool  | m_bOn
RDK_DEPRECATED double  | m_dAmount
RDK_DEPRECATED ON_wString  | m_sName
 Friends
class  | CRhRdkBasicMaterial::CImpl
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CTextureSlot()
 CRhRdkBasicMaterial::CTextureSlot::CTextureSlot  |  ( |  const CTextureSlot &  |  slot | )
Member Function Documentation
◆ Amount()
 double CRhRdkBasicMaterial::CTextureSlot::Amount  |  ( |  void  |   | ) |   const
◆ ChildSlotName()
 ON_wString CRhRdkBasicMaterial::CTextureSlot::ChildSlotName  |  ( |  void  |   | ) |   const
◆ FilterOn()
 bool CRhRdkBasicMaterial::CTextureSlot::FilterOn  |  ( |  void  |   | ) |   const
◆ InternalName()
 ON_wString CRhRdkBasicMaterial::CTextureSlot::InternalName  |  ( |  void  |   | ) |   const
◆ On()
 bool CRhRdkBasicMaterial::CTextureSlot::On  |  ( |  void  |   | ) |   const
◆ operator!=()
 bool CRhRdkBasicMaterial::CTextureSlot::operator!=  |  ( |  const CTextureSlot &  |  slot | )
◆ operator=()
 const CTextureSlot& CRhRdkBasicMaterial::CTextureSlot::operator=  |  ( |  const CTextureSlot &  |  slot | )
◆ operator==()
 bool CRhRdkBasicMaterial::CTextureSlot::operator==  |  ( |  const CTextureSlot &  |  slot | )
◆ ReadParametersFromSection()
 void CRhRdkBasicMaterial::CTextureSlot::ReadParametersFromSection  |  ( |  const IRhRdk_XMLSection &  |  section,
|  CRhRdkContent::ReadParamsContext  |  context
)
◆ SetAmount()
 void CRhRdkBasicMaterial::CTextureSlot::SetAmount  |  ( |  double  |  d | )
◆ SetField()
 void CRhRdkBasicMaterial::CTextureSlot::SetField  |  ( |  CRhRdkTexturedContentField *  |  p | )
◆ SetFilterOn()
 void CRhRdkBasicMaterial::CTextureSlot::SetFilterOn  |  ( |  bool  |  b | )
◆ SetOn()
 void CRhRdkBasicMaterial::CTextureSlot::SetOn  |  ( |  bool  |  b | )
◆ SetSimulation()
 void CRhRdkBasicMaterial::CTextureSlot::SetSimulation  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
◆ WriteParametersToSection()
 void CRhRdkBasicMaterial::CTextureSlot::WriteParametersToSection  |  ( |  IRhRdk_XMLSection &  |  section,
|  CRhRdkContent::WriteParamsContext  |  context
) |   |  const
Friends And Related Function Documentation
◆ CRhRdkBasicMaterial::CImpl
 friend class CRhRdkBasicMaterial::CImpl
friend
Member Data Documentation
◆ m_bFilterOn
 RDK_DEPRECATED bool CRhRdkBasicMaterial::CTextureSlot::m_bFilterOn
◆ m_bOn
 RDK_DEPRECATED bool CRhRdkBasicMaterial::CTextureSlot::m_bOn
◆ m_dAmount
 RDK_DEPRECATED double CRhRdkBasicMaterial::CTextureSlot::m_dAmount
◆ m_sName
 RDK_DEPRECATED ON_wString CRhRdkBasicMaterial::CTextureSlot::m_sName