Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiColorListBox Class Reference
RhinoUI
CRhinoUiColorListBox. More...
#include <RhinoSdkUiColorListBox.h>
 Inheritance diagram for CRhinoUiColorListBox:
 Public Member Functions
CRhinoUiColorListBox ()
virtual  | ~CRhinoUiColorListBox ()
bool  | AddColorItem (const char *lpsColorName, COLORREF color)
bool  | AddColorItem (const wchar_t *lpsColorName, COLORREF color)
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
CRhinoUiColorComboBoxItem *  | ItemFromIndex (int nIndex)
void  | SetColorPalette (HPALETTE pal)
 Protected Member Functions
bool  | _AddColorItem (LPCTSTR lpsColorName, COLORREF color)
 Protected Attributes
HPALETTE  | m_hPalette
CObArray  | m_items
Detailed Description
CRhinoUiColorListBox.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiColorListBox()
 CRhinoUiColorListBox::CRhinoUiColorListBox  |  ( |   | )
◆ ~CRhinoUiColorListBox()
 virtual CRhinoUiColorListBox::~CRhinoUiColorListBox  |  ( |   | )
virtual
Member Function Documentation
◆ _AddColorItem()
 bool CRhinoUiColorListBox::_AddColorItem  |  ( |  LPCTSTR  |  lpsColorName,
|  COLORREF  |  color
)
protected
◆ AddColorItem() [1/2]
 bool CRhinoUiColorListBox::AddColorItem  |  ( |  const char *  |  lpsColorName,
|  COLORREF  |  color
)
◆ AddColorItem() [2/2]
 bool CRhinoUiColorListBox::AddColorItem  |  ( |  const wchar_t *  |  lpsColorName,
|  COLORREF  |  color
)
◆ CompareItem()
 virtual int CRhinoUiColorListBox::CompareItem  |  ( |  LPCOMPAREITEMSTRUCT  |   | )
virtual
◆ DrawItem()
 virtual void CRhinoUiColorListBox::DrawItem  |  ( |  LPDRAWITEMSTRUCT  |   | )
virtual
◆ ItemFromIndex()
 CRhinoUiColorComboBoxItem* CRhinoUiColorListBox::ItemFromIndex  |  ( |  int  |  nIndex | )
◆ SetColorPalette()
 void CRhinoUiColorListBox::SetColorPalette  |  ( |  HPALETTE  |  pal | )
Member Data Documentation
◆ m_hPalette
 HPALETTE CRhinoUiColorListBox::m_hPalette
protected
◆ m_items
 CObArray CRhinoUiColorListBox::m_items
protected