Public Types | Public Member Functions | Protected Attributes | List of all members
ON_ErrorLog Class Reference
OpenNURBS
#include <opennurbs_error.h>
 Public Types
enum  | : unsigned int { MaximumEventCount = 32 }
 Public Member Functions
ON_ErrorLog ()=default
ON_ErrorLog (const ON_ErrorLog &)=default
virtual  | ~ON_ErrorLog ()
virtual unsigned int  | Append (const ON_ErrorEvent &error_event)
void  | Clear ()
unsigned int  | Count () const
void  | DisableLogging ()
void  | Dump (class ON_TextLog &text_log) const
bool  | EnableLogging ()
const ON_ErrorEvent &  | Event (unsigned int i) const
ON_ErrorLog &  | operator= (const ON_ErrorLog &)=default
 Protected Attributes
unsigned int  | m_event_count = 0
ON_ErrorEvent  | m_events [ON_ErrorLog::MaximumEventCount]
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
MaximumEventCount
Constructor & Destructor Documentation
◆ ON_ErrorLog() [1/2]
 ON_ErrorLog::ON_ErrorLog  |  ( |   | )
default
◆ ~ON_ErrorLog()
 virtual ON_ErrorLog::~ON_ErrorLog  |  ( |   | )
virtual
◆ ON_ErrorLog() [2/2]
 ON_ErrorLog::ON_ErrorLog  |  ( |  const ON_ErrorLog &  |   | )
default
Member Function Documentation
◆ Append()
 virtual unsigned int ON_ErrorLog::Append  |  ( |  const ON_ErrorEvent &  |  error_event | )
virtual
Parameters: error_event - [in] event to add Returns: 0: Event not added because maximum capacity reached. >0: Number of events after adding error_event.
◆ Clear()
 void ON_ErrorLog::Clear  |  ( |   | )
◆ Count()
 unsigned int ON_ErrorLog::Count  |  ( |   | ) |   const
Returns: Total number of error events.
◆ DisableLogging()
 void ON_ErrorLog::DisableLogging  |  ( |   | )
Description: Stop logging errors to this error log.
◆ Dump()
 void ON_ErrorLog::Dump  |  ( |  class ON_TextLog &  |  text_log | ) |   const
◆ EnableLogging()
 bool ON_ErrorLog::EnableLogging  |  ( |   | )
Returns: True if up to ON_ErrorLog::MaximumErrorCount error events will be saved in this to this error log. False if another error log is active.
◆ Event()
 const ON_ErrorEvent& ON_ErrorLog::Event  |  ( |  unsigned int  |  i | ) |   const
Parameters: i - [in] zero based event index. Returns Event at specified index or ON_ErrorEvent::Unset if the index is out of range.
◆ operator=()
 ON_ErrorLog& ON_ErrorLog::operator=  |  ( |  const ON_ErrorLog &  |   | )
default
Member Data Documentation
◆ m_event_count
 unsigned int ON_ErrorLog::m_event_count = 0
protected
◆ m_events
 ON_ErrorEvent ON_ErrorLog::m_events[ON_ErrorLog::MaximumEventCount]
protected