Public Member Functions | Friends | List of all members
CRhinoUiOptionsListCtrlRadioButtonColumnBtn Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Public Member Functions
CRhinoUiOptionsListCtrlRadioButtonColumnBtn (class CRhinoUiOptionsListCtrlRadioButtonColumn *=NULL, LPCTSTR=NULL)
CRhinoUiOptionsListCtrlRadioButtonColumnBtn (const CRhinoUiOptionsListCtrlRadioButtonColumnBtn &)
virtual  | ~CRhinoUiOptionsListCtrlRadioButtonColumnBtn ()
CRhinoUiOptionsListCtrlRadioButtonColumn *  | ButtonColumn () const
int  | ButtonIndex () const
bool  | ButtonIsPressed () const
LPCTSTR  | ButtonLabel () const
CRect  | ButtonRect () const
const CRhinoUiOptionsListCtrlRadioButtonColumnBtn &  | operator= (const CRhinoUiOptionsListCtrlRadioButtonColumnBtn &)
 Friends
class  | CRhinoUiOptionsListCtrlRadioButtonColumn
Detailed Description
CRhinoUiOptionsListCtrlRadioButtonColumn
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlRadioButtonColumnBtn() [1/2]
 CRhinoUiOptionsListCtrlRadioButtonColumnBtn::CRhinoUiOptionsListCtrlRadioButtonColumnBtn  |  ( |  class CRhinoUiOptionsListCtrlRadioButtonColumn *  |   = NULL,
|  LPCTSTR  |   = NULL
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
◆ CRhinoUiOptionsListCtrlRadioButtonColumnBtn() [2/2]
 CRhinoUiOptionsListCtrlRadioButtonColumnBtn::CRhinoUiOptionsListCtrlRadioButtonColumnBtn  |  ( |  const CRhinoUiOptionsListCtrlRadioButtonColumnBtn &  |   | )
◆ ~CRhinoUiOptionsListCtrlRadioButtonColumnBtn()
 virtual CRhinoUiOptionsListCtrlRadioButtonColumnBtn::~CRhinoUiOptionsListCtrlRadioButtonColumnBtn  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ ButtonColumn()
 CRhinoUiOptionsListCtrlRadioButtonColumn* CRhinoUiOptionsListCtrlRadioButtonColumnBtn::ButtonColumn  |  ( |   | ) |   const
Description: This method is used to get the CRhinoUiOptionsListCtrlRadioButtonColumn this button belongs to.
Returns: Returns the CRhinoUiOptionsListCtrlRadioButtonColumn this button belongs to or NULL if the button has not yet been added to a column
See Also: class CRhinoUiOptionsListCtrlRadioButtonColumn CRhinoUiOptionsListCtrlRadioButtonColumn::AddRadioButton()
◆ ButtonIndex()
 int CRhinoUiOptionsListCtrlRadioButtonColumnBtn::ButtonIndex  |  ( |   | ) |   const
Description: Return CRhinoUiOptionsListCtrlRadioButtonColumn zero based index for this button item.
Returns: Return CRhinoUiOptionsListCtrlRadioButtonColumn zero based index for this button item.
See Also: class CRhinoUiOptionsListCtrlRadioButtonColumn CRhinoUiOptionsListCtrlRadioButtonColumn::GetButton()
◆ ButtonIsPressed()
 bool CRhinoUiOptionsListCtrlRadioButtonColumnBtn::ButtonIsPressed  |  ( |   | ) |   const
Description: Check button state to see if it is currently pressed.
Returns: Returns true if mouse is currently down over this item. Used when drawing item during selection process.
◆ ButtonLabel()
 LPCTSTR CRhinoUiOptionsListCtrlRadioButtonColumnBtn::ButtonLabel  |  ( |   | ) |   const
Description: Radio button label which will appear in the value column.
Returns: Returns the text to display to the right of this button.
◆ ButtonRect()
 CRect CRhinoUiOptionsListCtrlRadioButtonColumnBtn::ButtonRect  |  ( |   | ) |   const
Description: Display rectangle for this button item. Used when creating or drawing button.
Returns: Returns display rectangle for this button item.
See Also: class CRhinoUiOptionsListCtrlRadioButtonColumn CRhinoUiOptionsListCtrlRadioButtonColumn::AddRadioButton()
◆ operator=()
 const CRhinoUiOptionsListCtrlRadioButtonColumnBtn& CRhinoUiOptionsListCtrlRadioButtonColumnBtn::operator=  |  ( |  const CRhinoUiOptionsListCtrlRadioButtonColumnBtn &  |   | )
Description: operator= Called by ON_ClassArray when growing array
Friends And Related Function Documentation
◆ CRhinoUiOptionsListCtrlRadioButtonColumn
 friend class CRhinoUiOptionsListCtrlRadioButtonColumn
friend