Public Member Functions | List of all members
CRhinoVarSrfConstraintPoint Class Reference
Rhino
#include <rhinoSdkUtilities.h>
 Public Member Functions
CRhinoVarSrfConstraintPoint (const ON_3dPoint &point)
const ON_3dPoint &  | Point () const
Constructor & Destructor Documentation
◆ CRhinoVarSrfConstraintPoint()
 CRhinoVarSrfConstraintPoint::CRhinoVarSrfConstraintPoint  |  ( |  const ON_3dPoint &  |  point | )
Member Function Documentation
◆ Point()
 const ON_3dPoint& CRhinoVarSrfConstraintPoint::Point  |  ( |   | ) |   const
inline