Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
ON_Curve Class Referenceabstract
OpenNURBS
#include <opennurbs_curve.h>
 Inheritance diagram for ON_Curve:
 Public Member Functions
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
bool  | AreaMassProperties (ON_3dPoint base_point, ON_3dVector plane_normal, ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
virtual bool  | ChangeClosedCurveSeam (double t)
bool  | ChangeClosedCurveSeam (double t, double min_dist)
virtual bool  | ChangeDimension (int desired_dimension)
virtual class ON_CurveTree *  | CreateCurveTree () const
ON_3dVector  | CurvatureAt (double t) const
const class ON_CurveTree *  | CurveTree () const
virtual int  | Degree () const =0
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
virtual ON_Interval  | Domain () const =0
virtual ON_Curve *  | DuplicateCurve () const
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
virtual bool  | Evaluate (double t, int der_count, int v_stride, double *v, int side=0, int *hint=0) const =0
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvSignedCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, double &kappa, const ON_3dVector *normal=nullptr, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
virtual bool  | Extend (const ON_Interval &domain)
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
virtual bool  | GetClosestPoint (const ON_3dPoint &test_point, double *t, double maximum_distance=0.0, const ON_Interval *sub_domain=nullptr) const
virtual bool  | GetCurveParameterFromNurbFormParameter (double nurbs_t, double *curve_t) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetLength (double *length, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const
virtual bool  | GetLocalClosestPoint (const ON_3dPoint &test_point, double seed_parameter, double *t, const ON_Interval *sub_domain=0) const
virtual bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual bool  | GetNormalizedArcLengthPoint (double s, double *t, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const
virtual bool  | GetNormalizedArcLengthPoints (int count, const double *s, double *t, double absolute_tolerance=0.0, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const
virtual int  | GetNurbForm (ON_NurbsCurve &nurbs_curve, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
virtual bool  | GetNurbFormParameterFromCurveParameter (double curve_t, double *nurbs_t) const
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVector (double *span_parameters) const =0
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override
 More...
virtual int  | HasNurbForm () const
int  | IntersectCurve (const ON_Curve *curveB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *curveB_domain=0) const
int  | IntersectPlane (ON_PlaneEquation plane_equation, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curve_domain=0) const
virtual int  | IntersectSelf (ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, const ON_Interval *curve_domain=0) const
int  | IntersectSurface (const ON_Surface *surfaceB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *surfaceB_udomain=0, const ON_Interval *surfaceB_vdomain=0) const
virtual bool  | IsArc (const ON_Plane *plane=nullptr, ON_Arc *arc=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsClosed () const
virtual bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual bool  | IsInPlane (const ON_Plane &test_plane, double tolerance=ON_ZERO_TOLERANCE) const =0
virtual bool  | IsLinear (double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsLong (double min_length, const ON_Interval *sub_domain=0) const
virtual bool  | IsPeriodic () const
virtual bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
virtual int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const
virtual bool  | IsShort (double tolerance, const ON_Interval *sub_domain=0, double *length_estimate=0) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | LengthMassProperties (class ON_MassProperties &mp, bool bLength=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
class ON_PolylineCurve *  | MeshCurve (ON_MeshCurveParameters &mp, ON_PolylineCurve *polyline, bool bSkipFirstPoint, const ON_Interval *domain) const
double  | NextCurveKink (ON_Interval search_domain, const class ON_CurveKinkDefinition &kink_definition) const
Find the next curve kink in the search domain. More...
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
class ON_NurbsCurve *  | NurbsCurveFit (ON_Interval domain, const class ON_NurbsCurveFitParameters &fit_parameters, class ON_NurbsCurve *destination_nurbs_cuve, class ON_Line &maximum_separation, double &this_separation_parameter, double &nurbs_separation_parameter) const
Get a uniform NURBS curve fit to this curve.. This function is useful when you want to fit this curve a single time. If you are in a situation where you are repeatedly adjusting fit_parameters, it is much more efficient to use the ON_NurbsCurveFitBuilder class because the steps involved in sampling points and other information from this input curve are expensive and can be reused as fit_parameters.Degree(), fit_parameters.PointCount(), and other fitting parmeters are changed. More...
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
class ON_NurbsCurve *  | RebuildToMatchTemplateCurve (const ON_Curve &template_curve, bool bFlipSourceDirection, bool bPreserveEndTangents, bool bMakeSubDFriendly, class ON_NurbsCurve *destination_nurbs_curve, class ON_Line *maximum_deviation) const
Rebuild this curve (the "source" curve) so it takes on the degree, knot vector, and control point count of a template curve. When rebuilding many curves against the same template, use the ON_TemplatedCurveRebuilder class so the template is analyzed only once. More...
virtual bool  | RemoveShortSegments (double tolerance, bool bRemoveShortSegments=true)
virtual bool  | Reverse ()=0
virtual bool  | SetDomain (double t0, double t1)
bool  | SetDomain (ON_Interval domain)
virtual bool  | SetEndPoint (ON_3dPoint end_point)
virtual bool  | SetStartPoint (ON_3dPoint start_point)
double  | SignedCurvatureAt (double t, const ON_3dVector *plane_normal=nullptr) const
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
virtual int  | SpanCount () const =0
const ON_SimpleArray< double >  | SpanVector () const
The curve's span vector is a stricltly monotone increasing list of doubles that are the intervals on which the curve is C-infinity. More...
virtual bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const
ON_3dVector  | TangentAt (double t) const
ON_3dVector  | TangentAt (double t, int side) const
Evaluate the unit tangent vector with the option to specify the direction of the limit. This is useful when evaluating tangent vectors at a tangent discontinuity. More...
bool  | Transform (const ON_Xform &xform) override
virtual bool  | Trim (const ON_Interval &domain)
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual int  | Dimension () const
virtual bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | IsDeformable () const
virtual bool  | IsMorphable () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | MakeDeformable ()
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static class ON_NurbsCurve *  | CreateCubicLoft (int point_count, int point_dim, int point_stride, const double *point_list, double k, int is_closed=0, ON::cubic_loft_end_condition start_shape=ON::cubic_loft_ec_quadratic, ON::cubic_loft_end_condition end_shape=ON::cubic_loft_ec_quadratic, class ON_NurbsCurve *nurbs_curve=0)
static bool  | GetCurveSeparation (const ON_Curve &curveA, ON_Interval domainA, const ON_Curve &curveB, ON_Interval domainB, ON_Line &minimum_separation, double *min_parameter_A, double *min_parameter_B, ON_Line &maximum_separation, double *max_parameter_A, double *max_parameter_B)
Find the locations of the minimimum and maximum separation between two curves. When the separation points are distinct, the line connecting the separation points is perpindicular to the curves. This calculates the distances and locations shown in the Rhino CrvDeviation command. More...
 Protected Member Functions
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
Detailed Description
Description: ON_Curve is a pure virtual class for curve objects
Any class derived from ON_Curve should have a ON_OBJECT_DECLARE(ON_...); at the beginning of its class definition and a ON_OBJECT_IMPLEMENT( ON_..., ON_Curve ); in a .cpp file. Example:
See the definition of ON_NurbsCurve for an example.
Constructor & Destructor Documentation
◆ ON_Curve() [1/2]
 ON_Curve::ON_Curve  |  ( |   | )
◆ ~ON_Curve()
 virtual ON_Curve::~ON_Curve  |  ( |   | )
virtual
◆ ON_Curve() [2/2]
 ON_Curve::ON_Curve  |  ( |  const ON_Curve &  |   | )
Member Function Documentation
◆ AreaMassProperties()
 bool ON_Curve::AreaMassProperties  |  ( |  ON_3dPoint  |  base_point,
|  ON_3dVector  |  plane_normal,
|  ON_MassProperties &  |  mp,
|  bool  |  bArea = true,
|  bool  |  bFirstMoments = true,
|  bool  |  bSecondMoments = true,
|  bool  |  bProductMoments = true,
|  double  |  rel_tol = 1.0e-6,
|  double  |  abs_tol = 1.0e-6
) |   |  const
Description: Calculate area mass properties of a curve. The curve should be planar. Parameters: base_point - [in] A point on the plane that contains the curve. To get the best results, the point should be in the near the curve's centroid.
When computing the area, area centroid, or area first moments of a planar area whose boundary is defined by several curves, pass the same base_point and plane_normal to each call to AreaMassProperties. The base_point must be in the plane of the curves.
When computing the area second moments or area product moments of a planar area whose boundary is defined by several curves, you MUST pass the entire area's centroid as the base_point and the input mp parameter must contain the results of a previous call to AreaMassProperties(mp,true,true,false,false,base_point). In particular, in this case, you need to make two sets of calls; use first set to calculate the area centroid and the second set calculate the second moments and product moments. plane_normal - [in] nonzero unit normal to the plane of integration. If a closed curve has counter clock-wise orientation with respect to this normal, the area will be positive. If the a closed curve has clock-wise orientation with respect to this normal, the area will be negative. mp - [out] bArea - [in] true to calculate volume bFirstMoments - [in] true to calculate area first moments, area, and area centroid. bSecondMoments - [in] true to calculate area second moments. bProductMoments - [in] true to calculate area product moments. Notes: Here is an example of using a curve to compute the mass properties of the planar area bounded by the curve.
ON_Curve& crv = ...; ON_Plane plane; double tol = .001; ON_MassProperties mp; if( crv.IsClosed() && crv.IsPlanar( plane, tol)) ///< ensure curve is closed and planar { if( ON_ClosedCurveOrientation( crv, plane)<0) ///< get correct orientation of plane plane.Flip(); ON_BoundingBox bbox = crv.BoundingBox(); ///< choose a reasonable base_point ON_3dPoint base_point = plane.ClosestPointTo(bbox.Center()); } if( crv.AreaMassProperties( base_point, plane.Normal(), mp)) { / mp contains area mass properties of planar region bounded crv. } Returns: True if successful.
◆ ChangeClosedCurveSeam() [1/2]
 virtual bool ON_Curve::ChangeClosedCurveSeam  |  ( |  double  |  t | )
virtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, CRhinoPolyEdge, ON_PolyEdgeCurve, ON_PolyCurve, ON_PolylineCurve, and ON_ArcCurve.
◆ ChangeClosedCurveSeam() [2/2]
 bool ON_Curve::ChangeClosedCurveSeam  |  ( |  double  |  t,
|  double  |  min_dist
)
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. min_dist - [in] Do not change if Crv(t) is within min_dist of the original seam Returns: true if successful, and seam was moved.
◆ ChangeDimension()
 virtual bool ON_Curve::ChangeDimension  |  ( |  int  |  desired_dimension | )
virtual
Description: Change the dimension of a curve. Parameters: desired_dimension - [in] Returns: true if the curve's dimension was already desired_dimension or if the curve's dimension was successfully changed to desired_dimension.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_LineCurve.
◆ CreateCubicLoft()
 static class ON_NurbsCurve* ON_Curve::CreateCubicLoft  |  ( |  int  |  point_count,
|  int  |  point_dim,
|  int  |  point_stride,
|  const double *  |  point_list,
|  double  |  k,
|  int  |  is_closed = 0,
|  ON::cubic_loft_end_condition  |  start_shape = ON::cubic_loft_ec_quadratic,
|  ON::cubic_loft_end_condition  |  end_shape = ON::cubic_loft_ec_quadratic,
|  class ON_NurbsCurve *  |  nurbs_curve = 0
)
static
Description: Create a cubic nurbs surface that interpolates a list of curves.
Parameters: point_count - [in] >= 2 number of points point_dim - [in] >= 1 dimension of points point_stride - [in] >= point_dim The first coordinate of the i-th point is point_list[i*point_stride]. point_list - [in] array of point coordinates
k - in or k = ON_UNSET_VALUE k determines how the curve's m_knot[0] values are calculated. Most frequently, 0.0, 0.5, or 1.0 should be used. 0.0: uniform 0.5: sqrt(chord length) 1.0: chord length In general, when k >= 0.0, then spacing is pow(d,k), where d is the average distance between the curves defining the span. ON_UNSET_VALUE: the interpolation knot vector is explicitly specified. The knots in the interpolated direction are specified. You must understand the mathematics of NURBS surfaces to use this option. To specify an explicit knot vector for the interpolation, the nurbs_curve parameter must be non-null, nurbs_curve->m_order must be 4. The value of nurbs_curve->m_cv_count must be set as describe in the is_closed parameter section. The array nurbs_curve->m_knot[0][] must have length nurbs_curve->m_cv_count[0]+2, and the values in nurbs_curve->m_knot[0][2, ..., nurbs_curve->m_cv_count[0]-1] must be strictly increasing. is_closed - [in] 0: open curve_count must be at least 2. The resulting nurbs_curve will have m_cv_count = point_count+2. 1: closed curve_count must be at least 3. Do not include a duplicate of the start point as the last point in the list. The resulting nurbs_curve will have m_cv_count = point_count+3. 2: periodic curve_count must be at least 3. The resulting nurbs_curve will have m_cv_count = point_count+3.
start_shape - [in] end_shape - [in] The start_shape and end_shape parameters determine the starting and ending shape of the lofted surface.
Simple shapes: The simple end conditions calculate the rows of free control points based on the locations of the input curves and do not require additional input information. ON::cubic_loft_ec_quadratic: quadratic ON::cubic_loft_ec_linear: linear ON::cubic_loft_ec_cubic: cubic ON::cubic_loft_ec_natural: natural (zero 2nd derivative)
Explicit shapes: ON::cubic_loft_ec_unit_tangent: unit tangent is specified ON::cubic_loft_ec_1st_derivative: first derivative is specified ON::cubic_loft_ec_2nd_derivative: second derivative is specified ON::cubic_loft_ec_free_cv: free control vertex is specified
In order to specify explicit end conditions, point_count must be at least 3, is_closed must be 0 or 1, the nurbs_curve parameter must be non-null, the nurbs_curve control points must be allocated, and nurbs_curve->m_cv_count must set as described in the is_closed parameter section. If the start_shape is explicit, then nurbs_curve->CV(1) must be set to the desired value. If the end_shape is explicit, then nurbs_curve->CV(nurbs_curve->m_cv_count-2) must be set to the desired value. A good way to specify explicit shapes is to call CreateCubicLoft() with ON::cubic_loft_ec_quadratic as the condition parameters, modify the returned curves's end condition CVs as desired, and then call CreateCubicLoft() with the explicit end condition option. This way you will be sure to have a properly initialized nurbs_curve.
nurbs_curve - [in] If not null, the result will returned in this ON_NurbsCurve. Typically, this parameter is used when you want to store the result in an ON_NurbsCurve that is on the stack. This parameter is also used when you want to specify the interpolation knots or end conditions.
Returns: If successful, a pointer to the surface is returned. If the input nurbs_surface parameter was null, then this surface is on the heap and will need to be deleted to avoid memory leaks. If the input is not valid, null is returned, even when nurbs_surface is not null.
Example:
/ EXAMPLE: Loft a curve through a list of points ON_SimpleArray< ON_3dPoint > point_list = ....; ON_NurbsCurve* srf = ON_Curve::CreateCubicLoft( point_list.Count(), ///< number of points 3, ///< dimension 3, ///< stride &point_list[0].x, 0.5 ///< sqrt(chord length) spacing );
◆ CreateCurveTree()
 virtual class ON_CurveTree* ON_Curve::CreateCurveTree  |  ( |   | ) |   const
virtual
◆ CurvatureAt()
 ON_3dVector ON_Curve::CurvatureAt  |  ( |  double  |  t | ) |   const
Description: Evaluate the curvature vector at a parameter. Parameters: t - [in] evaluation parameter Returns: curvature vector of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvCurvature
◆ CurveTree()
 const class ON_CurveTree* ON_Curve::CurveTree  |  ( |   | ) |   const
Description: Get the runtime curve tree used to speed closest point and intersection calculations. Returns: Pointer to the curve tree.
◆ Degree()
 virtual int ON_Curve::Degree  |  ( |   | ) |   const
pure virtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Implemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ DerivativeAt()
 ON_3dVector ON_Curve::DerivativeAt  |  ( |  double  |  t | ) |   const
Description: Evaluate first derivative at a parameter. Parameters: t - [in] evaluation parameter Returns: First derivative of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::Ev1Der
◆ DestroyCurveTree()
 void ON_Curve::DestroyCurveTree  |  ( |   | )
Description: Destroys the runtime curve tree used to speed closest point and intersection calculations. Remarks: If the geometry of the curve is modified in any way, then call DestroyCurveTree(); The curve tree is created as needed.
◆ DestroyRuntimeCache()
 void ON_Curve::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Object.
Reimplemented in ON_SubDEdgeChainCurve, CRhinoPolyEdgeSegment, ON_PolyEdgeSegment, ON_CurveProxy, ON_PolyCurve, ON_PolyEdgeCurve, and CRhinoPolyEdge.
◆ Domain()
 virtual ON_Interval ON_Curve::Domain  |  ( |   | ) |   const
pure virtual
Returns: domain of the curve.
Implemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_PolylineCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ DuplicateCurve()
 virtual ON_Curve* ON_Curve::DuplicateCurve  |  ( |   | ) |   const
virtual
Description: Get a duplicate of the curve. Returns: A duplicate of the curve.
 Remarks: The caller must delete the returned curve. For non-ON_CurveProxy objects, this simply duplicates the curve using ON_Object::Duplicate. For ON_CurveProxy objects, this duplicates the actual proxy curve geometry and, if necessary, trims and reverse the result to that the returned curve's parameterization and locus match the proxy curve's.
Reimplemented in CRhinoPolyEdgeSegment, ON_PolyEdgeSegment, ON_CurveProxy, ON_PolyCurve, ON_PolyEdgeCurve, and CRhinoPolyEdge.
◆ Ev1Der()
 bool ON_Curve::Ev1Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate first derivative at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t first_derivative - [out] value of first derivative at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev2Der ON_Curve::EvTangent ON_Curve::Evaluate
◆ Ev2Der()
 bool ON_Curve::Ev2Der  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  first_derivative,
|  ON_3dVector &  |  second_derivative,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate second derivative at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t first_derivative - [out] value of first derivative at t second_derivative - [out] value of second derivative at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::Ev1Der ON_Curve::EvCurvature ON_Curve::Evaluate
◆ Evaluate()
 virtual bool ON_Curve::Evaluate  |  ( |  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
pure virtual
Description: This evaluator actually does all the work. The other ON_Curve evaluation tools call this virtual function. Parameters: t - [in] evaluation parameter ( usually in Domain() ). der_count - [in] (>=0) number of derivatives to evaluate v_stride - [in] (>=Dimension()) stride to use for the v[] array v - [out] array of length (der_count+1)*v_stride curve(t) is returned in (v[0],...,v[m_dim-1]), curve'(t) is returned in (v[v_stride],...,v[v_stride+m_dim-1]), curve"(t) is returned in (v[2*v_stride],...,v[2*v_stride+m_dim-1]), etc. side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::EvPoint ON_Curve::Ev1Der ON_Curve::Ev2Der
Implemented in ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, ON_CurveOnSurface, and ON_SubDEdgeChainCurve.
◆ EvaluatePoint()
 bool ON_Curve::EvaluatePoint  |  ( |  const class ON_ObjRef &  |  objref,
|  ON_3dPoint &  |  P
) |   |  const
overridevirtual
virtual ON_Geometry override
Reimplemented from ON_Geometry.
Reimplemented in ON_PolyCurve.
◆ EvCurvature()
 bool ON_Curve::EvCurvature  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  ON_3dVector &  |  kappa,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate unit tangent and curvature at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t tangent - [out] value of unit tangent kappa - [out] value of curvature vector side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::CurvatureAt ON_Curve::Ev2Der ON_EvCurvature
◆ EvPoint()
 bool ON_Curve::EvPoint  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate point at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::PointAt ON_Curve::EvTangent ON_Curve::Evaluate
◆ EvSignedCurvature()
 bool ON_Curve::EvSignedCurvature  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  double &  |  kappa,
|  const ON_3dVector *  |  normal = nullptr,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate unit tangent and signed curvature (also called oriented curvature) of a planar curve at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t tangent - [out] value of unit tangent kappa - [out] value of signed curvature normal - [in] oriented unit normal of the plane containing the curve. default of nullptr is interpreted as ON_3dVector(0,0,1) side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. Notes: Computes the Triple product T o ( K X N) where T is the unit tangent, K is the curvature vector and N is the plane unit normal. If the curve is planar this is the signed curvature for the given plane orientation. The normal defaults to (0,0,1) for curves in the x-y plane. See Also: ON_Curve::CurvatureAt ON_Curve::Ev2Der ON_EvCurvature
◆ EvTangent()
 bool ON_Curve::EvTangent  |  ( |  double  |  t,
|  ON_3dPoint &  |  point,
|  ON_3dVector &  |  tangent,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate unit tangent at a parameter with error checking. Parameters: t - [in] evaluation parameter point - [out] value of curve at t tangent - [out] value of unit tangent side - [in] optional - determines which side to evaluate from =0 default <0 to evaluate from below, >0 to evaluate from above hint - [in/out] optional evaluation hint used to speed repeated evaluations Returns: false if unable to evaluate. See Also: ON_Curve::TangentAt ON_Curve::Ev1Der
◆ Extend()
 virtual bool ON_Curve::Extend  |  ( |  const ON_Interval &  |  domain | )
virtual
Description: Pure virtual function. Default returns false. Where possible, analytically extends curve to include domain. Parameters: domain - [in] if domain is not included in curve domain, curve will be extended so that its domain includes domain.
 Will not work if curve is closed. Original curve is identical to the restriction of the resulting curve to the original curve domain, Returns: true if successful.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_LineCurve, and ON_ArcCurve.
◆ FirstSpanIsLinear() [1/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
Parameters: min_length -[in] minimum length of a linear span tolerance -[in] distance tolerance to use when checking linearity. Returns true if the span is a non-degenerate line. This means:
dimension = 2 or 3
The length of the line segment from the span's initial point to the span's control point is >= min_length.
The maximum distance from the line segment to the span is <= tolerance and the span increases monotonically in the direction of the line segment.
◆ FirstSpanIsLinear() [2/2]
 bool ON_Curve::FirstSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ FrameAt()
 bool ON_Curve::FrameAt  |  ( |  double  |  t,
|  ON_Plane &  |  plane
) |   |  const
Description: Return a 3d frame at a parameter. Parameters: t - [in] evaluation parameter plane - [out] the frame is returned here Returns: true if successful See Also: ON_Curve::PointAt, ON_Curve::TangentAt, ON_Curve::Ev1Der, Ev2Der
◆ GetClosestPoint()
 virtual bool ON_Curve::GetClosestPoint  |  ( |  const ON_3dPoint &  |  test_point,
|  double *  |  t,
|  double  |  maximum_distance = 0.0,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
virtual
Find parameter of the point on a curve that is closest to test_point. If the maximum_distance parameter is > 0, then only points whose distance to the given point is <= maximum_distance will be returned. Using a positive value of maximum_distance can substantially speed up the search. If the sub_domain parameter is not nullptr, then the search is restricted to the specified portion of the curve.
true if returned if the search is successful. false is returned if the search fails.
Parameters
t | parameter of local closest point returned here
maximum_distance | maximum_distance
sub_domain | sub_domain
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.
◆ GetCurveParameterFromNurbFormParameter()
 virtual bool ON_Curve::GetCurveParameterFromNurbFormParameter  |  ( |  double  |  nurbs_t,
|  double *  |  curve_t
) |   |  const
virtual
Description: Convert a NURBS curve parameter to a curve parameter
Parameters: nurbs_t - [in] nurbs form parameter curve_t - [out] curve parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetNurbFormParameterFromCurveParameter
Reimplemented in ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, ON_SubDEdgeChainCurve, ON_NurbsCurve, and ON_LineCurve.
◆ GetCurveSeparation()
 static bool ON_Curve::GetCurveSeparation  |  ( |  const ON_Curve &  |  curveA,
|  ON_Interval  |  domainA,
|  const ON_Curve &  |  curveB,
|  ON_Interval  |  domainB,
|  ON_Line &  |  minimum_separation,
|  double *  |  min_parameter_A,
|  double *  |  min_parameter_B,
|  ON_Line &  |  maximum_separation,
|  double *  |  max_parameter_A,
|  double *  |  max_parameter_B
)
static
Find the locations of the minimimum and maximum separation between two curves. When the separation points are distinct, the line connecting the separation points is perpindicular to the curves. This calculates the distances and locations shown in the Rhino CrvDeviation command.
Parameters
curveA
domainA | If you want to restrict the search to a subdomain of curveA, pass that subdomain here. Otherwise pass ON_Interval::Nan or curveA.Domain().
curveB
domainB | If you want to restrict the search to a subdomain of curveB, pass that subdomain here. Otherwise pass ON_Interval::Nan or curveB.Domain().
minimum_separation | If minimum separation points can be found, then a line connecting those points is returned in minimum_separation. Otherwise, ON_Line::NanLine is returned. minimum_separation.from is on curveA and minimum_separation.to is on curveB. If
min_parameter_A | If min_parameter_A is not nullptr, then the parameter of the minimum separation point on curveA is returned in min_parameter_A.
min_parameter_B | If min_parameter_B is not nullptr, then the parameter of the minimum separation point on curveB is returned in min_parameter_B.
maximum_separation | If maximum separation points can be found, then a line connecting those points is returned in maximum_separation. Otherwise, ON_Line::NanLine is returned. maximum_separation.from is on curveA and maximum_separation.to is on curveB.
max_parameter_A | If max_parameter_A is not nullptr, then the parameter of the maximum separation point on curveA is returned in max_parameter_A.
max_parameter_B | If max_parameter_B is not nullptr, then the parameter of the maximum separation point on curveB is returned in max_parameter_B.
Returns
True if some information was returned. Any results that could not be computed are returned as nans.
◆ GetDomain()
 bool ON_Curve::GetDomain  |  ( |  double *  |  t0,
|  double *  |  t1
) |   |  const
curve interface
Description: Gets domain of the curve Parameters: t0 - [out] t1 - [out] domain is [*t0, *t1] Returns: true if successful.
◆ GetLength()
 virtual bool ON_Curve::GetLength  |  ( |  double *  |  length,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
virtual
Description: Get the length of the curve. Parameters: length - [out] length returned here. fractional_tolerance - [in] desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve (must be non-decreasing) Returns: true if returned if the length calculation is successful. false is returned if the length is not calculated. Remarks: The arc length will be computed so that (returned length - real length)/(real length) <= fractional_tolerance More simply, if you want N significant figures in the answer, set the fractional_tolerance to 1.0e-N. For "nice" curves, 1.0e-8 works fine. For very high degree NURBS and NURBS with bad parameterizations, use larger values of fractional_tolerance.
Reimplemented in ON_SubDEdgeChainCurve, ON_LineCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, and ON_ArcCurve.
◆ GetLocalClosestPoint()
 virtual bool ON_Curve::GetLocalClosestPoint  |  ( |  const ON_3dPoint &  |  test_point,
|  double  |  seed_parameter,
|  double *  |  t,
|  const ON_Interval *  |  sub_domain = 0
) |   |  const
virtual
Find parameter of the point on a curve that is locally closest to the test_point. The search for a local close point starts at seed_parameter. If the sub_domain parameter is not nullptr, then the search is restricted to the specified portion of the curve.
true if returned if the search is successful. false is returned if the search fails.
Reimplemented in ON_SubDEdgeChainCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.
◆ GetNextDiscontinuity()
 virtual bool ON_Curve::GetNextDiscontinuity  |  ( |  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Description: Search for a derivative, tangent, or curvature discontinuity. Parameters: c - [in] type of continity to test for. t0 - [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities. t1 - [in] (t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity type and t1 is at the start or end of the curve. t - [out] if a discontinuity is found, then *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means the curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. If 'c', the type of continuity to test for is ON::continuity::Gsmooth_continuous and the curvature changes from curved to 0 or 0 to curved and there is no tangency kink dtype is returns 3 cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, and ON_PolyCurve.
◆ GetNormalizedArcLengthPoint()
 virtual bool ON_Curve::GetNormalizedArcLengthPoint  |  ( |  double  |  s,
|  double *  |  t,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
virtual
Description: Get the parameter of the point on the curve that is a prescribed arc length from the start of the curve. Parameters: s - [in] normalized arc length parameter. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve. t - [out] parameter such that the length of the curve from its start to t is arc_length. fractional_tolerance - [in] desired fractional precision. fabs(("exact" length from start to t) - arc_length)/arc_length <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve. Returns: true if successful
Reimplemented in ON_SubDEdgeChainCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, and ON_LineCurve.
◆ GetNormalizedArcLengthPoints()
 virtual bool ON_Curve::GetNormalizedArcLengthPoints  |  ( |  int  |  count,
|  const double *  |  s,
|  double *  |  t,
|  double  |  absolute_tolerance = 0.0,
|  double  |  fractional_tolerance = 1.0e-8,
|  const ON_Interval *  |  sub_domain = nullptr
) |   |  const
virtual
Description: Get the parameter of the point on the curve that is a prescribed arc length from the start of the curve. Parameters: count - [in] number of parameters in s. s - [in] array of normalized arc length parameters. E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve. t - [out] array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length. absolute_tolerance - [in] if absolute_tolerance > 0, then the difference between (s[i+1]-s[i])*curve_length and the length of the curve segment from t[i] to t[i+1] will be <= absolute_tolerance. fractional_tolerance - [in] desired fractional precision for each segment. fabs("true" length - actual length)/(actual length) <= fractional_tolerance sub_domain - [in] If not nullptr, the calculation is performed on the specified sub-domain of the curve. A 0.0 s value corresponds to sub_domain->Min() and a 1.0 s value corresponds to sub_domain->Max(). Returns: true if successful
Reimplemented in ON_SubDEdgeChainCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, and ON_LineCurve.
◆ GetNurbForm()
 virtual int ON_Curve::GetNurbForm  |  ( |  ON_NurbsCurve &  |  nurbs_curve,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
virtual
Description: Get a NURBS curve representation of this curve. Parameters: nurbs_curve - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the curve's to wthe desired accuracy 2 success - returned NURBS point locus matches the curve's to the desired accuracy and the domain of the NURBS curve is correct. On However, This curve's parameterization and the NURBS curve parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of curves that have a transcendental parameterization like circles Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Curve::NurbsCurve may be easier to use. See Also: ON_Curve::NurbsCurve
Reimplemented in ON_NurbsCurve, ON_SubDEdgeChainCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, ON_ArcCurve, and ON_CurveOnSurface.
◆ GetNurbFormParameterFromCurveParameter()
 virtual bool ON_Curve::GetNurbFormParameterFromCurveParameter  |  ( |  double  |  curve_t,
|  double *  |  nurbs_t
) |   |  const
virtual
Description: Convert a curve parameter to a NURBS curve parameter.
Parameters: curve_t - [in] curve parameter nurbs_t - [out] nurbs form parameter
Remarks: If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
See Also: ON_Curve::GetNurbForm, ON_Curve::GetCurveParameterFromNurbFormParameter
Reimplemented in ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_ArcCurve, ON_NurbsCurve, and ON_LineCurve.
◆ GetParameterTolerance()
 virtual bool ON_Curve::GetParameterTolerance  |  ( |  double  |  t,
|  double *  |  tminus,
|  double *  |  tplus
) |   |  const
virtual
Description: Returns maximum algebraic degree of any span or a good estimate if curve spans are not algebraic. Returns: degree
Parameters
t | returns tminus < tplus: parameters tminus <= s <= tplus [IN] t = parameter in domain
[out] | tminus | [OUT] tminus
[out] | tplus | [OUT] tplus
Reimplemented in ON_CurveProxy, ON_CurveOnSurface, ON_SubDEdgeChainCurve, and ON_NurbsCurve.
◆ GetSpanVector()
 virtual bool ON_Curve::GetSpanVector  |  ( |  double *  |  span_parameters | ) |   const
pure virtual
Description: Get number of parameters of "knots". Parameters: span_parameters - [out] an array of length SpanCount()+1 is filled in with the parameters where the curve is not smooth (C-infinity). Returns: true if successful
Implemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ GetSpanVectorIndex()
 virtual bool ON_Curve::GetSpanVectorIndex  |  ( |  double  |  t,
|  int  |  side,
|  int *  |  span_vector_index,
|  ON_Interval *  |  span_domain
) |   |  const
virtual
If t is in the domain of the curve, GetSpanVectorIndex() returns the span vector index "i" such that span_vector[i] <= t <= span_vector[i+1]. The "side" parameter determines which span is selected when t is at the end of a span.
Parameters
[in] | t | [IN] t = evaluation parameter
[in] | side | [IN] side 0 = default, -1 = from below, +1 = from above
[out] | span_vector_index | [OUT] span vector index
[out] | span_domain | [OUT] domain of the span containing "t"
Reimplemented in ON_SubDEdgeChainCurve.
◆ GetTightBoundingBox()
 bool ON_Curve::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
Reimplemented in ON_SubDEdgeChainCurve, ON_PolyCurve, ON_PolylineCurve, and ON_LineCurve.
◆ HasNurbForm()
 virtual int ON_Curve::HasNurbForm  |  ( |   | ) |   const
virtual
Description: Does a NURBS curve representation of this curve. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the curve's to wthe desired accuracy 2 success - NURBS point locus matches the curve's and the domain of the NURBS curve is correct.
 However, This curve's parameterization and the NURBS curve parameterization may not match. This situation happens when getting NURBS representations of curves that have a transcendental parameterization like circles Remarks: This is a low-level virtual function.
 See Also: ON_Curve::GetNurbForm ON_Curve::NurbsCurve
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, ON_CurveProxy, ON_LineCurve, and ON_ArcCurve.
◆ IntersectCurve()
 int ON_Curve::IntersectCurve  |  ( |  const ON_Curve *  |  curveB,
|  ON_SimpleArray< ON_X_EVENT > &  |  x,
|  double  |  intersection_tolerance = 0.0,
|  double  |  overlap_tolerance = 0.0,
|  const ON_Interval *  |  curveA_domain = 0,
|  const ON_Interval *  |  curveB_domain = 0
) |   |  const
Description: Intersect this curve with curveB. Parameters: curveB - [in] x - [out] Intersection events are appended to this array. intersection_tolerance - [in] If the distance from a point on this curve to curveB is <= intersection tolerance, then the point will be part of an intersection event. If the input intersection_tolerance <= 0.0, then 0.001 is used. overlap_tolerance - [in] If t1 and t2 are parameters of this curve's intersection events and the distance from curve(t) to curveB is <= overlap_tolerance for every t1 <= t <= t2, then the event will be returned as an overlap event. If the input overlap_tolerance <= 0.0, then intersection_tolerance*2.0 is used, Otherwise, overlap tolerance must be >= intersection_tolerance. curveA_domain - [in] optional restriction on this curve's domain curveB_domain - [in] optional restriction on curveB domain Returns: Number of intersection events appended to x.
◆ IntersectPlane()
 int ON_Curve::IntersectPlane  |  ( |  ON_PlaneEquation  |  plane_equation,
|  ON_SimpleArray< ON_X_EVENT > &  |  x,
|  double  |  intersection_tolerance = 0.0,
|  double  |  overlap_tolerance = 0.0,
|  const ON_Interval *  |  curve_domain = 0
) |   |  const
Description: Intersect this curve with an infinite plane.
Parameters: plane_equation - [in]
x - [out] Intersection events are appended to this array. intersection_tolerance - [in]
 If the distance from a point on this curve to the surface is <= intersection tolerance, then the point will be part of an intersection event, or there is an intersection event the point leads to. If the input intersection_tolerance <= 0.0, then 0.001 is used.
overlap_tolerance - [in] If the input overlap_tolerance <= 0.0, then 2.0*intersection_tolerance is used. Otherwise, overlap tolerance must be >= intersection_tolerance. In all cases, the intersection calculation is performed with an overlap_tolerance that is >= intersection_tolerance. If t1 and t2 are curve parameters of intersection events and the distance from curve(t) to the surface is <= overlap_tolerance for every t1 <= t <= t2, then the event will be returned as an overlap event.
curve_domain - [in] optional restriction on this curve's domain
Returns: Number of intersection events appended to x.
NOTE: The surface parameters, m_b, of x are not useful. If you got the plane equation from an ON_Plane, the m_b will most likely not be correct with respect to the original plane.
◆ IntersectSelf()
 virtual int ON_Curve::IntersectSelf  |  ( |  ON_SimpleArray< ON_X_EVENT > &  |  x,
|  double  |  intersection_tolerance = 0.0,
|  const ON_Interval *  |  curve_domain = 0
) |   |  const
virtual
Description: Find curve's self intersection points. Parameters: x - [out] Intersection events are appended to this array. Only intersection points are reported. Overlaps are not reported. intersection_tolerance - [in] curve_domain - [in] optional restriction Returns: Number of intersection events appended to x. Remarks: Overlaps were are not reported. Overlaps are now reported as of Rhino 8.0
Reimplemented in ON_SubDEdgeChainCurve, ON_ArcCurve, and ON_LineCurve.
◆ IntersectSurface()
 int ON_Curve::IntersectSurface  |  ( |  const ON_Surface *  |  surfaceB,
|  ON_SimpleArray< ON_X_EVENT > &  |  x,
|  double  |  intersection_tolerance = 0.0,
|  double  |  overlap_tolerance = 0.0,
|  const ON_Interval *  |  curveA_domain = 0,
|  const ON_Interval *  |  surfaceB_udomain = 0,
|  const ON_Interval *  |  surfaceB_vdomain = 0
) |   |  const
Description: Intersect this curve with surfaceB.
Parameters: surfaceB - [in]
x - [out] Intersection events are appended to this array. intersection_tolerance - [in]
 If the distance from a point on this curve to the surface is <= intersection tolerance, then the point will be part of an intersection event, or there is an intersection event the point leads to. If the input intersection_tolerance <= 0.0, then 0.001 is used.
overlap_tolerance - [in] If the input overlap_tolerance <= 0.0, then 2.0*intersection_tolerance is used. Otherwise, overlap tolerance must be >= intersection_tolerance. In all cases, the intersection calculation is performed with an overlap_tolerance that is >= intersection_tolerance. If t1 and t2 are curve parameters of intersection events and the distance from curve(t) to the surface is <= overlap_tolerance for every t1 <= t <= t2, then the event will be returned as an overlap event.
curveA_domain - [in] optional restriction on this curve's domain
surfaceB_udomain - [in] optional restriction on surfaceB u domain
surfaceB_vdomain - [in] optional restriction on surfaceB v domain
Returns: Number of intersection events appended to x.
◆ IsArc()
 virtual bool ON_Curve::IsArc  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Arc *  |  arc = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Description: Test a curve to see if the locus if its points is an arc or circle. Parameters: plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking Returns: ON_Arc.m_angle > 0 if curve locus is an arc between specified points. If ON_Arc.m_angle is 2.0*ON_PI, then the curve is a circle.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_LineCurve, ON_CurveOnSurface, and ON_ArcCurve.
◆ IsArcAt()
 bool ON_Curve::IsArcAt  |  ( |  double  |  t,
|  const ON_Plane *  |  plane = 0,
|  ON_Arc *  |  arc = 0,
|  double  |  tolerance = ON_ZERO_TOLERANCE,
|  double *  |  t0 = 0,
|  double *  |  t1 = 0
) |   |  const
Description: Parameters: t - [in] curve parameter plane - [in] if not nullptr, test is performed in this plane arc - [out] if not nullptr and true is returned, then arc parameters are filled in tolerance - [in] tolerance to use when checking t0 - [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested. t1 - [out] if not nullptr, and then *t0 is set to the parameter at the start of the G2 curve segment that was tested. Returns: True if the parameter t is on a arc segment of the curve.
◆ IsClosable()
 bool ON_Curve::IsClosable  |  ( |  double  |  tolerance,
|  double  |  min_abs_size = 0.0,
|  double  |  min_rel_size = 10.0
) |   |  const
Description: Decide if it makes sense to close off this curve by moving the endpoint to the start based on start-end gap size and length of curve as approximated by chord defined by 6 points. Parameters: tolerance - [in] maximum allowable distance between start and end. if start - end gap is greater than tolerance, returns false min_abs_size - [in] if greater than 0.0 and none of the interior sampled points are at least min_abs_size from start, returns false. min_rel_size - [in] if greater than 1.0 and chord length is less than min_rel_size*gap, returns false. Returns: true if start and end points are close enough based on above conditions.
◆ IsClosed()
 virtual bool ON_Curve::IsClosed  |  ( |   | ) |   const
virtual
Description: Test a curve to see if it is closed. Returns: true if the curve is closed.
Reimplemented in ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, ON_CurveOnSurface, ON_SubDEdgeChainCurve, ON_NurbsCurve, CRhinoPolyEdgeSegment, ON_PolyEdgeSegment, ON_PolylineCurve, ON_BrepEdge, ON_PolyEdgeCurve, and CRhinoPolyEdge.
◆ IsContinuous()
 virtual bool ON_Curve::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
virtual
Description: Test continuity at a curve parameter value. Parameters: c - [in] type of continuity to test for. Read ON::continuity comments for details. t - [in] parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the curve is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the curve is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the curve is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous or ON::continuity::Gsmooth_continuous.
 ON::continuity::G2_continuous: If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. ON::continuity::Gsmooth_continuous: If K0 and K1 are curvatures evaluated from above and below and the angle between K0 and K1 is at least twice angle tolerance or ||K0| - |K1|| > (max(|K0|,|K1|) > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the curve has at least the c type continuity at the parameter t.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, and ON_ArcCurve.
◆ IsEllipse()
 virtual bool ON_Curve::IsEllipse  |  ( |  const ON_Plane *  |  plane = nullptr,
|  ON_Ellipse *  |  ellipse = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Reimplemented in ON_SubDEdgeChainCurve.
◆ IsInPlane()
 virtual bool ON_Curve::IsInPlane  |  ( |  const ON_Plane &  |  test_plane,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
pure virtual
Description: Test a curve to see if it lies in a specific plane. Parameters: test_plane - [in] tolerance - [in] tolerance to use when checking Returns: true if the maximum distance from the curve to the test_plane is <= tolerance.
Implemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_LineCurve, ON_CurveOnSurface, and ON_ArcCurve.
◆ IsLinear()
 virtual bool ON_Curve::IsLinear  |  ( |  double  |  tolerance = ON_ZERO_TOLERANCE | ) |   const
virtual
Description: Test a curve to see if the locus if its points is a line segment. Parameters: tolerance - [in] ///< tolerance to use when checking linearity Returns: true if the ends of the curve are farther than tolerance apart and the maximum distance from any point on the curve to the line segment connecting the curve's ends is <= tolerance.
Reimplemented in ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, ON_CurveOnSurface, ON_SubDEdgeChainCurve, ON_NurbsCurve, and ON_PolylineCurve.
◆ IsLong()
 bool ON_Curve::IsLong  |  ( |  double  |  min_length,
|  const ON_Interval *  |  sub_domain = 0
) |   |  const
Description: Used to quickly find out if a curve is longer than the minimum length. Parameters: min_length [in] - (>= 0) sub_domain [in] - If not nullptr, the test is performed on the interval that is the intersection of sub_domain with Domain(). Returns: true if the curve is longer than min_length Remarks: Faster than calling Length() and testing the result.
◆ IsPeriodic()
 virtual bool ON_Curve::IsPeriodic  |  ( |   | ) |   const
virtual
Description: Test a curve to see if it is periodic. Returns: true if the curve is closed and at least C2 at the start/end.
Reimplemented in ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_ArcCurve, ON_LineCurve, ON_CurveOnSurface, ON_SubDEdgeChainCurve, and ON_NurbsCurve.
◆ IsPlanar()
 virtual bool ON_Curve::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
virtual
Description: Test a curve to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checkin Note: If the curve is a simple planar closed curve the plane orientation agrees with the curve orientation. Returns: true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_LineCurve, ON_CurveOnSurface, and ON_ArcCurve.
◆ IsPolyline()
 virtual int ON_Curve::IsPolyline  |  ( |  ON_SimpleArray< ON_3dPoint > *  |  pline_points = nullptr,
|  ON_SimpleArray< double > *  |  pline_t = nullptr
) |   |  const
virtual
Description: Several types of ON_Curve can have the form of a polyline including a degree 1 ON_NurbsCurve, an ON_PolylineCurve, and an ON_PolyCurve all of whose segments are some form of polyline. IsPolyline tests a curve to see if it can be represented as a polyline. Parameters: pline_points - [out] if not nullptr and true is returned, then the points of the polyline form are returned here. t - [out] if not nullptr and true is returned, then the parameters of the polyline points are returned here. Returns: @untitled table 0 curve is not some form of a polyline >=2 number of points in polyline form
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, and ON_LineCurve.
◆ IsShort()
 virtual bool ON_Curve::IsShort  |  ( |  double  |  tolerance,
|  const ON_Interval *  |  sub_domain = 0,
|  double *  |  length_estimate = 0
) |   |  const
virtual
Description: Used to quickly find short curves. Parameters: tolerance - [in] (>=0) sub_domain - [in] If not nullptr, the test is performed on the interval that is the intersection of sub_domain with Domain(). Returns: True if the length of the curve is <= tolerance. Remarks: Faster than calling Length() and testing the result.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_ArcCurve, and ON_LineCurve.
◆ LastSpanIsLinear() [1/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance
) |   |  const
◆ LastSpanIsLinear() [2/2]
 bool ON_Curve::LastSpanIsLinear  |  ( |  double  |  min_length,
|  double  |  tolerance,
|  ON_Line *  |  span_line
) |   |  const
◆ LengthMassProperties()
 bool ON_Curve::LengthMassProperties  |  ( |  class ON_MassProperties &  |  mp,
|  bool  |  bLength = true,
|  bool  |  bFirstMoments = true,
|  bool  |  bSecondMoments = true,
|  bool  |  bProductMoments = true,
|  double  |  rel_tol = 1.0e-6,
|  double  |  abs_tol = 1.0e-6
) |   |  const
Description: Calculate length mass properties of the curve. Parameters: mp - [out] bLength - [in] true to calculate length bFirstMoments - [in] true to calculate volume first moments, length, and length centroid. bSecondMoments - [in] true to calculate length second moments. bProductMoments - [in] true to calculate length product moments. Returns: True if successful.
◆ MeshCurve()
 class ON_PolylineCurve* ON_Curve::MeshCurve  |  ( |  ON_MeshCurveParameters &  |  mp,
|  ON_PolylineCurve *  |  polyline,
|  bool  |  bSkipFirstPoint,
|  const ON_Interval *  |  domain
) |   |  const
Description: Mesh a curve into line segments. Parameters: mp - [in] Parameters that determine how the curve will be approximated by a polyline. polyline - [in] If not nullptr, the polyline approximation will be appended to this polyline. bSkipFirstPoint - [in] If true, the starting point of the approximation will not be added to the returned polyline. This parameter is useful when getting a polyline approximation of a sequence of contiguous curves. domain - [in] If not nullptr, the polyline approximation will be restricted to this domain. Returns: A pointer to the polyline approximation.
◆ NextCurveKink()
 double ON_Curve::NextCurveKink  |  ( |  ON_Interval  |  search_domain,
|  const class ON_CurveKinkDefinition &  |  kink_definition
) |   |  const
Find the next curve kink in the search domain.
Parameters
search_domain | An increasing interval that is contained in this->Domain().
kink_definition
Returns
If a kink is found, then a parameter strictly inside search_domain is returned where the first kink was found. If no kink exists in the domain, the search_domain.Max() is returned. If the input is invalid, then ON_DBL_QNAN is returned.
◆ NurbsCurve()
 ON_NurbsCurve* ON_Curve::NurbsCurve  |  ( |  ON_NurbsCurve *  |  pNurbsCurve = nullptr,
|  double  |  tolerance = 0.0,
|  const ON_Interval *  |  subdomain = nullptr
) |   |  const
Description: Get a NURBS curve representation of this curve. Parameters: pNurbsCurve - [in/out] if not nullptr, this ON_NurbsCurve will be used to store the NURBS representation of the curve will be returned. tolerance - [in] tolerance to use when creating NURBS representation. subdomain - [in] if not nullptr, then the NURBS representation for this portion of the curve is returned. Returns: nullptr or a NURBS representation of the curve. Remarks: See ON_Surface::GetNurbForm for important details about the NURBS surface parameterization. See Also: ON_Curve::GetNurbForm
◆ NurbsCurveFit()
 class ON_NurbsCurve* ON_Curve::NurbsCurveFit  |  ( |  ON_Interval  |  domain,
|  const class ON_NurbsCurveFitParameters &  |  fit_parameters,
|  class ON_NurbsCurve *  |  destination_nurbs_cuve,
|  class ON_Line &  |  maximum_separation,
|  double &  |  this_separation_parameter,
|  double &  |  nurbs_separation_parameter
) |   |  const
Get a uniform NURBS curve fit to this curve.. This function is useful when you want to fit this curve a single time. If you are in a situation where you are repeatedly adjusting fit_parameters, it is much more efficient to use the ON_NurbsCurveFitBuilder class because the steps involved in sampling points and other information from this input curve are expensive and can be reused as fit_parameters.Degree(), fit_parameters.PointCount(), and other fitting parmeters are changed.
Parameters
domain | If domain is increasing and included in this->Domain(), then only that portion of this curve is fit. Otherwise all of this curve is fit.
fit_parameters | Parameters the determine the degree number of control points in the NURBS curve fit.
destination_nurbs_cuve | If destination_nurbs_cuve is not nullptr, then the NURBS curve fit is returned in this ON_NurbsCurve. Otherwise the NURBS curve fit is returned in a new ON_NurbsCurve and the caller is responsible for deleting the result a the appropriate time.
maximum_separation | maximum_separation is an output parameter. If a nurbs curved is returned, then maximum_separation is a line from this curve to the nurbs curve at the point of maximum separation. Otherwise the returned maximum_separation is ON_Line::Nan.
this_separation_parameter | this_separation_parameter is an output parameter. If a nurbs curved is returned, then this_separation_parameter is the parameter on this curve at the point of maximum separation from the nurbs curve. Otherwise the returned this_separation_parameter is ON_DBL_QNAN.
nurbs_separation_parameter | nurbs_separation_parameter is an output parameter. If a nurbs curved is returned, then nurbs_separation_parameter is the parameter on the returned nurbs at the point of maximum separation from this curve. Otherwise the returned nurbs_separation_parameter is ON_DBL_QNAN.
Returns
◆ ObjectType()
 ON::object_type ON_Curve::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: overrides virtual ON_Object::ObjectType. Returns: ON::curve_object
Reimplemented from ON_Object.
◆ operator=()
 ON_Curve& ON_Curve::operator=  |  ( |  const ON_Curve &  |   | )
◆ ParameterSearch()
 bool ON_Curve::ParameterSearch  |  ( |  double  |  t,
|  int &  |  index,
|  bool  |  bEnableSnap,
|  const ON_SimpleArray< double > &  |  m_t,
|  double  |  RelTol = ON_SQRT_EPSILON
) |   |  const
protected
Description: Lookup a parameter in the m_t array, optionally using a built in snap tolerance to snap a parameter value to an element of m_t. This function is used by some types derived from ON_Curve to snap parameter values Parameters: t - [in] parameter index -[out] index into m_t such that if function returns false then
 @table
 value                  condition
-1                                   t<m_t[0] or m_t is empty
    0<=i<=m_t.Count()-2     m_t[i] < t < m_t[i+1]
    m_t.Count()-1                   t>m_t[ m_t.Count()-1]
if the function returns true then t is equal to, or is closest to and
within  tolerance of m_t[index].
bEnableSnap-[in] enable snapping m_t -[in] Array of parameter values to snap to RelTol -[in] tolerance used in snapping
Returns:
 true if the t is exactly equal to (bEnableSnap==false), or within tolerance of (bEnableSnap==true) m_t[index].
◆ PointAt()
 ON_3dPoint ON_Curve::PointAt  |  ( |  double  |  t | ) |   const
Description: Evaluate point at a parameter. Parameters: t - [in] evaluation parameter Returns: Point (location of curve at the parameter t). Remarks: No error handling. See Also: ON_Curve::EvPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
◆ PointAtEnd()
 ON_3dPoint ON_Curve::PointAtEnd  |  ( |   | ) |   const
Description: Evaluate point at the end of the curve. Parameters: t - [in] evaluation parameter Returns: Point (location of the end of the curve.) Remarks: No error handling. See Also: ON_Curve::PointAt
◆ PointAtStart()
 ON_3dPoint ON_Curve::PointAtStart  |  ( |   | ) |   const
Description: Evaluate point at the start of the curve. Parameters: t - [in] evaluation parameter Returns: Point (location of the start of the curve.) Remarks: No error handling. See Also: ON_Curve::PointAt
◆ RebuildToMatchTemplateCurve()
 class ON_NurbsCurve* ON_Curve::RebuildToMatchTemplateCurve  |  ( |  const ON_Curve &  |  template_curve,
|  bool  |  bFlipSourceDirection,
|  bool  |  bPreserveEndTangents,
|  bool  |  bMakeSubDFriendly,
|  class ON_NurbsCurve *  |  destination_nurbs_curve,
|  class ON_Line *  |  maximum_deviation
) |   |  const
Rebuild this curve (the "source" curve) so it takes on the degree, knot vector, and control point count of a template curve. When rebuilding many curves against the same template, use the ON_TemplatedCurveRebuilder class so the template is analyzed only once.
Parameters
template_curve | The curve whose degree, knots, and control point count the result matches.
bFlipSourceDirection | If true and this curve is open, its direction is flipped (reversed) before sampling. Set this when this curve runs opposite the template.
bPreserveEndTangents | If true and the result is open with at least 4 control points, the interior end control points are adjusted so the result's end tangents match this curve's.
bMakeSubDFriendly | If true, the result is converted to a SubD friendly curve.
destination_nurbs_curve | If not nullptr, the result is returned here. Otherwise the result is returned in a new ON_NurbsCurve and the caller is responsible for deleting it at the appropriate time.
maximum_deviation | If not nullptr, a line from this curve to the rebuilt curve at the point of maximum separation is returned here (from is on this curve, to is on the rebuilt curve), or ON_Line::NanLine if it cannot be computed.
Returns
The rebuilt curve, or nullptr if the template curve is unusable or the rebuild fails.
◆ RemoveShortSegments()
 virtual bool ON_Curve::RemoveShortSegments  |  ( |  double  |  tolerance,
|  bool  |  bRemoveShortSegments = true
)
virtual
Description: Looks for segments that are shorter than tolerance that can be removed. If bRemoveShortSegments is true, then the short segments are removed. Does not change the domain, but it will change the relative parameterization. Parameters: tolerance - [in] bRemoveShortSegments - [in] If true, then short segments are removed. Returns: True if removable short segments can were found. False if no removable short segments can were found.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, and ON_PolyCurve.
◆ Reverse()
 virtual bool ON_Curve::Reverse  |  ( |   | )
pure virtual
Description: Reverse the direction of the curve. Returns: true if curve was reversed. Remarks: If reversed, the domain changes from [a,b] to [-b,-a]
Implemented in ON_SubDEdgeChainCurve, ON_BrepTrim, ON_NurbsCurve, ON_CurveProxy, ON_PolylineCurve, ON_PolyCurve, ON_BrepEdge, ON_LineCurve, ON_ArcCurve, and ON_CurveOnSurface.
◆ SetDomain() [1/2]
 virtual bool ON_Curve::SetDomain  |  ( |  double  |  t0,
|  double  |  t1
)
virtual
Description: Set the domain of the curve Parameters: t0 - [in] t1 - [in] new domain will be [t0,t1] Returns: true if successful.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, and ON_LineCurve.
◆ SetDomain() [2/2]
 bool ON_Curve::SetDomain  |  ( |  ON_Interval  |  domain | )
Description: Set the domain of the curve. Parameters: domain - [in] increasing interval Returns: true if successful.
◆ SetEndPoint()
 virtual bool ON_Curve::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetEndPoint() returns true if end_point is the same as the end of the curve, false otherwise. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, CRhinoPolyEdge, ON_ArcCurve, ON_PolyEdgeCurve, and ON_LineCurve.
◆ SetStartPoint()
 virtual bool ON_Curve::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
virtual
Description: Force the curve to start at a specified point. Parameters: start_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. ON_Curve::SetStartPoint() returns true if start_point is the same as the start of the curve, false otherwise. See Also: ON_Curve::SetEndPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_PolyCurve, CRhinoPolyEdge, ON_PolyEdgeCurve, ON_ArcCurve, and ON_LineCurve.
◆ SignedCurvatureAt()
 double ON_Curve::SignedCurvatureAt  |  ( |  double  |  t,
|  const ON_3dVector *  |  plane_normal = nullptr
) |   |  const
Description: Evaluate the signed curvature of a planar curve at a parameter. Parameters: t - [in] evaluation parameter plane_normal - [in] oriented plane unit normal, defaults to ON_3dVector(0,0,1) for curve in xy-plane Returns: signed curvature of a planar curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvSignedCurvature
◆ SizeOf()
 unsigned int ON_Curve::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
Reimplemented from ON_Object.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolyCurve, ON_CurveProxy, ON_CurveOnSurface, ON_LineCurve, and ON_PolylineCurve.
◆ SpanCount()
 virtual int ON_Curve::SpanCount  |  ( |   | ) |   const
pure virtual
Description: Get number of nonempty smooth (c-infinity) spans in curve Returns: Number of nonempty smooth (c-infinity) spans.
Implemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_CurveProxy, ON_PolyCurve, ON_PolylineCurve, ON_ArcCurve, ON_LineCurve, and ON_CurveOnSurface.
◆ SpanVector()
 const ON_SimpleArray<double> ON_Curve::SpanVector  |  ( |   | ) |   const
The curve's span vector is a stricltly monotone increasing list of doubles that are the intervals on which the curve is C-infinity.
Returns
The curve's span vector.
◆ Split()
 virtual bool ON_Curve::Split  |  ( |  double  |  t,
|  ON_Curve *&  |  left_side,
|  ON_Curve *&  |  right_side
) |   |  const
virtual
Description: Splits (divides) the curve at the specified parameter.
 The parameter must be in the interior of the curve's domain. The pointers passed to Split must either be nullptr or point to an ON_Curve object of the same type. If the pointer is nullptr, then a curve will be created in Split(). You may pass "this" as left_side or right_side. Parameters: t - [in] parameter to split the curve at in the interval returned by Domain(). left_side - [out] left portion of curve returned here right_side - [out] right portion of curve returned here Returns: true - The curve was split into two pieces.
 false - The curve could not be split. For example if the parameter is too close to an endpoint.
Example: For example, if crv were an ON_NurbsCurve, then
  ON_NurbsCurve right_side;
  crv.Split( crv.Domain().Mid() &crv, &right_side );
would split crv at the parametric midpoint, put the left side in crv, and return the right side in right_side.
Reimplemented in ON_PolylineCurve, ON_SubDEdgeChainCurve, ON_PolyCurve, ON_CurveProxy, CRhinoPolyEdgeSegment, ON_LineCurve, ON_ArcCurve, ON_PolyEdgeSegment, and ON_NurbsCurve.
◆ TangentAt() [1/2]
 ON_3dVector ON_Curve::TangentAt  |  ( |  double  |  t | ) |   const
Description: Evaluate unit tangent vector at a parameter. Parameters: t - [in] evaluation parameter Returns: Unit tangent vector of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvTangent
◆ TangentAt() [2/2]
 ON_3dVector ON_Curve::TangentAt  |  ( |  double  |  t,
|  int  |  side
) |   |  const
Evaluate the unit tangent vector with the option to specify the direction of the limit. This is useful when evaluating tangent vectors at a tangent discontinuity.
Description: Evaluate unit tangent vector at a parameter. Parameters: t - [in] evaluation parameter Returns: Unit tangent vector of the curve at the parameter t. Remarks: No error handling. See Also: ON_Curve::EvTangent
Parameters
t | Evaluation parameter
side | -1 for limit from below t. +1 for limit from above t. 0 for default.
Returns
If successful, the tangent vector is returned. Otherwise, ON_3dVector::NanVector is returned.
◆ Transform()
 bool ON_Curve::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: overrides virtual ON_Geometry::Transform(). ON_Curve::Transform() calls ON_Geometry::Transform(xform), which calls ON_Object::TransformUserData(xform), and then calls this->DestroyCurveTree(). Parameters: xform - [in] transformation to apply to object. Remarks: Classes derived from ON_Curve should call ON_Curve::Transform() to handle user data transformations and curve tree destruction and then transform their definition.
Reimplemented from ON_Geometry.
Reimplemented in ON_SubDEdgeChainCurve, ON_NurbsCurve, ON_PolylineCurve, ON_CurveProxy, ON_PolyCurve, ON_CurveOnSurface, and ON_LineCurve.
◆ Trim()
 virtual bool ON_Curve::Trim  |  ( |  const ON_Interval &  |  domain | )
virtual
Description: Removes portions of the curve outside the specified interval. Parameters: domain - [in] interval of the curve to keep. Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed. Returns: true if successful.
Reimplemented in ON_SubDEdgeChainCurve, ON_PolyCurve, ON_CurveProxy, CRhinoPolyEdgeSegment, ON_LineCurve, ON_PolyEdgeSegment, ON_NurbsCurve, ON_PolylineCurve, and ON_ArcCurve.