Static Public Member Functions | Static Public Attributes | List of all members
ON_PlusFunction Class Reference
OpenNURBS
#include <opennurbs_plus_function.h>
 Static Public Member Functions
static bool  | IsValid ()
 Static Public Attributes
static ON_PLUS_FUNCTION_BendBrepFace  | f_ON_BendBrepFace
Used by ON_BendBrepFace. More...
static ON_PLUS_FUNCTION_BezierCurve_GetLocalClosestPoint  | f_ON_BezierCurve_GetLocalClosestPoint
Used by ON_BezierCurve:: More...
static ON_PLUS_FUNCTION_BezierCurve_GetTightBoundingBox  | f_ON_BezierCurve_GetTightBoundingBox
Used by ON_BezierCurve:: More...
static ON_PLUS_FUNCTION_BezierCurve_LocalIntersectCurve  | f_ON_BezierCurve_LocalIntersectCurve
Used by ON_BezierCurve:: More...
static ON_PLUS_FUNCTION_BezierCurve_LocalIntersectSurface  | f_ON_BezierCurve_LocalIntersectSurface
Used by ON_BezierCurve:: More...
static ON_PLUS_FUNCTION_BezierSurface_GetClosestPoint  | f_ON_BezierSurface_GetClosestPoint
Used by ON_BezierSurface::GetLocalClosestPoint() More...
static ON_PLUS_FUNCTION_Brep_GetEdgeOrTrimParameter  | f_ON_Brep_GetEdgeParameter
Used by ON_Brep::GetEdgeParameter. More...
static ON_PLUS_FUNCTION_Brep_GetEdgeOrTrimParameter  | f_ON_Brep_GetTrimParameter
Used by ON_Brep::GetEdgeParameter. More...
static ON_PLUS_FUNCTION_Brep_IsPointInsideHelper  | f_ON_Brep_IsPointInsideHelper
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_MassProperties  | f_ON_Brep_MassProperties
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_MergeBrepsHelper  | f_ON_Brep_MergeBrepsHelper
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_Mesh  | f_ON_Brep_Mesh
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_PointIsOnFace  | f_ON_Brep_PointIsOnFace
Used by ON_RayHitIsOnFace() More...
static ON_PLUS_FUNCTION_Brep_RegionTopologyHelper  | f_ON_Brep_RegionTopologyHelper
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_Silhouette  | f_ON_Brep_Silhouette
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_Brep_SplitFaces  | f_ON_Brep_SplitFaces
Used by ON_Brep:: More...
static ON_PLUS_FUNCTION_BrepCloseTrimGap  | f_ON_BrepCloseTrimGap
Used by ON_Brep::CloseTrimGap. More...
static ON_PLUS_FUNCTION_BrepFace_Mesh  | f_ON_BrepFace_Mesh
Used by ON_BrepFace:: More...
static ON_PLUS_FUNCTION_BrepFace_Silhouette  | f_ON_BrepFace_Silhouette
Used by ON_BrepFace:: More...
static ON_PLUS_FUNCTION_BrepFaceGetIsoIntervals  | f_ON_BrepFaceGetIsoIntervals
Used by ON_BrepFace::GetIsoIntervals. More...
static ON_PLUS_FUNCTION_Check2dPatternHasMapBackInfo  | f_ON_Check2dPatternHasMapBackInfo
used by ON_Is2dPatternSquished More...
static ON_PLUS_FUNCTION_CreateSquisherImpl  | f_ON_CreateSquisherImpl
used by ON_Squisher::Create More...
static ON_PLUS_FUNCTION_Curve_CreateCubicLoft  | f_ON_Curve_CreateCubicLoft
static ON_PLUS_FUNCTION_Curve_GetCurveSeparation  | f_ON_Curve_GetCurveSeparation
Used by ON_Curve::GetCurveSeparation() More...
static ON_PLUS_FUNCTION_Curve_MassProperties  | f_ON_Curve_MassProperties
static ON_PLUS_FUNCTION_Curve_Mesh  | f_ON_Curve_Mesh
static ON_PLUS_FUNCTION_CurveTreeNode_GetClosestPoint  | f_ON_CurveTreeNode_GetClosestPoint
Used by ON_CurveTreeNode:: More...
static ON_PLUS_FUNCTION_CurveTreeNode_IntersectCurveTree  | f_ON_CurveTreeNode_IntersectCurveTree
Used by ON_CurveTreeNode:: More...
static ON_PLUS_FUNCTION_CurveTreeNode_IntersectPlane  | f_ON_CurveTreeNode_IntersectPlane
Used by ON_CurveTreeNode:: More...
static ON_PLUS_FUNCTION_CurveTreeNode_IntersectSelf  | f_ON_CurveTreeNode_IntersectSelf
Used by ON_CurveTreeNode:: More...
static ON_PLUS_FUNCTION_CurveTreeNode_IntersectSurfaceTree  | f_ON_CurveTreeNode_IntersectSurfaceTree
Used by ON_CurveTreeNode:: More...
static ON_PLUS_FUNCTION_DumpSquishInfoText  | f_ON_DumpSquishInfoText
used by ON_DumpSquishInfoText More...
static ON_PLUS_FUNCTION_Extrusion_Pullback  | f_ON_Extrusion_Pullback
Used by ON_Extrusion::Pullback(). More...
static ON_PLUS_FUNCTION_Extrusion_Pushup  | f_ON_Extrusion_Pushup
Used by ON_Extrusion::Pushup(). More...
static ON_PLUS_FUNCTION_GetMatrixSVD  | f_ON_GetMatrixSVD
Used by ON_GetMatrixSVD() More...
static ON_PLUS_FUNCTION_GetNew_HiddenLineDrawing  | f_ON_GetNew_HiddenLineDrawing
static ON_PLUS_FUNCTION_Integrate1  | f_ON_Integrate1
Used by ON_Integrate() for 1 parameter functions. More...
static ON_PLUS_FUNCTION_Integrate2  | f_ON_Integrate2
Used by ON_Integrate() for 2 parameter functions. More...
static ON_PLUS_FUNCTION_IsPointListPlanar  | f_ON_IsPointListPlanar
Used by ON_IsPointListPlanar() More...
static ON_PLUS_FUNCTION_MapBackCurve  | f_ON_MapBackCurve
used by ON_MapBackPoint More...
static ON_PLUS_FUNCTION_MapBackPoint  | f_ON_MapBackPoint
used by ON_MapBackPoint More...
static ON_PLUS_FUNCTION_Mesh2dPolygon  | f_ON_Mesh2dPolygon
Used by ON_Mesh2dPolygon() More...
static ON_PLUS_FUNCTION_Mesh2dRegion  | f_ON_Mesh2dRegion
static ON_PLUS_FUNCTION_Mesh_IsPointInside  | f_ON_Mesh_IsPointInside
Used by ON_Mesh::IsPointInside. More...
static ON_PLUS_FUNCTION_Mesh_MassProperties  | f_ON_Mesh_MassProperties
Used by ON_Mesh:: More...
static ON_PLUS_FUNCTION_Mesh_Silhouette  | f_ON_Mesh_Silhouette
Used by ON_Mesh::GetSilhouette() More...
static ON_PLUS_FUNCTION_Mesh_SolidOrientation  | f_ON_Mesh_SolidOrientation
Used by ON_Mesh::SolidOrientation. More...
static ON_PLUS_FUNCTION_MeshClashSearch  | f_ON_MeshClashSearch
Used by ON_MeshClashSearch and ON_MeshFaceClashSearch. More...
static ON_PLUS_FUNCTION_Minimize  | f_ON_Minimize
Used by ON_Minimize() for to call TL_BoundedBFGSMin() More...
static ON_PLUS_FUNCTION_ON_NurbsCurve_RemoveKnots  | f_ON_NurbsCurve_RemoveKnots
static ON_PLUS_FUNCTION_ON_NurbsGrevilleInterpolate  | f_ON_NurbsGrevilleInterpolate
static ON_PLUS_FUNCTION_NurbsSurface_Mesh  | f_ON_NurbsSurface_Mesh
Used by ON_NurbsSurface::CreateMesh() More...
static ON_PLUS_FUNCTION_ON_NurbsSurface_RemoveKnots  | f_ON_NurbsSurface_RemoveKnots
static ON_PLUS_FUNCTION_OldMeshBooleansPickTwoSides  | f_ON_OldMeshBooleansPickTwoSides
Used by new mesh booleans. More...
static ON_PLUS_FUNCTION_Outline_GetOutlineMesh  | f_ON_Outline_GetOutlineMesh
Used by ON_Outline::GetOutlineMesh() More...
static ON_PLUS_FUNCTION_PlaneSurface_Mesh  | f_ON_PlaneSurface_Mesh
Used by ON_PlaneSurface::CreateMesh() More...
static ON_PLUS_FUNCTION_RevSurface_Mesh  | f_ON_RevSurface_Mesh
Used by ON_RevSurface::CreateMesh() More...
static ON_PLUS_FUNCTION_SimpleCreate2dMesh  | f_ON_SimpleCreate2dMesh
Used by ON_MX_Split*. More...
static ON_PLUS_FUNCTION_SquishBack2dMarks  | f_ON_SquishBack2dMarks
used by ON_SquishBack2dMarks More...
static ON_PLUS_FUNCTION_SquishMesh  | f_ON_SquishMesh
Used by ON_SquishMesh. More...
static ON_PLUS_FUNCTION_SquishSurface  | f_ON_SquishSurface
Used by ON_SquishMesh. More...
static ON_PLUS_FUNCTION_SumSurface_Mesh  | f_ON_SumSurface_Mesh
Used by ON_SumSurface::CreateMesh() More...
static ON_PLUS_FUNCTION_Surface_CreateCubicLoft  | f_ON_Surface_CreateCubicLoft
static ON_PLUS_FUNCTION_Surface_CreateLinearLoft  | f_ON_Surface_CreateLinearLoft
static ON_PLUS_FUNCTION_Surface_MassProperties  | f_ON_Surface_MassProperties
static ON_PLUS_FUNCTION_Surface_Silhouette  | f_ON_Surface_Silhouette
Used by ON_Surface::GetSilhouettes() More...
static ON_PLUS_FUNCTION_SurfaceTreeNode_GetClosestPoint  | f_ON_SurfaceTreeNode_GetClosestPoint
Used by ON_SurfaceTreeNode:: More...
static ON_PLUS_FUNCTION_SurfaceTreeNode_IntersectSurfaceTree  | f_ON_SurfaceTreeNode_IntersectSurfaceTree
Used by ON_SurfaceTreeNode:: More...
static ON_PLUS_FUNCTION_TransformBrepComponents  | f_ON_TransformBrepComponents
Used by ON_BendBrepFace. More...
Detailed Description
static storage used by Rhino SDK to set function pointers used by opennurbs member functions.
Member Function Documentation
◆ IsValid()
 static bool ON_PlusFunction::IsValid  |  ( |   | )
static
Member Data Documentation
◆ f_ON_BendBrepFace
 ON_PLUS_FUNCTION_BendBrepFace ON_PlusFunction::f_ON_BendBrepFace
static
Used by ON_BendBrepFace.
◆ f_ON_BezierCurve_GetLocalClosestPoint
 ON_PLUS_FUNCTION_BezierCurve_GetLocalClosestPoint ON_PlusFunction::f_ON_BezierCurve_GetLocalClosestPoint
static
Used by ON_BezierCurve::
◆ f_ON_BezierCurve_GetTightBoundingBox
 ON_PLUS_FUNCTION_BezierCurve_GetTightBoundingBox ON_PlusFunction::f_ON_BezierCurve_GetTightBoundingBox
static
Used by ON_BezierCurve::
◆ f_ON_BezierCurve_LocalIntersectCurve
 ON_PLUS_FUNCTION_BezierCurve_LocalIntersectCurve ON_PlusFunction::f_ON_BezierCurve_LocalIntersectCurve
static
Used by ON_BezierCurve::
◆ f_ON_BezierCurve_LocalIntersectSurface
 ON_PLUS_FUNCTION_BezierCurve_LocalIntersectSurface ON_PlusFunction::f_ON_BezierCurve_LocalIntersectSurface
static
Used by ON_BezierCurve::
◆ f_ON_BezierSurface_GetClosestPoint
 ON_PLUS_FUNCTION_BezierSurface_GetClosestPoint ON_PlusFunction::f_ON_BezierSurface_GetClosestPoint
static
Used by ON_BezierSurface::GetLocalClosestPoint()
◆ f_ON_Brep_GetEdgeParameter
 ON_PLUS_FUNCTION_Brep_GetEdgeOrTrimParameter ON_PlusFunction::f_ON_Brep_GetEdgeParameter
static
Used by ON_Brep::GetEdgeParameter.
◆ f_ON_Brep_GetTrimParameter
 ON_PLUS_FUNCTION_Brep_GetEdgeOrTrimParameter ON_PlusFunction::f_ON_Brep_GetTrimParameter
static
Used by ON_Brep::GetEdgeParameter.
◆ f_ON_Brep_IsPointInsideHelper
 ON_PLUS_FUNCTION_Brep_IsPointInsideHelper ON_PlusFunction::f_ON_Brep_IsPointInsideHelper
static
Used by ON_Brep::
◆ f_ON_Brep_MassProperties
 ON_PLUS_FUNCTION_Brep_MassProperties ON_PlusFunction::f_ON_Brep_MassProperties
static
Used by ON_Brep::
◆ f_ON_Brep_MergeBrepsHelper
 ON_PLUS_FUNCTION_Brep_MergeBrepsHelper ON_PlusFunction::f_ON_Brep_MergeBrepsHelper
static
Used by ON_Brep::
◆ f_ON_Brep_Mesh
 ON_PLUS_FUNCTION_Brep_Mesh ON_PlusFunction::f_ON_Brep_Mesh
static
Used by ON_Brep::
◆ f_ON_Brep_PointIsOnFace
 ON_PLUS_FUNCTION_Brep_PointIsOnFace ON_PlusFunction::f_ON_Brep_PointIsOnFace
static
Used by ON_RayHitIsOnFace()
◆ f_ON_Brep_RegionTopologyHelper
 ON_PLUS_FUNCTION_Brep_RegionTopologyHelper ON_PlusFunction::f_ON_Brep_RegionTopologyHelper
static
Used by ON_Brep::
◆ f_ON_Brep_Silhouette
 ON_PLUS_FUNCTION_Brep_Silhouette ON_PlusFunction::f_ON_Brep_Silhouette
static
Used by ON_Brep::
◆ f_ON_Brep_SplitFaces
 ON_PLUS_FUNCTION_Brep_SplitFaces ON_PlusFunction::f_ON_Brep_SplitFaces
static
Used by ON_Brep::
◆ f_ON_BrepCloseTrimGap
 ON_PLUS_FUNCTION_BrepCloseTrimGap ON_PlusFunction::f_ON_BrepCloseTrimGap
static
Used by ON_Brep::CloseTrimGap.
◆ f_ON_BrepFace_Mesh
 ON_PLUS_FUNCTION_BrepFace_Mesh ON_PlusFunction::f_ON_BrepFace_Mesh
static
Used by ON_BrepFace::
◆ f_ON_BrepFace_Silhouette
 ON_PLUS_FUNCTION_BrepFace_Silhouette ON_PlusFunction::f_ON_BrepFace_Silhouette
static
Used by ON_BrepFace::
◆ f_ON_BrepFaceGetIsoIntervals
 ON_PLUS_FUNCTION_BrepFaceGetIsoIntervals ON_PlusFunction::f_ON_BrepFaceGetIsoIntervals
static
Used by ON_BrepFace::GetIsoIntervals.
◆ f_ON_Check2dPatternHasMapBackInfo
 ON_PLUS_FUNCTION_Check2dPatternHasMapBackInfo ON_PlusFunction::f_ON_Check2dPatternHasMapBackInfo
static
used by ON_Is2dPatternSquished
◆ f_ON_CreateSquisherImpl
 ON_PLUS_FUNCTION_CreateSquisherImpl ON_PlusFunction::f_ON_CreateSquisherImpl
static
used by ON_Squisher::Create
◆ f_ON_Curve_CreateCubicLoft
 ON_PLUS_FUNCTION_Curve_CreateCubicLoft ON_PlusFunction::f_ON_Curve_CreateCubicLoft
static
Used by ON_Curve::CreateCubicLoft(). Set by TL_PLUS_FUNCTION_SetCubicLoftFunctions().
◆ f_ON_Curve_GetCurveSeparation
 ON_PLUS_FUNCTION_Curve_GetCurveSeparation ON_PlusFunction::f_ON_Curve_GetCurveSeparation
static
Used by ON_Curve::GetCurveSeparation()
◆ f_ON_Curve_MassProperties
 ON_PLUS_FUNCTION_Curve_MassProperties ON_PlusFunction::f_ON_Curve_MassProperties
static
Used by ON_Curve::LengthMassProperties() and ON_Curve::AreaMassProperties(). Set by TL_PLUS_FUNCTION_Set_MeshingFunctionPointers().
◆ f_ON_Curve_Mesh
 ON_PLUS_FUNCTION_Curve_Mesh ON_PlusFunction::f_ON_Curve_Mesh
static
Used by ON_Curve::MeshCurve(). Set by TL_PLUS_FUNCTION_Set_MeshingFunctionPointers().
◆ f_ON_CurveTreeNode_GetClosestPoint
 ON_PLUS_FUNCTION_CurveTreeNode_GetClosestPoint ON_PlusFunction::f_ON_CurveTreeNode_GetClosestPoint
static
Used by ON_CurveTreeNode::
◆ f_ON_CurveTreeNode_IntersectCurveTree
 ON_PLUS_FUNCTION_CurveTreeNode_IntersectCurveTree ON_PlusFunction::f_ON_CurveTreeNode_IntersectCurveTree
static
Used by ON_CurveTreeNode::
◆ f_ON_CurveTreeNode_IntersectPlane
 ON_PLUS_FUNCTION_CurveTreeNode_IntersectPlane ON_PlusFunction::f_ON_CurveTreeNode_IntersectPlane
static
Used by ON_CurveTreeNode::
◆ f_ON_CurveTreeNode_IntersectSelf
 ON_PLUS_FUNCTION_CurveTreeNode_IntersectSelf ON_PlusFunction::f_ON_CurveTreeNode_IntersectSelf
static
Used by ON_CurveTreeNode::
◆ f_ON_CurveTreeNode_IntersectSurfaceTree
 ON_PLUS_FUNCTION_CurveTreeNode_IntersectSurfaceTree ON_PlusFunction::f_ON_CurveTreeNode_IntersectSurfaceTree
static
Used by ON_CurveTreeNode::
◆ f_ON_DumpSquishInfoText
 ON_PLUS_FUNCTION_DumpSquishInfoText ON_PlusFunction::f_ON_DumpSquishInfoText
static
used by ON_DumpSquishInfoText
◆ f_ON_Extrusion_Pullback
 ON_PLUS_FUNCTION_Extrusion_Pullback ON_PlusFunction::f_ON_Extrusion_Pullback
static
Used by ON_Extrusion::Pullback().
◆ f_ON_Extrusion_Pushup
 ON_PLUS_FUNCTION_Extrusion_Pushup ON_PlusFunction::f_ON_Extrusion_Pushup
static
Used by ON_Extrusion::Pushup().
◆ f_ON_GetMatrixSVD
 ON_PLUS_FUNCTION_GetMatrixSVD ON_PlusFunction::f_ON_GetMatrixSVD
static
Used by ON_GetMatrixSVD()
◆ f_ON_GetNew_HiddenLineDrawing
 ON_PLUS_FUNCTION_GetNew_HiddenLineDrawing ON_PlusFunction::f_ON_GetNew_HiddenLineDrawing
static
Used by ON_HiddenLineDrawing constructors Set by TL_PLUS_FUNCTION_GetNew_HiddenLineDrawing().
◆ f_ON_Integrate1
 ON_PLUS_FUNCTION_Integrate1 ON_PlusFunction::f_ON_Integrate1
static
Used by ON_Integrate() for 1 parameter functions.
◆ f_ON_Integrate2
 ON_PLUS_FUNCTION_Integrate2 ON_PlusFunction::f_ON_Integrate2
static
Used by ON_Integrate() for 2 parameter functions.
◆ f_ON_IsPointListPlanar
 ON_PLUS_FUNCTION_IsPointListPlanar ON_PlusFunction::f_ON_IsPointListPlanar
static
Used by ON_IsPointListPlanar()
◆ f_ON_MapBackCurve
 ON_PLUS_FUNCTION_MapBackCurve ON_PlusFunction::f_ON_MapBackCurve
static
used by ON_MapBackPoint
◆ f_ON_MapBackPoint
 ON_PLUS_FUNCTION_MapBackPoint ON_PlusFunction::f_ON_MapBackPoint
static
used by ON_MapBackPoint
◆ f_ON_Mesh2dPolygon
 ON_PLUS_FUNCTION_Mesh2dPolygon ON_PlusFunction::f_ON_Mesh2dPolygon
static
Used by ON_Mesh2dPolygon()
◆ f_ON_Mesh2dRegion
 ON_PLUS_FUNCTION_Mesh2dRegion ON_PlusFunction::f_ON_Mesh2dRegion
static
Used by ON_Mesh2dRegion() Set by TL_PLUS_FUNCTION_Set_MeshingFunctionPointers().
◆ f_ON_Mesh_IsPointInside
 ON_PLUS_FUNCTION_Mesh_IsPointInside ON_PlusFunction::f_ON_Mesh_IsPointInside
static
Used by ON_Mesh::IsPointInside.
◆ f_ON_Mesh_MassProperties
 ON_PLUS_FUNCTION_Mesh_MassProperties ON_PlusFunction::f_ON_Mesh_MassProperties
static
Used by ON_Mesh::
◆ f_ON_Mesh_Silhouette
 ON_PLUS_FUNCTION_Mesh_Silhouette ON_PlusFunction::f_ON_Mesh_Silhouette
static
Used by ON_Mesh::GetSilhouette()
◆ f_ON_Mesh_SolidOrientation
 ON_PLUS_FUNCTION_Mesh_SolidOrientation ON_PlusFunction::f_ON_Mesh_SolidOrientation
static
Used by ON_Mesh::SolidOrientation.
◆ f_ON_MeshClashSearch
 ON_PLUS_FUNCTION_MeshClashSearch ON_PlusFunction::f_ON_MeshClashSearch
static
Used by ON_MeshClashSearch and ON_MeshFaceClashSearch.
◆ f_ON_Minimize
 ON_PLUS_FUNCTION_Minimize ON_PlusFunction::f_ON_Minimize
static
Used by ON_Minimize() for to call TL_BoundedBFGSMin()
◆ f_ON_NurbsCurve_RemoveKnots
 ON_PLUS_FUNCTION_ON_NurbsCurve_RemoveKnots ON_PlusFunction::f_ON_NurbsCurve_RemoveKnots
static
Used by ON_NurbsCurve::RemoveKnots(). Set by TL_PLUS_FUNCTION_Set_Nurbs_RemoveKnots().
◆ f_ON_NurbsGrevilleInterpolate
 ON_PLUS_FUNCTION_ON_NurbsGrevilleInterpolate ON_PlusFunction::f_ON_NurbsGrevilleInterpolate
static
Used by ON_NurbsCurve::GrevilleInterpolate(). Set by TL_PLUS_FUNCTION_Set_Nurbs_RemoveKnots().
◆ f_ON_NurbsSurface_Mesh
 ON_PLUS_FUNCTION_NurbsSurface_Mesh ON_PlusFunction::f_ON_NurbsSurface_Mesh
static
Used by ON_NurbsSurface::CreateMesh()
◆ f_ON_NurbsSurface_RemoveKnots
 ON_PLUS_FUNCTION_ON_NurbsSurface_RemoveKnots ON_PlusFunction::f_ON_NurbsSurface_RemoveKnots
static
Used by ON_NurbsCurve::RemoveKnots(). Set by TL_PLUS_FUNCTION_Set_Nurbs_RemoveKnots().
◆ f_ON_OldMeshBooleansPickTwoSides
 ON_PLUS_FUNCTION_OldMeshBooleansPickTwoSides ON_PlusFunction::f_ON_OldMeshBooleansPickTwoSides
static
Used by new mesh booleans.
◆ f_ON_Outline_GetOutlineMesh
 ON_PLUS_FUNCTION_Outline_GetOutlineMesh ON_PlusFunction::f_ON_Outline_GetOutlineMesh
static
Used by ON_Outline::GetOutlineMesh()
◆ f_ON_PlaneSurface_Mesh
 ON_PLUS_FUNCTION_PlaneSurface_Mesh ON_PlusFunction::f_ON_PlaneSurface_Mesh
static
Used by ON_PlaneSurface::CreateMesh()
◆ f_ON_RevSurface_Mesh
 ON_PLUS_FUNCTION_RevSurface_Mesh ON_PlusFunction::f_ON_RevSurface_Mesh
static
Used by ON_RevSurface::CreateMesh()
◆ f_ON_SimpleCreate2dMesh
 ON_PLUS_FUNCTION_SimpleCreate2dMesh ON_PlusFunction::f_ON_SimpleCreate2dMesh
static
Used by ON_MX_Split*.
◆ f_ON_SquishBack2dMarks
 ON_PLUS_FUNCTION_SquishBack2dMarks ON_PlusFunction::f_ON_SquishBack2dMarks
static
used by ON_SquishBack2dMarks
◆ f_ON_SquishMesh
 ON_PLUS_FUNCTION_SquishMesh ON_PlusFunction::f_ON_SquishMesh
static
Used by ON_SquishMesh.
◆ f_ON_SquishSurface
 ON_PLUS_FUNCTION_SquishSurface ON_PlusFunction::f_ON_SquishSurface
static
Used by ON_SquishMesh.
◆ f_ON_SumSurface_Mesh
 ON_PLUS_FUNCTION_SumSurface_Mesh ON_PlusFunction::f_ON_SumSurface_Mesh
static
Used by ON_SumSurface::CreateMesh()
◆ f_ON_Surface_CreateCubicLoft
 ON_PLUS_FUNCTION_Surface_CreateCubicLoft ON_PlusFunction::f_ON_Surface_CreateCubicLoft
static
Used by ON_Surface::CreateCubicLoft(). Set by TL_PLUS_FUNCTION_SetCubicLoftFunctions().
◆ f_ON_Surface_CreateLinearLoft
 ON_PLUS_FUNCTION_Surface_CreateLinearLoft ON_PlusFunction::f_ON_Surface_CreateLinearLoft
static
Used by ON_Surface::CreateLinearLoft(). Set by TL_PLUS_FUNCTION_SetCubicLoftFunctions().
◆ f_ON_Surface_MassProperties
 ON_PLUS_FUNCTION_Surface_MassProperties ON_PlusFunction::f_ON_Surface_MassProperties
static
Used by ON_Surface::AreaMassProperties() and ON_Surface::VolumeMassProperties() Set by TL_PLUS_FUNCTION_Set_Surface_MassProperties().
◆ f_ON_Surface_Silhouette
 ON_PLUS_FUNCTION_Surface_Silhouette ON_PlusFunction::f_ON_Surface_Silhouette
static
Used by ON_Surface::GetSilhouettes()
◆ f_ON_SurfaceTreeNode_GetClosestPoint
 ON_PLUS_FUNCTION_SurfaceTreeNode_GetClosestPoint ON_PlusFunction::f_ON_SurfaceTreeNode_GetClosestPoint
static
Used by ON_SurfaceTreeNode::
◆ f_ON_SurfaceTreeNode_IntersectSurfaceTree
 ON_PLUS_FUNCTION_SurfaceTreeNode_IntersectSurfaceTree ON_PlusFunction::f_ON_SurfaceTreeNode_IntersectSurfaceTree
static
Used by ON_SurfaceTreeNode::
◆ f_ON_TransformBrepComponents
 ON_PLUS_FUNCTION_TransformBrepComponents ON_PlusFunction::f_ON_TransformBrepComponents
static
Used by ON_BendBrepFace.