Public Member Functions | List of all members
CRhRdkPreviewGeometry Class Referenceabstract
RDK
#include <RhRdkPlugIn.h>
 Inheritance diagram for CRhRdkPreviewGeometry:
 Public Member Functions
virtual const wchar_t *  | ElementKind (void) const final override
virtual void  | SetUpPreview (class IRhRdkPreviewSceneServerEx &ss, const CRhRdkContent &c, bool bCopy) const =0
 Public Member Functions inherited from CRhRdkPreviewSceneElement
CRhRdkPreviewSceneElement ()
virtual  | ~CRhRdkPreviewSceneElement ()
virtual CRhRdkPreviewSceneElement *  | Duplicate (void) const =0
virtual UUID  | TypeId (void) const =0
virtual const wchar_t *  | XmlTag (void) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Member Function Documentation
◆ ElementKind()
 virtual const wchar_t* CRhRdkPreviewGeometry::ElementKind  |  ( |  void  |   | ) |   const
finaloverridevirtual
Implements CRhRdkPreviewSceneElement.
◆ SetUpPreview()
 virtual void CRhRdkPreviewGeometry::SetUpPreview  |  ( |  class IRhRdkPreviewSceneServerEx &  |  ss,
|  const CRhRdkContent &  |  c,
|  bool  |  bCopy
) |   |  const
pure virtual