Public Member Functions | Static Public Member Functions | List of all members
ON_ContentHash::Cache Class Reference
#include <opennurbs_file_utilities.h>
 Public Member Functions
Cache ()
~Cache ()
 Static Public Member Functions
static void  | Add (const char *, const ON_ContentHash &)
static void  | Add (const wchar_t *, const ON_ContentHash &)
static const ON_ContentHash *  | FromFile (const char *)
static const ON_ContentHash *  | FromFile (const wchar_t *)
Constructor & Destructor Documentation
◆ Cache()
 ON_ContentHash::Cache::Cache  |  ( |   | )
◆ ~Cache()
 ON_ContentHash::Cache::~Cache  |  ( |   | )
Member Function Documentation
◆ Add() [1/2]
 static void ON_ContentHash::Cache::Add  |  ( |  const char *  |  ,
|  const ON_ContentHash &
)
static
◆ Add() [2/2]
 static void ON_ContentHash::Cache::Add  |  ( |  const wchar_t *  |  ,
|  const ON_ContentHash &
)
static
◆ FromFile() [1/2]
 static const ON_ContentHash* ON_ContentHash::Cache::FromFile  |  ( |  const char *  |   | )
static
◆ FromFile() [2/2]
 static const ON_ContentHash* ON_ContentHash::Cache::FromFile  |  ( |  const wchar_t *  |   | )
static