Public Types | Static Public Member Functions | List of all members
CRhinoDpi Class Reference
Rhino
#include <RhinoSdkDpi.h>
 Public Types
enum  | IconType : unsigned int { IconType::NormalIcon, IconType::SmallIcon }
 Static Public Member Functions
static int  | DpiScale ()
static bool  | DpiScaleIsOne ()
static int  | IconSize (IconType iconType)
ON_OS_WINDOWS. More...
static int  | Scale (int x)
static int  | ScreenDpi ()
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. / / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / ////////////////////////////////////////////////////////////// Description: A set of static utility functions to help with high-DPI displays
Member Enumeration Documentation
◆ IconType
 enum CRhinoDpi::IconType : unsigned int
strong
Description: Standard icon types.
Enumerator
NormalIcon
SmallIcon
Member Function Documentation
◆ DpiScale()
 static int CRhinoDpi::DpiScale  |  ( |   | )
static
Returns: The display DPI scale factor when Rhino started.
◆ DpiScaleIsOne()
 static bool CRhinoDpi::DpiScaleIsOne  |  ( |   | )
static
Returns: True if the DPI scale factor was set to 100% when Rhino started, false otherwise.
◆ IconSize()
 static int CRhinoDpi::IconSize  |  ( |  IconType  |  iconType | )
static
ON_OS_WINDOWS.
Description: Returns the preferred sizes of icons. The measurement values that are returned are scaled to the current DPI setting. Parameters: iconType [in] - The icon type. Returns: The size in pixels.
◆ Scale()
 static int CRhinoDpi::Scale  |  ( |  int  |  x | )
static
Description: Scales a value by the current DPI scale factor. Parameters: x [in] - The value to scale Returns: The value multiplied by the DPI scale.
◆ ScreenDpi()
 static int CRhinoDpi::ScreenDpi  |  ( |   | )
static
Returns: The display DPI value when Rhino started.