Public Types | Public Member Functions | List of all members
CRhRdkCreateNew Class Referencefinal
RDK
#include <RhRdkTask.h>
 Public Types
enum  | {
 cnf_ForceAdvanced = 1, cnf_MultiSelect = 2, cnf_SuppressLibraryDialog = 4, cnf_SuppressHarvesting = 8,
 cnf_HideNewTab = 16, cnf_HideExistingTab = 32
 }
 Public Member Functions
CRhRdkCreateNew ()
~CRhRdkCreateNew ()
bool  | Execute (const IRhRdkTaskOrigin &) const
bool  | Execute (const IRhRdkTaskOrigin &, UINT, OUT CRhRdkContentArray &) const
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
cnf_ForceAdvanced
cnf_MultiSelect
cnf_SuppressLibraryDialog
cnf_SuppressHarvesting
cnf_HideNewTab
cnf_HideExistingTab
Constructor & Destructor Documentation
◆ CRhRdkCreateNew()
 CRhRdkCreateNew::CRhRdkCreateNew  |  ( |   | )
◆ ~CRhRdkCreateNew()
 CRhRdkCreateNew::~CRhRdkCreateNew  |  ( |   | )
Member Function Documentation
◆ Execute() [1/2]
 bool CRhRdkCreateNew::Execute  |  ( |  const IRhRdkTaskOrigin &  |   | ) |   const
◆ Execute() [2/2]
 bool CRhRdkCreateNew::Execute  |  ( |  const IRhRdkTaskOrigin &  |  ,
|  UINT  |  ,
|  OUT CRhRdkContentArray &
) |   |  const