Public Member Functions | List of all members
ON_AerialPhotoImage Class Reference
OpenNURBS
#include <opennurbs_photogrammetry.h>
 Public Member Functions
ON_AerialPhotoImage ()
bool  | CameraLocationIsSet () const
bool  | CameraOrientationIsSet () const
bool  | CameraPositionIsSet () const
void  | GetCameraPosition (ON_AerialPhotoCameraPosition &camera_position) const
void  | GetImageFileName (ON_wString &image_file_name) const
void  | GetImageFrustum (ON_AerialPhotoImageFrustum &image_frustum) const
bool  | GetImageSize (int *width_pixels, int *height_pixels) const
void  | GetName (ON_wString &name) const
bool  | GetViewProjection (ON_BoundingBox target_bbox, ON_Viewport &viewport) const
ON_UUID  | Id () const
bool  | ImageFileNameIsSet () const
bool  | ImageFrustumIsSet () const
bool  | ImageSizeIsSet () const
bool  | NameIsSet () const
void  | SetCameraPosition (ON_AerialPhotoCameraPosition camera_position)
void  | SetId (ON_UUID image_id)
void  | SetImageFileName (const wchar_t *image_file_name)
void  | SetImageFrustum (ON_AerialPhotoImageFrustum image_frustum)
bool  | SetImageSize (int width_pixels, int height_pixels)
void  | SetName (const wchar_t *name)
void  | Unset ()
void  | UnsetCameraPosition ()
void  | UnsetImageFileName ()
void  | UnsetImageFrustum ()
void  | UnsetImageSize ()
void  | UnsetName ()
Constructor & Destructor Documentation
◆ ON_AerialPhotoImage()
 ON_AerialPhotoImage::ON_AerialPhotoImage  |  ( |   | )
Member Function Documentation
◆ CameraLocationIsSet()
 bool ON_AerialPhotoImage::CameraLocationIsSet  |  ( |   | ) |   const
◆ CameraOrientationIsSet()
 bool ON_AerialPhotoImage::CameraOrientationIsSet  |  ( |   | ) |   const
◆ CameraPositionIsSet()
 bool ON_AerialPhotoImage::CameraPositionIsSet  |  ( |   | ) |   const
Camera position interface
◆ GetCameraPosition()
 void ON_AerialPhotoImage::GetCameraPosition  |  ( |  ON_AerialPhotoCameraPosition &  |  camera_position | ) |   const
◆ GetImageFileName()
 void ON_AerialPhotoImage::GetImageFileName  |  ( |  ON_wString &  |  image_file_name | ) |   const
◆ GetImageFrustum()
 void ON_AerialPhotoImage::GetImageFrustum  |  ( |  ON_AerialPhotoImageFrustum &  |  image_frustum | ) |   const
◆ GetImageSize()
 bool ON_AerialPhotoImage::GetImageSize  |  ( |  int *  |  width_pixels,
|  int *  |  height_pixels
) |   |  const
◆ GetName()
 void ON_AerialPhotoImage::GetName  |  ( |  ON_wString &  |  name | ) |   const
◆ GetViewProjection()
 bool ON_AerialPhotoImage::GetViewProjection  |  ( |  ON_BoundingBox  |  target_bbox,
|  ON_Viewport &  |  viewport
) |   |  const
General tools
◆ Id()
 ON_UUID ON_AerialPhotoImage::Id  |  ( |   | ) |   const
◆ ImageFileNameIsSet()
 bool ON_AerialPhotoImage::ImageFileNameIsSet  |  ( |   | ) |   const
Image frustum interface
◆ ImageFrustumIsSet()
 bool ON_AerialPhotoImage::ImageFrustumIsSet  |  ( |   | ) |   const
Image frustum interface
◆ ImageSizeIsSet()
 bool ON_AerialPhotoImage::ImageSizeIsSet  |  ( |   | ) |   const
◆ NameIsSet()
 bool ON_AerialPhotoImage::NameIsSet  |  ( |   | ) |   const
◆ SetCameraPosition()
 void ON_AerialPhotoImage::SetCameraPosition  |  ( |  ON_AerialPhotoCameraPosition  |  camera_position | )
◆ SetId()
 void ON_AerialPhotoImage::SetId  |  ( |  ON_UUID  |  image_id | )
◆ SetImageFileName()
 void ON_AerialPhotoImage::SetImageFileName  |  ( |  const wchar_t *  |  image_file_name | )
◆ SetImageFrustum()
 void ON_AerialPhotoImage::SetImageFrustum  |  ( |  ON_AerialPhotoImageFrustum  |  image_frustum | )
◆ SetImageSize()
 bool ON_AerialPhotoImage::SetImageSize  |  ( |  int  |  width_pixels,
|  int  |  height_pixels
)
◆ SetName()
 void ON_AerialPhotoImage::SetName  |  ( |  const wchar_t *  |  name | )
◆ Unset()
 void ON_AerialPhotoImage::Unset  |  ( |   | )
◆ UnsetCameraPosition()
 void ON_AerialPhotoImage::UnsetCameraPosition  |  ( |   | )
◆ UnsetImageFileName()
 void ON_AerialPhotoImage::UnsetImageFileName  |  ( |   | )
◆ UnsetImageFrustum()
 void ON_AerialPhotoImage::UnsetImageFrustum  |  ( |   | )
◆ UnsetImageSize()
 void ON_AerialPhotoImage::UnsetImageSize  |  ( |   | )
◆ UnsetName()
 void ON_AerialPhotoImage::UnsetName  |  ( |   | )