Public Member Functions | List of all members
CRhinoRotationGripUserInterfaceObject Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Inheritance diagram for CRhinoRotationGripUserInterfaceObject:
 Public Member Functions
CRhinoRotationGripUserInterfaceObject ()
CRhinoRotationGripUserInterfaceObject (const ON_Plane &plane, double radius)
virtual  | ~CRhinoRotationGripUserInterfaceObject ()
bool  | ArcVisibleInViewport (const CRhinoViewport *viewport) const
void  | Draw (CRhinoDisplayPipeline &dp) override
void  | Draw (CRhinoDisplayPipeline &dp, const ON_Color &color)
bool  | IsGripPointVisible () const
bool  | IsMouseOver (const CRhinoMouseEventArgs &mouse) override
void  | OnDrag (const ON_3dPoint &point, const CRhinoMouseEventArgs &mouse) override
virtual void  | OnRotationDrag (double angle, const CRhinoMouseEventArgs &mouse)
ON_Plane  | Plane () const
double  | RotationRadius () const
void  | SetGripPointVisible (bool on)
void  | SetPlane (const ON_Plane &plane)
void  | SetRotationRadius (double radius)
 Public Member Functions inherited from CRhinoGripUserInterfaceObject
CRhinoGripUserInterfaceObject ()
CRhinoGripUserInterfaceObject (const ON_3dPoint &location)
virtual  | ~CRhinoGripUserInterfaceObject ()
int  | AddSnapPoints (int pointCount, const ON_3dPoint *snapPoints)
double  | CameraDepth (const ON_Plane &cameraPlane) const override
void  | ClearConstraints ()
void  | ClearSnapPoints ()
ON_3dPoint  | ComputeDragPoint (const CRhinoMouseEventArgs &mouse)
bool  | Constrain (const ON_Arc &arc)
bool  | Constrain (const ON_Circle &circle)
bool  | Constrain (const ON_Curve &curve)
bool  | Constrain (const ON_Line &line)
void  | EnableObjectSnapCursors (bool enable)
void  | EnableOnObjectCursors (bool enable)
GripShape  | GetGripShape () const
ON_Color  | GripColor () const
ON_Color  | GripFillColor () const
ON_3dPoint  | GripLocation () const
float  | GripRadius () const
float  | GripShapeRotationRadians () const
float  | GripStrokeWidth () const
bool  | ObjectSnapCursorsEnabled () const
bool  | ObjectSnapPermitted () const
void  | OnMouseDown (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseEnter (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseLeave (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseMove (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseUp (const CRhinoMouseEventArgs &mouse) override
bool  | OnObjectCursorsEnabled () const
void  | PermitObjectSnap (bool permit)
void  | SetGripColor (const ON_Color &color)
void  | SetGripFillColor (const ON_Color &color)
void  | SetGripLocation (const ON_3dPoint &point)
void  | SetGripRadius (float radius)
void  | SetGripShape (GripShape shape)
void  | SetGripShapeRotationRadians (float angle)
void  | SetGripStrokeWidth (float width)
 Public Member Functions inherited from CRhinoUserInterfaceObject
CRhinoUserInterfaceObject ()
virtual  | ~CRhinoUserInterfaceObject ()
virtual bool  | AcceptsKeyboardFocus () const
void  | Animate (CRhinoAnimatingDouble &value, double target, double duration, AnimationStyle style, CRhinoDoc *doc)
void  | BindToActiveViewport (bool on)
void  | BindToViewport (unsigned int viewport_sn)
int  | DisplayOrder () const
ON_UUID  | DocumentGroupId () const
unsigned int  | DocumentRuntimeSerialNumber () const
bool  | GetData (const wchar_t *key, bool &value) const
bool  | GetData (const wchar_t *key, double &value) const
bool  | GetData (const wchar_t *key, int &value) const
bool  | GetData (const wchar_t *key, ON_UUID &value) const
bool  | GetData (const wchar_t *key, ON_wString &value) const
bool  | HasKeyboardFocus () const
bool  | HasMouseCapture () const
bool  | IsBoundToActiveViewport () const
unsigned int  | IsBoundToViewport () const
bool  | MoveKeyboardFocusToSibling (bool forward, CRhinoDoc *doc)
virtual bool  | OnCharacter (unsigned int character, unsigned int flags)
virtual void  | OnKeyboardFocusChanged (bool hasFocus)
virtual bool  | OnKeyDown (unsigned int virtualKey, unsigned int flags)
virtual void  | OnMouseClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDoubleClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseWheel (const CRhinoMouseEventArgs &mouse, int delta)
virtual CRhinoCommand::result  | OnRunCommand (const CRhinoCommandContext &context, const CRhinoMouseEventArgs &mouse)
virtual void  | OnTrackpadScroll (const CRhinoMouseEventArgs &mouse, float horizontal, float vertical)
CRhinoUserInterfaceObject *  | Parent ()
const CRhinoUserInterfaceObject *  | Parent () const
bool  | ReceivesMouseWheelEvents () const
bool  | ReceivesTrackpadScrollEvents () const
bool  | RegisterForAllDocuments ()
void  | RunCommand (const CRhinoMouseEventArgs &mouse)
unsigned int  | RuntimeSerialNumber () const
void  | SetCursor (HCURSOR cursor)
void  | SetData (const wchar_t *key, bool value)
void  | SetData (const wchar_t *key, const wchar_t *value)
void  | SetData (const wchar_t *key, double value)
void  | SetData (const wchar_t *key, int value)
void  | SetData (const wchar_t *key, ON_UUID value)
void  | SetDisplayOrder (int order)
void  | SetReceivesMouseWheelEvents (bool enable)
void  | SetReceivesTrackpadScrollEvents (bool enable)
void  | SetTooltip (const wchar_t *tooltip)
void  | SetVisible (bool visible)
bool  | UnregisterFromAllDocuments ()
bool  | Visible () const
 Additional Inherited Members
 Public Types inherited from CRhinoGripUserInterfaceObject
enum  | GripShape { GripShape::Circle = 0, GripShape::Square = 1, GripShape::Triangle = 2, GripShape::X = 3 }
 Public Types inherited from CRhinoUserInterfaceObject
enum  | FocusReason : int { FocusReason::Unknown = 0, FocusReason::Pointer = 1, FocusReason::Navigation = 2 }
 Static Public Member Functions inherited from CRhinoUserInterfaceObject
static void  | ClearKeyboardFocus (CRhinoDoc *doc)
static FocusReason  | KeyboardFocusReason ()
 Protected Member Functions inherited from CRhinoUserInterfaceObject
virtual void  | ContinueAnimate (CRhinoDoc *doc)
void  | ReleaseKeyboardFocus (CRhinoDoc *doc)
void  | SetKeyboardFocus (CRhinoDoc *doc, FocusReason reason=FocusReason::Unknown)
void  | SetMouseCapture (CRhinoDoc *doc)
 Protected Attributes inherited from CRhinoGripUserInterfaceObject
class CRhGripUserInterfaceObjectPrivate *  | m_grip_private = nullptr
 Protected Attributes inherited from CRhinoUserInterfaceObject
class CRhUserInterfaceObjectPrivate *  | m_private = nullptr
Constructor & Destructor Documentation
◆ CRhinoRotationGripUserInterfaceObject() [1/2]
 CRhinoRotationGripUserInterfaceObject::CRhinoRotationGripUserInterfaceObject  |  ( |   | )
◆ CRhinoRotationGripUserInterfaceObject() [2/2]
 CRhinoRotationGripUserInterfaceObject::CRhinoRotationGripUserInterfaceObject  |  ( |  const ON_Plane &  |  plane,
|  double  |  radius
)
◆ ~CRhinoRotationGripUserInterfaceObject()
 virtual CRhinoRotationGripUserInterfaceObject::~CRhinoRotationGripUserInterfaceObject  |  ( |   | )
virtual
Member Function Documentation
◆ ArcVisibleInViewport()
 bool CRhinoRotationGripUserInterfaceObject::ArcVisibleInViewport  |  ( |  const CRhinoViewport *  |  viewport | ) |   const
◆ Draw() [1/2]
 void CRhinoRotationGripUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | )
overridevirtual
Description: All user interface objects must implement a Draw function. This is where drawing using the input display pipeline is performed. The base class Draw function does nothing.
Reimplemented from CRhinoGripUserInterfaceObject.
◆ Draw() [2/2]
 void CRhinoRotationGripUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  const ON_Color &  |  color
)
◆ IsGripPointVisible()
 bool CRhinoRotationGripUserInterfaceObject::IsGripPointVisible  |  ( |   | ) |   const
◆ IsMouseOver()
 bool CRhinoRotationGripUserInterfaceObject::IsMouseOver  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Return true if the input mouse is considered to be over this object
Reimplemented from CRhinoGripUserInterfaceObject.
◆ OnDrag()
 void CRhinoRotationGripUserInterfaceObject::OnDrag  |  ( |  const ON_3dPoint &  |  point,
|  const CRhinoMouseEventArgs &  |  mouse
)
overridevirtual
Description: Gets called while the grip is being dragged to update the location. The default implementation calls SetGripLocation
Reimplemented from CRhinoGripUserInterfaceObject.
◆ OnRotationDrag()
 virtual void CRhinoRotationGripUserInterfaceObject::OnRotationDrag  |  ( |  double  |  angle,
|  const CRhinoMouseEventArgs &  |  mouse
)
virtual
◆ Plane()
 ON_Plane CRhinoRotationGripUserInterfaceObject::Plane  |  ( |   | ) |   const
◆ RotationRadius()
 double CRhinoRotationGripUserInterfaceObject::RotationRadius  |  ( |   | ) |   const
◆ SetGripPointVisible()
 void CRhinoRotationGripUserInterfaceObject::SetGripPointVisible  |  ( |  bool  |  on | )
◆ SetPlane()
 void CRhinoRotationGripUserInterfaceObject::SetPlane  |  ( |  const ON_Plane &  |  plane | )
◆ SetRotationRadius()
 void CRhinoRotationGripUserInterfaceObject::SetRotationRadius  |  ( |  double  |  radius | )