Public Member Functions | List of all members
CRhRdkBasicEnvironmentCCI Class Referenceabstract
RDK
#include <RhRdkBasicEnvironmentCCI.h>
 Inheritance diagram for CRhRdkBasicEnvironmentCCI:
 Public Member Functions
CRhRdkBasicEnvironmentCCI ()
virtual  | ~CRhRdkBasicEnvironmentCCI ()
virtual CRhRdkColor  | BackgroundColor (void) const
virtual bool  | DisableLighting (void) const
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual void *  | GetShader (const UUID &uuidRenderEngine, void *pvData) const =0
virtual bool  | GetSimulation (CRhRdkSimulatedEnvironment &) const
virtual bool  | IsBuiltIn (void) const
virtual UUID  | Kind (void) const
virtual CRhRdkSimulatedEnvironment::BackgroundProjections  | Projection (void) const
virtual void  | SetBackgroundColor (const CRhRdkColor &col)
virtual void  | SetProjection (CRhRdkSimulatedEnvironment::BackgroundProjections proj)
virtual void  | SetTexture (const CRhRdkTexture *pTexture)
virtual const CRhRdkTexture *  | Texture (void) const
 Public Member Functions inherited from CRhRdkCompoundContentImplementor
virtual UUID  | InterfaceId (void) const final override
virtual CRhRdkCompoundContentImplementor *  | NewInstance (void) const =0
virtual UUID  | TargetRenderEngineId (void) const =0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkBasicEnvironmentCCI()
 CRhRdkBasicEnvironmentCCI::CRhRdkBasicEnvironmentCCI  |  ( |   | )
◆ ~CRhRdkBasicEnvironmentCCI()
 virtual CRhRdkBasicEnvironmentCCI::~CRhRdkBasicEnvironmentCCI  |  ( |   | )
virtual
Member Function Documentation
◆ BackgroundColor()
 virtual CRhRdkColor CRhRdkBasicEnvironmentCCI::BackgroundColor  |  ( |  void  |   | ) |   const
virtual
◆ DisableLighting()
 virtual bool CRhRdkBasicEnvironmentCCI::DisableLighting  |  ( |  void  |   | ) |   const
virtual
Implements CRhRdkCompoundContentImplementor.
◆ EVF()
 virtual void* CRhRdkBasicEnvironmentCCI::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
Implements CRhRdkCompoundContentImplementor.
◆ GetShader()
 virtual void* CRhRdkBasicEnvironmentCCI::GetShader  |  ( |  const UUID &  |  uuidRenderEngine,
|  void *  |  pvData
) |   |  const
pure virtual
Returns
Shader for target renderer.
◆ GetSimulation()
 virtual bool CRhRdkBasicEnvironmentCCI::GetSimulation  |  ( |  CRhRdkSimulatedEnvironment &  |   | ) |   const
inlinevirtual
Modify an Proto_ON_Environment to simulate this environment as best you can.
◆ IsBuiltIn()
 virtual bool CRhRdkBasicEnvironmentCCI::IsBuiltIn  |  ( |  void  |   | ) |   const
inlinevirtual
Implements CRhRdkCompoundContentImplementor.
◆ Kind()
 virtual UUID CRhRdkBasicEnvironmentCCI::Kind  |  ( |  void  |   | ) |   const
virtual
Returns
The unique id for the kind of CCI.
Implements CRhRdkCompoundContentImplementor.
◆ Projection()
 virtual CRhRdkSimulatedEnvironment::BackgroundProjections CRhRdkBasicEnvironmentCCI::Projection  |  ( |  void  |   | ) |   const
virtual
◆ SetBackgroundColor()
 virtual void CRhRdkBasicEnvironmentCCI::SetBackgroundColor  |  ( |  const CRhRdkColor &  |  col | )
virtual
◆ SetProjection()
 virtual void CRhRdkBasicEnvironmentCCI::SetProjection  |  ( |  CRhRdkSimulatedEnvironment::BackgroundProjections  |  proj | )
virtual
◆ SetTexture()
 virtual void CRhRdkBasicEnvironmentCCI::SetTexture  |  ( |  const CRhRdkTexture *  |  pTexture | )
virtual
◆ Texture()
 virtual const CRhRdkTexture* CRhRdkBasicEnvironmentCCI::Texture  |  ( |  void  |   | ) |   const
virtual