Public Member Functions | Static Public Attributes | List of all members
ON_SubDComponentList Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentList ()=default
ON_SubDComponentList (const ON_SubDComponentList &)
~ON_SubDComponentList ()=default
const ON_SimpleArray< ON_SubDComponentPtr > &  | ComponentList () const
unsigned int  | Count () const
unsigned  | CreateFromComponentList (const ON_SubD &subd, const ON_SimpleArray< ON_COMPONENT_INDEX > &component_list)
unsigned  | CreateFromComponentList (const ON_SubD &subd, const ON_SimpleArray< ON_SubDComponentPtr > &component_list)
unsigned  | CreateFromMarkedComponents (const ON_SubD &subd, bool bComponentInListMark)
unsigned  | CreateFromMarkedEdges (const ON_SubD &subd, bool bEdgeInListMark)
unsigned  | CreateFromMarkedFaces (const ON_SubD &subd, bool bFaceInListMark)
unsigned  | CreateFromMarkedVertices (const ON_SubD &subd, bool bVertexInListMark)
unsigned  | CreateFromVertexIdList (const ON_SubD &subd, const ON_SimpleArray< unsigned > &free_vertex_ids)
unsigned  | CreateFromVertexList (const ON_SubD &subd, const ON_SimpleArray< const ON_SubDVertex * > &free_vertices)
unsigned  | CreateFromVertexList (const ON_SubD &subd, const ON_SimpleArray< ON_SubDVertexPtr > &free_vertices)
void  | Destroy ()
ON_SubDComponentList &  | operator= (const ON_SubDComponentList &)
const ON_SubDComponentPtr  | operator[] (int) const
const ON_SubDComponentPtr  | operator[] (ON__INT64) const
const ON_SubDComponentPtr  | operator[] (ON__UINT64) const
const ON_SubDComponentPtr  | operator[] (unsigned int) const
unsigned int  | RemoveAllComponents ()
unsigned int  | RemoveAllEdges ()
unsigned int  | RemoveAllFaces ()
unsigned int  | RemoveAllVertices ()
const ON_SubD &  | SubD () const
ON__UINT64  | SubDGeometryContentSerialNumber () const
ON__UINT64  | SubDRenderContentSerialNumber () const
ON__UINT64  | SubDRuntimeSerialNumber () const
void  | UpdateContentSerialNumbers ()
unsigned int  | UpdateSubDForExperts (const ON_SubD &subd, bool bUpdateDeletedComponents)
 Static Public Attributes
static const ON_SubDComponentList  | Empty
Detailed Description
ON_SubDComponentList
Constructor & Destructor Documentation
◆ ON_SubDComponentList() [1/2]
 ON_SubDComponentList::ON_SubDComponentList  |  ( |   | )
default
◆ ~ON_SubDComponentList()
 ON_SubDComponentList::~ON_SubDComponentList  |  ( |   | )
default
◆ ON_SubDComponentList() [2/2]
 ON_SubDComponentList::ON_SubDComponentList  |  ( |  const ON_SubDComponentList &  |   | )
Member Function Documentation
◆ ComponentList()
 const ON_SimpleArray< ON_SubDComponentPtr >& ON_SubDComponentList::ComponentList  |  ( |   | ) |   const
◆ Count()
 unsigned int ON_SubDComponentList::Count  |  ( |   | ) |   const
◆ CreateFromComponentList() [1/2]
 unsigned ON_SubDComponentList::CreateFromComponentList  |  ( |  const ON_SubD &  |  subd,
|  const ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_list
)
◆ CreateFromComponentList() [2/2]
 unsigned ON_SubDComponentList::CreateFromComponentList  |  ( |  const ON_SubD &  |  subd,
|  const ON_SimpleArray< ON_SubDComponentPtr > &  |  component_list
)
◆ CreateFromMarkedComponents()
 unsigned ON_SubDComponentList::CreateFromMarkedComponents  |  ( |  const ON_SubD &  |  subd,
|  bool  |  bComponentInListMark
)
◆ CreateFromMarkedEdges()
 unsigned ON_SubDComponentList::CreateFromMarkedEdges  |  ( |  const ON_SubD &  |  subd,
|  bool  |  bEdgeInListMark
)
◆ CreateFromMarkedFaces()
 unsigned ON_SubDComponentList::CreateFromMarkedFaces  |  ( |  const ON_SubD &  |  subd,
|  bool  |  bFaceInListMark
)
◆ CreateFromMarkedVertices()
 unsigned ON_SubDComponentList::CreateFromMarkedVertices  |  ( |  const ON_SubD &  |  subd,
|  bool  |  bVertexInListMark
)
◆ CreateFromVertexIdList()
 unsigned ON_SubDComponentList::CreateFromVertexIdList  |  ( |  const ON_SubD &  |  subd,
|  const ON_SimpleArray< unsigned > &  |  free_vertex_ids
)
◆ CreateFromVertexList() [1/2]
 unsigned ON_SubDComponentList::CreateFromVertexList  |  ( |  const ON_SubD &  |  subd,
|  const ON_SimpleArray< const ON_SubDVertex * > &  |  free_vertices
)
◆ CreateFromVertexList() [2/2]
 unsigned ON_SubDComponentList::CreateFromVertexList  |  ( |  const ON_SubD &  |  subd,
|  const ON_SimpleArray< ON_SubDVertexPtr > &  |  free_vertices
)
◆ Destroy()
 void ON_SubDComponentList::Destroy  |  ( |   | )
◆ operator=()
 ON_SubDComponentList& ON_SubDComponentList::operator=  |  ( |  const ON_SubDComponentList &  |   | )
◆ operator[]() [1/4]
 const ON_SubDComponentPtr ON_SubDComponentList::operator[]  |  ( |  int  |   | ) |   const
operator[] returns ON_SubDComponentPtr::Null when index is out of bounds.
◆ operator[]() [2/4]
 const ON_SubDComponentPtr ON_SubDComponentList::operator[]  |  ( |  ON__INT64  |   | ) |   const
◆ operator[]() [3/4]
 const ON_SubDComponentPtr ON_SubDComponentList::operator[]  |  ( |  ON__UINT64  |   | ) |   const
◆ operator[]() [4/4]
 const ON_SubDComponentPtr ON_SubDComponentList::operator[]  |  ( |  unsigned int  |   | ) |   const
◆ RemoveAllComponents()
 unsigned int ON_SubDComponentList::RemoveAllComponents  |  ( |   | )
Returns: Number of removed components.
◆ RemoveAllEdges()
 unsigned int ON_SubDComponentList::RemoveAllEdges  |  ( |   | )
Returns: Number of removed components.
◆ RemoveAllFaces()
 unsigned int ON_SubDComponentList::RemoveAllFaces  |  ( |   | )
Returns: Number of removed components.
◆ RemoveAllVertices()
 unsigned int ON_SubDComponentList::RemoveAllVertices  |  ( |   | )
Returns: Number of removed components.
◆ SubD()
 const ON_SubD& ON_SubDComponentList::SubD  |  ( |   | ) |   const
◆ SubDGeometryContentSerialNumber()
 ON__UINT64 ON_SubDComponentList::SubDGeometryContentSerialNumber  |  ( |   | ) |   const
Returns: SubD content serial number when this list was created or the last time UpdateContentSerialNumbers() was run.
◆ SubDRenderContentSerialNumber()
 ON__UINT64 ON_SubDComponentList::SubDRenderContentSerialNumber  |  ( |   | ) |   const
Returns: SubD content serial number when this list was created or the last time UpdateContentSerialNumbers() was run.
◆ SubDRuntimeSerialNumber()
 ON__UINT64 ON_SubDComponentList::SubDRuntimeSerialNumber  |  ( |   | ) |   const
Returns: SubD runtime serial number.
◆ UpdateContentSerialNumbers()
 void ON_SubDComponentList::UpdateContentSerialNumbers  |  ( |   | )
Description: Update the saved subd geometry and render content serial number to the current values of SubD().GeometryContentSerialNumber() and SubD().RenderContentSerialNumber().
◆ UpdateSubDForExperts()
 unsigned int ON_SubDComponentList::UpdateSubDForExperts  |  ( |  const ON_SubD &  |  subd,
|  bool  |  bUpdateDeletedComponents
)
Description: Change the component list to reference components in a different subd. Parameters: new_subd - [in] subd to replace current referenced subd bUpdateDeletedComponents - [in] false: current components that are deleted will be ignored. true: if the corresponding component in new_sub is not deleted, it will be added to the list. Returns: Number of components in list after updating.
Member Data Documentation
◆ Empty
 const ON_SubDComponentList ON_SubDComponentList::Empty
static