Classes | Static Public Member Functions | Static Protected Member Functions | List of all members
CRhinoGetDimLinear Class Reference
Rhino
Class to interactively get user input for linear dimensions. More...
#include <RhinoSdkDimLinear.h>
 Classes
class  | RhDocDimension
Undo record for GetDimLinear baseline and continue modes. More...
 Static Public Member Functions
static CRhinoCommand::result  | GetDimLinear (const unsigned int doc_sn, ON_DimLinear *&output_dimension, CRhinoObjRef objrefs[2], bool bInteractive, CRhinoDimLinear::rotation_mode &rotation_mode, double &rotation_angle, CRhinoDimLinear::continue_mode &continue_mode)
 Static Protected Member Functions
static void  | ClearDimToContinue (unsigned int doc_sn)
static const CRhinoDimLinear *  | DimToContinue (unsigned int doc_sn, int &direction)
static const RhDocDimension *  | GetDimRecToContinue (unsigned int doc_sn)
Functions used by GetDimLinear for baseline and continue modes. More...
static const CRhinoDimLinear *  | SelectDimToContinue (unsigned int doc_sn)
static void  | SetDimToContinue (unsigned int doc_sn, ON_UUID dim_id, int direction)
Detailed Description
Class to interactively get user input for linear dimensions.
Member Function Documentation
◆ ClearDimToContinue()
 static void CRhinoGetDimLinear::ClearDimToContinue  |  ( |  unsigned int  |  doc_sn | )
staticprotected
◆ DimToContinue()
 static const CRhinoDimLinear* CRhinoGetDimLinear::DimToContinue  |  ( |  unsigned int  |  doc_sn,
|  int &  |  direction
)
staticprotected
◆ GetDimLinear()
 static CRhinoCommand::result CRhinoGetDimLinear::GetDimLinear  |  ( |  const unsigned int  |  doc_sn,
|  ON_DimLinear *&  |  output_dimension,
|  CRhinoObjRef  |  objrefs[2],
|  bool  |  bInteractive,
|  CRhinoDimLinear::rotation_mode &  |  rotation_mode,
|  double &  |  rotation_angle,
|  CRhinoDimLinear::continue_mode &  |  continue_mode
)
static
Description: Gets a dimension rotated to either horizontal or vertical in the cplane Will allocate dim_out memory which caller must delete Parameters: doc_sn, [in] Serial no of the document for annotation styles and continued dimensions output_dimension [out] Resulting dimension objrefs[2], [out] ObjRefs of objects osnapped to or object picked to dimension bInteractive, [in] true: run in interactive mode false - run in script mode rotation_mode, [in] Ortho - dimension line is horizontal or vertical Rotated - dimension line is rotated to a specified angle Aligned - dimension line is parallel to line between definition points rotation_angle, [in] Angle in radians if RotationMode == Rotated continue_mode, [in/out] None - get a single dimension Continue - run in continue mode Baseline - run in baseline mode Returns: Failure: No dimension gotten Success: Got a dimension Undo: User requested an undo in continue or baseline mode
◆ GetDimRecToContinue()
 static const RhDocDimension* CRhinoGetDimLinear::GetDimRecToContinue  |  ( |  unsigned int  |  doc_sn | )
staticprotected
Functions used by GetDimLinear for baseline and continue modes.
◆ SelectDimToContinue()
 static const CRhinoDimLinear* CRhinoGetDimLinear::SelectDimToContinue  |  ( |  unsigned int  |  doc_sn | )
staticprotected
◆ SetDimToContinue()
 static void CRhinoGetDimLinear::SetDimToContinue  |  ( |  unsigned int  |  doc_sn,
|  ON_UUID  |  dim_id,
|  int  |  direction
)
staticprotected