Public Member Functions | List of all members
CRhRdkSdkContentSelector Class Reference
RDK
#include <RhRdkPlugIn.h>
 Public Member Functions
CRhRdkSdkContentSelector (const CRhinoDoc &doc, CRhRdkContent::Kinds kind, UINT_PTR uReserved=0)
RDK_DEPRECATED  | CRhRdkSdkContentSelector (const UUID &uuidTarget, const CRhinoDoc &doc, UINT_PTR uReserved=0)
virtual  | ~CRhRdkSdkContentSelector ()
virtual void *  | EVF (const wchar_t *, void *)
virtual bool  | GetSelection (CRhRdkInstanceIdArray &aContent) const
virtual bool  | SetSelection (const CRhRdkInstanceIdArray &aContent) const
virtual bool  | UnselectAllContent (void) const
Detailed Description
Provides access to the selected contents in the main content editor for a particular document and content kind.
Constructor & Destructor Documentation
◆ CRhRdkSdkContentSelector() [1/2]
 RDK_DEPRECATED CRhRdkSdkContentSelector::CRhRdkSdkContentSelector  |  ( |  const UUID &  |  uuidTarget,
|  const CRhinoDoc &  |  doc,
|  UINT_PTR  |  uReserved = 0
)
This constructor is deprecated and not implemented. Please use the other constructor.
◆ CRhRdkSdkContentSelector() [2/2]
 CRhRdkSdkContentSelector::CRhRdkSdkContentSelector  |  ( |  const CRhinoDoc &  |  doc,
|  CRhRdkContent::Kinds  |  kind,
|  UINT_PTR  |  uReserved = 0
)
Parameters
doc | is the document that contains the contents to be accessed.
kind | is the kind of contents to access.
uReserved | is reserved for future use and should be set to zero.
◆ ~CRhRdkSdkContentSelector()
 virtual CRhRdkSdkContentSelector::~CRhRdkSdkContentSelector  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* CRhRdkSdkContentSelector::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
◆ GetSelection()
 virtual bool CRhRdkSdkContentSelector::GetSelection  |  ( |  CRhRdkInstanceIdArray &  |  aContent | ) |   const
virtual
Gets the contents currently selected in the editor.
Parameters
aContent | accepts the content instance ids.
Returns
true if successful, else false.
◆ SetSelection()
 virtual bool CRhRdkSdkContentSelector::SetSelection  |  ( |  const CRhRdkInstanceIdArray &  |  aContent | ) |   const
virtual
Sets the content selection in the editor.
Parameters
aContent | specifies the instance ids of the contents to select.
Returns
true if successful, else false.
◆ UnselectAllContent()
 virtual bool CRhRdkSdkContentSelector::UnselectAllContent  |  ( |  void  |   | ) |   const
virtual
Unselects all the contents in the editor.
Returns
true if successful, else false.