Public Types | Public Member Functions | Static Public Attributes | List of all members
ON_3dmAnimationProperties Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Types
enum  | CaptureTypes : int {
 CaptureTypes::path = 0, CaptureTypes::turntable, CaptureTypes::flythrough, CaptureTypes::day_sun_study,
 CaptureTypes::seasonal_sun_study, CaptureTypes::none
 }
 Public Member Functions
ON_3dmAnimationProperties ()=default
ON_3dmAnimationProperties (const ON_3dmAnimationProperties &)=default
~ON_3dmAnimationProperties ()=default
ON_UUID  | CameraPathId (void) const
ON_3dPointArray &  | CameraPoints (void)
const ON_3dPointArray &  | CameraPoints (void) const
ON_wString  | CaptureMethod (void) const
CaptureTypes  | CaptureType (void) const
int  | CurrentFrame (void) const
ON_ClassArray< ON_wString > &  | Dates (void)
const ON_ClassArray< ON_wString > &  | Dates (void) const
int  | DaysBetweenFrames (void) const
ON_UUID  | DisplayMode (void) const
int  | EndDay (void) const
int  | EndHour (void) const
int  | EndMinutes (void) const
int  | EndMonth (void) const
int  | EndSeconds (void) const
int  | EndYear (void) const
ON_wString  | FileExtension (void) const
ON_wString  | FolderName (void) const
int  | FrameCount (void) const
ON_wString  | HtmlFilename (void) const
ON_ClassArray< ON_wString > &  | Images (void)
const ON_ClassArray< ON_wString > &  | Images (void) const
double  | Latitude (void) const
int  | LightIndex (void) const
double  | Longitude (void) const
int  | MinutesBetweenFrames (void) const
double  | NorthAngle (void) const
ON_3dmAnimationProperties &  | operator= (const ON_3dmAnimationProperties &)=default
bool  | Read (ON_BinaryArchive &)
bool  | RenderFull (void) const
bool  | RenderPreview (void) const
void  | SetCameraPathId (const ON_UUID &id)
void  | SetCaptureMethod (const ON_wString &s)
void  | SetCaptureType (CaptureTypes t)
void  | SetCurrentFrame (int i)
void  | SetDaysBetweenFrames (int i)
void  | SetDisplayMode (const ON_UUID &id)
void  | SetEndDay (int i)
void  | SetEndHour (int i)
void  | SetEndMinutes (int i)
void  | SetEndMonth (int i)
void  | SetEndSeconds (int i)
void  | SetEndYear (int i)
void  | SetFileExtension (const ON_wString &s)
void  | SetFolderName (const ON_wString &s)
void  | SetFrameCount (int i)
void  | SetHtmlFilename (const ON_wString &s)
void  | SetLatitude (double d)
void  | SetLightIndex (int i)
void  | SetLongitude (double d)
void  | SetMinutesBetweenFrames (int i)
void  | SetNorthAngle (double d)
void  | SetRenderFull (const bool b)
void  | SetRenderPreview (const bool b)
void  | SetStartDay (int i)
void  | SetStartHour (int i)
void  | SetStartMinutes (int i)
void  | SetStartMonth (int i)
void  | SetStartSeconds (int i)
void  | SetStartYear (int i)
void  | SetTargetPathId (const ON_UUID &id)
void  | SetViewportName (const ON_wString &s)
int  | StartDay (void) const
int  | StartHour (void) const
int  | StartMinutes (void) const
int  | StartMonth (void) const
int  | StartSeconds (void) const
int  | StartYear (void) const
ON_UUID  | TargetPathId (void) const
ON_3dPointArray &  | TargetPoints (void)
const ON_3dPointArray &  | TargetPoints (void) const
ON_wString  | ViewportName (void) const
bool  | Write (ON_BinaryArchive &) const
 Static Public Attributes
static const ON_3dmAnimationProperties  | Default
Detailed Description
ON_3dmAnimationProperties
Member Enumeration Documentation
◆ CaptureTypes
 enum ON_3dmAnimationProperties::CaptureTypes : int
strong
Enumerator
path
turntable
flythrough
day_sun_study
seasonal_sun_study
none
Constructor & Destructor Documentation
◆ ON_3dmAnimationProperties() [1/2]
 ON_3dmAnimationProperties::ON_3dmAnimationProperties  |  ( |   | )
default
◆ ~ON_3dmAnimationProperties()
 ON_3dmAnimationProperties::~ON_3dmAnimationProperties  |  ( |   | )
default
◆ ON_3dmAnimationProperties() [2/2]
 ON_3dmAnimationProperties::ON_3dmAnimationProperties  |  ( |  const ON_3dmAnimationProperties &  |   | )
default
Member Function Documentation
◆ CameraPathId()
 ON_UUID ON_3dmAnimationProperties::CameraPathId  |  ( |  void  |   | ) |   const
◆ CameraPoints() [1/2]
 ON_3dPointArray& ON_3dmAnimationProperties::CameraPoints  |  ( |  void  |   | )
◆ CameraPoints() [2/2]
 const ON_3dPointArray& ON_3dmAnimationProperties::CameraPoints  |  ( |  void  |   | ) |   const
◆ CaptureMethod()
 ON_wString ON_3dmAnimationProperties::CaptureMethod  |  ( |  void  |   | ) |   const
◆ CaptureType()
 CaptureTypes ON_3dmAnimationProperties::CaptureType  |  ( |  void  |   | ) |   const
◆ CurrentFrame()
 int ON_3dmAnimationProperties::CurrentFrame  |  ( |  void  |   | ) |   const
◆ Dates() [1/2]
 ON_ClassArray<ON_wString>& ON_3dmAnimationProperties::Dates  |  ( |  void  |   | )
◆ Dates() [2/2]
 const ON_ClassArray<ON_wString>& ON_3dmAnimationProperties::Dates  |  ( |  void  |   | ) |   const
◆ DaysBetweenFrames()
 int ON_3dmAnimationProperties::DaysBetweenFrames  |  ( |  void  |   | ) |   const
◆ DisplayMode()
 ON_UUID ON_3dmAnimationProperties::DisplayMode  |  ( |  void  |   | ) |   const
◆ EndDay()
 int ON_3dmAnimationProperties::EndDay  |  ( |  void  |   | ) |   const
◆ EndHour()
 int ON_3dmAnimationProperties::EndHour  |  ( |  void  |   | ) |   const
◆ EndMinutes()
 int ON_3dmAnimationProperties::EndMinutes  |  ( |  void  |   | ) |   const
◆ EndMonth()
 int ON_3dmAnimationProperties::EndMonth  |  ( |  void  |   | ) |   const
◆ EndSeconds()
 int ON_3dmAnimationProperties::EndSeconds  |  ( |  void  |   | ) |   const
◆ EndYear()
 int ON_3dmAnimationProperties::EndYear  |  ( |  void  |   | ) |   const
◆ FileExtension()
 ON_wString ON_3dmAnimationProperties::FileExtension  |  ( |  void  |   | ) |   const
◆ FolderName()
 ON_wString ON_3dmAnimationProperties::FolderName  |  ( |  void  |   | ) |   const
◆ FrameCount()
 int ON_3dmAnimationProperties::FrameCount  |  ( |  void  |   | ) |   const
◆ HtmlFilename()
 ON_wString ON_3dmAnimationProperties::HtmlFilename  |  ( |  void  |   | ) |   const
◆ Images() [1/2]
 ON_ClassArray<ON_wString>& ON_3dmAnimationProperties::Images  |  ( |  void  |   | )
◆ Images() [2/2]
 const ON_ClassArray<ON_wString>& ON_3dmAnimationProperties::Images  |  ( |  void  |   | ) |   const
◆ Latitude()
 double ON_3dmAnimationProperties::Latitude  |  ( |  void  |   | ) |   const
◆ LightIndex()
 int ON_3dmAnimationProperties::LightIndex  |  ( |  void  |   | ) |   const
◆ Longitude()
 double ON_3dmAnimationProperties::Longitude  |  ( |  void  |   | ) |   const
◆ MinutesBetweenFrames()
 int ON_3dmAnimationProperties::MinutesBetweenFrames  |  ( |  void  |   | ) |   const
◆ NorthAngle()
 double ON_3dmAnimationProperties::NorthAngle  |  ( |  void  |   | ) |   const
◆ operator=()
 ON_3dmAnimationProperties& ON_3dmAnimationProperties::operator=  |  ( |  const ON_3dmAnimationProperties &  |   | )
default
◆ Read()
 bool ON_3dmAnimationProperties::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ RenderFull()
 bool ON_3dmAnimationProperties::RenderFull  |  ( |  void  |   | ) |   const
◆ RenderPreview()
 bool ON_3dmAnimationProperties::RenderPreview  |  ( |  void  |   | ) |   const
◆ SetCameraPathId()
 void ON_3dmAnimationProperties::SetCameraPathId  |  ( |  const ON_UUID &  |  id | )
◆ SetCaptureMethod()
 void ON_3dmAnimationProperties::SetCaptureMethod  |  ( |  const ON_wString &  |  s | )
◆ SetCaptureType()
 void ON_3dmAnimationProperties::SetCaptureType  |  ( |  CaptureTypes  |  t | )
◆ SetCurrentFrame()
 void ON_3dmAnimationProperties::SetCurrentFrame  |  ( |  int  |  i | )
◆ SetDaysBetweenFrames()
 void ON_3dmAnimationProperties::SetDaysBetweenFrames  |  ( |  int  |  i | )
◆ SetDisplayMode()
 void ON_3dmAnimationProperties::SetDisplayMode  |  ( |  const ON_UUID &  |  id | )
◆ SetEndDay()
 void ON_3dmAnimationProperties::SetEndDay  |  ( |  int  |  i | )
◆ SetEndHour()
 void ON_3dmAnimationProperties::SetEndHour  |  ( |  int  |  i | )
◆ SetEndMinutes()
 void ON_3dmAnimationProperties::SetEndMinutes  |  ( |  int  |  i | )
◆ SetEndMonth()
 void ON_3dmAnimationProperties::SetEndMonth  |  ( |  int  |  i | )
◆ SetEndSeconds()
 void ON_3dmAnimationProperties::SetEndSeconds  |  ( |  int  |  i | )
◆ SetEndYear()
 void ON_3dmAnimationProperties::SetEndYear  |  ( |  int  |  i | )
◆ SetFileExtension()
 void ON_3dmAnimationProperties::SetFileExtension  |  ( |  const ON_wString &  |  s | )
◆ SetFolderName()
 void ON_3dmAnimationProperties::SetFolderName  |  ( |  const ON_wString &  |  s | )
◆ SetFrameCount()
 void ON_3dmAnimationProperties::SetFrameCount  |  ( |  int  |  i | )
◆ SetHtmlFilename()
 void ON_3dmAnimationProperties::SetHtmlFilename  |  ( |  const ON_wString &  |  s | )
◆ SetLatitude()
 void ON_3dmAnimationProperties::SetLatitude  |  ( |  double  |  d | )
◆ SetLightIndex()
 void ON_3dmAnimationProperties::SetLightIndex  |  ( |  int  |  i | )
◆ SetLongitude()
 void ON_3dmAnimationProperties::SetLongitude  |  ( |  double  |  d | )
◆ SetMinutesBetweenFrames()
 void ON_3dmAnimationProperties::SetMinutesBetweenFrames  |  ( |  int  |  i | )
◆ SetNorthAngle()
 void ON_3dmAnimationProperties::SetNorthAngle  |  ( |  double  |  d | )
◆ SetRenderFull()
 void ON_3dmAnimationProperties::SetRenderFull  |  ( |  const bool  |  b | )
◆ SetRenderPreview()
 void ON_3dmAnimationProperties::SetRenderPreview  |  ( |  const bool  |  b | )
◆ SetStartDay()
 void ON_3dmAnimationProperties::SetStartDay  |  ( |  int  |  i | )
◆ SetStartHour()
 void ON_3dmAnimationProperties::SetStartHour  |  ( |  int  |  i | )
◆ SetStartMinutes()
 void ON_3dmAnimationProperties::SetStartMinutes  |  ( |  int  |  i | )
◆ SetStartMonth()
 void ON_3dmAnimationProperties::SetStartMonth  |  ( |  int  |  i | )
◆ SetStartSeconds()
 void ON_3dmAnimationProperties::SetStartSeconds  |  ( |  int  |  i | )
◆ SetStartYear()
 void ON_3dmAnimationProperties::SetStartYear  |  ( |  int  |  i | )
◆ SetTargetPathId()
 void ON_3dmAnimationProperties::SetTargetPathId  |  ( |  const ON_UUID &  |  id | )
◆ SetViewportName()
 void ON_3dmAnimationProperties::SetViewportName  |  ( |  const ON_wString &  |  s | )
◆ StartDay()
 int ON_3dmAnimationProperties::StartDay  |  ( |  void  |   | ) |   const
◆ StartHour()
 int ON_3dmAnimationProperties::StartHour  |  ( |  void  |   | ) |   const
◆ StartMinutes()
 int ON_3dmAnimationProperties::StartMinutes  |  ( |  void  |   | ) |   const
◆ StartMonth()
 int ON_3dmAnimationProperties::StartMonth  |  ( |  void  |   | ) |   const
◆ StartSeconds()
 int ON_3dmAnimationProperties::StartSeconds  |  ( |  void  |   | ) |   const
◆ StartYear()
 int ON_3dmAnimationProperties::StartYear  |  ( |  void  |   | ) |   const
◆ TargetPathId()
 ON_UUID ON_3dmAnimationProperties::TargetPathId  |  ( |  void  |   | ) |   const
◆ TargetPoints() [1/2]
 ON_3dPointArray& ON_3dmAnimationProperties::TargetPoints  |  ( |  void  |   | )
◆ TargetPoints() [2/2]
 const ON_3dPointArray& ON_3dmAnimationProperties::TargetPoints  |  ( |  void  |   | ) |   const
◆ ViewportName()
 ON_wString ON_3dmAnimationProperties::ViewportName  |  ( |  void  |   | ) |   const
◆ Write()
 bool ON_3dmAnimationProperties::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ Default
 const ON_3dmAnimationProperties ON_3dmAnimationProperties::Default
static