Public Member Functions | List of all members
CRhRdkTextureKindList Class Reference
RDK
#include <RhRdkContentKindList.h>
 Inheritance diagram for CRhRdkTextureKindList:
 Public Member Functions
CRhRdkTextureKindList ()
 Public Member Functions inherited from CRhRdkContentKindList
CRhRdkContentKindList ()
CRhRdkContentKindList (const CRhRdkContentKindList &)
CRhRdkContentKindList (CRhRdkContent::Kinds kind)
virtual  | ~CRhRdkContentKindList ()
virtual void  | Add (CRhRdkContent::Kinds kind)
virtual void  | AddAllKinds (void)
virtual bool  | Contains (CRhRdkContent::Kinds kind) const
virtual int  | Count (void) const
const CRhRdkContentKindList &  | operator= (const CRhRdkContentKindList &other)
CRhRdkContent::Kinds  | operator[] (int index) const
virtual void  | Remove (CRhRdkContent::Kinds kind)
virtual bool  | SetFromSemicolonDelimitedString (const wchar_t *wsz)
virtual CRhRdkContent::Kinds  | SingleKind (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkContentKindList
static bool  | IsSupportedKind (CRhRdkContent::Kinds kind)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This class makes it easy to get a content kind list for just textures.
Constructor & Destructor Documentation
◆ CRhRdkTextureKindList()
 CRhRdkTextureKindList::CRhRdkTextureKindList  |  ( |   | )