Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiPopuUpListBox Class Reference
RhinoUI
CRhinoUiPopuUpListBox. More...
#include <RhinoSdkUiPopuUpListBox.h>
 Inheritance diagram for CRhinoUiPopuUpListBox:
 Public Member Functions
CRhinoUiPopuUpListBox ()
virtual  | ~CRhinoUiPopuUpListBox ()
void  | EnableSelectOnMouseMove (bool enable=true)
int  | LeftButtonDownOnX () const
afx_msg void  | OnChar (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
int  | PageCount () const
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
int  | RowFromPoint (CPoint point, int &row) const
bool  | SelectOnMouseMove () const
int  | WidestString () const
 Public Attributes
CFont  | m_font
 Protected Member Functions
class CRhinoUiPopUpListWnd *  | PopUpWindow ()
 Protected Attributes
bool  | m_adjust_width
int  | m_lbutton_donw_on_x
int  | m_lbutton_down_on_item
CRhinoUiPopUpListWnd *  | m_list_wnd
bool  | m_select_on_mouse_move
 Friends
class  | CRhinoUiPopUpListWnd
Detailed Description
CRhinoUiPopuUpListBox.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiPopuUpListBox()
 CRhinoUiPopuUpListBox::CRhinoUiPopuUpListBox  |  ( |   | )
◆ ~CRhinoUiPopuUpListBox()
 virtual CRhinoUiPopuUpListBox::~CRhinoUiPopuUpListBox  |  ( |   | )
virtual
Member Function Documentation
◆ EnableSelectOnMouseMove()
 void CRhinoUiPopuUpListBox::EnableSelectOnMouseMove  |  ( |  bool  |  enable = true | )
◆ LeftButtonDownOnX()
 int CRhinoUiPopuUpListBox::LeftButtonDownOnX  |  ( |   | ) |   const
◆ OnChar()
 afx_msg void CRhinoUiPopuUpListBox::OnChar  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnCreate()
 afx_msg int CRhinoUiPopuUpListBox::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnKeyDown()
 afx_msg void CRhinoUiPopuUpListBox::OnKeyDown  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
◆ OnKillFocus()
 afx_msg void CRhinoUiPopuUpListBox::OnKillFocus  |  ( |  CWnd *  |  pNewWnd | )
◆ OnLButtonDown()
 afx_msg void CRhinoUiPopuUpListBox::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonUp()
 afx_msg void CRhinoUiPopuUpListBox::OnLButtonUp  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseMove()
 afx_msg void CRhinoUiPopuUpListBox::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnMouseWheel()
 afx_msg BOOL32 CRhinoUiPopuUpListBox::OnMouseWheel  |  ( |  UINT  |  nFlags,
|  short  |  zDelta,
|  CPoint  |  pt
)
◆ PageCount()
 int CRhinoUiPopuUpListBox::PageCount  |  ( |   | ) |   const
◆ PopUpWindow()
 class CRhinoUiPopUpListWnd* CRhinoUiPopuUpListBox::PopUpWindow  |  ( |   | )
protected
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiPopuUpListBox::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ RowFromPoint()
 int CRhinoUiPopuUpListBox::RowFromPoint  |  ( |  CPoint  |  point,
|  int &  |  row
) |   |  const
◆ SelectOnMouseMove()
 bool CRhinoUiPopuUpListBox::SelectOnMouseMove  |  ( |   | ) |   const
◆ WidestString()
 int CRhinoUiPopuUpListBox::WidestString  |  ( |   | ) |   const
Friends And Related Function Documentation
◆ CRhinoUiPopUpListWnd
 friend class CRhinoUiPopUpListWnd
friend
Member Data Documentation
◆ m_adjust_width
 bool CRhinoUiPopuUpListBox::m_adjust_width
protected
◆ m_font
 CFont CRhinoUiPopuUpListBox::m_font
◆ m_lbutton_donw_on_x
 int CRhinoUiPopuUpListBox::m_lbutton_donw_on_x
protected
◆ m_lbutton_down_on_item
 int CRhinoUiPopuUpListBox::m_lbutton_down_on_item
protected
◆ m_list_wnd
 CRhinoUiPopUpListWnd* CRhinoUiPopuUpListBox::m_list_wnd
protected
◆ m_select_on_mouse_move
 bool CRhinoUiPopuUpListBox::m_select_on_mouse_move
protected