Public Member Functions | Protected Attributes | List of all members
CGetRhinoProfileContextIterator Class Reference
RhinoUI
#include <rhinoSdkUiProfileContext.h>
 Public Member Functions
CGetRhinoProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CGetRhinoProfileContextIterator ()
CRhinoProfileContextIterator *  | Iterator () const
 Protected Attributes
CRhinoProfileContextIterator *  | m_pIterator
Detailed Description
class CGetRhinoProfileContextIterator
This is a simple utility class for getting and deleting a CRhinoProfileContextIterator associated with a CRhinoProfileContext;
Constructor & Destructor Documentation
◆ CGetRhinoProfileContextIterator()
 CGetRhinoProfileContextIterator::CGetRhinoProfileContextIterator  |  ( |  const wchar_t *  |  section,
|  CRhinoProfileContext &  |  pc
)
◆ ~CGetRhinoProfileContextIterator()
 virtual CGetRhinoProfileContextIterator::~CGetRhinoProfileContextIterator  |  ( |   | )
virtual
Member Function Documentation
◆ Iterator()
 CRhinoProfileContextIterator* CGetRhinoProfileContextIterator::Iterator  |  ( |   | ) |   const
Member Data Documentation
◆ m_pIterator
 CRhinoProfileContextIterator* CGetRhinoProfileContextIterator::m_pIterator
protected