Public Member Functions | List of all members
CRhinoUiMemDC Class Reference
RhinoUI
#include <RhinoSdkUiMemDC.h>
 Inheritance diagram for CRhinoUiMemDC:
 Public Member Functions
CRhinoUiMemDC (CDC *pDC, const CRect *pRect=NULL)
~CRhinoUiMemDC (void)
COLORREF  | MaskingColor () const
operator CRhinoUiMemDC * ()
CRhinoUiMemDC *  | operator-> ()
void  | SetMaskingColor (COLORREF cr)
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiMemDC()
 CRhinoUiMemDC::CRhinoUiMemDC  |  ( |  CDC *  |  pDC,
|  const CRect *  |  pRect = NULL
)
◆ ~CRhinoUiMemDC()
 CRhinoUiMemDC::~CRhinoUiMemDC  |  ( |  void  |   | )
Member Function Documentation
◆ MaskingColor()
 COLORREF CRhinoUiMemDC::MaskingColor  |  ( |   | ) |   const
◆ operator CRhinoUiMemDC *()
 CRhinoUiMemDC::operator CRhinoUiMemDC *  |  ( |   | )
◆ operator->()
 CRhinoUiMemDC* CRhinoUiMemDC::operator->  |  ( |   | )
◆ SetMaskingColor()
 void CRhinoUiMemDC::SetMaskingColor  |  ( |  COLORREF  |  cr | )