Public Member Functions | List of all members
ON_ParticleSystem::ON_ParticleIterator Class Reference
#include <opennurbs_plus_particle.h>
 Public Member Functions
ON_ParticleIterator (ON_ParticleSystem &particle_system)
const class ON_ParticleSystem::ON_Particle *  | First ()
const class ON_ParticleSystem::ON_Particle *  | Next ()
void  | Reset ()
Constructor & Destructor Documentation
◆ ON_ParticleIterator()
 ON_ParticleSystem::ON_ParticleIterator::ON_ParticleIterator  |  ( |  ON_ParticleSystem &  |  particle_system | )
Member Function Documentation
◆ First()
 const class ON_ParticleSystem::ON_Particle* ON_ParticleSystem::ON_ParticleIterator::First  |  ( |   | )
◆ Next()
 const class ON_ParticleSystem::ON_Particle* ON_ParticleSystem::ON_ParticleIterator::Next  |  ( |   | )
◆ Reset()
 void ON_ParticleSystem::ON_ParticleIterator::Reset  |  ( |   | )