Public Attributes | List of all members
ON_FaceNameKey Class Reference
OpenNURBS
#include <opennurbs_textiterator.h>
 Public Attributes
unsigned int  | m_charset = 0
unsigned int  | m_codepage = 1252
int  | m_rtf_font_index = -1
ON_wString  | m_rtf_font_name
Member Data Documentation
◆ m_charset
 unsigned int ON_FaceNameKey::m_charset = 0
◆ m_codepage
 unsigned int ON_FaceNameKey::m_codepage = 1252
◆ m_rtf_font_index
 int ON_FaceNameKey::m_rtf_font_index = -1
◆ m_rtf_font_name
 ON_wString ON_FaceNameKey::m_rtf_font_name
In reality, the RTF "face" name can be a PostScript name, LOGFONT.lfFaceName, DWrite Family Name, and probably more. It depends on what tool is used to create the RTF and we see all three of the above names in Rhino parsing and the current Eto Text controls generate RTF with all three of those "names" OS version.