Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiModlessDockingDialogManager Class Reference
RhinoUI
#include <RhinoSdkUiPageDockBarManager.h>
 Public Member Functions
CRhinoUiModlessDockingDialogManager ()
virtual  | ~CRhinoUiModlessDockingDialogManager ()
int  | AddDockingDialog (UUID uuidDockBar, const wchar_t *lpsCaption, UUID uuid, int nImage, LPCTSTR lpszTemplateName, LPCTSTR szHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
int  | AddDockingDialog (UUID uuidDockBar, const wchar_t *lpsCaption, UUID uuid, int nImage, UINT nIDTemplate, UINT nHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
CRhinoUiPageDockBar *  | GetPageDockBarFromRecordIndex (int iRecIndex) const
const CRhinoUiModlessDockingDialogRecord *  | GetRecord (const CDialog *pPage) const
const CRhinoUiModlessDockingDialogRecord *  | GetRecord (int nItem) const
const CRhinoUiModlessDockingDialogRecord *  | GetRecord (UUID uuid) const
int  | GetRecordCount () const
 Protected Member Functions
CRhinoUiModlessDockingDialogManager (const CRhinoUiModlessDockingDialogManager &)
Not implemented. More...
int  | AddDockingDialog (UUID uuidDockBar, const wchar_t *lpsCaption, UUID uuid, int nImage, UINT nIDTemplate, LPCTSTR lpszTemplateName, UINT nHtmlResID, LPCTSTR szHtmlResID, CRuntimeClass *pRC, AFX_MODULE_STATE *pMS)
CRhinoUiModlessDockingDialogManager &  | operator= (const CRhinoUiModlessDockingDialogManager &)
 Protected Attributes
ON_ClassArray< CRhinoUiModlessDockingDialogRecord >  | m_item_list
Detailed Description
class CRhinoUiModelessDockingDialog
Constructor & Destructor Documentation
◆ CRhinoUiModlessDockingDialogManager() [1/2]
 CRhinoUiModlessDockingDialogManager::CRhinoUiModlessDockingDialogManager  |  ( |   | )
◆ ~CRhinoUiModlessDockingDialogManager()
 virtual CRhinoUiModlessDockingDialogManager::~CRhinoUiModlessDockingDialogManager  |  ( |   | )
virtual
◆ CRhinoUiModlessDockingDialogManager() [2/2]
 CRhinoUiModlessDockingDialogManager::CRhinoUiModlessDockingDialogManager  |  ( |  const CRhinoUiModlessDockingDialogManager &  |   | )
protected
Not implemented.
Member Function Documentation
◆ AddDockingDialog() [1/3]
 int CRhinoUiModlessDockingDialogManager::AddDockingDialog  |  ( |  UUID  |  uuidDockBar,
|  const wchar_t *  |  lpsCaption,
|  UUID  |  uuid,
|  int  |  nImage,
|  LPCTSTR  |  lpszTemplateName,
|  LPCTSTR  |  szHtmlResID,
|  CRuntimeClass *  |  pRC,
|  AFX_MODULE_STATE *  |  pMS
)
Description: Add new page to bottom of tab stack.
Parameters: lpsCaption [in] Tab caption nImage [in] Index of image to display to left of caption lpszTemplateName [in] The null-terminated string that is the name of a dialog-box template resource. szHtmlResID [in] The null-terminated string that is the name of an HTML resource. nIDTemplate [in] Contains the ID number of a dialog-box template resource. nHtmlResID [in] Contains the ID number of an HTML resource. pRC [in] Class to create and add to control. Use RUNTIME_CLASS( CMyClass) macro to format this parameter. Class decloration must include DECLARE_DYNCREATE(CMyClass) macro. Class implementation must include IMPLEMENT_DYNCREATE(CMyClass, CRhinoUiDialog) macro. pMS [in] This must be your DLL application module state.
Returns: Returns record index if successful; otherwise -1
See Also: CRhinoUiExpandableTabCtrl::InsertItem() AfxGetStaticModuleState()
◆ AddDockingDialog() [2/3]
 int CRhinoUiModlessDockingDialogManager::AddDockingDialog  |  ( |  UUID  |  uuidDockBar,
|  const wchar_t *  |  lpsCaption,
|  UUID  |  uuid,
|  int  |  nImage,
|  UINT  |  nIDTemplate,
|  LPCTSTR  |  lpszTemplateName,
|  UINT  |  nHtmlResID,
|  LPCTSTR  |  szHtmlResID,
|  CRuntimeClass *  |  pRC,
|  AFX_MODULE_STATE *  |  pMS
)
protected
◆ AddDockingDialog() [3/3]
 int CRhinoUiModlessDockingDialogManager::AddDockingDialog  |  ( |  UUID  |  uuidDockBar,
|  const wchar_t *  |  lpsCaption,
|  UUID  |  uuid,
|  int  |  nImage,
|  UINT  |  nIDTemplate,
|  UINT  |  nHtmlResID,
|  CRuntimeClass *  |  pRC,
|  AFX_MODULE_STATE *  |  pMS
)
◆ GetPageDockBarFromRecordIndex()
 CRhinoUiPageDockBar* CRhinoUiModlessDockingDialogManager::GetPageDockBarFromRecordIndex  |  ( |  int  |  iRecIndex | ) |   const
◆ GetRecord() [1/3]
 const CRhinoUiModlessDockingDialogRecord* CRhinoUiModlessDockingDialogManager::GetRecord  |  ( |  const CDialog *  |  pPage | ) |   const
Description: Get the tab control item associated with a particular page.
Parameters: pPage [in] Page to search for.
Returns: Return valid pointer if the dialog page is found or NULL if not.
See Also: CRhinoUiExpandableTabCtrl::GetItemCount()
◆ GetRecord() [2/3]
 const CRhinoUiModlessDockingDialogRecord* CRhinoUiModlessDockingDialogManager::GetRecord  |  ( |  int  |  nItem | ) |   const
Description: Get the tab control item associated with a particular index.
Parameters: nItem [in] Index of item to get.
Returns: Return valid pointer if nItem is valid or NULL if not.
See Also: CRhinoUiExpandableTabCtrl::GetItemCount()
◆ GetRecord() [3/3]
 const CRhinoUiModlessDockingDialogRecord* CRhinoUiModlessDockingDialogManager::GetRecord  |  ( |  UUID  |  uuid | ) |   const
Description: Get the tab control item associated with a particular UUID.
Parameters: uuid [in] UUID of item to get.
Returns: Return valid pointer if a record with the specified UUID is found or NULL if not.
See Also: CRhinoUiExpandableTabCtrl::GetItemCount()
◆ GetRecordCount()
 int CRhinoUiModlessDockingDialogManager::GetRecordCount  |  ( |   | ) |   const
Description: Number of tabs currently added to this control. Includes hidden tabs.
Returns: Returns number of items in tab control including hidden items.
◆ operator=()
 CRhinoUiModlessDockingDialogManager& CRhinoUiModlessDockingDialogManager::operator=  |  ( |  const CRhinoUiModlessDockingDialogManager &  |   | )
protected
Member Data Documentation
◆ m_item_list
 ON_ClassArray<CRhinoUiModlessDockingDialogRecord> CRhinoUiModlessDockingDialogManager::m_item_list
protected