Public Member Functions | Public Attributes | List of all members
CRhinoMeshObjectsUI Class Referenceabstract
Rhino
#include <rhinoSdkMeshObject.h>
 Inheritance diagram for CRhinoMeshObjectsUI:
 Public Member Functions
CRhinoMeshObjectsUI ()
virtual  | ~CRhinoMeshObjectsUI ()
virtual CRhinoCommand::result  | GetMeshParameters (const ON_SimpleArray< const CRhinoObject * > &objects, ON_MeshParameters &mp)=0
bool  | OnCancelPreview ()
int  | OnPreview (const ON_MeshParameters &mp)
 Public Attributes
class CRhinoMeshWorkerThread *  | m__meshworker
Pretend these are private. Don't look and don't touch. More...
AFX_MODULE_STATE *  | m__pModuleState
Constructor & Destructor Documentation
◆ CRhinoMeshObjectsUI()
 CRhinoMeshObjectsUI::CRhinoMeshObjectsUI  |  ( |   | )
◆ ~CRhinoMeshObjectsUI()
 virtual CRhinoMeshObjectsUI::~CRhinoMeshObjectsUI  |  ( |   | )
virtual
Member Function Documentation
◆ GetMeshParameters()
 virtual CRhinoCommand::result CRhinoMeshObjectsUI::GetMeshParameters  |  ( |  const ON_SimpleArray< const CRhinoObject * > &  |  objects,
|  ON_MeshParameters &  |  mp
)
pure virtual
Description: Provides the user interface that gets meshing parameters. Parameters: objects - [in] objects being meshed mp - [out] meshing parameters. Returns: CRhinoCommand::success if the mesh parameters returned in mp should be used to create meshes.
CRhinoCommand::cancel if the user canceled.
Implemented in CRhinoMeshStlUI.
◆ OnCancelPreview()
 bool CRhinoMeshObjectsUI::OnCancelPreview  |  ( |   | )
Description: Call to cancel mesh calculations happening during a call to OnPreview(). Returns: True if preview meshes were begin calculated and the calculation was canceled.
◆ OnPreview()
 int CRhinoMeshObjectsUI::OnPreview  |  ( |  const ON_MeshParameters &  |  mp | )
Description: Call this function if you want a visual preview of the meshes created from the settings in mp. Returns: 0: OnCancelPreview() canceled the mesh calculation. 1: successful preview mesh creation. 2: User pressed ESC key.
 Return CRhinoCommand::cancel immediately.
Member Data Documentation
◆ m__meshworker
 class CRhinoMeshWorkerThread* CRhinoMeshObjectsUI::m__meshworker
Pretend these are private. Don't look and don't touch.
◆ m__pModuleState
 AFX_MODULE_STATE* CRhinoMeshObjectsUI::m__pModuleState