Public Member Functions | Protected Attributes | List of all members
CRhRdkOneColorEvaluator Class Referenceabstract
RDK
#include <RhRdkTwoColorTextureBase.h>
 Inheritance diagram for CRhRdkOneColorEvaluator:
 Public Member Functions
CRhRdkOneColorEvaluator (const class CRhRdkOneColorTextureBase &texture, CEvalFlags ef, bool bCreateTexEvals=true)
virtual  | ~CRhRdkOneColorEvaluator ()
virtual const CRhRdkColor &  | Color1 (void) const
virtual void  | DeleteThis (void)
virtual void *  | EVF (const wchar_t *, void *)
virtual bool  | GetColor (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, CRhRdkColor &colOut, void *pvData=nullptr) const
virtual bool  | GetColor2 (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, CRhRdkColor &colOut, void *pvData=nullptr) const
virtual CRhRdkColor  | GetColorSample (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, void *) const =0
virtual const ON_Xform &  | LocalMappingTransform (void) const
virtual CRhRdkColor  | OutputColor (int colorNumber, const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, void *) const
virtual bool  | RegisterChildCallback (IChildCallback *pChildCallback, const CRhRdkTexture &texture, void *pvData)
virtual double  | TextureAmount1 (void) const
virtual bool  | TextureOn1 (void) const
 Public Member Functions inherited from CRhRdkTextureEvaluator
bool  | AdjustmentOn (void) const
virtual const IChildCallback *  | ChildCallback (void) const override
const CEvalFlags &  | EvaluatorFlags (void) const
bool  | FilteringOn (void) const
virtual bool  | Initialize (void) override
bool  | LocalMappingOn (void) const
bool  | ProjectionChangeOn (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkTextureEvaluator
bool  | WriteByteArray (const ON_2iSize &size, unsigned char *buffer) const
bool  | WriteFloatArray (const ON_2iSize &size, float *buffer) const
 Protected Attributes
class CRhRdkOneColorEvaluatorImpl *  | m_pImpl1
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkTextureEvaluator
CRhRdkTextureEvaluator (IRhRdkTextureEvaluator::CEvalFlags ef)
virtual  | ~CRhRdkTextureEvaluator ()
 Protected Member Functions inherited from IRhRdkTextureEvaluator
virtual  | ~IRhRdkTextureEvaluator ()
Constructor & Destructor Documentation
◆ CRhRdkOneColorEvaluator()
 CRhRdkOneColorEvaluator::CRhRdkOneColorEvaluator  |  ( |  const class CRhRdkOneColorTextureBase &  |  texture,
|  CEvalFlags  |  ef,
|  bool  |  bCreateTexEvals = true
)
◆ ~CRhRdkOneColorEvaluator()
 virtual CRhRdkOneColorEvaluator::~CRhRdkOneColorEvaluator  |  ( |   | )
virtual
Member Function Documentation
◆ Color1()
 virtual const CRhRdkColor& CRhRdkOneColorEvaluator::Color1  |  ( |  void  |   | ) |   const
virtual
◆ DeleteThis()
 virtual void CRhRdkOneColorEvaluator::DeleteThis  |  ( |  void  |   | )
inlinevirtual
You must implement this method as
delete this;
Implements IRhRdkTextureEvaluator.
◆ EVF()
 virtual void* CRhRdkOneColorEvaluator::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
virtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkTextureEvaluator.
◆ GetColor()
 virtual bool CRhRdkOneColorEvaluator::GetColor  |  ( |  const ON_3dPoint &  |  uvw,
|  const ON_3dVector &  |  duvwdx,
|  const ON_3dVector &  |  duvwdy,
|  CRhRdkColor &  |  colOut,
|  void *  |  pvData = nullptr
) |   |  const
virtual
Get the color of the texture at a particular point in uvw space. May be called from within a rendering shade pipeline.
Parameters
uvw | is the point for which to evaluate the texture.
duvwdx | is a ray differential.
duvwdy | is a ray differential.
colOut | receives the texture color.
Note
For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
Returns
true if the color was retrieved successfully, else false. It is important to only return false if the function fails catastrophically. A black value outside some threshold is not a failure case. If the first call returns false, the entire evaluation will fail. If you return false you must leave colOut untouched.
Implements IRhRdkTextureEvaluator.
◆ GetColor2()
 virtual bool CRhRdkOneColorEvaluator::GetColor2  |  ( |  const ON_3dPoint &  |  uvw,
|  const ON_3dVector &  |  duvwdx,
|  const ON_3dVector &  |  duvwdy,
|  CRhRdkColor &  |  colOut,
|  void *  |  pvData = nullptr
) |   |  const
virtual
◆ GetColorSample()
 virtual CRhRdkColor CRhRdkOneColorEvaluator::GetColorSample  |  ( |  const ON_3dPoint &  |  uvw,
|  const ON_3dVector &  |  duvwdx,
|  const ON_3dVector &  |  duvwdy,
|  void *
) |   |  const
pure virtual
◆ LocalMappingTransform()
 virtual const ON_Xform& CRhRdkOneColorEvaluator::LocalMappingTransform  |  ( |  void  |   | ) |   const
virtual
◆ OutputColor()
 virtual CRhRdkColor CRhRdkOneColorEvaluator::OutputColor  |  ( |  int  |  colorNumber,
|  const ON_3dPoint &  |  uvw,
|  const ON_3dVector &  |  duvwdx,
|  const ON_3dVector &  |  duvwdy,
|  void *
) |   |  const
virtual
Reimplemented in CRhRdkTwoColorEvaluator.
◆ RegisterChildCallback()
 virtual bool CRhRdkOneColorEvaluator::RegisterChildCallback  |  ( |  IChildCallback *  |  pChildCallback,
|  const CRhRdkTexture &  |  texture,
|  void *  |  pvData
)
virtual
Implements IRhRdkTextureEvaluator::RegisterChildCallback().
Reimplemented from CRhRdkTextureEvaluator.
Reimplemented in CRhRdkTwoColorEvaluator.
◆ TextureAmount1()
 virtual double CRhRdkOneColorEvaluator::TextureAmount1  |  ( |  void  |   | ) |   const
virtual
◆ TextureOn1()
 virtual bool CRhRdkOneColorEvaluator::TextureOn1  |  ( |  void  |   | ) |   const
virtual
Member Data Documentation
◆ m_pImpl1
 class CRhRdkOneColorEvaluatorImpl* CRhRdkOneColorEvaluator::m_pImpl1
protected