Public Member Functions | List of all members
IRhinoSdkRenderFrameEx2 Class Referenceabstract
Rhino
Alpha support added when saving rendered image. More...
#include <RhinoSdkRenderFrame.h>
 Inheritance diagram for IRhinoSdkRenderFrameEx2:
 Public Member Functions
virtual bool  | SaveRenderImageAs (const wchar_t *lpsFileName) const=0
virtual bool  | SaveRenderImageAs (const wchar_t *lpsFileName, bool bUseAlpha) const =0
 Public Member Functions inherited from IRhinoSdkRenderFrameEx
virtual const class IRhRdkRenderSession *  | RenderSession (void) const =0
virtual class IRhRdkRenderSession *  | RenderSession (void)=0
virtual const class IRhRdkRenderWindow *  | RenderWindow (void) const =0
virtual class IRhRdkRenderWindow *  | RenderWindow (void)=0
 Public Member Functions inherited from IRhinoSdkRenderFrame
virtual bool  | CopyRenderWindowToClipboard () const =0
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
virtual ON_2iSize  | ImageSize () const =0
virtual bool  | IsRendering () const =0
virtual void  | MakeModal (bool bModal)=0
virtual bool  | SaveRenderImageAs (const wchar_t *lpsFileName) const =0
virtual void  | SetImageSize (const ON_2iSize &)=0
virtual void  | SetPlugIn (CRhinoRenderPlugIn *pPlugIn)=0
virtual void  | SetRenderCommand (CRhinoSdkRender *pRenderCommand)=0
virtual void  | SetSaveOnClose (bool bSave)=0
virtual void  | SetView (const ON_3dmView &view)=0
virtual bool  | StartRendering ()=0
virtual void  | StopRendering ()=0
virtual const ON_3dmView &  | View () const =0
 Public Member Functions inherited from IRhinoWindow
virtual  | ~IRhinoWindow ()=default
virtual bool  | Create (const CRhinoWindowCreateOptions &options)=0
virtual bool  | Created () const =0
virtual bool  | Destroy ()=0
virtual const wchar_t *  | EnglishCaption () const =0
virtual void  | GetScreenCoords (ON_4iRect &rectOut) const =0
virtual RHINO_WINDOW_HANDLE  | Handle (void)=0
virtual bool  | IsEnabled () const =0
virtual bool  | IsVisible () const =0
virtual const wchar_t *  | LocalCaption () const
virtual ON_2iPoint  | Location () const =0
virtual RHINO_WINDOW_HANDLE  | Parent () const =0
virtual void  | Refresh (bool immediate=false)=0
virtual void  | Release ()=0
virtual void  | SetFocused ()=0
virtual void  | SetIsEnabled (bool enable)=0
virtual void  | SetIsVisible (bool visible)=0
virtual void  | SetLocation (ON_2iPoint location)=0
virtual void  | SetParent (RHINO_WINDOW_HANDLE parent)=0
virtual void  | SetSize (ON_2iSize size, bool redraw=false, bool redrawBorder=false)=0
virtual ON_2iSize  | Size () const =0
virtual LPARAM  | WindowProc (unsigned int message, WPARAM wParam, LPARAM lParam)
 Additional Inherited Members
 Static Public Member Functions inherited from IRhinoSdkRenderFrame
static ON_SimpleArray< class IRhinoSdkRenderFrame * >  | RenderFrames (const CRhinoDoc &)
static class IRhinoSdkRenderFrame *  | TopRenderFrame (const CRhinoDoc &)
 Protected Member Functions inherited from IRhinoSdkRenderFrame
IRhinoSdkRenderFrame ()
virtual  | ~IRhinoSdkRenderFrame ()
virtual void  | Delete (void)=0
 Protected Member Functions inherited from IRhinoWindow
IRhinoWindow ()=default
IRhinoWindow (const IRhinoWindow &)=delete
IRhinoWindow &  | operator= (const IRhinoWindow &)=delete
Detailed Description
Alpha support added when saving rendered image.
Member Function Documentation
◆ SaveRenderImageAs() [1/2]
 virtual bool IRhinoSdkRenderFrame::SaveRenderImageAs
◆ SaveRenderImageAs() [2/2]
 virtual bool IRhinoSdkRenderFrameEx2::SaveRenderImageAs  |  ( |  const wchar_t *  |  lpsFileName,
|  bool  |  bUseAlpha
) |   |  const
pure virtual