Public Member Functions | List of all members
ON_SubDRTree Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Inheritance diagram for ON_SubDRTree:
 Public Member Functions
ON_SubDRTree ()=default
~ON_SubDRTree ()=default
bool  | AddVertex (const ON_SubDVertex *v, ON_SubDComponentLocation vertex_location)
void  | Clear ()
bool  | CreateSubDEmptyRTree (const ON_SubD &subd)
bool  | CreateSubDVertexRTree (const ON_SubD &subd, ON_SubDComponentLocation vertex_location)
const ON_SubDVertex *  | FindMarkedVertexAtPoint (const ON_3dPoint P, const double distance_tolerance) const
const ON_SubDVertex *  | FindUnmarkedVertexAtPoint (const ON_3dPoint P, const double distance_tolerance) const
const ON_SubDVertex *  | FindVertex (const class ON_SubDRTreeVertexFinder &vertex_finder, const double distance_tolerance) const
const ON_SubDVertex *  | FindVertexAtPoint (const ON_3dPoint P, const double distance_tolerance) const
const ON_SubD &  | SubD () const
 Public Member Functions inherited from ON_RTree
ON_RTree (size_t leaf_count=0)
~ON_RTree ()
ON_BoundingBox  | BoundingBox () const
bool  | CreateMeshFaceTree (const class ON_Mesh *mesh)
bool  | CreateMeshFaceTreePacked (const class ON_Mesh *mesh)
bool  | CreateMeshVertexTreePacked (const class ON_Mesh *mesh)
int  | ElementCount ()
bool  | Insert (const double a_min[3], const double a_max[3], int a_element_id)
bool  | Insert (const double a_min[3], const double a_max[3], void *a_element_id)
bool  | Insert2d (const double a_min[2], const double a_max[2], int a_element_id)
bool  | Insert2d (const double a_min[2], const double a_max[2], void *a_element_id)
bool  | Remove (const double a_min[3], const double a_max[3], int a_elementId)
bool  | Remove (const double a_min[3], const double a_max[3], void *a_elementId)
bool  | Remove2d (const double a_min[2], const double a_max[2], int a_elementId)
bool  | Remove2d (const double a_min[2], const double a_max[2], void *a_elementId)
void  | RemoveAll ()
const ON_RTreeNode *  | Root () const
bool  | Search (const class ON_PlaneEquation &a_plane_eqn, double a_min, double a_max, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (const double a_min[3], const double a_max[3], bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (const double a_min[3], const double a_max[3], ON_RTreeSearchResult &a_result) const
bool  | Search (const double a_min[3], const double a_max[3], ON_SimpleArray< int > &a_result) const
bool  | Search (const double a_min[3], const double a_max[3], ON_SimpleArray< ON_RTreeLeaf > &a_result) const
bool  | Search (const double a_min[3], const double a_max[3], ON_SimpleArray< void * > &a_result) const
bool  | Search (const double a_plane_eqn[4], double a_min, double a_max, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (const ON_Line *a_line, bool infinite, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (const ON_Line *a_line, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (const ON_Polyline *polyline, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), ON_RTreePolylineContext *a_context) const
bool  | Search (double tolerance, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB), void *a_context) const
bool  | Search (double tolerance, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB, double *tolerance), void *a_context) const
bool  | Search (double tolerance, ON_SimpleArray< ON_2dex > &a_result) const
bool  | Search (double tolerance, void ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB), void *a_context) const
bool  | Search (ON_RTreeBBox *a_rect, bool ON_CALLBACK_CDECL a_resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (ON_RTreeCapsule *a_capsule, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search (ON_RTreeSphere *a_sphere, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search2d (const double a_min[2], const double a_max[2], bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_id), void *a_context) const
bool  | Search2d (const double a_min[2], const double a_max[2], ON_RTreeSearchResult &a_result) const
bool  | Search2d (const double a_min[2], const double a_max[2], ON_SimpleArray< int > &a_result) const
bool  | Search2d (const double a_min[2], const double a_max[2], ON_SimpleArray< ON_RTreeLeaf > &a_result) const
bool  | Search2d (const double a_min[2], const double a_max[2], ON_SimpleArray< void * > &a_result) const
size_t  | SizeOf () const
bool  | Transform (const class ON_Xform &xform)
 Additional Inherited Members
 Static Public Member Functions inherited from ON_RTree
static bool  | Search (const ON_RTree &a_rtreeA, const ON_RTree &a_rtreeB, double tolerance, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB), void *a_context)
static bool  | Search (const ON_RTree &a_rtreeA, const ON_RTree &a_rtreeB, double tolerance, bool ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB, double *tolerance), void *a_context)
static bool  | Search (const ON_RTree &a_rtreeA, const ON_RTree &a_rtreeB, double tolerance, ON_SimpleArray< ON_2dex > &a_result)
static bool  | Search (const ON_RTree &a_rtreeA, const ON_RTree &a_rtreeB, double tolerance, void ON_CALLBACK_CDECL resultCallback(void *a_context, ON__INT_PTR a_idA, ON__INT_PTR a_idB), void *a_context)
 Static Public Attributes inherited from ON_RTree
static const ON_RTree  | Empty
Constructor & Destructor Documentation
◆ ON_SubDRTree()
 ON_SubDRTree::ON_SubDRTree  |  ( |   | )
default
◆ ~ON_SubDRTree()
 ON_SubDRTree::~ON_SubDRTree  |  ( |   | )
default
Member Function Documentation
◆ AddVertex()
 bool ON_SubDRTree::AddVertex  |  ( |  const ON_SubDVertex *  |  v,
|  ON_SubDComponentLocation  |  vertex_location
)
◆ Clear()
 void ON_SubDRTree::Clear  |  ( |   | )
Description: CLears the reference to the SubD and removes all RTree nodes.
◆ CreateSubDEmptyRTree()
 bool ON_SubDRTree::CreateSubDEmptyRTree  |  ( |  const ON_SubD &  |  subd | )
◆ CreateSubDVertexRTree()
 bool ON_SubDRTree::CreateSubDVertexRTree  |  ( |  const ON_SubD &  |  subd,
|  ON_SubDComponentLocation  |  vertex_location
)
◆ FindMarkedVertexAtPoint()
 const ON_SubDVertex* ON_SubDRTree::FindMarkedVertexAtPoint  |  ( |  const ON_3dPoint  |  P,
|  const double  |  distance_tolerance
) |   |  const
◆ FindUnmarkedVertexAtPoint()
 const ON_SubDVertex* ON_SubDRTree::FindUnmarkedVertexAtPoint  |  ( |  const ON_3dPoint  |  P,
|  const double  |  distance_tolerance
) |   |  const
◆ FindVertex()
 const ON_SubDVertex* ON_SubDRTree::FindVertex  |  ( |  const class ON_SubDRTreeVertexFinder &  |  vertex_finder,
|  const double  |  distance_tolerance
) |   |  const
◆ FindVertexAtPoint()
 const ON_SubDVertex* ON_SubDRTree::FindVertexAtPoint  |  ( |  const ON_3dPoint  |  P,
|  const double  |  distance_tolerance
) |   |  const
◆ SubD()
 const ON_SubD& ON_SubDRTree::SubD  |  ( |   | ) |   const