List of all members
CRhinoObjectDrawIterator Class Reference
Rhino
#include <rhinoSdkDraw.h>
Detailed Description
Description: The CRhinoObjectDrawIterator is a customized iterator used to iterate through the list of objects being drawn in a viewport.