Public Member Functions | Public Attributes | List of all members
ON_ClippingPlane Class Reference
OpenNURBS
#include <opennurbs_plane.h>
 Public Member Functions
ON_ClippingPlane ()
~ON_ClippingPlane ()
bool  | ClipParticipationListsAreExclusionLists () const
ON_ClippingPlaneInfo  | ClippingPlaneInfo () const
void  | Default ()
double  | Depth () const
bool  | DepthEnabled () const
Default is false. More...
const ON_SimpleArray< int > *  | LayerClipParticipationList () const
const ON_UuidList *  | ObjectClipParticipationList () const
bool  | ParticipationListsEnabled () const
Default is false. More...
bool  | Read (class ON_BinaryArchive &)
void  | SetDepth (double depth)
void  | SetDepthEnabled (bool on)
void  | SetParticipationLists (const ON_SimpleArray< ON_UUID > *objectIds, const ON_SimpleArray< int > *layerIndices, bool isExclusionList)
void  | SetParticipationListsEnabled (bool on)
bool  | Write (class ON_BinaryArchive &) const
 Public Attributes
bool  | m_bEnabled
true if this clipping plane is active More...
ON_Plane  | m_plane
ON_UUID  | m_plane_id
ON_UuidList  | m_viewport_ids
ids of viewports that this clipping plane "clips" More...
Constructor & Destructor Documentation
◆ ON_ClippingPlane()
 ON_ClippingPlane::ON_ClippingPlane  |  ( |   | )
◆ ~ON_ClippingPlane()
 ON_ClippingPlane::~ON_ClippingPlane  |  ( |   | )
Member Function Documentation
◆ ClipParticipationListsAreExclusionLists()
 bool ON_ClippingPlane::ClipParticipationListsAreExclusionLists  |  ( |   | ) |   const
◆ ClippingPlaneInfo()
 ON_ClippingPlaneInfo ON_ClippingPlane::ClippingPlaneInfo  |  ( |   | ) |   const
◆ Default()
 void ON_ClippingPlane::Default  |  ( |   | )
◆ Depth()
 double ON_ClippingPlane::Depth  |  ( |   | ) |   const
A distance where the clipping plane does not clip geometry. A positive value is equivalent to placing another clipping plane at a distance from this clipping plane along it's normal and then flipping it
The depth must also be enabled to be effective
◆ DepthEnabled()
 bool ON_ClippingPlane::DepthEnabled  |  ( |   | ) |   const
Default is false.
◆ LayerClipParticipationList()
 const ON_SimpleArray<int>* ON_ClippingPlane::LayerClipParticipationList  |  ( |   | ) |   const
◆ ObjectClipParticipationList()
 const ON_UuidList* ON_ClippingPlane::ObjectClipParticipationList  |  ( |   | ) |   const
◆ ParticipationListsEnabled()
 bool ON_ClippingPlane::ParticipationListsEnabled  |  ( |   | ) |   const
Default is false.
◆ Read()
 bool ON_ClippingPlane::Read  |  ( |  class ON_BinaryArchive &  |   | )
◆ SetDepth()
 void ON_ClippingPlane::SetDepth  |  ( |  double  |  depth | )
Negative depth values are currently not allowed. If a negative depth value is passed to this function, it will not the internal depth value
◆ SetDepthEnabled()
 void ON_ClippingPlane::SetDepthEnabled  |  ( |  bool  |  on | )
◆ SetParticipationLists()
 void ON_ClippingPlane::SetParticipationLists  |  ( |  const ON_SimpleArray< ON_UUID > *  |  objectIds,
|  const ON_SimpleArray< int > *  |  layerIndices,
|  bool  |  isExclusionList
)
◆ SetParticipationListsEnabled()
 void ON_ClippingPlane::SetParticipationListsEnabled  |  ( |  bool  |  on | )
◆ Write()
 bool ON_ClippingPlane::Write  |  ( |  class ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bEnabled
 bool ON_ClippingPlane::m_bEnabled
true if this clipping plane is active
◆ m_plane
 ON_Plane ON_ClippingPlane::m_plane
◆ m_plane_id
 ON_UUID ON_ClippingPlane::m_plane_id
◆ m_viewport_ids
 ON_UuidList ON_ClippingPlane::m_viewport_ids
ids of viewports that this clipping plane "clips"