Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_UuidIndex Class Reference
OpenNURBS
#include <opennurbs_uuid.h>
 Public Member Functions
ON_UuidIndex ()=default
ON_UuidIndex (const ON_UuidIndex &)=default
ON_UuidIndex (ON_UUID id, int index)
~ON_UuidIndex ()=default
ON_UuidIndex &  | operator= (const ON_UuidIndex &)=default
 Static Public Member Functions
static int  | CompareId (const ON_UuidIndex *a, const ON_UuidIndex *b)
static int  | CompareIdAndIndex (const ON_UuidIndex *a, const ON_UuidIndex *b)
static int  | CompareIndex (const ON_UuidIndex *a, const ON_UuidIndex *b)
static int  | CompareIndexAndId (const ON_UuidIndex *a, const ON_UuidIndex *b)
 Public Attributes
int  | m_i = 0
ON_UUID  | m_id = ON_nil_uuid
 Static Public Attributes
static const ON_UuidIndex  | NilIndex
uuid = nil, index = 0 More...
Detailed Description
class ON_CLASS ON_Id : public ON_UUID { public: ON_Id() = default; ~ON_Id() = default; ON_Id(const ON_Id&) = default; ON_Id& operator=(const ON_Id&) = default;
ON_Id(const ON_UUID&); ON_Id& operator=(const ON_UUID&);
operator ON_UUID&(); operator const ON_UUID&() const;
static ON_Id Create(); static const ON_Id nil;
static int Compare( const ON_Id& a, const ON_Id& b );
static int ComparePtr( const ON_Id* a, const ON_Id* b );
static int CompareUUID( const ON_UUID& a, const ON_UUID& b );
static int CompareUUIDPtr( const ON_UUID* a, const ON_UUID* b );
bool IsNil() const; bool IsNotNil() const; };
bool operator==(const ON_Id& a, const ON_Id& b ); bool operator==(const ON_UUID& a, const ON_Id& b ); bool operator==(const ON_Id& a, const ON_UUID& b );
bool operator!=(const ON_Id& a, const ON_Id& b ); bool operator!=(const ON_UUID& a, const ON_Id& b ); bool operator!=(const ON_Id& a, const ON_UUID& b );
bool operator<=(const ON_Id& a, const ON_Id& b ); bool operator<=(const ON_UUID& a, const ON_Id& b ); bool operator<=(const ON_Id& a, const ON_UUID& b );
bool operator>=(const ON_Id& a, const ON_Id& b ); bool operator>=(const ON_UUID& a, const ON_Id& b ); bool operator>=(const ON_Id& a, const ON_UUID& b );
bool operator<(const ON_Id& a, const ON_Id& b ); bool operator<(const ON_UUID& a, const ON_Id& b ); bool operator<(const ON_Id& a, const ON_UUID& b );
bool operator>(const ON_Id& a, const ON_Id& b ); bool operator>(const ON_UUID& a, const ON_Id& b ); bool operator>(const ON_Id& a, const ON_UUID& b ); Description: This class is used by ON_UuidIndexList. It is used when uuids are used to search for items that can be found by an integer index.
Constructor & Destructor Documentation
◆ ON_UuidIndex() [1/3]
 ON_UuidIndex::ON_UuidIndex  |  ( |   | )
default
◆ ~ON_UuidIndex()
 ON_UuidIndex::~ON_UuidIndex  |  ( |   | )
default
◆ ON_UuidIndex() [2/3]
 ON_UuidIndex::ON_UuidIndex  |  ( |  const ON_UuidIndex &  |   | )
default
◆ ON_UuidIndex() [3/3]
 ON_UuidIndex::ON_UuidIndex  |  ( |  ON_UUID  |  id,
|  int  |  index
)
Member Function Documentation
◆ CompareId()
 static int ON_UuidIndex::CompareId  |  ( |  const ON_UuidIndex *  |  a,
|  const ON_UuidIndex *  |  b
)
static
Compare m_id and ignore m_i.
◆ CompareIdAndIndex()
 static int ON_UuidIndex::CompareIdAndIndex  |  ( |  const ON_UuidIndex *  |  a,
|  const ON_UuidIndex *  |  b
)
static
Dictionary compare m_id and then m_i.
◆ CompareIndex()
 static int ON_UuidIndex::CompareIndex  |  ( |  const ON_UuidIndex *  |  a,
|  const ON_UuidIndex *  |  b
)
static
Compare m_i and ignore m_id.
◆ CompareIndexAndId()
 static int ON_UuidIndex::CompareIndexAndId  |  ( |  const ON_UuidIndex *  |  a,
|  const ON_UuidIndex *  |  b
)
static
Dictionary compare m_id and then m_i.
◆ operator=()
 ON_UuidIndex& ON_UuidIndex::operator=  |  ( |  const ON_UuidIndex &  |   | )
default
Member Data Documentation
◆ m_i
 int ON_UuidIndex::m_i = 0
◆ m_id
 ON_UUID ON_UuidIndex::m_id = ON_nil_uuid
In cases when there is a discrepancy between the m_id and m_i, m_id is assumed to be valid unless comments where this class is used indicate otherwise.
◆ NilIndex
 const ON_UuidIndex ON_UuidIndex::NilIndex
static
uuid = nil, index = 0