Public Member Functions | List of all members
CRhRdkLinearWorkflowEx Class Reference
RDK
#include <RhRdkLinearWorkflow.h>
 Inheritance diagram for CRhRdkLinearWorkflowEx:
 Public Member Functions
CRhRdkLinearWorkflowEx ()
CRhRdkLinearWorkflowEx (const IRhRdkLinearWorkflow &lw)
CRhRdkLinearWorkflowEx (const ON_LinearWorkflow &lw)
virtual void  | ApplyPostProcessGamma (CRhinoDib &dibInOut) const override
ON__UINT32  | CRC (ON__UINT32 current_remainder) const
virtual void *  | EVF (const wchar_t *, void *) override
bool  | operator!= (const IRhRdkLinearWorkflow &lw) const
const CRhRdkLinearWorkflowEx &  | operator= (const IRhRdkLinearWorkflow &lw)
bool  | operator== (const IRhRdkLinearWorkflow &lw) const
void  | SetXML (const wchar_t *wszXML)
ON_wString  | XML (void) const
 Public Member Functions inherited from CRhRdkLinearWorkflow
CRhRdkLinearWorkflow ()
CRhRdkLinearWorkflow (const IRhRdkLinearWorkflow &lw)
virtual void  | ApplyPreProcessGamma (CRhinoDib &dibInOut) const override
virtual void  | ApplyPreProcessGamma (CRhRdkColor &col, bool bForTexture) const override
virtual IRhRdkLinearWorkflow &  | BeginChange (RhRdkChangeContext cc) const override
virtual ON__UINT32  | ComputeCRC (void) const override
virtual void  | CopyFrom (const IRhRdkLinearWorkflow &lw) override
void  | CopyFrom (const ON_LinearWorkflow &lw)
virtual bool  | EndChange (void) override
virtual bool  | IsEqual (const IRhRdkLinearWorkflow &lw) const override
bool  | operator!= (const IRhRdkLinearWorkflow &lw) const
const CRhRdkLinearWorkflow &  | operator= (const IRhRdkLinearWorkflow &lw)
bool  | operator== (const IRhRdkLinearWorkflow &lw) const
virtual bool  | PostProcessFrameBuffer (void) const override
virtual float  | PostProcessGamma (void) const override
virtual float  | PostProcessGammaReciprocal (void) const override
virtual bool  | PreProcessColors (void) const override
virtual float  | PreProcessGamma (void) const override
virtual bool  | PreProcessTextures (void) const override
virtual void  | SetPostProcessFrameBuffer (bool b) override
virtual void  | SetPostProcessGamma (float fGamma) override
virtual void  | SetPreProcessColors (bool b) override
virtual void  | SetPreProcessGamma (float fGamma) override
virtual void  | SetPreProcessTextures (bool b) override
 Public Member Functions inherited from IRhRdkLinearWorkflow
virtual  | ~IRhRdkLinearWorkflow ()
bool  | PostProcessFrameBufferOn (void) const
bool  | PostProcessGammaOn (void) const
bool  | PreProcessColorsOn (void) const
bool  | PreProcessTexturesOn (void) const
void  | SetPostProcessFrameBufferOn (bool b)
void  | SetPostProcessGammaOn (bool)
void  | SetPreProcessColorsOn (bool b)
void  | SetPreProcessTexturesOn (bool b)
 Additional Inherited Members
 Static Public Member Functions inherited from IRhRdkLinearWorkflow
static IRhRdkLinearWorkflow *  | New (void)
Detailed Description
This helper class extends CRhRdkLinearWorkflow to add support for turning post-process gamma on and off.
If you want to get the linear workflow or gamma settings being used by a document, please see CRhRdkDocument::LinearWorkflow().
Constructor & Destructor Documentation
◆ CRhRdkLinearWorkflowEx() [1/3]
 CRhRdkLinearWorkflowEx::CRhRdkLinearWorkflowEx  |  ( |   | )
◆ CRhRdkLinearWorkflowEx() [2/3]
 CRhRdkLinearWorkflowEx::CRhRdkLinearWorkflowEx  |  ( |  const IRhRdkLinearWorkflow &  |  lw | )
◆ CRhRdkLinearWorkflowEx() [3/3]
 CRhRdkLinearWorkflowEx::CRhRdkLinearWorkflowEx  |  ( |  const ON_LinearWorkflow &  |  lw | )
Member Function Documentation
◆ ApplyPostProcessGamma()
 virtual void CRhRdkLinearWorkflowEx::ApplyPostProcessGamma  |  ( |  CRhinoDib &  |  dibInOut | ) |   const
overridevirtual
Modifies a DIB by applying gamma correction using the gamma reciprocal.
Note
This method replaces the NewGammaCorrectedBitmap() method.
Parameters
dibInOut | is the DIB which is altered if gamma is not equal to 1.
Reimplemented from CRhRdkLinearWorkflow.
◆ CRC()
 ON__UINT32 CRhRdkLinearWorkflowEx::CRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
◆ EVF()
 virtual void* CRhRdkLinearWorkflowEx::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion. Currently implemented wszFunc: "PostProcessGammaOn" (pvData = null; returns pointer to bool). "SetPostProcessGammaOn" (pvData is pointer to bool).
Reimplemented from CRhRdkLinearWorkflow.
◆ operator!=()
 bool CRhRdkLinearWorkflowEx::operator!=  |  ( |  const IRhRdkLinearWorkflow &  |  lw | ) |   const
◆ operator=()
 const CRhRdkLinearWorkflowEx& CRhRdkLinearWorkflowEx::operator=  |  ( |  const IRhRdkLinearWorkflow &  |  lw | )
◆ operator==()
 bool CRhRdkLinearWorkflowEx::operator==  |  ( |  const IRhRdkLinearWorkflow &  |  lw | ) |   const
◆ SetXML()
 void CRhRdkLinearWorkflowEx::SetXML  |  ( |  const wchar_t *  |  wszXML | )
◆ XML()
 ON_wString CRhRdkLinearWorkflowEx::XML  |  ( |  void  |   | ) |   const