Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDVertexPtr Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
bool  | ClearMark () const
ON__UINT8  | ClearMarkBits () const
void  | ClearSavedSubdivisionPoints () const
void  | ClearSavedSubdivisionPoints (bool bClearNeighborhood) const
bool  | IsActive () const
bool  | IsNotNull () const
bool  | IsNull () const
bool  | Mark () const
ON__UINT8  | MarkBits () const
bool  | SetMark () const
bool  | SetMark (bool bMark) const
ON__UINT8  | SetMarkBits (ON__UINT8 mark_bits) const
const ON_ComponentStatus  | Status () const
class ON_SubDVertex *  | Vertex () const
ON__UINT_PTR  | VertexDirection () const
unsigned int  | VertexId () const
 Static Public Member Functions
static int  | CompareVertexId (const ON_SubDVertexPtr *a, const ON_SubDVertexPtr *b)
static const ON_SubDVertexPtr  | Create (const class ON_SubDComponentPtr &vertex_component)
static const ON_SubDVertexPtr  | Create (const class ON_SubDVertex *vertex)
static const ON_SubDVertexPtr  | Create (const class ON_SubDVertex *vertex, ON__UINT_PTR vertex_direction)
 Public Attributes
ON__UINT_PTR  | m_ptr
 Static Public Attributes
static const ON_SubDVertexPtr  | Null
Member Function Documentation
◆ ClearMark()
 bool ON_SubDVertexPtr::ClearMark  |  ( |   | ) |   const
Description: Clears (sets to false) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specific state. Returns: Input value of Mark().
◆ ClearMarkBits()
 ON__UINT8 ON_SubDVertexPtr::ClearMarkBits  |  ( |   | ) |   const
◆ ClearSavedSubdivisionPoints() [1/2]
 void ON_SubDVertexPtr::ClearSavedSubdivisionPoints  |  ( |   | ) |   const
◆ ClearSavedSubdivisionPoints() [2/2]
 void ON_SubDVertexPtr::ClearSavedSubdivisionPoints  |  ( |  bool  |  bClearNeighborhood | ) |   const
Description: Clears saved subdivision and limit surface information for this component. Parameters: bClearNeighborhood - [in] If true, all components attached to this component are also cleared.
◆ CompareVertexId()
 static int ON_SubDVertexPtr::CompareVertexId  |  ( |  const ON_SubDVertexPtr *  |  a,
|  const ON_SubDVertexPtr *  |  b
)
static
Description: Compares VertexId(), with similar null rules as ON_SubDComponentPtr::CompareComponentId.
◆ Create() [1/3]
 static const ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDComponentPtr &  |  vertex_component | )
static
◆ Create() [2/3]
 static const ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex | )
static
◆ Create() [3/3]
 static const ON_SubDVertexPtr ON_SubDVertexPtr::Create  |  ( |  const class ON_SubDVertex *  |  vertex,
|  ON__UINT_PTR  |  vertex_direction
)
static
Parameters: vertex - [in] vertex_direction - [in] zero or one
◆ IsActive()
 bool ON_SubDVertexPtr::IsActive  |  ( |   | ) |   const
Returns: True if this vertex is active in its parent subd or other relevant context. Remarks: When a component is in use, IsActive() = true. If was used and then deleted, IsActive() is false.
◆ IsNotNull()
 bool ON_SubDVertexPtr::IsNotNull  |  ( |   | ) |   const
◆ IsNull()
 bool ON_SubDVertexPtr::IsNull  |  ( |   | ) |   const
◆ Mark()
 bool ON_SubDVertexPtr::Mark  |  ( |   | ) |   const
Returns: The current value of the component mark ( m_status->RuntimeMark() ). Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specific state.
◆ MarkBits()
 ON__UINT8 ON_SubDVertexPtr::MarkBits  |  ( |   | ) |   const
◆ SetMark() [1/2]
 bool ON_SubDVertexPtr::SetMark  |  ( |   | ) |   const
Description: Sets (sets to true) the value of the component mark. Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specific state. Returns: Input value of Mark().
◆ SetMark() [2/2]
 bool ON_SubDVertexPtr::SetMark  |  ( |  bool  |  bMark | ) |   const
Description: Sets the value of the component mark to bMark. Parameter: bMark - [in] Remarks: SubD components have a mutable runtime mark that can be used in any context where a single thread cares about the marks. It is widely used in many calculations to keep track of sets of components that are in a certain context specific state. Returns: Input value of Mark().
◆ SetMarkBits()
 ON__UINT8 ON_SubDVertexPtr::SetMarkBits  |  ( |  ON__UINT8  |  mark_bits | ) |   const
◆ Status()
 const ON_ComponentStatus ON_SubDVertexPtr::Status  |  ( |   | ) |   const
◆ Vertex()
 class ON_SubDVertex* ON_SubDVertexPtr::Vertex  |  ( |   | ) |   const
◆ VertexDirection()
 ON__UINT_PTR ON_SubDVertexPtr::VertexDirection  |  ( |   | ) |   const
◆ VertexId()
 unsigned int ON_SubDVertexPtr::VertexId  |  ( |   | ) |   const
Returns
If Vertex() is not nullptr, Vertex()->m_id is returned. Otherwise, 0 is returned.
Member Data Documentation
◆ m_ptr
 ON__UINT_PTR ON_SubDVertexPtr::m_ptr
For performance reasons, m_ptr is not initialized and no constructors are declared or implemented. If you require initialization, then use x = ON_SubDVertexPtr::Null or x = ON_SubDVertexPtr::Create(...).
◆ Null
 const ON_SubDVertexPtr ON_SubDVertexPtr::Null
static