Public Member Functions | Public Attributes | List of all members
ON_AerialPhotoImageFrustum Class Reference
OpenNURBS
#include <opennurbs_photogrammetry.h>
 Public Member Functions
ON_AerialPhotoImageFrustum ()
bool  | CornersAreSet () const
bool  | HeightIsSet () const
bool  | IsSet () const
bool  | UnitSystemIsSet () const
void  | Unset ()
 Public Attributes
ON_2dPoint  | m_corners [4]
double  | m_height
ON_UnitSystem  | m_unit_system
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_AerialPhotoImageFrustum()
 ON_AerialPhotoImageFrustum::ON_AerialPhotoImageFrustum  |  ( |   | )
Member Function Documentation
◆ CornersAreSet()
 bool ON_AerialPhotoImageFrustum::CornersAreSet  |  ( |   | ) |   const
◆ HeightIsSet()
 bool ON_AerialPhotoImageFrustum::HeightIsSet  |  ( |   | ) |   const
◆ IsSet()
 bool ON_AerialPhotoImageFrustum::IsSet  |  ( |   | ) |   const
◆ UnitSystemIsSet()
 bool ON_AerialPhotoImageFrustum::UnitSystemIsSet  |  ( |   | ) |   const
◆ Unset()
 void ON_AerialPhotoImageFrustum::Unset  |  ( |   | )
Member Data Documentation
◆ m_corners
 ON_2dPoint ON_AerialPhotoImageFrustum::m_corners[4]
The corners must be the vertices of a 3 or 4 sided convex region and must have counter-clockwise order in the 2d plane. It is common for the corners to be a rectangle (lower left, lower right, upper right, upper left) and for the rectangle to be symmetric about (0,0). However, when the image has been cropped, the frustum can be skew. The frustum's apex point is always directly above (0,0).
◆ m_height
 double ON_AerialPhotoImageFrustum::m_height
The frustum's apex height must be positive. It is common for the image frustum height to be a camera's focal length.
◆ m_unit_system
 ON_UnitSystem ON_AerialPhotoImageFrustum::m_unit_system
The frustum unit system must be set. It is common for the frustum unit system to be millimeters.