Public Member Functions | Static Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | List of all members
MRhinoApp Class Reference
Rhino
#include <RhinoSdkMacRhinoApp.h>
 Inheritance diagram for MRhinoApp:
 Public Member Functions
MRhinoApp (class CRhApp &)
virtual  | ~MRhinoApp ()
id  | AppDefaults (void) const override
LPCTSTR  | AppName () const override
void  | Arrange3dViews (const class CDocument &)
void  | BeginWaitCursor () override
void  | EndWaitCursor () override
void  | ExitApp ()
class RhCommandAutocompleter &  | GetCommandAutocompleter ()
bool  | GetCommandLineScript (ON_wString &)
CRhinoDoc *  | GetOpenDocument (int) const
int  | GetOpenDocumentCount () const
unsigned int  | GetPOSIXLocaleIdentifier () const override
const char *  | GetPOSIXLocaleName () const override
ON_RUNTIME_WIN. More...
void  | HideOnDemandToolPalettesForCommand (LPCTSTR str)
int  | Initialize ()
void  | InitializeCustomCursors ()
bool  | IsAnyMainThread (const pthread_t t)
bool  | IsLicenseManagerInitialized ()
HCURSOR  | LoadCursor (unsigned int cursorID) const override
bool  | LoadResourceDLL (ON_wString)
void *  | MainHMenu () const
const pthread_t  | MainThread ()
void  | OnClose ()
void  | OnMRApplicationTerminate ()
void  | OnMRApplicationTerminateCancel ()
class CDocument *  | OpenDocumentFile (const wchar_t *)
const wchar_t *  | ProfileName () const override
class CRecentFileList *  | RecentFileList ()
const wchar_t *  | RegistryKey () const override
CString  | RhinoGetProfileString (const wchar_t *, const wchar_t *, const wchar_t *, int)
BOOL32  | RhinoWriteProfileString (const wchar_t *, const wchar_t *, const char *, int)
BOOL32  | RhinoWriteProfileString (const wchar_t *, const wchar_t *, const wchar_t *, int)
BOOL32  | RhinoWriteProfileString (const wchar_t *, const wchar_t *, CString &, int)
void  | SetAppName (LPCTSTR) override
void  | SetMruMenuString (LPCTSTR str)
CThreadManager &  | ThreadManager (void) const override
 Public Member Functions inherited from CRhinoApp
CRhinoApp (class CRhApp &)
virtual  | ~CRhinoApp ()
BOOL32  | AcceleratorKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
bool  | ActivateCommandWindowCaret () const
Activates flashing caret in command prompt. More...
MAC_DEPRECATED const RHINO_SDK_FUNCTION CRhinoCommand *  | ActiveCommand () const
MAC_DEPRECATED const RHINO_SDK_FUNCTION CRhinoCommandContext::COMMAND_STYLE  | ActiveCommandStyle () const
RHINO_SDK_FUNCTION CRhinoDoc *  | ActiveDoc () const
RHINO_SDK_FUNCTION ON::active_space  | ActiveSpace () const
RHINO_SDK_FUNCTION class CRhinoView *  | ActiveView () const
RHINO_SDK_FUNCTION BOOL32  | AddMenu (HMENU hSubMenu, LPCTSTR title, CRhinoPlugIn *pApp)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
RHINO_SDK_FUNCTION BOOL32  | AddMenuItem (HMENU hTargetMenu, UINT index, MENUITEMINFO *pMi, CRhinoPlugIn *pApp)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
MAC_DEPRECATED void  | AddMruCommand (const wchar_t *cmd, const wchar_t *display_string=nullptr)
RHINO_SDK_FUNCTION BOOL32  | AddPageToObjectPropertiesDialog (class IRhinoPropertiesPanelPage *pPage, const CRhinoPlugIn *pPlugIn)
bool  | AllowActivateCommandWindowCaret () const
class CRhEventManager *  | AppEventManager () const
list of events (text tokens, view clicks, digitizer points, etc. More...
RHINO_SDK_FUNCTION CRhinoAppSettings &  | AppSettings ()
RHINO_SDK_FUNCTION CRhinoApp::APP_STATE  | AppState () const
void  | ArrangeViews (bool bMakeVisible)
RHINO_SDK_FUNCTION bool  | AskUserForRhinoLicense (bool bStandalone, HWND parent)
RHINO_SDK_FUNCTION bool  | AutoSave (unsigned int rhino_doc_sn, const wchar_t *lpsCommandName, int auto_save_action)
HCURSOR  | BlankCursor () const
RHINO_SDK_FUNCTION void *  | Calloc (size_t, size_t)
RHINO_SDK_FUNCTION bool  | CanSave ()
RHINO_SDK_FUNCTION bool  | CaptureCommandWindowPrint (bool enabled)
RHINO_SDK_FUNCTION bool  | CaptureCommandWindowPrintEnabled () const
RHINO_SDK_FUNCTION void  | ClearCommandHistoryWindowText ()
RHINO_SDK_FUNCTION void  | ClearCursorToolTip ()
RHINO_SDK_FUNCTION void  | ClearCursorToolTipPane (CRhinoApp::cursor_tooltip_pane)
void  | ClearFileReadOptions ()
void  | ClearProtocolHandlerUrl ()
void  | CloseAllDocuments (BOOL32 bEndSession)
RHINO_SDK_FUNCTION bool  | CommandCanceled () const
class CRhCommandManager &  | CommandManager ()
'Manager' helper classes - do NOT export to SDK More...
const CRhMruCommandRecord *  | CommandToRepeat () const
RHINO_SDK_FUNCTION void  | CommandWindowCapturedStrings (ON_ClassArray< ON_wString > &strings, bool clearBuffer)
void  | CreateOsnapCursors (int)
unsigned int  | CreateRhinoView (unsigned int rhino_doc_sn, const ON_3dmView *view, CRuntimeClass *pMfcViewRuntimeClass, bool bShowView)
CRhinoRenderPlugIn *  | CurrentRenderPlugIn ()
class CRhCustomMenuManager &  | CustomMenuManager ()
RHINO_SDK_FUNCTION int  | DaysUntilExpiration ()
RHINO_SDK_FUNCTION class CRhinoDigitizerManager &  | DigitizerManager ()
int  | DispatchPluginMenuCommand (HMENU hmenu, WPARAM wParam, LPARAM lParam)
class CRhDocViewManager &  | DocViewManager ()
RHINO_SDK_FUNCTION bool  | DoHelp (const wchar_t *helpTopicLink) const
RHINO_SDK_FUNCTION bool  | Echo () const
void  | EchoCommand (const wchar_t *) const
void  | EchoPrompt (const wchar_t *) const
void  | EmergencyExit (int)
See source code comments for usage. Do not. More...
void  | EnterCommand (CRhinoDoc &doc, const CRhinoCommand *, unsigned int *undo_record_sn)
RHINO_SDK_FUNCTION bool  | ExecutableFolder (ON_wString &result) const
RHINO_SDK_FUNCTION CRhinoCommand::result  | ExecuteCommand (unsigned int rhino_doc_sn, const wchar_t *cmd_name)
RHINO_SDK_FUNCTION int  | ExeServiceRelease () const
RHINO_SDK_FUNCTION int  | ExeVersion () const
void  | ExitCommand (unsigned int rhino_doc_sn0, unsigned int rhino_doc_sn1, const CRhinoCommand *, unsigned int undo_record_sn)
int  | ExitInstance ()
BOOL32  | ExitRhino ()
bool  | FileImport (unsigned int rhino_doc_sn, const wchar_t *file_name_to_read, bool bUseDialogs, bool bSelectNewObjects, ON_wString *file_name_read)
unsigned int  | FileNew (bool bUseDialogs)
unsigned int  | FileOpen (const wchar_t *file_name_to_read, bool bUseDialogs, bool bCreateEmptyDocOnFailure, ON_wString *file_name_read)
RHINO_SDK_FUNCTION CRhinoFileReadOptions &  | FileReadOptions ()
const RHINO_SDK_FUNCTION CRhinoFileReadOptions &  | FileReadOptions () const
class CRhFileReadOptions &  | FileReadOptionsEx ()
do not export this function More...
RHINO_SDK_FUNCTION bool  | FileReference (ON_wString &FileName, bool bUseDialog=true, HWND hWndParent=nullptr)
RHINO_SDK_FUNCTION CRhinoCommand *  | FindCommand (const wchar_t *command_name) const
RHINO_SDK_FUNCTION CRhinoCommand *  | FindCommand (ON_UUID command_uuid) const
RHINO_SDK_FUNCTION CRhinoGripsEnabler *  | FindGripsEnabler (ON_UUID grips_id) const
RHINO_SDK_FUNCTION int  | FindMenuItem (HMENU hmenu, LPCTSTR string, MENUITEMINFO *pMi)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
RHINO_SDK_FUNCTION bool  | FindRhinoMenuItem (const wchar_t *sEnglishMenuPath, HMENU &hParentMenuHandle, int &nMenuItemIndex)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
BOOL32  | FrameWindowProc (UINT message, WPARAM wParam, LPARAM lParam, BOOL32 bInPlace)
RHINO_SDK_FUNCTION void  | Free (void *)
RHINO_SDK_FUNCTION bool  | FullscreenEscapeDisabled () const
RHINO_SDK_FUNCTION void  | GetApplicationName (ON_3dmApplication &app_name) const
RHINO_SDK_FUNCTION void  | GetApplicationName (ON_wString &app_name) const
class CRhAutoSave &  | GetAutoSave () const
RHINO_SDK_FUNCTION void  | GetBuildDate (int &nYear, int &nMonth, int &nDate) const
RHINO_SDK_FUNCTION void  | GetBuildDate (ON_wString &wBuildDate) const
RHINO_SDK_FUNCTION void  | GetBuildDate (ON_wString &wYear, ON_wString &wMonth, ON_wString &wDate) const
RHINO_SDK_FUNCTION void  | GetCommandHistoryWindowText (ON_wString &wstr) const
RHINO_SDK_FUNCTION bool  | GetCommandLineScript (ON_wString &wScript)
void  | GetCommandNameList (ON_TextLog &) const
RHINO_SDK_FUNCTION bool  | GetCommandPrompt (ON_wString &prompt) const
bool  | GetCommandPromptEx (ON_wString &prompt, ON_wString &prompt_default, ON_ClassArray< CRhinoCommandOption > &options)
RHINO_SDK_FUNCTION ON_UUID  | GetDefaultRenderApp () const
RHINO_SDK_FUNCTION CRhinoDoc *  | GetDocument (UINT_PTR doc_sn) const
RHINO_SDK_FUNCTION int  | GetMRUCommands (ON_ClassArray< ON_wString > &display_strings, ON_ClassArray< ON_wString > &macros) const
void  | GetNetCoreRuntimeVersion (ON_wString &wVersion)
RHINO_SDK_FUNCTION LPUNKNOWN  | GetPlugInObjectInterface (const ON_UUID &plugin_uuid, const ON_UUID &interface_uuid)
RHINO_SDK_FUNCTION bool  | GetProtocolHandlerUrl (ON_wString &protocolHandlerUrl)
RHINO_SDK_FUNCTION bool  | GetRhinoGlobalOptionsRegistryPath (bool bFullPath, ON_wString &result) const
RHINO_SDK_FUNCTION bool  | GetRhinoPlugInsRegistryPath (bool bFullPath, ON_wString &result) const
RHINO_SDK_FUNCTION CRhinoProfileContext &  | GetRhinoProfileContext (CRhinoProfileContext::context_location location)
RHINO_SDK_FUNCTION BOOL32  | GetRhinoRegistryKey (ON_wString &result) const
RHINO_SDK_FUNCTION bool  | GetRhinoRootRegistryPath (ON_wString &result) const
RHINO_SDK_FUNCTION bool  | GetRhinoSchemeRegistryPath (bool bFullPath, ON_wString &result) const
RHINO_SDK_FUNCTION class CRhSkin *  | GetRhSkin () const
RHINO_SDK_FUNCTION void  | GetSystemInformation (ON_TextLog &log) const
RHINO_SDK_FUNCTION UINT  | GetUniqueMenuItemID (HMENU hMenu)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
RHINO_SDK_FUNCTION bool  | HideControlBars (UINT nCBMask=0xFFFFFFFF, int nDockState=0, bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | HideToolBars (int nDockState=0, bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | HideWindowBars (UINT nWBMask=0xFFFFFFFF, bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | InAppMode () const
RHINO_SDK_FUNCTION int  | InCommand (bool bIgnoreScriptRunnerCommands=false) const
RHINO_SDK_FUNCTION bool  | InConstructor () const
RHINO_SDK_FUNCTION void  | IncrementRhinoAppTicker ()
RHINO_SDK_FUNCTION bool  | InDestructor () const
RHINO_SDK_FUNCTION bool  | InExitInstance () const
RHINO_SDK_FUNCTION bool  | InFullscreen () const
RHINO_SDK_FUNCTION bool  | InInitInstance () const
void  | InitCursorToolTip ()
BOOL32  | InitInstance ()
RHINO_SDK_FUNCTION bool  | InMainFrameOnClose () const
RHINO_SDK_FUNCTION bool  | InScriptRunnerCommand () const
RHINO_SDK_FUNCTION installation_type  | InstallationType ()
RHINO_SDK_FUNCTION ON_wString  | InstallationTypeString ()
RHINO_SDK_FUNCTION bool  | InstallFolder (ON_wString &result)
RHINO_SDK_FUNCTION bool  | IsAutomated () const
RHINO_SDK_FUNCTION bool  | IsBatchMode () const
RHINO_SDK_FUNCTION bool  | IsClosing () const
RHINO_SDK_FUNCTION bool  | IsCloudZooNode ()
bool  | IsDontRepeatCommand (wchar_t *token)
RHINO_SDK_FUNCTION bool  | IsEvaluation ()
RHINO_SDK_FUNCTION bool  | IsExiting () const
RHINO_SDK_FUNCTION bool  | IsHeadless () const
RHINO_SDK_FUNCTION bool  | IsInitializing () const
RHINO_SDK_FUNCTION bool  | IsInternetAccessAllowed ()
RHINO_SDK_FUNCTION bool  | IsLicenseValidated ()
RHINO_SDK_FUNCTION bool  | IsParentWindowDesktop () const
RHINO_SDK_FUNCTION bool  | IsPreRelease ()
RHINO_SDK_FUNCTION bool  | IsRhino2UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino3UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino4UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino5UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino6UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino7UUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsRhino8UUID (const ON_UUID) const
bool  | IsRhinoAllowedToRun () const
RHINO_SDK_FUNCTION bool  | IsRhinoUUID (const ON_UUID) const
RHINO_SDK_FUNCTION bool  | IsSafeModeEnabled () const
RHINO_SDK_FUNCTION bool  | IsSingleDocApp () const
RHINO_SDK_FUNCTION bool  | IsSkinned () const
RHINO_SDK_FUNCTION bool  | IsUnattended () const
RHINO_SDK_FUNCTION bool  | LicenseExpires ()
class CRhinoLicenseManager &  | LicenseManager ()
RHINO_SDK_FUNCTION ON_wString  | LicenseUserName ()
RHINO_SDK_FUNCTION ON_wString  | LicenseUserOrganization ()
RHINO_SDK_FUNCTION CRhinoView *  | LookupView (ON_UUID main_viewport_id) const
class CMainFrame *  | MainFrame () const
HMENU  | MainHMenu () const
CWnd *  | MainWindow () const
RHINO_SDK_FUNCTION HWND  | MainWnd () const
RHINO_SDK_FUNCTION void *  | Malloc (size_t)
main application memory pool tools More...
RHINO_SDK_FUNCTION void *  | Memdup (const void *, size_t)
RHINO_SDK_FUNCTION ON_SimpleArray< ON_4iRect >  | MonitorRects () const
const ON_ClassArray< CRhMruCommandRecord > &  | MruCommandList () const
bool  | NoCancelOnMainFrameClose () const
RHINO_SDK_FUNCTION node_type  | NodeType ()
RHINO_SDK_FUNCTION class IRhinoObjectManager &  | ObjectManager (void)
RHINO_SDK_FUNCTION CRhinoDoc *  | ObsoleteActiveDoc () const
ON_DEPRECATED. More...
void  | OnAppAbout ()
Call RhinoAbout() externally. More...
void  | OnAppFileNew ()
bool  | OnEscapeKeyDown ()
void  | OnFileClose ()
void  | OnFileNew ()
void  | OnFileOpen ()
RHINO_SDK_FUNCTION BOOL32  | OnIdle (LONG lCount)
void  | OnInitMenuPopup (WPARAM wparam, LPARAM lparam)
BOOL32  | OnOpenRecentFile (UINT nID)
bool  | OnSysKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
Does the "generic" Alt+Fx and F10 key handling. More...
bool  | OnSysKeyUp (UINT nChar, UINT nRepCnt, UINT nFlags)
Needed for Alt + arrow key input buffer cleanup when nudging. More...
CDocument *  | OpenDocumentFile (LPCTSTR lpszFileName)
CDocument *  | OpenDocumentFile (LPCTSTR lpszFileName, BOOL32 bAddToMRU)
const RHINO_SDK_FUNCTION wchar_t *  | OsnapName (CRhinoAppSettings::osnap_mode)
class CRhPlugInManager &  | PlugInManager ()
bool  | PopMainMenu ()
bool  | PostRhinoWindowsMessage (WPARAM wParam, LPARAM lParam)
DO NOT PUT THIS FUNCTION IN THE PUBLIC SDK. More...
BOOL32  | PreTranslateMessage (MSG *pMsg)
RHINO_SDK_FUNCTION void ON_VARGS_FUNC_CDECL  | Print (const char *format,...) const
Print formatted text in the command window. More...
RHINO_SDK_FUNCTION void ON_VARGS_FUNC_CDECL  | Print (const wchar_t *format,...) const
See ON_wString::Format for a description of string formatting. More...
void  | PrintCommandNameList (bool is_interactive) const
class CRhPrintManager &  | PrintManager ()
RHINO_SDK_FUNCTION CRhinoProfileContext &  | ProfileContext ()
RHINO_SDK_FUNCTION bool  | PurgeCommand (CRhinoCommand *pCommand, ON_UUID password)
bool  | PushMainMenu ()
BOOL32  | PushStatusBarButton (UINT nBntID, BOOL32 bIn)
RHINO_SDK_FUNCTION void *  | Realloc (void *, size_t)
RHINO_SDK_FUNCTION void  | RecordInitInstanceTime (const wchar_t *) const
Plug-in support for startup /stopwatch command line option. More...
RHINO_SDK_FUNCTION bool  | RefreshRhinoLicense ()
RHINO_SDK_FUNCTION void  | RefreshScreen () const
RHINO_SDK_FUNCTION BOOL32  | RegisterCommand (CRhinoCommand *pCommand)
RHINO_SDK_FUNCTION bool  | RegisterGripsEnabler (CRhinoGripsEnabler *pCustomGripsInformation)
RHINO_SDK_FUNCTION LPCTSTR  | RegistrySchemeName () const
RHINO_SDK_FUNCTION bool  | RememberCopyOption () const
RHINO_SDK_FUNCTION BOOL32  | RemovePageFromObjectPropertiesDialog (class IRhinoPropertiesPanelPage *pPage)
RHINO_SDK_FUNCTION BOOL32  | RemovePlugInAddedMenu (HMENU hmenu, CRhinoPlugIn *plug_in)
STEVEBAERV6///< - Need to chat with John about plan for supporting menu in V6. More...
MAC_DEPRECATED RHINO_SDK_FUNCTION void  | RepeatCommand ()
repeats previous command More...
bool  | RespondToRhinoWindowsMessage (WPARAM wParam, LPARAM lParam)
DO NOT PUT THIS FUNCTION IN THE PUBLIC SDK. More...
RHINO_SDK_FUNCTION bool  | RestoreControlBars (bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | RestoreFullscreen (const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | RestoreToolBars (bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION bool  | RestoreWindowBars (bool bRedraw=true, const CRhinoDoc *pDoc=nullptr)
RHINO_SDK_FUNCTION ON_UUID  | Rhino2_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino3_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino4_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino5_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino6_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino7_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino8_UUID () const
RHINO_SDK_FUNCTION ON_UUID  | Rhino9_UUID () const
RHINO_SDK_FUNCTION void  | RhinoAbout (bool bForceRhinoAbout=false) const
RHINO_SDK_FUNCTION LPCTSTR  | RhinoCommandLine () const
RHINO_SDK_FUNCTION class CRhinoCommandManager &  | RhinoCommandManager ()
RHINO_SDK_FUNCTION ON_UUID  | RhinoCurrent_UUID () const
RHINO_SDK_FUNCTION CRhinoDirectoryManager &  | RhinoDirectoryManager ()
RHINO_SDK_FUNCTION HKEY  | RhinoGetAppRegistryKeyEx (int nMode, int nProfile=CRhinoProfileContext::cl_scheme_current_user)
RHINO_SDK_FUNCTION HKEY  | RhinoGetGlobalOptionsRegistryKeyEx (int nMode, int nProfile=CRhinoProfileContext::cl_scheme_current_user)
RHINO_SDK_FUNCTION HKEY  | RhinoGetRootRegistryKeyEx (int nMode, int nProfile=CRhinoProfileContext::cl_scheme_current_user)
RHINO_SDK_FUNCTION HKEY  | RhinoGetSectionKey (LPCTSTR lpszSection, int nProfile=CRhinoProfileContext::cl_scheme_current_user)
RHINO_SDK_FUNCTION HKEY  | RhinoGetSectionKeyEx (LPCTSTR lpszSection, int nMode, int nProfile=CRhinoProfileContext::cl_scheme_current_user)
RHINO_SDK_FUNCTION HINSTANCE  | RhinoInstanceHandle () const
CDocTemplate *  | RhinoMfcDocTemplate ()
RHINO_SDK_FUNCTION AFX_MODULE_STATE *  | RhinoModuleState () const
RHINO_SDK_FUNCTION UUID  | RhinoRenderPlugInUUID () const
Return UUID for the one and only Rhino system render plug-in. More...
HINSTANCE  | RhinoResourceHandle ()
RHINO_SDK_FUNCTION class CRhinoAppUiManager &  | RhinoUiManager () const
RHINO_SDK_FUNCTION class CRhinoUiPaintManager &  | RhinoUiPaintManager () const
RHINO_SDK_FUNCTION class CRhinoAppUiResourceManager &  | RhinoUiResourceManager () const
RHINO_SDK_FUNCTION class CRhSkin &  | RhSkin () const
Obsolete use CRhinoApp::GetRhSkin() More...
RHINO_SDK_FUNCTION bool  | RunAsServer ()
RHINO_SDK_FUNCTION bool  | RunMenuScript (const wchar_t *script)
RHINO_SDK_FUNCTION bool  | RunMenuScript (unsigned int rhino_doc_sn, const wchar_t *script)
MAC_DEPRECATED void  | RunMruCommand (int cmd_index)
MAC_DEPRECATED void  | RunMruFavoriteCommand (int cmd_index)
MAC_DEPRECATED const RHINO_SDK_FUNCTION CRhinoCommand *  | RunningCommand (int i) const
RHINO_SDK_FUNCTION bool  | RunScript (const CRhinoScriptContext &script_context)
RHINO_SDK_FUNCTION bool  | RunScript (unsigned int rhino_doc_sn, const wchar_t *script, int echo_mode=1)
RHINO_SDK_FUNCTION bool  | RunScriptEx (unsigned int rhino_doc_sn, const wchar_t *script, const wchar_t *mruDisplayString, int echo_mode=1)
BOOL32  | SaveAllModified ()
save before exit More...
HMENU  | SavedMainMenu () const
RHINO_SDK_FUNCTION unsigned int  | SdkServiceRelease () const
RHINO_SDK_FUNCTION unsigned int  | SdkVersion () const
void  | SendCharToCommandWnd (UINT nChar, UINT nRepCnt, UINT nFlags) const
low level tool used to send keyboard events to command window More...
RHINO_SDK_FUNCTION bool  | SendCommandWindowPrintToConsole (bool enabled)
RHINO_SDK_FUNCTION bool  | SendCommandWindowPrintToConsoleEnabled () const
void  | SendKeyDownToCommandWnd (UINT nChar, UINT nRepCnt, UINT nFlags) const
RHINO_SDK_FUNCTION ON_wString  | SerialNumber ()
RHINO_SDK_FUNCTION void  | SetActiveView (CRhinoView *) const
RHINO_SDK_FUNCTION void  | SetActiveViewport (ON_UUID viewport_id)
bool  | SetAllowActivateCommandWindowCaret (bool b=true)
void  | SetAppID (const wchar_t *)
RHINO_SDK_FUNCTION void  | SetCommandPrompt (const wchar_t *prompt, const wchar_t *prompt_default, const ON_ClassArray< CRhinoCommandOption > &options)
RHINO_SDK_FUNCTION void  | SetCommandPrompt (const wchar_t *prompt, const wchar_t *prompt_default=nullptr)
RHINO_SDK_FUNCTION void  | SetCommandPromptMessage (const wchar_t *sMessage)
Setting command window prompt. More...
void  | SetCommandWindowText (const wchar_t *=nullptr)
RHINO_SDK_FUNCTION void  | SetCursorToolTip (const ON_wString &)
RHINO_SDK_FUNCTION void  | SetCursorToolTipNumberPane (double d, bool bAutoFormatDistance=true)
RHINO_SDK_FUNCTION void  | SetCursorToolTipOsnapPane (CRhinoAppSettings::osnap_mode)
RHINO_SDK_FUNCTION void  | SetCursorToolTipPane (CRhinoApp::cursor_tooltip_pane, const ON_wString &)
RHINO_SDK_FUNCTION void  | SetCursorToolTipPointPane (ON_3dPoint point, const ON_Plane *plane=nullptr)
void  | SetCursorToolTipPromptPane (const ON_wString &)
RHINO_SDK_FUNCTION bool  | SetDefaultRenderApp (ON_UUID &uuid)
void  | SetFileReadOptions (const class CRhFileReadOptions &)
RHINO_SDK_FUNCTION bool  | SetFullscreen (UINT nCBMask, UINT nWBMask, int nDockState, const CRhinoDoc *pDoc=nullptr)
void  | SetNoCancelOnMainFrameClose (bool b)
void  | SetProtocolHandlerUrl (const wchar_t *protocolHandlerUrl)
RHINO_SDK_FUNCTION void  | SetRememberCopyOption (bool b)
RHINO_SDK_FUNCTION void  | SetStatusBarDistancePane (double dist, bool bAutoFormatDistancePane=true)
Setting command window prompt. More...
RHINO_SDK_FUNCTION void  | SetStatusBarMessagePane (const wchar_t *)
pass NULL to clear message pane More...
RHINO_SDK_FUNCTION void  | SetStatusBarNumberPane (double angle)
RHINO_SDK_FUNCTION void  | SetStatusBarPointPane (const ON_3dPoint &, const ON_Plane *pPane=nullptr)
RHINO_SDK_FUNCTION bool  | StartedAsRhinoExe () const
class CRhinoStatusBar *  | StatusBar () const
RHINO_SDK_FUNCTION void  | StatusBarProgressMeterEnd ()
RHINO_SDK_FUNCTION int  | StatusBarProgressMeterPos (int nPos, bool bAbsolute=true)
RHINO_SDK_FUNCTION int  | StatusBarProgressMeterStart (int nLower, int nUpper, const wchar_t *pszLabel=nullptr, bool bEmbedLabel=true, bool bShowPercent=true)
class CStringTableCollection &  | StringTables ()
bool  | StringTablesInitialized () const
RHINO_SDK_FUNCTION class CRhTextureManager &  | TextureManager ()
bool  | UpdateCursorToolTipLocation (const ON_2iPoint &pt)
void  | UpdateNotesWindow (unsigned int rhino_doc_sn)
RHINO_SDK_FUNCTION int  | UpdatesAndStatisticsStatus ()
bool  | UseNetCoreRuntime ()
RHINO_SDK_FUNCTION bool  | ValidateRhinoLicense (const wchar_t *licenseKey, const wchar_t *email)
RHINO_SDK_FUNCTION int  | ValidationGracePeriodDaysLeft ()
bool  | ViewDisableSetActiveView () const
bool  | ViewerOnlyMode () const
bool  | ViewSetDisableSetActiveView (bool b)
LPCTSTR  | ViewWndClassName () const
CRhinoView window class name. More...
RHINO_SDK_FUNCTION void  | Wait (DWORD dwMilliseconds=0)
RHINO_SDK_FUNCTION CRhinoProfileContext &  | WindowPositionsProfileContext ()
 Static Public Member Functions
static unsigned int  | GetPOSIXLocaleIdentifier (NSString *locale)
 Public Attributes
HCURSOR  | m_control_polygon_dragmode_cursor
const char *  | m_language_abbreviation
unsigned int  | m_language_identifier
Rhino language identifier. More...
HCURSOR  | m_uvn_dragmode_cursor
HCURSOR  | m_view_dragmode_cursor
HCURSOR  | m_world_dragmode_cursor
Dragmode cursors. More...
 Public Attributes inherited from CRhinoApp
HCURSOR  | m_arrow_command_cursor = nullptr
HCURSOR  | m_arrow_copy_cursor = nullptr
arrow with "+" More...
HCURSOR  | m_cen_osnap_arrow_cursor = nullptr
HCURSOR  | m_cen_osnap_cursor = nullptr
HCURSOR  | m_context_menu_cursor = nullptr
HCURSOR  | m_cross_hair_copy_cursor = nullptr
HCURSOR  | m_cross_hair_cursor = nullptr
HCURSOR  | m_cursor = nullptr
current cursor More...
HCURSOR  | m_default_cursor = nullptr
Steve - I would like to eventually make these private and accessible through functions. More...
HCURSOR  | m_end_osnap_arrow_cursor = nullptr
HCURSOR  | m_end_osnap_cursor = nullptr
HCURSOR  | m_focus_osnap_cursor = nullptr
HCURSOR  | m_hand_cursor = nullptr
HCURSOR  | m_hand_snap_cursor = nullptr
HCURSOR  | m_hyperlink_cursor = nullptr
HCURSOR  | m_int_osnap_arrow_cursor = nullptr
HCURSOR  | m_int_osnap_cursor = nullptr
HCURSOR  | m_knot_osnap_arrow_cursor = nullptr
HCURSOR  | m_knot_osnap_cursor = nullptr
HCURSOR  | m_magnify_cursor = nullptr
HCURSOR  | m_magnify_snap_cursor = nullptr
HCURSOR  | m_mid_osnap_arrow_cursor = nullptr
HCURSOR  | m_mid_osnap_cursor = nullptr
HCURSOR  | m_near_osnap_arrow_cursor = nullptr
HCURSOR  | m_near_osnap_cursor = nullptr
HCURSOR  | m_object_perp_osnap_cursor = nullptr
HCURSOR  | m_object_tan_osnap_cursor = nullptr
HCURSOR  | m_oncrv_osnap_cursor = nullptr
HCURSOR  | m_onmesh_osnap_cursor = nullptr
HCURSOR  | m_onsrf_osnap_cursor = nullptr
class CRhinoAppFonts *  | m_pAppFonts = nullptr
HCURSOR  | m_perp_osnap_cursor = nullptr
HCURSOR  | m_point_osnap_arrow_cursor = nullptr
Current drag base point osnap cursors (arrow cursor and osnap label) More...
HCURSOR  | m_point_osnap_cursor = nullptr
Current osnap cursors. More...
HCURSOR  | m_prohibit_cursor = nullptr
circle with slash More...
class CRhino3Splash *  | m_pSplash = nullptr
HCURSOR  | m_quad_osnap_arrow_cursor = nullptr
HCURSOR  | m_quad_osnap_cursor = nullptr
HCURSOR  | m_rotate_cursor = nullptr
HCURSOR  | m_tan_osnap_cursor = nullptr
HCURSOR  | m_vertex_osnap_arrow_cursor = nullptr
HCURSOR  | m_vertex_osnap_cursor = nullptr
HCURSOR  | m_wait_cursor = nullptr
 Protected Member Functions
friend  | CRhinoAppAppearanceSettings::CRhinoAppAppearanceSettings ()
unsigned int  | SetPOSIXLocale ()
 Protected Member Functions inherited from CRhinoApp
class CCommandControlBar *  | CommandWindow () const
void  | LoadProfile (CRhinoProfileContext &PC)
MAC_DEPRECATED LPCTSTR  | MruMenuString () const
void  | RegisterRhinoFactories (bool bAutomated)
Rhino's version of COleObjectFactory::RegisterAll() More...
void  | SetCommandToRepeat (const CRhinoApp::CRhMruCommandRecord &rec)
bool  | SetDefaultRenderApp (ON_UUID &uuid, bool force)
Special version of SetDefaultRenderApp called by InitInstance. Not exported. More...
MAC_DEPRECATED void  | SetMruMenuString (HMENU hmenu, UINT id)
void  | WinAppOnFileNew ()
TODO: remove this, temp hack to access private CWinApp func. More...
 Protected Attributes
id  | m_appDefaults
a NSMutableDictionary of default values More...
BOOL32  | m_bInitialized
TRUE after initialization is completed. More...
class RhCommandAutocompleter *  | m_commandAutocompleter
CRhCustomMenuManager *  | m_custom_menu_manager
pthread_t  | m_main_thread_id
APP_STATE  | m_save_state = APP_STATE::app_state_ctor_zero
CThreadManager *  | m_thread_manager
 Protected Attributes inherited from CRhinoApp
bool  | m_activate_command_caret = true
class CRhFileReadOptions &  | m_app_fro
unsigned char  | m_app_fro_buffer [4096]
bool  | m_bCursorToolTip = false
bool  | m_bInFullscreen = false
bool  | m_bInViewNavigation = false
bool  | m_bNoCancelOnMainFrameClose = false
bool  | m_bRememberCopyOption = true
This looks like it should be on app settings. More...
bool  | m_bRestoreFromFullscreen = false
bool  | m_bSafeModeEnabled = false
class CRhCommandManager *  | m_command_manager = nullptr
ON_wString  | m_CommandLineLoadGrasshopperFileName
ON_wString  | m_CommandLineLoadScriptFileName
ON_SimpleArray< CRhinoGripsEnabler * >  | m_custom_grips
ON_UUID  | m_default_render_plug_in
CRhinoDirectoryManager  | m_dir_manager
bool  | m_disable_set_active_view = false
class CRhWorkSession *  | m_DO_NOT_USE = nullptr
CRhinoFileMenu  | m_FileMenu
File menu options;. More...
HMENU  | m_hParentMenu = nullptr
CRhinoAppSettings *  | m_lazyptr_app_settings = nullptr
class CRhAutoSave *  | m_lazyptr_autosave = nullptr
class CRhCustomMenuManager *  | m_lazyptr_custom_menu_manager = nullptr
class CRhinoDigitizerManager *  | m_lazyptr_digitizer_manager = nullptr
class CRhDocViewManager *  | m_lazyptr_docview_manager = nullptr
class CRhinoLicenseManager *  | m_lazyptr_license_manager = nullptr
class CRhPaletteManager *  | m_lazyptr_palette_manager = nullptr
class CRhPlugInManager *  | m_lazyptr_plug_in_manager = nullptr
class CRhPrintManager *  | m_lazyptr_print_manager = nullptr
class CRhTextureManager *  | m_lazyptr_texture_manager = nullptr
CRhinoProfileContext *  | m_pc_scheme_current_user = nullptr
CRhinoProfileContext *  | m_pc_window_positions = nullptr
Attaches to the CRhAppSettings::WindowPostions() settings. More...
class CToolTipCtrl *  | m_pCursorToolTip = nullptr
ON_SimpleArray< ON_UUID >  | m_PlugInFileExportDisplayList
ON_SimpleArray< ON_UUID >  | m_PlugInFileImportDisplayList
class CRhSkin *  | m_pRhinoSkin = nullptr
class CRhinoAppUiManager *  | m_pRhinoUiManager = nullptr
ON__UINT64  | m_rhino_app_ticker = 0
bool  | m_RunAsViewerOnly = false
HMENU  | m_save_menu = nullptr
ON_wString  | m_sCurrentMenuLabel
ON_wString  | m_sParentMenuLabel
ON_wString  | m_sSchemeName
class CStringTableCollection *  | m_string_tables = nullptr
ON_wString  | m_sViewWndClass
TOOLINFOW  | m_tiCursorToolTip
bool  | m_unused = false
ON_wString  | m_wCursorToolTip
ON_wString  | m_wCursorToolTipPanes [cursor_tooltip_pane_count]
WINDOWPLACEMENT  | m_WP
WARNING: Do not add public data fields to CRhinoApp below this line. More...
 Additional Inherited Members
 Public Types inherited from CRhinoApp
enum  | {
 HCB_COMMANDLINE_BAR = 0x00000001, HCB_CURVATURE_ANALYSIS_BAR = 0x00000002, HCB_CURVATURE_GRAPH_BAR = 0x00000004, HCB_DRAFT_ANGLE_BAR = 0x00000008,
 HCB_EDGE_ANALYSIS_BAR = 0x00000010, HCB_EMAP_BAR = 0x00000020, HCB_LAYER_BAR = 0x00000040, HCB_LAYER_MANAGER_BAR = 0x00000080,
 HCB_MOVE_UVN_BAR = 0x00000100, HCB_NOTES_BAR = 0x00000200, HCB_OSNAP_BAR = 0x00000400, HCB_PROPERTIES_BAR = 0x00000800,
 HCB_VIEW_MANAGER_BAR = 0x00001000, HCB_ZEBRA_BAR = 0x00002000, HCB_COMMAND_CONTEXT_BAR = 0x00004000, HCB_END_ANALYSIS_BAR = 0x00008000,
 HCB_DIRECTION_ANALYSIS_BAR = 0x00010000
 }
Control bar bit masks... More...
enum  | { HWB_TITLE_BAR = 0x00000001, HWB_MENU_BAR = 0x00000002, HWB_STATUS_BAR = 0x00000004 }
Window bar bit masks... More...
enum  | APP_STATE : unsigned int {
 app_state_ctor_zero = 0, app_state_ctor_begin, app_state_ctor_end, app_state_ctor_exited,
 app_state_InitInstance_begin, app_state_InitInstance_before_WinAppInit, app_state_InitInstance_after_WinAppInit, app_state_InitInstance_end,
 app_state_InitInstance_exited, app_state_OnClose_begin, app_state_OnClose_before_MDIClose, app_state_OnClose_UnsavedCancel,
 app_state_OnClose_after_MDIClose, app_state_OnClose_end, app_state_OnClose_Canceled, app_state_OnClose_exited,
 app_state_ExitInstance_begin, app_state_ExitInstance_before_WinAppExit, app_state_ExitInstance_after_WinAppExit, app_state_ExitInstance_end,
 app_state_ExitInstance_exited, app_state_dtor_begin, app_state_dtor_end, app_state_dtor_exited
 }
enum  | cursor_tooltip_pane {
 number_pane = 0, osnap_pane = 1, point_pane = 2, relative_point_pane = 3,
 prompt_pane = 4, feedback_pane = 5, extra_pane = 6, cursor_tooltip_pane_count = 7
 }
enum  | installation_type {
 installation_undefined = 0, installation_commercial, installation_educational, installation_educational_lab,
 installation_not_for_resale, installation_not_for_resale_lab, installation_beta, installation_beta_lab,
 installation_evaluation, installation_corporate, installation_evaluation_timed, installation_force_32_bit = 0xFFFFFFFF
 }
enum  | node_type { node_stand_alone = 0, node_network, node_network_checked_out, node_type_force_32_bit = 0xFFFFFFFF }
Constructor & Destructor Documentation
◆ MRhinoApp()
 MRhinoApp::MRhinoApp  |  ( |  class CRhApp &  |   | )
◆ ~MRhinoApp()
 virtual MRhinoApp::~MRhinoApp  |  ( |   | )
virtual
Member Function Documentation
◆ AppDefaults()
 id MRhinoApp::AppDefaults  |  ( |  void  |   | ) |   const
overridevirtual
Implements CRhinoApp.
◆ AppName()
 LPCTSTR MRhinoApp::AppName  |  ( |   | ) |   const
overridevirtual
Implements CRhinoApp.
◆ Arrange3dViews()
 void MRhinoApp::Arrange3dViews  |  ( |  const class CDocument &  |   | )
◆ BeginWaitCursor()
 void MRhinoApp::BeginWaitCursor  |  ( |   | )
overridevirtual
Implements CRhinoApp.
◆ CRhinoAppAppearanceSettings::CRhinoAppAppearanceSettings()
 MRhinoApp::CRhinoAppAppearanceSettings::CRhinoAppAppearanceSettings  |  ( |   | )
protected
◆ EndWaitCursor()
 void MRhinoApp::EndWaitCursor  |  ( |   | )
overridevirtual
Implements CRhinoApp.
◆ ExitApp()
 void MRhinoApp::ExitApp  |  ( |   | )
◆ GetCommandAutocompleter()
 class RhCommandAutocompleter& MRhinoApp::GetCommandAutocompleter  |  ( |   | )
◆ GetCommandLineScript()
 bool MRhinoApp::GetCommandLineScript  |  ( |  ON_wString &  |   | )
◆ GetOpenDocument()
 CRhinoDoc* MRhinoApp::GetOpenDocument  |  ( |  int  |   | ) |   const
Description:
Parameters: document_index - zero based array index
Returns: Reference to the requested document.
◆ GetOpenDocumentCount()
 int MRhinoApp::GetOpenDocumentCount  |  ( |   | ) |   const
Returns: Number of open documents.
◆ GetPOSIXLocaleIdentifier() [1/2]
 unsigned int MRhinoApp::GetPOSIXLocaleIdentifier  |  ( |   | ) |   const
overridevirtual
Implements CRhinoApp.
◆ GetPOSIXLocaleIdentifier() [2/2]
 static unsigned int MRhinoApp::GetPOSIXLocaleIdentifier  |  ( |  NSString *  |  locale | )
static
◆ GetPOSIXLocaleName()
 const char* MRhinoApp::GetPOSIXLocaleName  |  ( |   | ) |   const
overridevirtual
ON_RUNTIME_WIN.
Implements CRhinoApp.
◆ HideOnDemandToolPalettesForCommand()
 void MRhinoApp::HideOnDemandToolPalettesForCommand  |  ( |  LPCTSTR  |  str | )
◆ Initialize()
 int MRhinoApp::Initialize  |  ( |   | )
◆ InitializeCustomCursors()
 void MRhinoApp::InitializeCustomCursors  |  ( |   | )
◆ IsAnyMainThread()
 bool MRhinoApp::IsAnyMainThread  |  ( |  const pthread_t  |  t | )
◆ IsLicenseManagerInitialized()
 bool MRhinoApp::IsLicenseManagerInitialized  |  ( |   | )
◆ LoadCursor()
 HCURSOR MRhinoApp::LoadCursor  |  ( |  unsigned int  |  cursorID | ) |   const
overridevirtual
Implements CRhinoApp.
◆ LoadResourceDLL()
 bool MRhinoApp::LoadResourceDLL  |  ( |  ON_wString  |   | )
◆ MainHMenu()
 void* MRhinoApp::MainHMenu  |  ( |   | ) |   const
◆ MainThread()
 const pthread_t MRhinoApp::MainThread  |  ( |   | )
◆ OnClose()
 void MRhinoApp::OnClose  |  ( |   | )
◆ OnMRApplicationTerminate()
 void MRhinoApp::OnMRApplicationTerminate  |  ( |   | )
◆ OnMRApplicationTerminateCancel()
 void MRhinoApp::OnMRApplicationTerminateCancel  |  ( |   | )
◆ OpenDocumentFile()
 class CDocument* MRhinoApp::OpenDocumentFile  |  ( |  const wchar_t *  |   | )
◆ ProfileName()
 const wchar_t* MRhinoApp::ProfileName  |  ( |   | ) |   const
overridevirtual
Implements CRhinoApp.
◆ RecentFileList()
 class CRecentFileList* MRhinoApp::RecentFileList  |  ( |   | )
◆ RegistryKey()
 const wchar_t* MRhinoApp::RegistryKey  |  ( |   | ) |   const
overridevirtual
Implements CRhinoApp.
◆ RhinoGetProfileString()
 CString MRhinoApp::RhinoGetProfileString  |  ( |  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  int
)
◆ RhinoWriteProfileString() [1/3]
 BOOL32 MRhinoApp::RhinoWriteProfileString  |  ( |  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  const char *  |  ,
|  int
)
◆ RhinoWriteProfileString() [2/3]
 BOOL32 MRhinoApp::RhinoWriteProfileString  |  ( |  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  int
)
◆ RhinoWriteProfileString() [3/3]
 BOOL32 MRhinoApp::RhinoWriteProfileString  |  ( |  const wchar_t *  |  ,
|  const wchar_t *  |  ,
|  CString &  |  ,
|  int
)
◆ SetAppName()
 void MRhinoApp::SetAppName  |  ( |  LPCTSTR  |   | )
overridevirtual
Implements CRhinoApp.
◆ SetMruMenuString()
 void MRhinoApp::SetMruMenuString  |  ( |  LPCTSTR  |  str | )
◆ SetPOSIXLocale()
 unsigned int MRhinoApp::SetPOSIXLocale  |  ( |   | )
protected
◆ ThreadManager()
 CThreadManager& MRhinoApp::ThreadManager  |  ( |  void  |   | ) |   const
overridevirtual
Implements CRhinoApp.
Member Data Documentation
◆ m_appDefaults
 id MRhinoApp::m_appDefaults
protected
a NSMutableDictionary of default values
◆ m_bInitialized
 BOOL32 MRhinoApp::m_bInitialized
protected
TRUE after initialization is completed.
◆ m_commandAutocompleter
 class RhCommandAutocompleter* MRhinoApp::m_commandAutocompleter
protected
◆ m_control_polygon_dragmode_cursor
 HCURSOR MRhinoApp::m_control_polygon_dragmode_cursor
◆ m_custom_menu_manager
 CRhCustomMenuManager* MRhinoApp::m_custom_menu_manager
protected
◆ m_language_abbreviation
 const char* MRhinoApp::m_language_abbreviation
◆ m_language_identifier
 unsigned int MRhinoApp::m_language_identifier
Rhino language identifier.
◆ m_main_thread_id
 pthread_t MRhinoApp::m_main_thread_id
protected
◆ m_save_state
 APP_STATE MRhinoApp::m_save_state = APP_STATE::app_state_ctor_zero
protected
◆ m_thread_manager
 CThreadManager* MRhinoApp::m_thread_manager
protected
◆ m_uvn_dragmode_cursor
 HCURSOR MRhinoApp::m_uvn_dragmode_cursor
◆ m_view_dragmode_cursor
 HCURSOR MRhinoApp::m_view_dragmode_cursor
◆ m_world_dragmode_cursor
 HCURSOR MRhinoApp::m_world_dragmode_cursor
Dragmode cursors.