Public Member Functions | Public Attributes | Friends | List of all members
ON_PostEffects Class Reference
OpenNURBS
Class ON_PostEffects represents a collection of post effects. More...
#include <opennurbs_post_effects.h>
 Public Member Functions
ON_PostEffects ()
ON_PostEffects (const ON_PostEffects &peps)
ON_PostEffects (ON_XMLNode &model_node)
virtual  | ~ON_PostEffects ()
virtual bool  | AddPostEffect (ON_PostEffect::Types type, const ON_UUID &id, const wchar_t *local_name, const ON_PostEffectParams &params, bool is_listable, bool listable_on, bool listable_shown)
Add a new post effect to the collection. More...
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual void  | GetPostEffects (ON_PostEffect::Types type, ON_SimpleArray< const ON_PostEffect * > &a) const
virtual void  | GetPostEffects (ON_PostEffect::Types type, ON_SimpleArray< ON_PostEffect * > &a)
Get an array of post effects of a certain type. More...
virtual void  | GetPostEffects (ON_SimpleArray< const ON_PostEffect * > &a) const
virtual void  | GetPostEffects (ON_SimpleArray< ON_PostEffect * > &a)
Get an array of all post effects. More...
virtual bool  | GetSelectedPostEffect (ON_PostEffect::Types type, ON_UUID &id_out) const
virtual bool  | MovePostEffectBefore (const ON_UUID &id_move, const ON_UUID &id_before)
virtual void  | OnInternalXmlChanged (const ON_PostEffects *)
For internal use only. More...
virtual bool  | operator!= (const ON_PostEffects &peps) const
virtual ON_PostEffects &  | operator= (const ON_PostEffects &peps)
virtual bool  | operator== (const ON_PostEffects &peps) const
virtual ON_PostEffect *  | PostEffectFromId (const ON_UUID &id)
Find a post effect from its id. More...
virtual const ON_PostEffect *  | PostEffectFromId (const ON_UUID &id) const
const ON_XMLNode &  | PostEffectsNode (void) const
< Expert access to the post effect XML. More...
void  | SetPostEffectsNode (const ON_XMLNode &)
Sets the XML node that stores the state of all the post effects (ON_RDK_POST_EFFECTS). More...
virtual void  | SetSelectedPostEffect (ON_PostEffect::Types type, const ON_UUID &id)
Sets the selected post effect for a certain type. More...
 Public Attributes
CImpl *  | _impl
 Friends
class  | ON_PostEffect
< For internal use only. More...
Detailed Description
Class ON_PostEffects represents a collection of post effects.
Constructor & Destructor Documentation
◆ ON_PostEffects() [1/3]
 ON_PostEffects::ON_PostEffects  |  ( |   | )
◆ ON_PostEffects() [2/3]
 ON_PostEffects::ON_PostEffects  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_PostEffects() [3/3]
 ON_PostEffects::ON_PostEffects  |  ( |  const ON_PostEffects &  |  peps | )
◆ ~ON_PostEffects()
 virtual ON_PostEffects::~ON_PostEffects  |  ( |   | )
virtual
Member Function Documentation
◆ AddPostEffect()
 virtual bool ON_PostEffects::AddPostEffect  |  ( |  ON_PostEffect::Types  |  type,
|  const ON_UUID &  |  id,
|  const wchar_t *  |  local_name,
|  const ON_PostEffectParams &  |  params,
|  bool  |  is_listable,
|  bool  |  listable_on,
|  bool  |  listable_shown
)
virtual
Add a new post effect to the collection.
◆ EVF()
 virtual void* ON_PostEffects::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ GetPostEffects() [1/4]
 virtual void ON_PostEffects::GetPostEffects  |  ( |  ON_PostEffect::Types  |  type,
|  ON_SimpleArray< const ON_PostEffect * > &  |  a
) |   |  const
virtual
◆ GetPostEffects() [2/4]
 virtual void ON_PostEffects::GetPostEffects  |  ( |  ON_PostEffect::Types  |  type,
|  ON_SimpleArray< ON_PostEffect * > &  |  a
)
virtual
Get an array of post effects of a certain type.
◆ GetPostEffects() [3/4]
 virtual void ON_PostEffects::GetPostEffects  |  ( |  ON_SimpleArray< const ON_PostEffect * > &  |  a | ) |   const
virtual
◆ GetPostEffects() [4/4]
 virtual void ON_PostEffects::GetPostEffects  |  ( |  ON_SimpleArray< ON_PostEffect * > &  |  a | )
virtual
Get an array of all post effects.
◆ GetSelectedPostEffect()
 virtual bool ON_PostEffects::GetSelectedPostEffect  |  ( |  ON_PostEffect::Types  |  type,
|  ON_UUID &  |  id_out
) |   |  const
virtual
Gets the selected post effect for a certain type into 'id_out'. Returns true if successful or false if the selection information could not be found.
◆ MovePostEffectBefore()
 virtual bool ON_PostEffects::MovePostEffectBefore  |  ( |  const ON_UUID &  |  id_move,
|  const ON_UUID &  |  id_before
)
virtual
Move a post effect before another post effect in the list. Param 'id_move' is the id of the post effect to move. Param 'id_before' is the id of a post effect before which the post effect should be moved. If this is nil, the post effect is moved to the end of the list. If the post effect identified by 'id_before' is not found, the method will fail. Returns true if successful, else false.
◆ OnInternalXmlChanged()
 virtual void ON_PostEffects::OnInternalXmlChanged  |  ( |  const ON_PostEffects *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_PostEffects::operator!=  |  ( |  const ON_PostEffects &  |  peps | ) |   const
virtual
◆ operator=()
 virtual ON_PostEffects& ON_PostEffects::operator=  |  ( |  const ON_PostEffects &  |  peps | )
virtual
◆ operator==()
 virtual bool ON_PostEffects::operator==  |  ( |  const ON_PostEffects &  |  peps | ) |   const
virtual
◆ PostEffectFromId() [1/2]
 virtual ON_PostEffect* ON_PostEffects::PostEffectFromId  |  ( |  const ON_UUID &  |  id | )
virtual
Find a post effect from its id.
◆ PostEffectFromId() [2/2]
 virtual const ON_PostEffect* ON_PostEffects::PostEffectFromId  |  ( |  const ON_UUID &  |  id | ) |   const
virtual
◆ PostEffectsNode()
 const ON_XMLNode& ON_PostEffects::PostEffectsNode  |  ( |  void  |   | ) |   const
< Expert access to the post effect XML.
Returns the XML node that stores the state of all the post effects (ON_RDK_POST_EFFECTS).
◆ SetPostEffectsNode()
 void ON_PostEffects::SetPostEffectsNode  |  ( |  const ON_XMLNode &  |   | )
Sets the XML node that stores the state of all the post effects (ON_RDK_POST_EFFECTS).
◆ SetSelectedPostEffect()
 virtual void ON_PostEffects::SetSelectedPostEffect  |  ( |  ON_PostEffect::Types  |  type,
|  const ON_UUID &  |  id
)
virtual
Sets the selected post effect for a certain type.
Friends And Related Function Documentation
◆ ON_PostEffect
 friend class ON_PostEffect
friend
< For internal use only.
Member Data Documentation
◆ _impl
 CImpl* ON_PostEffects::_impl