Public Member Functions | List of all members
ON_SubDComponentMarksClearAndRestore Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentMarksClearAndRestore (const ON_SubD &subd)
Constructor saves current component RuntimeMark() settings and then clears them. More...
~ON_SubDComponentMarksClearAndRestore ()
Destructor restores saved marks. More...
const ON_SimpleArray< const class ON_SubDComponentBase * > &  | ComponentList () const
void  | DisableRestore ()
Call DisableRestore() to prevent the destructor from restoring saved marks. More...
bool  | Restore (bool bDisableFutureRestores)
Detailed Description
ON_SubDComponentMarksClearAndRestore
Constructor & Destructor Documentation
◆ ON_SubDComponentMarksClearAndRestore()
 ON_SubDComponentMarksClearAndRestore::ON_SubDComponentMarksClearAndRestore  |  ( |  const ON_SubD &  |  subd | )
Constructor saves current component RuntimeMark() settings and then clears them.
◆ ~ON_SubDComponentMarksClearAndRestore()
 ON_SubDComponentMarksClearAndRestore::~ON_SubDComponentMarksClearAndRestore  |  ( |   | )
Destructor restores saved marks.
Member Function Documentation
◆ ComponentList()
 const ON_SimpleArray< const class ON_SubDComponentBase* >& ON_SubDComponentMarksClearAndRestore::ComponentList  |  ( |   | ) |   const
◆ DisableRestore()
 void ON_SubDComponentMarksClearAndRestore::DisableRestore  |  ( |   | )
Call DisableRestore() to prevent the destructor from restoring saved marks.
◆ Restore()
 bool ON_SubDComponentMarksClearAndRestore::Restore  |  ( |  bool  |  bDisableFutureRestores | )
Description: Restore marks saved by the constructor. Parameters: bDisableFutureRestores - [in] If true, no additional restores, including by the destructor, will occur.