Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoPropListProfileContextIterator Class Reference
Rhino
#include <RhinoSdkMacUiProfileContext.h>
 Inheritance diagram for CRhinoPropListProfileContextIterator:
 Public Member Functions
CRhinoPropListProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoPropListProfileContextIterator ()
const wchar_t *  | FirstSection ()
Must override. More...
const wchar_t *  | FirstValue ()
const wchar_t *  | NextSection ()
const wchar_t *  | NextValue ()
 Public Member Functions inherited from CRhinoProfileContextIterator
CRhinoProfileContextIterator (const wchar_t *section, CRhinoProfileContext &pc)
virtual  | ~CRhinoProfileContextIterator ()
int  | IterateAllSections (bool(*cull)(const wchar_t *)=NULL)
int  | IterateAllValues (bool(*cull)(ON_wString &value_name, ON_wString &value)=NULL)
const wchar_t *  | Section (int index) const
int  | SectionCount () const
const ON_ClassArray< ON_wString > &  | Sections () const
const wchar_t *  | Value () const
bool  | Value (bool &result) const
bool  | Value (double &result) const
bool  | Value (int &result) const
bool  | Value (int index, bool &result) const
bool  | Value (int index, double &result) const
bool  | Value (int index, int &result) const
bool  | Value (int index, ON_3dPoint &result) const
bool  | Value (int index, ON_3dVector &result) const
bool  | Value (int index, ON_Color &result) const
bool  | Value (int index, ON_wString &result) const
bool  | Value (int index, POINT &result) const
bool  | Value (int index, RECT &result) const
bool  | Value (ON_3dPoint &result) const
bool  | Value (ON_3dVector &result) const
bool  | Value (ON_Color &result) const
bool  | Value (ON_wString &result) const
bool  | Value (POINT &result) const
bool  | Value (RECT &result) const
int  | ValueCount () const
const wchar_t *  | ValueName (int index) const
const ON_ClassArray< ON_wString > &  | ValueNames () const
const ON_ClassArray< ON_wString > &  | Values () const
 Protected Member Functions
ON_wString  | ExtractSubKey (const ON_wString &section, const ON_wString &key) const
ON_wString  | FormatSectionString (const ON_wString &section) const
int  | KeyIndex (const ON_wString &w) const
bool  | LoadIniFile (CRhinoIniProfileContext &pc, bool bForceReload)
 Protected Attributes
INT_PTR  | m_iIniOffset
class CIniFile* m_pIniFile; More...
INT_PTR  | m_iKeyIndex
ON_ClassArray< ON_wString >  | m_key_list
ON_ClassArray< ON_wString >  | m_value_list
 Protected Attributes inherited from CRhinoProfileContextIterator
int  | m_item
CRhinoProfileContext &  | m_pc
ON_wString  | m_section
ON_ClassArray< ON_wString >  | m_sections
ON_wString  | m_value
ON_wString  | m_value_name
ON_ClassArray< ON_wString >  | m_value_names
ON_ClassArray< ON_wString >  | m_values
ON_wString  | m_w
Detailed Description
class CRhinoPropListProfileContextIterator
Constructor & Destructor Documentation
◆ CRhinoPropListProfileContextIterator()
 CRhinoPropListProfileContextIterator::CRhinoPropListProfileContextIterator  |  ( |  const wchar_t *  |  section,
|  CRhinoProfileContext &  |  pc
)
◆ ~CRhinoPropListProfileContextIterator()
 virtual CRhinoPropListProfileContextIterator::~CRhinoPropListProfileContextIterator  |  ( |   | )
virtual
Member Function Documentation
◆ ExtractSubKey()
 ON_wString CRhinoPropListProfileContextIterator::ExtractSubKey  |  ( |  const ON_wString &  |  section,
|  const ON_wString &  |  key
) |   |  const
protected
◆ FirstSection()
 const wchar_t* CRhinoPropListProfileContextIterator::FirstSection  |  ( |   | )
virtual
Must override.
Implements CRhinoProfileContextIterator.
◆ FirstValue()
 const wchar_t* CRhinoPropListProfileContextIterator::FirstValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ FormatSectionString()
 ON_wString CRhinoPropListProfileContextIterator::FormatSectionString  |  ( |  const ON_wString &  |  section | ) |   const
protected
◆ KeyIndex()
 int CRhinoPropListProfileContextIterator::KeyIndex  |  ( |  const ON_wString &  |  w | ) |   const
protected
◆ LoadIniFile()
 bool CRhinoPropListProfileContextIterator::LoadIniFile  |  ( |  CRhinoIniProfileContext &  |  pc,
|  bool  |  bForceReload
)
protected
◆ NextSection()
 const wchar_t* CRhinoPropListProfileContextIterator::NextSection  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
◆ NextValue()
 const wchar_t* CRhinoPropListProfileContextIterator::NextValue  |  ( |   | )
virtual
Implements CRhinoProfileContextIterator.
Member Data Documentation
◆ m_iIniOffset
 INT_PTR CRhinoPropListProfileContextIterator::m_iIniOffset
protected
class CIniFile* m_pIniFile;
◆ m_iKeyIndex
 INT_PTR CRhinoPropListProfileContextIterator::m_iKeyIndex
protected
◆ m_key_list
 ON_ClassArray<ON_wString> CRhinoPropListProfileContextIterator::m_key_list
protected
◆ m_value_list
 ON_ClassArray<ON_wString> CRhinoPropListProfileContextIterator::m_value_list
protected