Public Attributes | List of all members
CRhinoObjectVisualAnalysisMode Class Reference
Rhino
#include <rhinoSdkAnalysisModes.h>
 Public Attributes
const CRhinoVisualAnalysisMode *  | m_am
const CRhinoObjectVisualAnalysisMode *  | m_next
Detailed Description
Description: At runtime, CRhinoObject.m_visual_analysis_modes is a linked list of CRhinoObjectVisualAnalysisMode classes that record which analysis modes are active on that object.
Member Data Documentation
◆ m_am
 const CRhinoVisualAnalysisMode* CRhinoObjectVisualAnalysisMode::m_am
◆ m_next
 const CRhinoObjectVisualAnalysisMode* CRhinoObjectVisualAnalysisMode::m_next