Public Types | Public Member Functions | Static Public Attributes | List of all members
CRhinoScriptContext Class Reference
Rhino
#include <rhinoSdkApp.h>
 Public Types
enum  | ScriptEchoMode : unsigned int { ScriptEchoMode::Unset = 0, ScriptEchoMode::Literal = 1, ScriptEchoMode::Silent = 2 }
 Public Member Functions
CRhinoScriptContext ()=default
CRhinoScriptContext (const CRhinoScriptContext &)=default
~CRhinoScriptContext ()=default
class CRhinoDoc *  | Doc () const
unsigned int  | DocRuntimeSerialNumber () const
CRhinoScriptContext::ScriptEchoMode  | EchoMode () const
const ON_wString  | MRUDisplayString () const
const wchar_t *  | MRUDisplayStringPointer () const
CRhinoScriptContext &  | operator= (const CRhinoScriptContext &)=default
const ON_wString  | Script () const
const wchar_t *  | ScriptPointer () const
bool  | SetDocRuntimeSerialNumber (const class CRhinoDoc &doc)
bool  | SetDocRuntimeSerialNumber (const class CRhinoDoc *doc)
bool  | SetDocRuntimeSerialNumber (unsigned int rhino_doc_sn)
void  | SetEchoMode (CRhinoScriptContext::ScriptEchoMode echo_mode)
void  | SetMRUDisplayString (const wchar_t *mru_display_string)
void  | SetPersistentScript (const wchar_t *persistent_script)
void  | SetScript (const class ON_wString &script)
void  | SetScript (const wchar_t *script)
 Static Public Attributes
static const CRhinoScriptContext  | EmptyScript
Member Enumeration Documentation
◆ ScriptEchoMode
 enum CRhinoScriptContext::ScriptEchoMode : unsigned int
strong
Enumerator
Unset
Literal
Silent
Constructor & Destructor Documentation
◆ CRhinoScriptContext() [1/2]
 CRhinoScriptContext::CRhinoScriptContext  |  ( |   | )
default
◆ ~CRhinoScriptContext()
 CRhinoScriptContext::~CRhinoScriptContext  |  ( |   | )
default
◆ CRhinoScriptContext() [2/2]
 CRhinoScriptContext::CRhinoScriptContext  |  ( |  const CRhinoScriptContext &  |   | )
default
Member Function Documentation
◆ Doc()
 class CRhinoDoc* CRhinoScriptContext::Doc  |  ( |   | ) |   const
◆ DocRuntimeSerialNumber()
 unsigned int CRhinoScriptContext::DocRuntimeSerialNumber  |  ( |   | ) |   const
◆ EchoMode()
 CRhinoScriptContext::ScriptEchoMode CRhinoScriptContext::EchoMode  |  ( |   | ) |   const
◆ MRUDisplayString()
 const ON_wString CRhinoScriptContext::MRUDisplayString  |  ( |   | ) |   const
◆ MRUDisplayStringPointer()
 const wchar_t* CRhinoScriptContext::MRUDisplayStringPointer  |  ( |   | ) |   const
◆ operator=()
 CRhinoScriptContext& CRhinoScriptContext::operator=  |  ( |  const CRhinoScriptContext &  |   | )
default
◆ Script()
 const ON_wString CRhinoScriptContext::Script  |  ( |   | ) |   const
◆ ScriptPointer()
 const wchar_t* CRhinoScriptContext::ScriptPointer  |  ( |   | ) |   const
◆ SetDocRuntimeSerialNumber() [1/3]
 bool CRhinoScriptContext::SetDocRuntimeSerialNumber  |  ( |  const class CRhinoDoc &  |  doc | )
◆ SetDocRuntimeSerialNumber() [2/3]
 bool CRhinoScriptContext::SetDocRuntimeSerialNumber  |  ( |  const class CRhinoDoc *  |  doc | )
◆ SetDocRuntimeSerialNumber() [3/3]
 bool CRhinoScriptContext::SetDocRuntimeSerialNumber  |  ( |  unsigned int  |  rhino_doc_sn | )
◆ SetEchoMode()
 void CRhinoScriptContext::SetEchoMode  |  ( |  CRhinoScriptContext::ScriptEchoMode  |  echo_mode | )
◆ SetMRUDisplayString()
 void CRhinoScriptContext::SetMRUDisplayString  |  ( |  const wchar_t *  |  mru_display_string | )
◆ SetPersistentScript()
 void CRhinoScriptContext::SetPersistentScript  |  ( |  const wchar_t *  |  persistent_script | )
Parameters: persistent_script - [in] A string that will exist for the duration of the application.
 Example: SetPersistentScript( L"! _Circle 0,0,0w, 1meter" );
◆ SetScript() [1/2]
 void CRhinoScriptContext::SetScript  |  ( |  const class ON_wString &  |  script | )
◆ SetScript() [2/2]
 void CRhinoScriptContext::SetScript  |  ( |  const wchar_t *  |  script | )
Member Data Documentation
◆ EmptyScript
 const CRhinoScriptContext CRhinoScriptContext::EmptyScript
static