Public Member Functions | List of all members
CRhinoUiGradientSliderCtrl Class Reference
RhinoUI
CRhinoUiGradientSliderCtrl. More...
#include <RhinoSdkUiGradientSliderCtrl.h>
 Inheritance diagram for CRhinoUiGradientSliderCtrl:
 Public Member Functions
CRhinoUiGradientSliderCtrl ()
virtual  | ~CRhinoUiGradientSliderCtrl ()
HPALETTE  | ColorPalette ()
COLORREF  | FromColor ()
void  | InitializeGradientSlider (COLORREF from, COLORREF to, HPALETTE hPalette=NULL)
afx_msg void  | OnPaint ()
void  | SetColorPalette (HPALETTE hPalette)
void  | SetFromColor (COLORREF color)
void  | SetFromColor (const unsigned char r, const unsigned char g, const unsigned char b)
void  | SetToColor (COLORREF color)
void  | SetToColor (const unsigned char r, const unsigned char g, const unsigned char b)
COLORREF  | ToColor ()
 Public Member Functions inherited from CRhinoUiSliderCtrl
CRhinoUiSliderCtrl ()
virtual  | ~CRhinoUiSliderCtrl ()
void  | LinkTo (CRhinoUiEdit *edit_ctrl, double slider_to_edit_scale=0.0)
void  | LinkTo (CRhinoUiEditInt *edit_ctrl, double slider_to_edit_scale=0.0)
afx_msg LRESULT  | OnGetText (WPARAM, LPARAM)
afx_msg void  | OnKeyDown (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnKeyUp (UINT nChar, UINT nRepCnt, UINT nFlags)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonUp (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
afx_msg LRESULT  | OnSetText (WPARAM, LPARAM)
void  | PaintText (CDC &dc)
void  | SetText (const char *lpsText)
void  | SetText (const wchar_t *lpsText)
LPCTSTR  | Text ()
 Additional Inherited Members
 Protected Member Functions inherited from CRhinoUiSliderCtrl
void  | _LinkTo (CEdit *edit_ctrl, double slider_to_edit_scale)
void  | _SetLink (CEdit *edit_ctrl, CRhinoUiSliderCtrl *slider_ctrl)
void  | _SetMinMax (CEdit *edit_ctrl, int min_val, int max_val)
void  | _SetText (LPCTSTR lpsText)
Detailed Description
CRhinoUiGradientSliderCtrl.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiGradientSliderCtrl()
 CRhinoUiGradientSliderCtrl::CRhinoUiGradientSliderCtrl  |  ( |   | )
◆ ~CRhinoUiGradientSliderCtrl()
 virtual CRhinoUiGradientSliderCtrl::~CRhinoUiGradientSliderCtrl  |  ( |   | )
virtual
Member Function Documentation
◆ ColorPalette()
 HPALETTE CRhinoUiGradientSliderCtrl::ColorPalette  |  ( |   | )
◆ FromColor()
 COLORREF CRhinoUiGradientSliderCtrl::FromColor  |  ( |   | )
◆ InitializeGradientSlider()
 void CRhinoUiGradientSliderCtrl::InitializeGradientSlider  |  ( |  COLORREF  |  from,
|  COLORREF  |  to,
|  HPALETTE  |  hPalette = NULL
)
◆ OnPaint()
 afx_msg void CRhinoUiGradientSliderCtrl::OnPaint  |  ( |   | )
◆ SetColorPalette()
 void CRhinoUiGradientSliderCtrl::SetColorPalette  |  ( |  HPALETTE  |  hPalette | )
◆ SetFromColor() [1/2]
 void CRhinoUiGradientSliderCtrl::SetFromColor  |  ( |  COLORREF  |  color | )
◆ SetFromColor() [2/2]
 void CRhinoUiGradientSliderCtrl::SetFromColor  |  ( |  const unsigned char  |  r,
|  const unsigned char  |  g,
|  const unsigned char  |  b
)
◆ SetToColor() [1/2]
 void CRhinoUiGradientSliderCtrl::SetToColor  |  ( |  COLORREF  |  color | )
◆ SetToColor() [2/2]
 void CRhinoUiGradientSliderCtrl::SetToColor  |  ( |  const unsigned char  |  r,
|  const unsigned char  |  g,
|  const unsigned char  |  b
)
◆ ToColor()
 COLORREF CRhinoUiGradientSliderCtrl::ToColor  |  ( |   | )