Public Member Functions | List of all members
CRhRdkContent::DumpContext Class Referenceabstract
#include <RhRdkContent.h>
 Public Member Functions
virtual void  | Output (const wchar_t *text) const =0
virtual ON_wString  | Separator (void) const =0
Member Function Documentation
◆ Output()
 virtual void CRhRdkContent::DumpContext::Output  |  ( |  const wchar_t *  |  text | ) |   const
pure virtual
Implement this method to send the text somewhere.
◆ Separator()
 virtual ON_wString CRhRdkContent::DumpContext::Separator  |  ( |  void  |   | ) |   const
pure virtual
Implement this method to get a separator to output between each property.