Public Member Functions | Public Attributes | List of all members
CArgsRhinoGetPicture Class Reference
RhinoGet
#include <rhinoSdkGetPlane.h>
 Inheritance diagram for CArgsRhinoGetPicture:
 Public Member Functions
CArgsRhinoGetPicture (int width, int height, double one_to_one_width, double one_to_one_height)
virtual  | ~CArgsRhinoGetPicture ()
virtual void  | AddExtraOptions (CRhinoGetPoint &gp)
Allows for adding extra command options during RhinoGetRectangle. More...
virtual void  | HandleExtraOptions (const CRhinoGetPoint &gp)
 Public Member Functions inherited from CArgsRhinoGetPlane
CArgsRhinoGetPlane ()
CArgsRhinoGetPlane (const CArgsRhinoGetPlane &src)
virtual  | ~CArgsRhinoGetPlane ()
void  | AcceptNothing (bool bAcceptNothing=true)
Like CRhinoGet::AcceptNothing(). More...
BOOL32  | Allow3Point ()
BOOL32  | AllowCenter ()
BOOL32  | AllowCorners ()
BOOL32  | AllowDeformable () const
BOOL32  | AllowForceAspectRatio ()
BOOL32  | AllowRounded ()
BOOL32  | AllowVertical ()
int  | ArgsType () const
return type of args class plane or derived box More...
int  | CornerMode ()
double  | CornerRadius ()
double  | CornerRho ()
int  | CurrentMode ()
BOOL32  | Deformable () const
bool  | DrawPicture ()
std::function< void(const ON_3dPoint[4])>  | DynamicRectangleCallback () const
virtual bool  | ExtraOptionsAtStart () const
ON_Color  | FeedbackColor () const
color used to draw feedback line More...
int  | FirstDirectionCount () const
number of faces in first direction More...
int  | FirstDirectionMinCount () const
const CRhinoCommandOptionName &  | FirstMeshDensityDirectionPrompt () const
prompt for number of faces in first direction More...
const ON_3dPoint &  | FirstPoint () const
const wchar_t *  | FirstPointPrompt3Point () const
prompt when getting first corner More...
const wchar_t *  | FirstPointPromptCenter () const
prompt when getting center in center mode More...
const wchar_t *  | FirstPointPromptCorners () const
prompt when getting first corner More...
const wchar_t *  | FirstPointPromptVertical () const
prompt when getting first corner More...
double  | ForcedAspectRatio ()
BOOL32  | HaveFirstPoint () const
BOOL32  | HavePlane () const
BOOL32  | HaveSecondPoint () const
BOOL32  | HaveThirdPoint () const
double  | Length ()
CArgsRhinoGetPlane &  | operator= (const CArgsRhinoGetPlane &src)
const wchar_t *  | PictureFileName () const
const ON_Plane &  | Plane () const
bool  | PromptForMeshDensity () const
BOOL32  | Rounded ()
int  | SecondDirectionCount () const
number of faces in second direction More...
int  | SecondDirectionMinCount () const
const CRhinoCommandOptionName &  | SecondMeshDensityDirectionPrompt () const
prompt for number of faces in second direction More...
const ON_3dPoint &  | SecondPoint () const
const wchar_t *  | SecondPointPrompt3Point () const
prompt when getting second point in 3 point mode More...
const wchar_t *  | SecondPointPromptCenter () const
prompt when getting corner in center mode More...
const wchar_t *  | SecondPointPromptCorners () const
prompt when getting opposite corner More...
const wchar_t *  | SecondPointPromptVertical () const
prompt when getting second point in vertical mode More...
void  | SetAllow3Point (BOOL32 allow=TRUE)
void  | SetAllowCenter (BOOL32 allow=TRUE)
void  | SetAllowCorners (BOOL32 allow=TRUE)
void  | SetAllowDeformable (BOOL32 b=TRUE)
void  | SetAllowForceAspectRatio (BOOL32 allow=TRUE)
void  | SetAllowRounded (BOOL32 allow=FALSE)
void  | SetAllowVertical (BOOL32 allow=TRUE)
void  | SetCornerMode (int mode=corner_arc)
void  | SetCornerRadius (double radius)
void  | SetCornerRho (double rho)
void  | SetCurrentMode (int mode=mode_corners)
void  | SetDeformable (BOOL32 bDeformable=TRUE)
void  | SetDynamicRectangleCallback (std::function< void(const ON_3dPoint[4])> callback)
void  | SetFeedbackColor (COLORREF color)
void  | SetFirstDirectionCount (int count)
void  | SetFirstDirectionMinCount (int count)
void  | SetFirstMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetFirstPoint (const ON_3dPoint &base)
void  | SetFirstPointPrompt3Point (const wchar_t *prompt)
void  | SetFirstPointPromptCenter (const wchar_t *prompt)
void  | SetFirstPointPromptCorners (const wchar_t *prompt)
void  | SetFirstPointPromptVertical (const wchar_t *prompt)
void  | SetForcedAspectRatio (double forced_aspect_ratio)
void  | SetHaveFirstPoint (BOOL32 b=TRUE)
void  | SetHavePlane (BOOL32 b=TRUE)
void  | SetHaveSecondPoint (BOOL32 b=TRUE)
void  | SetHaveThirdPoint (BOOL32 b=TRUE)
void  | SetLength (double length)
void  | SetPictureFileNameAndSize (const wchar_t *filename, int width, int height)
void  | SetPlane (const ON_Plane &plane)
void  | SetPromptForMeshDensity (bool bMeshDensity=true)
void  | SetRounded (BOOL32 allow=FALSE)
void  | SetSecondDirectionCount (int count)
void  | SetSecondDirectionMinCount (int count)
void  | SetSecondMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetSecondPoint (const ON_3dPoint &point)
void  | SetSecondPointPrompt3Point (const wchar_t *prompt)
void  | SetSecondPointPromptCenter (const wchar_t *prompt)
void  | SetSecondPointPromptCorners (const wchar_t *prompt)
void  | SetSecondPointPromptVertical (const wchar_t *prompt)
void  | SetThirdDirectionCount (int count)
void  | SetThirdDirectionMinCount (int count)
void  | SetThirdMeshDensityDirectionPrompt (const CRhinoCommandOptionName &)
void  | SetThirdPoint (const ON_3dPoint &point)
void  | SetThirdPointPrompt3Point (const wchar_t *prompt)
void  | SetThirdPointPromptVertical (const wchar_t *prompt)
void  | SetUDegree (int degree)
void  | SetUPointCount (int count)
void  | SetUseActiveLayerLinetype (bool on)
When true the linetype of the active layer is used for dynamic drawing. More...
void  | SetVDegree (int degree)
void  | SetVPointCount (int count)
void  | SetWidth (double width)
int  | ThirdDirectionCount () const
number of faces in third direction More...
int  | ThirdDirectionMinCount () const
const CRhinoCommandOptionName &  | ThirdMeshDensityDirectionPrompt () const
prompt for number of faces in third direction More...
const ON_3dPoint &  | ThirdPoint () const
const wchar_t *  | ThirdPointPrompt3Point () const
prompt when getting opposite side in 3point mode More...
const wchar_t *  | ThirdPointPromptVertical () const
prompt when getting opposite side in vertical mode More...
int  | UDegree () const
int  | UPointCount () const
bool  | UseActiveLayerLinetype () const
int  | VDegree () const
int  | VPointCount () const
double  | Width ()
 Public Attributes
double  | m_height
bool  | m_one_to_one
double  | m_one_to_one_height
int  | m_one_to_one_option
double  | m_one_to_one_width
double  | m_width
 Public Attributes inherited from CArgsRhinoGetPlane
bool  | m_bAcceptNothing
int  | m_simple_option_index
ON_ClassArray< CRhinoCommandOptionName >  | m_simple_options
input - simple options to add to the first prompt; More...
 Additional Inherited Members
 Public Types inherited from CArgsRhinoGetPlane
enum  | {
 mode_corners, mode_3point, mode_vertical, mode_center,
 mode_3point_mid, mode_3point_center
 }
enum  | { corner_arc = 0, corner_conic = 1, corner_chamfer = 2 }
enum  | { plane_type = 0, box_type = 1, plane_type_ex = 2, detail_type = 3 }
 Protected Attributes inherited from CArgsRhinoGetPlane
BOOL32  | m_allow_3point
BOOL32  | m_allow_center
BOOL32  | m_allow_corners
allow switching to respective modes for interactive input More...
BOOL32  | m_allow_deformable
BOOL32  | m_allow_rounded
BOOL32  | m_allow_vertical
int  | m_ArgsType
int  | m_corner_mode
double  | m_corner_radius
double  | m_corner_rho
int  | m_current_mode
starting mode - corners, 3pt, vertical More...
BOOL32  | m_deformable
ON_Color  | m_dynamic_line_color
color to use when drawing dynamic line while getting second corner More...
std::function< void(const ON_3dPoint[4])>  | m_dynamicRectangleCallback
ON_3dPoint  | m_firstpoint
called-supplied first corner ot the rectangle More...
BOOL32  | m_force_aspect_ratio
double  | m_forced_aspect_ratio
BOOL32  | m_havefirstpoint
BOOL32  | m_haveplane
BOOL32  | m_havesecondpoint
BOOL32  | m_havethirdpoint
double  | m_length
int  | m_mesh_density_1stDirection
int  | m_mesh_density_2ndDirection
int  | m_mesh_density_3rdDirection
CRhinoCommandOptionName  | m_mesh_density_first_direction
int  | m_mesh_density_Min1stDirection
int  | m_mesh_density_Min2ndDirection
int  | m_mesh_density_Min3rdDirection
CRhinoCommandOptionName  | m_mesh_density_second_direction
CRhinoCommandOptionName  | m_mesh_density_third_direction
ON_wString  | m_picture_filename
file used to draw picture or bitmap image dynamically More...
ON_Plane  | m_plane
plane on which the rectangle will lie More...
ON_wString  | m_prompt_first_point_3point
prompt when getting first corner in 3 point mode More...
ON_wString  | m_prompt_first_point_center
prompt when getting center in center mode More...
ON_wString  | m_prompt_first_point_corners
prompt when getting first corner in corners mode More...
ON_wString  | m_prompt_first_point_vertical
prompt when getting first corner in vertical mode More...
ON_wString  | m_prompt_second_point_3point
prompt when getting opposite corner or second end of first edge More...
ON_wString  | m_prompt_second_point_center
prompt when getting corner in center mode More...
ON_wString  | m_prompt_second_point_corners
prompt when getting opposite corner or second end of first edge More...
ON_wString  | m_prompt_second_point_vertical
prompt when getting the second point in vertical mode More...
ON_wString  | m_prompt_third_point_3point
prompt when getting point on opposite side in 3 point mode More...
ON_wString  | m_prompt_third_point_vertical
prompt when getting point on opposite side in 3 point mode More...
bool  | m_PromptForMeshDensity
BOOL32  | m_rounded
ON_3dPoint  | m_secondpoint
called-supplied second end of first edge More...
ON_3dPoint  | m_thirdpoint
called-supplied third point in rect3pt mode More...
int  | m_ucount
int  | m_udegree
int  | m_vcount
int  | m_vdegree
double  | m_width
Constructor & Destructor Documentation
◆ CArgsRhinoGetPicture()
 CArgsRhinoGetPicture::CArgsRhinoGetPicture  |  ( |  int  |  width,
|  int  |  height,
|  double  |  one_to_one_width,
|  double  |  one_to_one_height
)
◆ ~CArgsRhinoGetPicture()
 virtual CArgsRhinoGetPicture::~CArgsRhinoGetPicture  |  ( |   | )
virtual
Member Function Documentation
◆ AddExtraOptions()
 virtual void CArgsRhinoGetPicture::AddExtraOptions  |  ( |  CRhinoGetPoint &  |  gp | )
virtual
Allows for adding extra command options during RhinoGetRectangle.
Reimplemented from CArgsRhinoGetPlane.
◆ HandleExtraOptions()
 virtual void CArgsRhinoGetPicture::HandleExtraOptions  |  ( |  const CRhinoGetPoint &  |  gp | )
virtual
Reimplemented from CArgsRhinoGetPlane.
Member Data Documentation
◆ m_height
 double CArgsRhinoGetPicture::m_height
◆ m_one_to_one
 bool CArgsRhinoGetPicture::m_one_to_one
◆ m_one_to_one_height
 double CArgsRhinoGetPicture::m_one_to_one_height
◆ m_one_to_one_option
 int CArgsRhinoGetPicture::m_one_to_one_option
◆ m_one_to_one_width
 double CArgsRhinoGetPicture::m_one_to_one_width
◆ m_width
 double CArgsRhinoGetPicture::m_width