Public Types | Public Member Functions | List of all members
CRhinoPolyEdge Class Reference
Rhino
#include <rhinoSdkPolyEdge.h>
 Inheritance diagram for CRhinoPolyEdge:
 Public Types
enum  | eTanMode { tmAuto = 0, tmIsoDir = 1, tmPerp = 2, tmUser = 3 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
CRhinoPolyEdge ()
~CRhinoPolyEdge ()
BOOL32  | Append (class CRhinoPolyEdgeSegment *new_segment)
Append curve. More...
BOOL32  | AppendAndMatch (ON_Curve *)
const ON_Brep *  | BrepAt (double t) const
bool  | ChangeClosedCurveSeam (double t) override
bool  | ContainsAllEdges () const
Test if all segments of the polyedge are surface edges. More...
bool  | ContainsAnyEdges () const
Test if there are any surface edges in the polyedge. More...
bool  | Create (const CRhinoObjRef &)
bool  | Create (const ON_BrepTrim *trim, const CRhinoObject *rhino_object=0)
bool  | Create (const ON_Curve *curve, const CRhinoObject *rhino_object=0)
bool  | Create (CRhinoDoc &doc, const ON_PolyEdgeHistory &history_value)
void  | DestroyRuntimeCache (bool bDelete=true) override
default copy constructor and operator= are fine. More...
ON_Curve *  | DuplicateCurve () const override
const ON_BrepEdge *  | EdgeAt (double t) const
double  | EdgeParameter (double t) const
bool  | EvaluateTangents (double t, ON_3dPoint &srfpoint, ON_3dVector &edgetangent, ON_3dVector &srfbinormal, ON_3dVector &srfisodir, ON_3dVector &srfnormal) const
bool  | EvSrfDerivatives (double t, ON_3dPoint &srfpoint, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv) const
bool  | EvSrfNormalCurvature (double t, ON_3dVector srftangent, ON_3dVector &srfnormalcurvature, ON_3dVector &srfnormal) const
bool  | EvSrfTangent (double t, ON_3dPoint &srfpoint, ON_3dVector &srftangent, ON_3dVector &srfnormal) const
const ON_BrepFace *  | FaceAt (double t) const
int  | FindCurve (const ON_Curve *curve) const
int  | FindEdge (const ON_BrepEdge *edge) const
int  | FindTrim (const ON_BrepTrim *trim) const
bool  | GetHistoryValue (CRhinoDoc &doc, ON_PolyEdgeHistory &polyedge_history) const
void  | Highlight (bool bHighlight=true) const
BOOL32  | Insert (int segment_index, class CRhinoPolyEdgeSegment *new_segment)
bool  | IsClosed () const override
virtual ON_Curve::IsClosed override More...
bool  | IsHighlighted () const
ON_Surface::ISO  | IsoType (double t) const
bool  | IsSelected () const
class CRhinoPolyEdgeSegment *  | operator[] (int) const
BOOL32  | Prepend (class CRhinoPolyEdgeSegment *new_segment)
Prepend curve. More...
BOOL32  | PrependAndMatch (ON_Curve *)
BOOL32  | Remove ()
remove last More...
BOOL32  | Remove (int index)
int  | SegmentCount () const
class CRhinoPolyEdgeSegment *  | SegmentCurve (int segment_index) const
void  | Select (bool bSelect=true, bool bSynchHighlight=true) const
bool  | SetEndPoint (ON_3dPoint end_point) override
virtual More...
void  | SetSrfTangentMode (eTanMode tm)
bool  | SetStartPoint (ON_3dPoint start_point) override
eTanMode  | SrfTangentMode () const
const ON_Surface *  | SurfaceAt (double t) const
ON_2dPoint  | SurfaceParameter (double t) const
const ON_BrepTrim *  | TrimAt (double t) const
double  | TrimParameter (double t) const
 Public Member Functions inherited from ON_PolyCurve
ON_PolyCurve () ON_NOEXCEPT
ON_PolyCurve (const ON_PolyCurve &)
ON_PolyCurve (int)
virtual  | ~ON_PolyCurve ()
bool  | Append (ON_Curve *)
Append curve. More...
bool  | AppendAndMatch (ON_Curve *)
Append and match start of curve to end of polycurve. More...
bool  | ChangeDimension (int desired_dimension) override
bool  | CloseGap (int gap_index, int segments_to_modify)
int  | CloseGaps ()
int  | Count () const
Interface. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree () const override
void  | Destroy ()
of the number of segments is known. More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain () const override
void  | Dump (ON_TextLog &) const override
for debugging More...
void  | EmergencyDestroy ()
call if memory used by ON_PolyCurve becomes invalid More...
bool  | Evaluate (double, int, int, double *, int=0, int *=0) const override
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
ON_Curve *  | ExplodeSingleSegmentCurve () const
bool  | Extend (const ON_Interval &domain) override
int  | FindNextGap (int segment_index0) const
ON_Curve *  | FirstSegmentCurve () const
returns nullptr if count = 0 More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override
 More...
bool  | GetClosestPoint (const ON_3dPoint &, double *, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetCurveParameterFromNurbFormParameter (double, double *) const override
virtual ON_Curve::GetCurveParameterFromNurbFormParameter override More...
bool  | GetLength (double *, double=1.0e-8, const ON_Interval *=nullptr) const override
bool  | GetLocalClosestPoint (const ON_3dPoint &, double, double *, const ON_Interval *=nullptr) const override
bool  | GetNextDiscontinuity (ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | GetNormalizedArcLengthPoint (double s, double *t, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
bool  | GetNormalizedArcLengthPoints (int count, const double *s, double *t, double absolute_tolerance=0.0, double fractional_tolerance=1.0e-8, const ON_Interval *sub_domain=nullptr) const override
int  | GetNurbForm (ON_NurbsCurve &, double=0.0, const ON_Interval *=nullptr) const override
bool  | GetNurbFormParameterFromCurveParameter (double, double *) const override
virtual ON_Curve::GetNurbFormParameterFromCurveParameter override More...
bool  | GetSpanVector (double *) const override
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override
 More...
ON_Curve *  | HarvestSegment (int)
int  | HasGap () const
bool  | HasGapAt (int segment_index) const
int  | HasNurbForm () const override
bool  | HasSynchronizedSegmentDomains () const
bool  | Insert (int, ON_Curve *)
bool  | IsArc (const ON_Plane *=nullptr, ON_Arc *=nullptr, double=ON_ZERO_TOLERANCE) const override
bool  | IsContinuous (ON::continuity c, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsInPlane (const ON_Plane &, double=ON_ZERO_TOLERANCE) const override
bool  | IsLinear (double=ON_ZERO_TOLERANCE) const override
bool  | IsMorphable () const override
virtual ON_Geometry override More...
bool  | IsNested () const
bool  | IsPeriodic (void) const override
periodic.) More...
bool  | IsPlanar (ON_Plane *=nullptr, double=ON_ZERO_TOLERANCE) const override
int  | IsPolyline (ON_SimpleArray< ON_3dPoint > *pline_points=nullptr, ON_SimpleArray< double > *pline_t=nullptr) const override
bool  | IsShort (double tolerance, const ON_Interval *sub_domain=0, double *length_estimate=0) const override
bool  | IsValid (bool bAllowGaps, ON_TextLog *text_log) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Curve *  | LastSegmentCurve () const
returns nullptr if count = 0 More...
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
bool  | Morph (const ON_SpaceMorph &morph) override
virtual ON_Geometry override More...
ON_PolyCurve &  | operator= (const ON_PolyCurve &)
ON_Curve *  | operator[] (int) const
These operator[] functions return nullptr if index is out of range. More...
bool  | ParameterSearch (double t, int &index, bool bEnableSnap) const
double  | PolyCurveParameter (int segment_index, double segmentcurve_parameter) const
bool  | Prepend (ON_Curve *)
Prepend curve. More...
bool  | PrependAndMatch (ON_Curve *)
Prepend and match end of curve to start of polycurve. More...
bool  | Read (ON_BinaryArchive &) override
bool  | Remove ()
delete last segment and reduce count by 1 More...
bool  | Remove (int)
delete specified segment and reduce count by 1 More...
bool  | RemoveNesting ()
bool  | RemoveNestingEx ()
bool  | RemoveShortSegments (double tolerance, bool bRemoveShortSegments=true) override
void  | Reserve (int)
make sure capacity is at least the specified count More...
bool  | Reverse () override
void  | SanitizeDomain ()
ON_Curve *  | SegmentCurve (int segment_index) const
double  | SegmentCurveParameter (double polycurve_parameter) const
const ON_CurveArray &  | SegmentCurves () const
ON_Interval  | SegmentDomain (int segment_index) const
int  | SegmentIndex (double polycurve_parameter) const
int  | SegmentIndex (ON_Interval sub_domain, int *segment_index0, int *segment_index1) const
const ON_SimpleArray< double > &  | SegmentParameters () const
bool  | SetDomain (double t0, double t1) override
bool  | SetParameterization (const double *t)
void  | SetSegment (int index, ON_Curve *crv)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount () const override
number of smooth spans in curve More...
bool  | Split (double t, ON_Curve *&left_side, ON_Curve *&right_side) const override
bool  | SwapCoordinates (int, int) override
bool  | SynchronizeSegmentDomains ()
bool  | Transform (const ON_Xform &) override
bool  | Trim (const ON_Interval &domain) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Curve
ON_Curve () ON_NOEXCEPT
ON_Curve (const ON_Curve &)
virtual  | ~ON_Curve ()
bool  | AreaMassProperties (ON_3dPoint base_point, ON_3dVector plane_normal, ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
bool  | ChangeClosedCurveSeam (double t, double min_dist)
virtual class ON_CurveTree *  | CreateCurveTree () const
ON_3dVector  | CurvatureAt (double t) const
const class ON_CurveTree *  | CurveTree () const
ON_3dVector  | DerivativeAt (double t) const
void  | DestroyCurveTree ()
bool  | Ev1Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, int side=0, int *hint=0) const
bool  | Ev2Der (double t, ON_3dPoint &point, ON_3dVector &first_derivative, ON_3dVector &second_derivative, int side=0, int *hint=0) const
bool  | EvCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, ON_3dVector &kappa, int side=0, int *hint=0) const
bool  | EvPoint (double t, ON_3dPoint &point, int side=0, int *hint=0) const
bool  | EvSignedCurvature (double t, ON_3dPoint &point, ON_3dVector &tangent, double &kappa, const ON_3dVector *normal=nullptr, int side=0, int *hint=0) const
bool  | EvTangent (double t, ON_3dPoint &point, ON_3dVector &tangent, int side=0, int *hint=0) const
bool  | FirstSpanIsLinear (double min_length, double tolerance) const
bool  | FirstSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | FrameAt (double t, ON_Plane &plane) const
bool  | GetDomain (double *t0, double *t1) const
curve interface More...
virtual bool  | GetParameterTolerance (double t, double *tminus, double *tplus) const
virtual bool  | GetSpanVectorIndex (double t, int side, int *span_vector_index, ON_Interval *span_domain) const
int  | IntersectCurve (const ON_Curve *curveB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *curveB_domain=0) const
int  | IntersectPlane (ON_PlaneEquation plane_equation, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curve_domain=0) const
virtual int  | IntersectSelf (ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, const ON_Interval *curve_domain=0) const
int  | IntersectSurface (const ON_Surface *surfaceB, ON_SimpleArray< ON_X_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, const ON_Interval *curveA_domain=0, const ON_Interval *surfaceB_udomain=0, const ON_Interval *surfaceB_vdomain=0) const
bool  | IsArcAt (double t, const ON_Plane *plane=0, ON_Arc *arc=0, double tolerance=ON_ZERO_TOLERANCE, double *t0=0, double *t1=0) const
bool  | IsClosable (double tolerance, double min_abs_size=0.0, double min_rel_size=10.0) const
virtual bool  | IsEllipse (const ON_Plane *plane=nullptr, ON_Ellipse *ellipse=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsLong (double min_length, const ON_Interval *sub_domain=0) const
bool  | LastSpanIsLinear (double min_length, double tolerance) const
bool  | LastSpanIsLinear (double min_length, double tolerance, ON_Line *span_line) const
bool  | LengthMassProperties (class ON_MassProperties &mp, bool bLength=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
class ON_PolylineCurve *  | MeshCurve (ON_MeshCurveParameters &mp, ON_PolylineCurve *polyline, bool bSkipFirstPoint, const ON_Interval *domain) const
double  | NextCurveKink (ON_Interval search_domain, const class ON_CurveKinkDefinition &kink_definition) const
Find the next curve kink in the search domain. More...
ON_NurbsCurve *  | NurbsCurve (ON_NurbsCurve *pNurbsCurve=nullptr, double tolerance=0.0, const ON_Interval *subdomain=nullptr) const
class ON_NurbsCurve *  | NurbsCurveFit (ON_Interval domain, const class ON_NurbsCurveFitParameters &fit_parameters, class ON_NurbsCurve *destination_nurbs_cuve, class ON_Line &maximum_separation, double &this_separation_parameter, double &nurbs_separation_parameter) const
Get a uniform NURBS curve fit to this curve.. This function is useful when you want to fit this curve a single time. If you are in a situation where you are repeatedly adjusting fit_parameters, it is much more efficient to use the ON_NurbsCurveFitBuilder class because the steps involved in sampling points and other information from this input curve are expensive and can be reused as fit_parameters.Degree(), fit_parameters.PointCount(), and other fitting parmeters are changed. More...
ON::object_type  | ObjectType () const override
ON_Curve &  | operator= (const ON_Curve &)
ON_3dPoint  | PointAt (double t) const
ON_3dPoint  | PointAtEnd () const
ON_3dPoint  | PointAtStart () const
class ON_NurbsCurve *  | RebuildToMatchTemplateCurve (const ON_Curve &template_curve, bool bFlipSourceDirection, bool bPreserveEndTangents, bool bMakeSubDFriendly, class ON_NurbsCurve *destination_nurbs_curve, class ON_Line *maximum_deviation) const
Rebuild this curve (the "source" curve) so it takes on the degree, knot vector, and control point count of a template curve. When rebuilding many curves against the same template, use the ON_TemplatedCurveRebuilder class so the template is analyzed only once. More...
bool  | SetDomain (ON_Interval domain)
double  | SignedCurvatureAt (double t, const ON_3dVector *plane_normal=nullptr) const
const ON_SimpleArray< double >  | SpanVector () const
The curve's span vector is a stricltly monotone increasing list of doubles that are the intervals on which the curve is C-infinity. More...
ON_3dVector  | TangentAt (double t) const
ON_3dVector  | TangentAt (double t, int side) const
Evaluate the unit tangent vector with the option to specify the direction of the limit. This is useful when evaluating tangent vectors at a tangent discontinuity. More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Additional Inherited Members
 Static Public Member Functions inherited from ON_Curve
static class ON_NurbsCurve *  | CreateCubicLoft (int point_count, int point_dim, int point_stride, const double *point_list, double k, int is_closed=0, ON::cubic_loft_end_condition start_shape=ON::cubic_loft_ec_quadratic, ON::cubic_loft_end_condition end_shape=ON::cubic_loft_ec_quadratic, class ON_NurbsCurve *nurbs_curve=0)
static bool  | GetCurveSeparation (const ON_Curve &curveA, ON_Interval domainA, const ON_Curve &curveB, ON_Interval domainB, ON_Line &minimum_separation, double *min_parameter_A, double *min_parameter_B, ON_Line &maximum_separation, double *max_parameter_A, double *max_parameter_B)
Find the locations of the minimimum and maximum separation between two curves. When the separation points are distinct, the line connecting the separation points is perpindicular to the curves. This calculates the distances and locations shown in the Rhino CrvDeviation command. More...
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Curve
bool  | ParameterSearch (double t, int &index, bool bEnableSnap, const ON_SimpleArray< double > &m_t, double RelTol=ON_SQRT_EPSILON) const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ eTanMode
 enum CRhinoPolyEdge::eTanMode
Description: The CRhinoPolyEdge EvSrf... tools can evaluate the "binormal" surface tangent direction in several different ways. The binormal surface tangent always points "out". @untitled table tmAuto if trim is a srf iso, then tm_IsoDir, else tmPerp tmIsoDir srf tangent will be parallel to du or dv tmPerp srf tangent will be perpendicular to edge See Also: CRhinoPolyEdge::SrfTangentMode CRhinoPolyEdge::SetSrfTangentMode
Enumerator
tmAuto
tmIsoDir
tmPerp
tmUser
Constructor & Destructor Documentation
◆ CRhinoPolyEdge()
 CRhinoPolyEdge::CRhinoPolyEdge  |  ( |   | )
◆ ~CRhinoPolyEdge()
 CRhinoPolyEdge::~CRhinoPolyEdge  |  ( |   | )
Member Function Documentation
◆ Append()
 BOOL32 CRhinoPolyEdge::Append  |  ( |  class CRhinoPolyEdgeSegment *  |  new_segment | )
Append curve.
◆ AppendAndMatch()
 BOOL32 CRhinoPolyEdge::AppendAndMatch  |  ( |  ON_Curve *  |   | )
◆ BrepAt()
 const ON_Brep* CRhinoPolyEdge::BrepAt  |  ( |  double  |  t | ) |   const
◆ ChangeClosedCurveSeam()
 bool CRhinoPolyEdge::ChangeClosedCurveSeam  |  ( |  double  |  t | )
overridevirtual
Description: If this curve is closed, then modify it so that the start/end point is at curve parameter t. Parameters: t - [in] curve parameter of new start/end point. The returned curves domain will start at t. Returns: true if successful. Remarks: Overrides virtual ON_Curve::ChangeClosedCurveSeam
Reimplemented from ON_PolyCurve.
◆ ContainsAllEdges()
 bool CRhinoPolyEdge::ContainsAllEdges  |  ( |   | ) |   const
Test if all segments of the polyedge are surface edges.
◆ ContainsAnyEdges()
 bool CRhinoPolyEdge::ContainsAnyEdges  |  ( |   | ) |   const
Test if there are any surface edges in the polyedge.
◆ Create() [1/4]
 bool CRhinoPolyEdge::Create  |  ( |  const CRhinoObjRef &  |   | )
Description: Create a one segment CRhinoPolyEdge curve.
◆ Create() [2/4]
 bool CRhinoPolyEdge::Create  |  ( |  const ON_BrepTrim *  |  trim,
|  const CRhinoObject *  |  rhino_object = 0
)
Description: Create a one segment CRhinoPolyEdge curve that uses a single edge.
◆ Create() [3/4]
 bool CRhinoPolyEdge::Create  |  ( |  const ON_Curve *  |  curve,
|  const CRhinoObject *  |  rhino_object = 0
)
Description: Create a one segment CRhinoPolyEdge curve that uses a single curve.
◆ Create() [4/4]
 bool CRhinoPolyEdge::Create  |  ( |  CRhinoDoc &  |  doc,
|  const ON_PolyEdgeHistory &  |  history_value
)
◆ DestroyRuntimeCache()
 void CRhinoPolyEdge::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
default copy constructor and operator= are fine.
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_PolyCurve.
◆ DuplicateCurve()
 ON_Curve* CRhinoPolyEdge::DuplicateCurve  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::DuplicateCurve override This insures that the duplicate is a CRhinoPolyEdge class rather than the ON_PolyCurve class that is created by the base class.
Reimplemented from ON_PolyCurve.
◆ EdgeAt()
 const ON_BrepEdge* CRhinoPolyEdge::EdgeAt  |  ( |  double  |  t | ) |   const
if the segment is an edge, the following return non-NULL pointers.
◆ EdgeParameter()
 double CRhinoPolyEdge::EdgeParameter  |  ( |  double  |  t | ) |   const
◆ EvaluateTangents()
 bool CRhinoPolyEdge::EvaluateTangents  |  ( |  double  |  t,
|  ON_3dPoint &  |  srfpoint,
|  ON_3dVector &  |  edgetangent,
|  ON_3dVector &  |  srfbinormal,
|  ON_3dVector &  |  srfisodir,
|  ON_3dVector &  |  srfnormal
) |   |  const
Description: Evaluate surface binormal and normal. Parameters: t - [in] CRhinoPolyEdge curve parameter srfpoint - [out] location on surface edgetangent - [out] tangent to the edge srfbinormal - [out] "binormal" tangent to the surface, perpendicular to the edge srfisodir - [out] tangent to the surface, parallel to the isocurve closest to binormal direction srfnormal - [out] normal to surface
◆ EvSrfDerivatives()
 bool CRhinoPolyEdge::EvSrfDerivatives  |  ( |  double  |  t,
|  ON_3dPoint &  |  srfpoint,
|  ON_3dVector &  |  du,
|  ON_3dVector &  |  dv,
|  ON_3dVector &  |  duu,
|  ON_3dVector &  |  duv,
|  ON_3dVector &  |  dvv
) |   |  const
Description: Evaluate surface derivatives. Parameters: t - [in] CRhinoPolyEdge curve parameter srfpoint - [out] location on surface du - [out] dv - [out] duu - [out] duv - [out] dvv - [out]
◆ EvSrfNormalCurvature()
 bool CRhinoPolyEdge::EvSrfNormalCurvature  |  ( |  double  |  t,
|  ON_3dVector  |  srftangent,
|  ON_3dVector &  |  srfnormalcurvature,
|  ON_3dVector &  |  srfnormal
) |   |  const
Description: Evaluate surface normal curvature Parameters: t - [in] CRhinoPolyEdge curve parameter srftangent - [in] tangent to the surface srfnormalcurvature - [out] normal curvature srfnormal - [out] normal to surface See Also: CRhinoPolyEdge::EvSrfTangent
◆ EvSrfTangent()
 bool CRhinoPolyEdge::EvSrfTangent  |  ( |  double  |  t,
|  ON_3dPoint &  |  srfpoint,
|  ON_3dVector &  |  srftangent,
|  ON_3dVector &  |  srfnormal
) |   |  const
Description: Evaluate surface binormal and normal. Parameters: t - [in] CRhinoPolyEdge curve parameter srfpoint - [out] location on surface srftangent - [out] "binormal" tangent to the surface. The direction of this tangent is controlled by the surface tangent mode setting. srfnormal - [out] normal to surface See Also: CRhinoPolyEdge::SetSrfTangentMode
◆ FaceAt()
 const ON_BrepFace* CRhinoPolyEdge::FaceAt  |  ( |  double  |  t | ) |   const
◆ FindCurve()
 int CRhinoPolyEdge::FindCurve  |  ( |  const ON_Curve *  |  curve | ) |   const
Description: See if this polyedge has a wire curve as one of its segments Parameters: curve - [in] the curve to look for Returns: -1: trim is not in the polyedge >=0: index of first segment that uses the curve
◆ FindEdge()
 int CRhinoPolyEdge::FindEdge  |  ( |  const ON_BrepEdge *  |  edge | ) |   const
Description: See if this polyedge has an edge as one of its segments Parameters: edge - [in] the edge to look for Returns: -1: edge is not in the polyedge >=0: index of first segment that uses the edge
◆ FindTrim()
 int CRhinoPolyEdge::FindTrim  |  ( |  const ON_BrepTrim *  |  trim | ) |   const
Description: See if this polyedge has a trim as one of its segments Parameters: trim - [in] the trim to look for Returns: -1: trim is not in the polyedge >=0: index of first segment that uses the trim
◆ GetHistoryValue()
 bool CRhinoPolyEdge::GetHistoryValue  |  ( |  CRhinoDoc &  |  doc,
|  ON_PolyEdgeHistory &  |  polyedge_history
) |   |  const
◆ Highlight()
 void CRhinoPolyEdge::Highlight  |  ( |  bool  |  bHighlight = true | ) |   const
◆ Insert()
 BOOL32 CRhinoPolyEdge::Insert  |  ( |  int  |  segment_index,
|  class CRhinoPolyEdgeSegment *  |  new_segment
)
◆ IsClosed()
 bool CRhinoPolyEdge::IsClosed  |  ( |   | ) |   const
overridevirtual
virtual ON_Curve::IsClosed override
Reimplemented from ON_PolyCurve.
◆ IsHighlighted()
 bool CRhinoPolyEdge::IsHighlighted  |  ( |   | ) |   const
◆ IsoType()
 ON_Surface::ISO CRhinoPolyEdge::IsoType  |  ( |  double  |  t | ) |   const
◆ IsSelected()
 bool CRhinoPolyEdge::IsSelected  |  ( |   | ) |   const
◆ operator[]()
 class CRhinoPolyEdgeSegment* CRhinoPolyEdge::operator[]  |  ( |  int  |   | ) |   const
◆ Prepend()
 BOOL32 CRhinoPolyEdge::Prepend  |  ( |  class CRhinoPolyEdgeSegment *  |  new_segment | )
Prepend curve.
◆ PrependAndMatch()
 BOOL32 CRhinoPolyEdge::PrependAndMatch  |  ( |  ON_Curve *  |   | )
◆ Remove() [1/2]
 BOOL32 CRhinoPolyEdge::Remove  |  ( |   | )
remove last
7-1-03 lw added override to unset cached closed flag when a segment is removed
◆ Remove() [2/2]
 BOOL32 CRhinoPolyEdge::Remove  |  ( |  int  |  index | )
◆ SegmentCount()
 int CRhinoPolyEdge::SegmentCount  |  ( |   | ) |   const
◆ SegmentCurve()
 class CRhinoPolyEdgeSegment* CRhinoPolyEdge::SegmentCurve  |  ( |  int  |  segment_index | ) |   const
◆ Select()
 void CRhinoPolyEdge::Select  |  ( |  bool  |  bSelect = true,
|  bool  |  bSynchHighlight = true
) |   |  const
◆ SetEndPoint()
 bool CRhinoPolyEdge::SetEndPoint  |  ( |  ON_3dPoint  |  end_point | )
overridevirtual
virtual
Description: Force the curve to end at a specified point. Parameters: end_point - [in] Returns: true if successful. Remarks: Some end points cannot be moved. Be sure to check return code. See Also: ON_Curve::SetStartPoint ON_Curve::PointAtStart ON_Curve::PointAtEnd
Reimplemented from ON_PolyCurve.
◆ SetSrfTangentMode()
 void CRhinoPolyEdge::SetSrfTangentMode  |  ( |  eTanMode  |  tm | )
Description: The CRhinoPolyEdge EvSrf... tools can evaluate the "binormal" surface tangent direction in several different ways. Parameters: tm - [in] mode for CRhinoPolyEdge::EvSrf... tools to use when computing value of srftangent parameter. See Also: CRhinoPolyEdge::SrfTangentMode
◆ SetStartPoint()
 bool CRhinoPolyEdge::SetStartPoint  |  ( |  ON_3dPoint  |  start_point | )
overridevirtual
OBSOLETE and unreliable. Use FindCurve, FindEdge, or FindTrim bool Contains( const ON_Curve* curve) const; virtual ON_Curve overrides do nothing to prevent changing edge
Reimplemented from ON_PolyCurve.
◆ SrfTangentMode()
 eTanMode CRhinoPolyEdge::SrfTangentMode  |  ( |   | ) |   const
Description: The CRhinoPolyEdge EvSrf... tools can evaluate the "binormal" surface tangent direction in several different ways. Returns: Current value of mode by CRhinoPolyEdge::EvSrf... tools when computing value of srftangent parameter. See Also: CRhinoPolyEdge::SrfTangentMode
◆ SurfaceAt()
 const ON_Surface* CRhinoPolyEdge::SurfaceAt  |  ( |  double  |  t | ) |   const
◆ SurfaceParameter()
 ON_2dPoint CRhinoPolyEdge::SurfaceParameter  |  ( |  double  |  t | ) |   const
◆ TrimAt()
 const ON_BrepTrim* CRhinoPolyEdge::TrimAt  |  ( |  double  |  t | ) |   const
◆ TrimParameter()
 double CRhinoPolyEdge::TrimParameter  |  ( |  double  |  t | ) |   const