Public Member Functions | Public Attributes | List of all members
CRhinoDrawAttributes Class Reference
Rhino
#include <rhinoSdkDraw.h>
 Public Member Functions
CRhinoDrawAttributes () RHINO_NOEXCEPT
CRhinoDrawAttributes (const CRhinoDrawAttributes &) RHINO_NOEXCEPT
CRhinoDrawAttributes (CRhinoDrawAttributes &&) RHINO_NOEXCEPT
~CRhinoDrawAttributes () RHINO_NOEXCEPT
std::shared_ptr< class CRhinoDrawCommonAttributes >  | Common () RHINO_NOEXCEPT
Shared among multiple objects could use reference counting? More...
std::shared_ptr< class CRhinoDrawFancyAttributes >  | Fancy () RHINO_NOEXCEPT
CRhinoDrawAttributes &  | operator= (const CRhinoDrawAttributes &) RHINO_NOEXCEPT
CRhinoDrawAttributes &  | operator= (CRhinoDrawAttributes &&) RHINO_NOEXCEPT
 Public Attributes
class CRhinoDrawCommonAttributes *  | m_common_attributes
One per object might be implemented this way? More...
class CRhinoDrawFancyAttributes *  | m_fancy_attributes
Constructor & Destructor Documentation
◆ CRhinoDrawAttributes() [1/3]
 CRhinoDrawAttributes::CRhinoDrawAttributes  |  ( |   | )
◆ ~CRhinoDrawAttributes()
 CRhinoDrawAttributes::~CRhinoDrawAttributes  |  ( |   | )
◆ CRhinoDrawAttributes() [2/3]
 CRhinoDrawAttributes::CRhinoDrawAttributes  |  ( |  const CRhinoDrawAttributes &  |   | )
◆ CRhinoDrawAttributes() [3/3]
 CRhinoDrawAttributes::CRhinoDrawAttributes  |  ( |  CRhinoDrawAttributes &&  |   | )
Member Function Documentation
◆ Common()
 std::shared_ptr<class CRhinoDrawCommonAttributes> CRhinoDrawAttributes::Common  |  ( |   | )
Shared among multiple objects could use reference counting?
◆ Fancy()
 std::shared_ptr<class CRhinoDrawFancyAttributes> CRhinoDrawAttributes::Fancy  |  ( |   | )
◆ operator=() [1/2]
 CRhinoDrawAttributes& CRhinoDrawAttributes::operator=  |  ( |  const CRhinoDrawAttributes &  |   | )
◆ operator=() [2/2]
 CRhinoDrawAttributes& CRhinoDrawAttributes::operator=  |  ( |  CRhinoDrawAttributes &&  |   | )
Member Data Documentation
◆ m_common_attributes
 class CRhinoDrawCommonAttributes* CRhinoDrawAttributes::m_common_attributes
One per object might be implemented this way?
Drawing attributes are broken into chunks so we do not use lots of time and memory to manage information that is rarely used. Common attributes that are almost always needed. Fancy attributes are rarely needed. There will probably be other "chunks" of attributes.
◆ m_fancy_attributes
 class CRhinoDrawFancyAttributes* CRhinoDrawAttributes::m_fancy_attributes