Public Attributes | List of all members
CRhinoOnViewModifiedEvent::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
unsigned int  | m_view_sn
Member Data Documentation
◆ m_view_sn
 unsigned int CRhinoOnViewModifiedEvent::CParameters::m_view_sn