Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_SectionStyle Class Reference
OpenNURBS
class ON_SectionStyle More...
#include <opennurbs_sectionstyle.h>
 Inheritance diagram for ON_SectionStyle:
 Public Types
enum  | SectionBackgroundFillMode : unsigned char { SectionBackgroundFillMode::None = 0, SectionBackgroundFillMode::Viewport = 1, SectionBackgroundFillMode::SolidColor = 2 }
Defines how a background fill is applied to a section More...
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
ON_SectionStyle () ON_NOEXCEPT
ON_SectionStyle (const ON_SectionStyle &other)
~ON_SectionStyle ()
ON_Color  | BackgroundFillColor (bool print) const
SectionBackgroundFillMode  | BackgroundFillMode () const
How a background fill is applied. More...
ON_Color  | BoundaryColor (bool print) const
const ON_Linetype *  | BoundaryLinetype () const
int  | BoundaryLinetypeIndex () const
double  | BoundaryPlotWeightMillimeters () const
bool  | BoundaryVisible () const
Should the boundary curves for a section be shown (default is true) More...
double  | BoundaryWidthScale () const
Width scale to apply to an object's linetype for sections. Default is 3. More...
void  | Dump (ON_TextLog &) const override
for debugging More...
ON_Color  | HatchColor (bool print) const
int  | HatchIndex () const
double  | HatchPatternPlotWeightMillimeters () const
double  | HatchRotation () const
Rotation angle in radians applied to hatch pattern for a section. More...
double  | HatchScale () const
Scale applied to the hatch pattern for a section. More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_SectionStyle &  | operator= (const ON_SectionStyle &other)
bool  | Read (ON_BinaryArchive &) override
void  | RemoveBoundaryLinetype ()
bool  | SectionAttributesEqual (const ON_SectionStyle &other) const
ON::SectionFillRule  | SectionFillRule () const
void  | SetBackgroundFillColor (const ON_Color &color, bool print)
void  | SetBackgroundFillMode (SectionBackgroundFillMode mode)
void  | SetBoundaryColor (const ON_Color &color, bool print)
void  | SetBoundaryLinetype (const ON_Linetype &linetype)
void  | SetBoundaryLinetypeIndex (int index)
void  | SetBoundaryPlotWeightMillimeters (double weight)
void  | SetBoundaryVisible (bool on)
void  | SetBoundaryWidthScale (double scale)
void  | SetHatchColor (const ON_Color &color, bool print)
void  | SetHatchIndex (int index)
void  | SetHatchPatternPlotWeightMillimeters (double weight)
void  | SetHatchRotation (double rotation)
void  | SetHatchScale (double scale)
void  | SetSectionFillRule (ON::SectionFillRule rule)
bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map) override
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
int  | UserStringCount () const
 Static Public Member Functions
static const ON_SectionStyle *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_SectionStyle *none_return_value)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_SectionStyle  | Default
index = -1, unique and persistent id. More...
static const ON_SectionStyle  | Unset
index = ON_UNSET_INT_INDEX, id = nil More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
class ON_SectionStyle
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Enumeration Documentation
◆ SectionBackgroundFillMode
 enum ON_SectionStyle::SectionBackgroundFillMode : unsigned char
strong
Defines how a background fill is applied to a section
Enumerator
None
Do not fill in the background of a section
Viewport
Use the current display mode settings to determine how to apply a fill. Wireframe will not fill while shaded and rendered will fill using colors and materials matching how the object is drawn.
SolidColor
Use a solid color for a background fill. If BackgroundFillColor is set on this section style, then that color will be used. Otherwise, the item's color that this section style is associated will be used
Constructor & Destructor Documentation
◆ ON_SectionStyle() [1/2]
 ON_SectionStyle::ON_SectionStyle  |  ( |   | )
◆ ~ON_SectionStyle()
 ON_SectionStyle::~ON_SectionStyle  |  ( |   | )
◆ ON_SectionStyle() [2/2]
 ON_SectionStyle::ON_SectionStyle  |  ( |  const ON_SectionStyle &  |  other | )
Member Function Documentation
◆ BackgroundFillColor()
 ON_Color ON_SectionStyle::BackgroundFillColor  |  ( |  bool  |  print | ) |   const
Custom background fill color. If unset (default), the object's color or material is used for a fill
◆ BackgroundFillMode()
 SectionBackgroundFillMode ON_SectionStyle::BackgroundFillMode  |  ( |   | ) |   const
How a background fill is applied.
◆ BoundaryColor()
 ON_Color ON_SectionStyle::BoundaryColor  |  ( |  bool  |  print | ) |   const
Custom boundary color for a section. If unset (default), the object's color is used
◆ BoundaryLinetype()
 const ON_Linetype* ON_SectionStyle::BoundaryLinetype  |  ( |   | ) |   const
Section styles can have custom linetypes. If null, then the linetype is retrieved from the parent layer or attributes
◆ BoundaryLinetypeIndex()
 int ON_SectionStyle::BoundaryLinetypeIndex  |  ( |   | ) |   const
◆ BoundaryPlotWeightMillimeters()
 double ON_SectionStyle::BoundaryPlotWeightMillimeters  |  ( |   | ) |   const
Plot width of the boundary curves. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to
NOTE: if a linetype is assigned to this section style that has a physical width (not pixels), then this value is ignored and the linetype value is used
◆ BoundaryVisible()
 bool ON_SectionStyle::BoundaryVisible  |  ( |   | ) |   const
Should the boundary curves for a section be shown (default is true)
◆ BoundaryWidthScale()
 double ON_SectionStyle::BoundaryWidthScale  |  ( |   | ) |   const
Width scale to apply to an object's linetype for sections. Default is 3.
◆ Dump()
 void ON_SectionStyle::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_ModelComponent.
◆ FromModelComponentRef()
 static const ON_SectionStyle* ON_SectionStyle::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_SectionStyle *  |  none_return_value
)
static
Parameters: model_component_reference - [in] none_return_value - [in] value to return if ON_SectionStyle::Cast(model_component_ref.ModelComponent()) is nullptr Returns: If ON_SectionStyle::Cast(model_component_ref.ModelComponent()) is not nullptr, that pointer is returned. Otherwise, none_return_value is returned.
◆ HatchColor()
 ON_Color ON_SectionStyle::HatchColor  |  ( |  bool  |  print | ) |   const
Custom hatch pattern color for a section. If unset (default), the object's color is used
◆ HatchIndex()
 int ON_SectionStyle::HatchIndex  |  ( |   | ) |   const
Hatch pattern index for hatch to use when drawing a closed section Default is ON_UNSET_INT_INDEX which means don't draw a hatch
◆ HatchPatternPlotWeightMillimeters()
 double ON_SectionStyle::HatchPatternPlotWeightMillimeters  |  ( |   | ) |   const
Plot width of the hatch pattern curves for a section. values less than -1 (-10 is default): plot weight is determined by the object's attributes -1: do not plot 0: use default weight defined by the print dialog positive values are thicknesses in millimeters to print to
◆ HatchRotation()
 double ON_SectionStyle::HatchRotation  |  ( |   | ) |   const
Rotation angle in radians applied to hatch pattern for a section.
◆ HatchScale()
 double ON_SectionStyle::HatchScale  |  ( |   | ) |   const
Scale applied to the hatch pattern for a section.
◆ IsValid()
 bool ON_SectionStyle::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests that name is set and there is at least one non-zero length segment
Reimplemented from ON_ModelComponent.
◆ operator=()
 ON_SectionStyle& ON_SectionStyle::operator=  |  ( |  const ON_SectionStyle &  |  other | )
◆ Read()
 bool ON_SectionStyle::Read  |  ( |  ON_BinaryArchive &  |   | )
overridevirtual
Description: Read from file (restore definition from binary archive)
Reimplemented from ON_Object.
◆ RemoveBoundaryLinetype()
 void ON_SectionStyle::RemoveBoundaryLinetype  |  ( |   | )
◆ SectionAttributesEqual()
 bool ON_SectionStyle::SectionAttributesEqual  |  ( |  const ON_SectionStyle &  |  other | ) |   const
Description: Test only the section style attributes below for equality. Does not perform any testing of the ON_ModelComponent fields Parameters: other: other section style to compare against this
◆ SectionFillRule()
 ON::SectionFillRule ON_SectionStyle::SectionFillRule  |  ( |   | ) |   const
When to fill/hatch the sections for an object can depend on the type of object being sectioned. See ON_SectionFillRule for the choices of when to generate hatches.
◆ SetBackgroundFillColor()
 void ON_SectionStyle::SetBackgroundFillColor  |  ( |  const ON_Color &  |  color,
|  bool  |  print
)
◆ SetBackgroundFillMode()
 void ON_SectionStyle::SetBackgroundFillMode  |  ( |  SectionBackgroundFillMode  |  mode | )
◆ SetBoundaryColor()
 void ON_SectionStyle::SetBoundaryColor  |  ( |  const ON_Color &  |  color,
|  bool  |  print
)
◆ SetBoundaryLinetype()
 void ON_SectionStyle::SetBoundaryLinetype  |  ( |  const ON_Linetype &  |  linetype | )
◆ SetBoundaryLinetypeIndex()
 void ON_SectionStyle::SetBoundaryLinetypeIndex  |  ( |  int  |  index | )
If the boundary linetype needs to come from the document, then set the index using an index in the document's linetype table. Default is ON_UNSET_INT_INDEX which means the linetype is not set to a document linetype and is instead derived from the locally held custom linetype or the object's linetype
◆ SetBoundaryPlotWeightMillimeters()
 void ON_SectionStyle::SetBoundaryPlotWeightMillimeters  |  ( |  double  |  weight | )
◆ SetBoundaryVisible()
 void ON_SectionStyle::SetBoundaryVisible  |  ( |  bool  |  on | )
◆ SetBoundaryWidthScale()
 void ON_SectionStyle::SetBoundaryWidthScale  |  ( |  double  |  scale | )
◆ SetHatchColor()
 void ON_SectionStyle::SetHatchColor  |  ( |  const ON_Color &  |  color,
|  bool  |  print
)
◆ SetHatchIndex()
 void ON_SectionStyle::SetHatchIndex  |  ( |  int  |  index | )
◆ SetHatchPatternPlotWeightMillimeters()
 void ON_SectionStyle::SetHatchPatternPlotWeightMillimeters  |  ( |  double  |  weight | )
◆ SetHatchRotation()
 void ON_SectionStyle::SetHatchRotation  |  ( |  double  |  rotation | )
◆ SetHatchScale()
 void ON_SectionStyle::SetHatchScale  |  ( |  double  |  scale | )
◆ SetSectionFillRule()
 void ON_SectionStyle::SetSectionFillRule  |  ( |  ON::SectionFillRule  |  rule | )
◆ UpdateReferencedComponents()
 bool ON_SectionStyle::UpdateReferencedComponents  |  ( |  const class ON_ComponentManifest &  |  source_manifest,
|  const class ON_ComponentManifest &  |  destination_manifest,
|  const class ON_ManifestMap &  |  manifest_map
)
overridevirtual
Description: Uses the destination_manifest to update references to other components. This is typically done when a component's references came from a "source" context and are being updated to the "destination" context. For example, inserting one model into another when index, id, and name conflicts need to be resolved at the time of insertion. Parameters: source_manifest - [in] A manifest of the source context with indices and ids corresponding to the current component references. If this manifest is not available, pass ON_ComponentManifest::Empty. destination_manifest - [in] A manifest of the destination context with indices and ids corresponding to the desired component references. If this manifest is not available, pass ON_ComponentManifest::Empty. manifest_map - [in] A map from the source (current) referenced component index/id values to the destination (desired) component index/id values. Returns: True if successful. False indicates a referenced component was not found in the manifest and the reference was changed to a default value. Example: If this object is an ON_Layer, the line pattern and render material references are updated. If this object is an ON_DimStyle, the text style reference is updated. If this object is an ON_3dmObjectAttributes, the layer, material, line pattern, and group references are updated.
Reimplemented from ON_Object.
◆ Write()
 bool ON_SectionStyle::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
overridevirtual
Description: Write to file (serialize definition to binary archive)
Reimplemented from ON_Object.
Member Data Documentation
◆ Default
 const ON_SectionStyle ON_SectionStyle::Default
static
index = -1, unique and persistent id.
◆ Unset
 const ON_SectionStyle ON_SectionStyle::Unset
static
index = ON_UNSET_INT_INDEX, id = nil