Public Member Functions | Public Attributes | Protected Attributes | List of all members
CArgsRhinoHatch Class Reference
Rhino
#include <rhinoSdkHatchObject.h>
 Public Member Functions
CArgsRhinoHatch ()=default
int  | PatternIndex () const
Gets. More...
double  | PatternRotation () const
double  | PatternScale () const
void  | SetPatternIndex (int index)
Sets. More...
void  | SetPatternRotation (double rotation)
void  | SetPatternScale (double scale)
void  | SetView (const CRhinoView *view)
const CRhinoView *  | View () const
 Public Attributes
ON_SimpleArray< const ON_Curve * >  | m_loops
 Protected Attributes
int  | m_pattern_index = -1
double  | m_pattern_rotation = 0.0
double  | m_pattern_scale = 1.0
const CRhinoView *  | m_view = nullptr
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CArgsRhinoHatch()
 CArgsRhinoHatch::CArgsRhinoHatch  |  ( |   | )
default
Member Function Documentation
◆ PatternIndex()
 int CArgsRhinoHatch::PatternIndex  |  ( |   | ) |   const
Gets.
◆ PatternRotation()
 double CArgsRhinoHatch::PatternRotation  |  ( |   | ) |   const
◆ PatternScale()
 double CArgsRhinoHatch::PatternScale  |  ( |   | ) |   const
◆ SetPatternIndex()
 void CArgsRhinoHatch::SetPatternIndex  |  ( |  int  |  index | )
Sets.
◆ SetPatternRotation()
 void CArgsRhinoHatch::SetPatternRotation  |  ( |  double  |  rotation | )
◆ SetPatternScale()
 void CArgsRhinoHatch::SetPatternScale  |  ( |  double  |  scale | )
◆ SetView()
 void CArgsRhinoHatch::SetView  |  ( |  const CRhinoView *  |  view | )
◆ View()
 const CRhinoView* CArgsRhinoHatch::View  |  ( |   | ) |   const
Member Data Documentation
◆ m_loops
 ON_SimpleArray<const ON_Curve*> CArgsRhinoHatch::m_loops
◆ m_pattern_index
 int CArgsRhinoHatch::m_pattern_index = -1
protected
◆ m_pattern_rotation
 double CArgsRhinoHatch::m_pattern_rotation = 0.0
protected
◆ m_pattern_scale
 double CArgsRhinoHatch::m_pattern_scale = 1.0
protected
◆ m_view
 const CRhinoView* CArgsRhinoHatch::m_view = nullptr
protected