Public Member Functions | Protected Attributes | List of all members
CRhRdkPostEffectPlugInManager Class Reference
RDK
#include <RhRdkPostEffectPlugInManager.h>
 Inheritance diagram for CRhRdkPostEffectPlugInManager:
 Public Member Functions
CRhRdkPostEffectPlugInManager ()
virtual  | ~CRhRdkPostEffectPlugInManager ()
bool  | AllowWireframeEffects (void) const
virtual_su bool  | CanDisplayOptions (const UUID &uuidPlugIn) const
virtual bool  | DisplayOptions (const UUID &uuidPlugIn, HWND hParent) const
virtual bool  | EnablePlugIn (const UUID &uuidPlugIn, bool bEnable=true) const
CImpl &  | GetImpl (void) const
virtual bool  | GetNextPlugIn (UUID &uuidOut, ON_wString &sNameOut) const
virtual IRhRdkPostEffectImage *  | Image (void) const
virtual bool  | Initialize (IRhRdkPostEffectImage *pImage) const
virtual bool  | IsPlugInEnabled (const UUID &uuidPlugIn) const
virtual bool  | MoveDown (const UUID &uuidPlugIn) const
virtual bool  | MoveDownPossible (const UUID &uuidPlugIn) const
virtual bool  | MoveUp (const UUID &uuidPlugIn) const
virtual bool  | MoveUpPossible (const UUID &uuidPlugIn) const
const CRhRdkPostEffectPlugInManager &  | operator= (const CRhRdkPostEffectPlugInManager &srce)
virtual CRhRdkPostEffectPlugIn *  | PlugIn (const UUID &uuidPlugIn) const
virtual bool  | PlugInWorksWithCurrentImage (const UUID &uuidPlugIn) const
virtual bool  | ProcessImage (void) const
virtual bool  | ReadState (const UUID &uuidPlugIn, const void *pBuffer, size_t size) const
virtual void  | ResetPlugInIterator (void) const
virtual bool  | RunSingleProcess (const UUID &uuidPlugIn) const
void  | SetAllowWireframeEffects (bool bAllow)
virtual void  | SetAllPlugInsToDocumentDefaults (const CRhinoDoc &doc) const
virtual RDK_DEPRECATED void  | SetAllPlugInsToDocumentDefaults (void) const
virtual void  | SetAllPlugInsToFactoryDefaults (void) const
virtual DWORD  | StateCRC (void) const
virtual void  | WriteAllPlugInsToDocumentDefaults (CRhinoDoc &doc) const
virtual RDK_DEPRECATED void  | WriteAllPlugInsToDocumentDefaults (void) const
virtual bool  | WriteState (const UUID &uuidPlugIn, void *pBuffer, size_t &size) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Protected Attributes
CImpl *  | m_pImpl
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Constructor & Destructor Documentation
◆ CRhRdkPostEffectPlugInManager()
 CRhRdkPostEffectPlugInManager::CRhRdkPostEffectPlugInManager  |  ( |   | )
◆ ~CRhRdkPostEffectPlugInManager()
 virtual CRhRdkPostEffectPlugInManager::~CRhRdkPostEffectPlugInManager  |  ( |   | )
virtual
Member Function Documentation
◆ AllowWireframeEffects()
 bool CRhRdkPostEffectPlugInManager::AllowWireframeEffects  |  ( |  void  |   | ) |   const
◆ CanDisplayOptions()
 virtual_su bool CRhRdkPostEffectPlugInManager::CanDisplayOptions  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
Query if a plug-in can display a properties dialog.
Parameters
uuidPlugIn | is the UUID of the plug-in.
Returns
true if it can, false if it can't or the plug-in does not exist.
◆ DisplayOptions()
 virtual bool CRhRdkPostEffectPlugInManager::DisplayOptions  |  ( |  const UUID &  |  uuidPlugIn,
|  HWND  |  hParent
) |   |  const
virtual
Display plug-in options to the user.
Parameters
uuidPlugIn | is the UUID of the plug-in.
Returns
true if successful, false if the plug-in does not exist or user cancelled the dialog.
◆ EnablePlugIn()
 virtual bool CRhRdkPostEffectPlugInManager::EnablePlugIn  |  ( |  const UUID &  |  uuidPlugIn,
|  bool  |  bEnable = true
) |   |  const
virtual
Enable a plug-in.
Parameters
uuidPlugIn | is the UUID of the plug-in.
Returns
true if successful, false if the plug-in does not exist.
◆ GetImpl()
 CImpl& CRhRdkPostEffectPlugInManager::GetImpl  |  ( |  void  |   | ) |   const
◆ GetNextPlugIn()
 virtual bool CRhRdkPostEffectPlugInManager::GetNextPlugIn  |  ( |  UUID &  |  uuidOut,
|  ON_wString &  |  sNameOut
) |   |  const
virtual
Get the next plug-in.
Parameters
uuidOut | accepts the UUID of the next plug-in.
sNameOut | accepts the name of the next plug-in.
Returns
true if plug-in was retrieved or false if there are no more plug-ins.
◆ Image()
 virtual IRhRdkPostEffectImage* CRhRdkPostEffectPlugInManager::Image  |  ( |  void  |   | ) |   const
virtual
Returns
A pointer to the post-effect image associated with this manager.
◆ Initialize()
 virtual bool CRhRdkPostEffectPlugInManager::Initialize  |  ( |  IRhRdkPostEffectImage *  |  pImage | ) |   const
virtual
Initialize the manager.
Parameters
pImage | is a pointer to a post-effect image that will be modified by the plug-ins. This pointer can be NUILL in which case RunSingleProcess() will have no effect.
◆ IsPlugInEnabled()
 virtual bool CRhRdkPostEffectPlugInManager::IsPlugInEnabled  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Query if a plug-in is enabled.
Parameters
uuidPlugIn | is the UUID of the plug-in.
Returns
true if enabled, false if disabled or the plug-in does not exist.
◆ MoveDown()
 virtual bool CRhRdkPostEffectPlugInManager::MoveDown  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Move a plug-in down in the list.
Returns
true if the plug-in was moved.
Parameters
uuidPlugIn | is the UUID of the plug-in to move.
◆ MoveDownPossible()
 virtual bool CRhRdkPostEffectPlugInManager::MoveDownPossible  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Returns
true if a plug-in can be moved down in the list.
Parameters
uuidPlugIn | is the UUID of the plug-in.
◆ MoveUp()
 virtual bool CRhRdkPostEffectPlugInManager::MoveUp  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Move a plug-in up in the list.
Returns
true if the plug-in was moved.
Parameters
uuidPlugIn | is the UUID of the plug-in to move.
◆ MoveUpPossible()
 virtual bool CRhRdkPostEffectPlugInManager::MoveUpPossible  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Returns
true if a plug-in can be moved up in the list.
Parameters
uuidPlugIn | is the UUID of the plug-in.
◆ operator=()
 const CRhRdkPostEffectPlugInManager& CRhRdkPostEffectPlugInManager::operator=  |  ( |  const CRhRdkPostEffectPlugInManager &  |  srce | )
Copy the manager.
◆ PlugIn()
 virtual CRhRdkPostEffectPlugIn* CRhRdkPostEffectPlugInManager::PlugIn  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Find a plug-in by its UUID.
Parameters
uuidPlugIn | is the UUID of the plug-in to find.
Returns
A pointer to the plug-in or NULL if the specified plug-in does not exist.
◆ PlugInWorksWithCurrentImage()
 virtual bool CRhRdkPostEffectPlugInManager::PlugInWorksWithCurrentImage  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Returns
true if a plug-in works with the current image.
Parameters
uuidPlugIn | is the UUID of the plug-in.
◆ ProcessImage()
 virtual bool CRhRdkPostEffectPlugInManager::ProcessImage  |  ( |  void  |   | ) |   const
virtual
Process the image by calling RunSingleProcess() on each enabled plug-in in order, stopping if any one plug-in fails.
Returns
true if all plug-ins were successful, false if a plug-in failed.
◆ ReadState()
 virtual bool CRhRdkPostEffectPlugInManager::ReadState  |  ( |  const UUID &  |  uuidPlugIn,
|  const void *  |  pBuffer,
|  size_t  |  size
) |   |  const
virtual
Read a plug-in's state from a buffer.
Parameters
uuidPlugIn | is the UUID of the plug-in.
pBuffer | is the buffer containing data previously written by WriteState().
size | is the number of bytes in the buffer.
Returns
true if successful, else false.
◆ ResetPlugInIterator()
 virtual void CRhRdkPostEffectPlugInManager::ResetPlugInIterator  |  ( |  void  |   | ) |   const
virtual
Reset the iterator for GetNextPlugIn().
◆ RunSingleProcess()
 virtual bool CRhRdkPostEffectPlugInManager::RunSingleProcess  |  ( |  const UUID &  |  uuidPlugIn | ) |   const
virtual
Process the image with a single plug-in.
Parameters
uuidPlugIn | is the UUID of the plug-in.
Returns
true if successful, false if plug-in failed.
◆ SetAllowWireframeEffects()
 void CRhRdkPostEffectPlugInManager::SetAllowWireframeEffects  |  ( |  bool  |  bAllow | )
◆ SetAllPlugInsToDocumentDefaults() [1/2]
 virtual void CRhRdkPostEffectPlugInManager::SetAllPlugInsToDocumentDefaults  |  ( |  const CRhinoDoc &  |  doc | ) |   const
virtual
Reset all post-effect plug-ins to document defaults.
◆ SetAllPlugInsToDocumentDefaults() [2/2]
 virtual RDK_DEPRECATED void CRhRdkPostEffectPlugInManager::SetAllPlugInsToDocumentDefaults  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of the one below.
◆ SetAllPlugInsToFactoryDefaults()
 virtual void CRhRdkPostEffectPlugInManager::SetAllPlugInsToFactoryDefaults  |  ( |  void  |   | ) |   const
virtual
Reset all post-effect plug-ins to their original factory defaults.
◆ StateCRC()
 virtual DWORD CRhRdkPostEffectPlugInManager::StateCRC  |  ( |  void  |   | ) |   const
virtual
Get the CRC of all plug-in state.
◆ WriteAllPlugInsToDocumentDefaults() [1/2]
 virtual void CRhRdkPostEffectPlugInManager::WriteAllPlugInsToDocumentDefaults  |  ( |  CRhinoDoc &  |  doc | ) |   const
virtual
Copy all post-effect plug-in state to document defaults.
◆ WriteAllPlugInsToDocumentDefaults() [2/2]
 virtual RDK_DEPRECATED void CRhRdkPostEffectPlugInManager::WriteAllPlugInsToDocumentDefaults  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of the one below.
◆ WriteState()
 virtual bool CRhRdkPostEffectPlugInManager::WriteState  |  ( |  const UUID &  |  uuidPlugIn,
|  void *  |  pBuffer,
|  size_t &  |  size
) |   |  const
virtual
Write a plug-in's state to a buffer.
Parameters
uuidPlugIn | is the UUID of the plug-in.
pBuffer | is the buffer to fill with state information.
size | is the physical number of bytes that the buffer can accomodate. This parameter also accepts the logical number of bytes written to the buffer. This will be more than size if the buffer was not big enough. If pBuffer is NULL you can pass zero in size to get the number of bytes required to write the plug-in state.
Returns
true if successful, else false.
Member Data Documentation
◆ m_pImpl
 CImpl* CRhRdkPostEffectPlugInManager::m_pImpl
protected