Public Member Functions | Protected Attributes | List of all members
CArgsRhinoAnnotationLeader Class Reference
RhinoGet
#include <rhinoSdkGetAnnotationLeader.h>
 Public Member Functions
CArgsRhinoAnnotationLeader ()
~CArgsRhinoAnnotationLeader ()
ON_Color  | FeedbackColor () const
color used to draw feedback line More...
const wchar_t *  | FirstPrompt () const
prompt when getting first dimension point More...
bool  | IsInteractive ()
Set or get whether the command is being run interaceively. More...
const wchar_t *  | PointPrompt () const
prompt when getting second dimension More...
void  | SetFeedbackColor (COLORREF color)
void  | SetFirstPrompt (const wchar_t *prompt)
void  | SetInteractive (bool interactive)
void  | SetPointPrompt (const wchar_t *prompt)
 Protected Attributes
ON_Color  | m_dynamic_line_color
[in] color to use when drawing dynamic line while getting end point More...
ON_wString  | m_first_prompt
[in] prompt when getting first point More...
bool  | m_interactive
ON_wString  | m_point_prompt
[in] prompt when getting other points More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. Description: CArgsRhinoAnnotationLeader is used to pass input to GetAnnotationLeader().
Constructor & Destructor Documentation
◆ CArgsRhinoAnnotationLeader()
 CArgsRhinoAnnotationLeader::CArgsRhinoAnnotationLeader  |  ( |   | )
◆ ~CArgsRhinoAnnotationLeader()
 CArgsRhinoAnnotationLeader::~CArgsRhinoAnnotationLeader  |  ( |   | )
Member Function Documentation
◆ FeedbackColor()
 ON_Color CArgsRhinoAnnotationLeader::FeedbackColor  |  ( |   | ) |   const
color used to draw feedback line
◆ FirstPrompt()
 const wchar_t* CArgsRhinoAnnotationLeader::FirstPrompt  |  ( |   | ) |   const
prompt when getting first dimension point
◆ IsInteractive()
 bool CArgsRhinoAnnotationLeader::IsInteractive  |  ( |   | )
Set or get whether the command is being run interaceively.
◆ PointPrompt()
 const wchar_t* CArgsRhinoAnnotationLeader::PointPrompt  |  ( |   | ) |   const
prompt when getting second dimension
◆ SetFeedbackColor()
 void CArgsRhinoAnnotationLeader::SetFeedbackColor  |  ( |  COLORREF  |  color | )
◆ SetFirstPrompt()
 void CArgsRhinoAnnotationLeader::SetFirstPrompt  |  ( |  const wchar_t *  |  prompt | )
◆ SetInteractive()
 void CArgsRhinoAnnotationLeader::SetInteractive  |  ( |  bool  |  interactive | )
◆ SetPointPrompt()
 void CArgsRhinoAnnotationLeader::SetPointPrompt  |  ( |  const wchar_t *  |  prompt | )
Member Data Documentation
◆ m_dynamic_line_color
 ON_Color CArgsRhinoAnnotationLeader::m_dynamic_line_color
protected
[in] color to use when drawing dynamic line while getting end point
◆ m_first_prompt
 ON_wString CArgsRhinoAnnotationLeader::m_first_prompt
protected
[in] prompt when getting first point
◆ m_interactive
 bool CArgsRhinoAnnotationLeader::m_interactive
protected
◆ m_point_prompt
 ON_wString CArgsRhinoAnnotationLeader::m_point_prompt
protected
[in] prompt when getting other points