Public Member Functions | List of all members
CRhRdkExcludeListAutoUIContext Class Reference
RDK
#include <RhRdkAutomaticUI.h>
 Inheritance diagram for CRhRdkExcludeListAutoUIContext:
 Public Member Functions
CRhRdkExcludeListAutoUIContext (IAutoUIExtraRequirements *pExtraReqs)
virtual CRhRdkAutoUIContext *  | Duplicate (void) const override
virtual bool  | OnButtonClicked (const wchar_t *wszParamName, const wchar_t *wszCtrlName) const override
virtual UUID  | TypeId (void) const override
 Public Member Functions inherited from CRhRdkAutoUIContext
CRhRdkAutoUIContext (IAutoUIExtraRequirements *pExtraReqs)
virtual  | ~CRhRdkAutoUIContext ()
virtual bool  | GetValue (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, CRhRdkVariant &vValueOut) const
virtual bool  | SetValue (const wchar_t *wszParamName, const wchar_t *wszExtraReqName, const CRhRdkVariant &vValue) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkAutoUIContext
IAutoUIExtraRequirements *  | ExtraRequirements (void) const
Constructor & Destructor Documentation
◆ CRhRdkExcludeListAutoUIContext()
 CRhRdkExcludeListAutoUIContext::CRhRdkExcludeListAutoUIContext  |  ( |  IAutoUIExtraRequirements *  |  pExtraReqs | )
Member Function Documentation
◆ Duplicate()
 virtual CRhRdkAutoUIContext* CRhRdkExcludeListAutoUIContext::Duplicate  |  ( |  void  |   | ) |   const
overridevirtual
Reimplemented from CRhRdkAutoUIContext.
◆ OnButtonClicked()
 virtual bool CRhRdkExcludeListAutoUIContext::OnButtonClicked  |  ( |  const wchar_t *  |  wszParamName,
|  const wchar_t *  |  wszCtrlName
) |   |  const
overridevirtual
Reimplemented from CRhRdkAutoUIContext.
◆ TypeId()
 virtual UUID CRhRdkExcludeListAutoUIContext::TypeId  |  ( |  void  |   | ) |   const
overridevirtual
Reimplemented from CRhRdkAutoUIContext.