Public Member Functions | Static Public Member Functions | Protected Attributes | List of all members
ON_MeshModifier Class Referenceabstract
OpenNURBS
#include <opennurbs_mesh_modifiers.h>
 Inheritance diagram for ON_MeshModifier:
 Public Member Functions
ON_MeshModifier ()
ON_MeshModifier (const ON_MeshModifier &mm)=delete
ON_MeshModifier (const ON_XMLNode &node)
virtual  | ~ON_MeshModifier ()
virtual ON_XMLNode *  | AddChildXML (ON_XMLRootNode &root) const
< For internal use only. More...
const ON_MeshModifier &  | operator= (const ON_MeshModifier &)=delete
virtual ON_UUID  | Uuid (void) const =0
Return the unique identifier of this mesh modifier. More...
 Static Public Member Functions
static ON_UUID  | PlugInId (void)
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers. More...
 Protected Attributes
CImpl *  | m_impl
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_MeshModifier() [1/3]
 ON_MeshModifier::ON_MeshModifier  |  ( |   | )
◆ ON_MeshModifier() [2/3]
 ON_MeshModifier::ON_MeshModifier  |  ( |  const ON_XMLNode &  |  node | )
◆ ON_MeshModifier() [3/3]
 ON_MeshModifier::ON_MeshModifier  |  ( |  const ON_MeshModifier &  |  mm | )
delete
◆ ~ON_MeshModifier()
 virtual ON_MeshModifier::~ON_MeshModifier  |  ( |   | )
virtual
Member Function Documentation
◆ AddChildXML()
 virtual ON_XMLNode* ON_MeshModifier::AddChildXML  |  ( |  ON_XMLRootNode &  |  root | ) |   const
virtual
< For internal use only.
Reimplemented in ON_ShutLining, and ON_Displacement.
◆ operator=()
 const ON_MeshModifier& ON_MeshModifier::operator=  |  ( |  const ON_MeshModifier &  |   | )
delete
◆ PlugInId()
 static ON_UUID ON_MeshModifier::PlugInId  |  ( |  void  |   | )
static
Returns the plug-in id of the 'Displacement' plug-in which implements all the mesh modifiers.
◆ Uuid()
 virtual ON_UUID ON_MeshModifier::Uuid  |  ( |  void  |   | ) |   const
pure virtual
Return the unique identifier of this mesh modifier.
Implemented in ON_ShutLining, ON_CurvePiping, ON_Thickening, ON_EdgeSoftening, and ON_Displacement.
Member Data Documentation
◆ m_impl
 CImpl* ON_MeshModifier::m_impl
protected