Public Types | Public Member Functions | List of all members
CRhinoUiResourceManager Class Referenceabstract
RhinoUI
#include <RhinoSdkUiResourceManager.h>
 Inheritance diagram for CRhinoUiResourceManager:
 Public Types
enum  | bitmaps { bmp_tb_drag_not = 0, bmp_tb_drag_del }
enum  | cursors {
 cursor_tb_shift = 0, cursor_tb_ctrl, cursor_tb_shift_ctrl, cursor_tb_move,
 cursor_tb_link, cursor_tb_copy, cursor_tb_delete
 }
enum  | images { image_tb_tt_lr = 0, image_layer_manager_state, image_layer_manager_state_empty, image_layer_manager_image }
 Public Member Functions
CRhinoUiResourceManager ()=default
virtual  | ~CRhinoUiResourceManager (void)
HCURSOR  | CreateTextCursor (HCURSOR hCursorTemplate, ON_wString wCustomText, bool bBlackTextOnWhiteBkgrnd=true, int iTextLeft=4, int iTextTop=1, LPRECT lpTextWrittenToRect=NULL)
virtual bool  | GetBitmap (bitmaps, CRhinoDib &)=0
virtual HCURSOR  | GetCursor (cursors)=0
virtual bool  | GetImageList (images, CRhinoUiImageList &)=0
virtual COLORREF  | GetImageMaskingColor ()=0
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ bitmaps
 enum CRhinoUiResourceManager::bitmaps
Enumerator
bmp_tb_drag_not
bmp_tb_drag_del
◆ cursors
 enum CRhinoUiResourceManager::cursors
Enumerator
cursor_tb_shift
cursor_tb_ctrl
cursor_tb_shift_ctrl
cursor_tb_move
cursor_tb_link
cursor_tb_copy
cursor_tb_delete
◆ images
 enum CRhinoUiResourceManager::images
Enumerator
image_tb_tt_lr
Tool bar tool tip, left and right mouse images. left should be image index 0, right 1
image_layer_manager_state
image_layer_manager_state_empty
image_layer_manager_image
Constructor & Destructor Documentation
◆ CRhinoUiResourceManager()
 CRhinoUiResourceManager::CRhinoUiResourceManager  |  ( |   | )
default
◆ ~CRhinoUiResourceManager()
 virtual CRhinoUiResourceManager::~CRhinoUiResourceManager  |  ( |  void  |   | )
virtual
Member Function Documentation
◆ CreateTextCursor()
 HCURSOR CRhinoUiResourceManager::CreateTextCursor  |  ( |  HCURSOR  |  hCursorTemplate,
|  ON_wString  |  wCustomText,
|  bool  |  bBlackTextOnWhiteBkgrnd = true,
|  int  |  iTextLeft = 4,
|  int  |  iTextTop = 1,
|  LPRECT  |  lpTextWrittenToRect = NULL
)
◆ GetBitmap()
 virtual bool CRhinoUiResourceManager::GetBitmap  |  ( |  bitmaps  |  ,
|  CRhinoDib &
)
pure virtual
Implemented in CRhinoAppUiResourceManager.
◆ GetCursor()
 virtual HCURSOR CRhinoUiResourceManager::GetCursor  |  ( |  cursors  |   | )
pure virtual
Implemented in CRhinoAppUiResourceManager.
◆ GetImageList()
 virtual bool CRhinoUiResourceManager::GetImageList  |  ( |  images  |  ,
|  CRhinoUiImageList &
)
pure virtual
Implemented in CRhinoAppUiResourceManager.
◆ GetImageMaskingColor()
 virtual COLORREF CRhinoUiResourceManager::GetImageMaskingColor  |  ( |   | )
pure virtual
Implemented in CRhinoAppUiResourceManager.