Public Types | Public Member Functions | Protected Attributes | List of all members
CRhinoUiDialogItemResizer Class Reference
RhinoUI
#include <RhinoSdkUiDialogItemResizer.h>
 Public Types
enum  | Modes {
 resize_lockleft = 0x0001, resize_lockright = 0x0002, resize_locktop = 0x0004, resize_lockbottom = 0x0008,
 resize_showhide = 0x0010, resize_lockall = resize_lockleft|resize_lockright|resize_locktop|resize_lockbottom, resize_locktopleft = resize_lockleft|resize_locktop, resize_locktopright = resize_lockright|resize_locktop,
 resize_lockbottomleft = resize_lockbottom|resize_lockleft, resize_lockbottomright = resize_lockbottom|resize_lockright, resize_lockwidth = resize_lockleft|resize_lockright, resize_lockheight = resize_locktop|resize_lockbottom,
 force_32bit_modes = 0xFFFFFFFF
 }
 Public Member Functions
CRhinoUiDialogItemResizer (CWnd *)
~CRhinoUiDialogItemResizer (void)
void  | Add (CWnd *pControl, unsigned int uFlags)
Adds a control to the resize list. More...
void  | Add (int nCtrlID, unsigned int uFlags)
CSize  | GetInitialSize () const
Returns the initial size. More...
void  | Resize (CWnd *pWnd)
Resizes the controls in the window. More...
void  | SetInitialSize (const CSize &size)
Sets the original size of the parent. More...
void  | SetInitialSize (int cx, int cy)
Sets the original size of the parent. More...
 Protected Attributes
ON_SimpleArray< void * >  | m_Controls
CWnd *  | m_pOwner
CSize  | m_szInitial
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Member Enumeration Documentation
◆ Modes
 enum CRhinoUiDialogItemResizer::Modes
Enumerator
resize_lockleft
Distance to left is fixed.
resize_lockright
Distance to right is fixed.
resize_locktop
Distance to top is fixed.
resize_lockbottom
Distance to bottom is fixed.
resize_showhide
Show/hide if not fully visible.
resize_lockall
resize_locktopleft
resize_locktopright
resize_lockbottomleft
resize_lockbottomright
resize_lockwidth
resize_lockheight
force_32bit_modes
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiDialogItemResizer()
 CRhinoUiDialogItemResizer::CRhinoUiDialogItemResizer  |  ( |  CWnd *  |   | )
◆ ~CRhinoUiDialogItemResizer()
 CRhinoUiDialogItemResizer::~CRhinoUiDialogItemResizer  |  ( |  void  |   | )
Member Function Documentation
◆ Add() [1/2]
 void CRhinoUiDialogItemResizer::Add  |  ( |  CWnd *  |  pControl,
|  unsigned int  |  uFlags
)
Adds a control to the resize list.
◆ Add() [2/2]
 void CRhinoUiDialogItemResizer::Add  |  ( |  int  |  nCtrlID,
|  unsigned int  |  uFlags
)
◆ GetInitialSize()
 CSize CRhinoUiDialogItemResizer::GetInitialSize  |  ( |   | ) |   const
Returns the initial size.
◆ Resize()
 void CRhinoUiDialogItemResizer::Resize  |  ( |  CWnd *  |  pWnd | )
Resizes the controls in the window.
◆ SetInitialSize() [1/2]
 void CRhinoUiDialogItemResizer::SetInitialSize  |  ( |  const CSize &  |  size | )
Sets the original size of the parent.
◆ SetInitialSize() [2/2]
 void CRhinoUiDialogItemResizer::SetInitialSize  |  ( |  int  |  cx,
|  int  |  cy
)
Sets the original size of the parent.
Member Data Documentation
◆ m_Controls
 ON_SimpleArray<void*> CRhinoUiDialogItemResizer::m_Controls
protected
◆ m_pOwner
 CWnd* CRhinoUiDialogItemResizer::m_pOwner
protected
◆ m_szInitial
 CSize CRhinoUiDialogItemResizer::m_szInitial
protected