Public Member Functions | Static Public Member Functions | Public Attributes | Friends | List of all members
CRhinoTextureMapping Class Reference
Rhino
#include <rhinoSdkTexture.h>
 Inheritance diagram for CRhinoTextureMapping:
 Public Member Functions
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
unsigned int  | UseCount () const
unsigned int  | WorksessionReferenceModelSerialNumber () const
 Public Member Functions inherited from ON_TextureMapping
ON_TextureMapping () ON_NOEXCEPT
ON_TextureMapping (const ON_TextureMapping &src)
virtual  | ~ON_TextureMapping ()
const ON_Brep *  | CustomMappingBrepPrimitive (void) const
const ON_Mesh *  | CustomMappingMeshPrimitive (void) const
const ON_Object *  | CustomMappingPrimitive (void) const
const ON_Surface *  | CustomMappingSurfacePrimitive (void) const
void  | Dump (ON_TextLog &) const override
virtual int  | Evaluate (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T) const
virtual int  | Evaluate (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T, const ON_Xform &P_xform, const ON_Xform &N_xform) const
int  | EvaluateBoxMapping (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T) const
int  | EvaluateBrepMapping (const ON_3dPoint &P, const ON_3dVector &N, const ON_Brep *brep, ON_3dPoint *T) const
int  | EvaluateCylinderMapping (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T) const
int  | EvaluateMeshMapping (const ON_3dPoint &P, const ON_3dVector &N, const ON_Mesh *mesh, ON_3dPoint *T) const
int  | EvaluatePlaneMapping (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T) const
int  | EvaluateSphereMapping (const ON_3dPoint &P, const ON_3dVector &N, ON_3dPoint *T) const
int  | EvaluateSurfaceMapping (const ON_3dPoint &P, const ON_3dVector &N, const ON_Surface *srf, ON_3dPoint *T) const
bool  | GetMappingBox (ON_Plane &plane, ON_Interval &dx, ON_Interval &dy, ON_Interval &dz) const
bool  | GetMappingCylinder (ON_Cylinder &cylinder) const
bool  | GetMappingPlane (ON_Plane &plane, ON_Interval &dx, ON_Interval &dy, ON_Interval &dz) const
bool  | GetMappingSphere (ON_Sphere &sphere) const
bool  | GetTextureCoordinates (const ON_Mesh &mesh, ON_SimpleArray< ON_2fPoint > &T, const ON_Xform *mesh_xform=0, bool bLazy=false, ON_SimpleArray< int > *Tside=0) const
bool  | GetTextureCoordinates (const ON_Mesh &mesh, ON_SimpleArray< ON_3fPoint > &T, const ON_Xform *mesh_xform=0, bool bLazy=false, ON_SimpleArray< int > *Tside=0) const
bool  | HasMatchingCachedTextureCoordinates (const ON_Mesh &mesh, const ON_Xform *object_xform=nullptr) const
bool  | HasMatchingTextureCoordinates (const class ON_MappingTag &tag, const ON_Xform *object_xform=nullptr) const
bool  | HasMatchingTextureCoordinates (const ON_Mesh &mesh, const ON_Xform *object_xform=nullptr) const
bool  | IsPeriodic (void) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON__UINT32  | MappingCRC () const
ON_TextureMapping &  | operator= (const ON_TextureMapping &src)
bool  | Read (ON_BinaryArchive &binary_archive) override
bool  | RequiresVertexNormals () const
bool  | ReverseTextureCoordinate (int dir)
bool  | SetBoxMapping (const ON_Plane &plane, ON_Interval dx, ON_Interval dy, ON_Interval dz, bool bIsCapped)
void  | SetCustomMappingPrimitive (ON_Object *)
bool  | SetCylinderMapping (const ON_Cylinder &cylinder, bool bIsCapped)
bool  | SetOcsMapping (const ON_Plane &plane)
bool  | SetPlaneMapping (const ON_Plane &plane, const ON_Interval &dx, const ON_Interval &dy, const ON_Interval &dz)
bool  | SetSphereMapping (const ON_Sphere &sphere)
bool  | SetSurfaceParameterMapping (void)
const std::shared_ptr< const ON_Object > &  | SharedCustomMappingPrimitive (void) const
unsigned int  | SizeOf () const override
bool  | SwapTextureCoordinate (int i, int j)
bool  | TileTextureCoordinate (int dir, double count, double offset)
bool  | Write (ON_BinaryArchive &binary_archive) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static unsigned int  | NextRuntimeSerialNumber ()
static ON_Xform  | OcsMappingTransformForObject (const CRhinoObject &object)
 Static Public Member Functions inherited from ON_TextureMapping
static const ON_TextureMapping *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_TextureMapping *none_return_value)
static ON_TextureMapping::PROJECTION  | ProjectionFromUnsigned (unsigned int projection_as_unsigned)
static const ON_wString  | ProjectionToString (ON_TextureMapping::PROJECTION texture_mapping_projection)
static void  | SetAdvancedBrepMappingToolFunctions (TEXMAP_INTERSECT_LINE_SURFACE, TEXMAP_BREP_FACE_CLOSEST_POINT)
static void  | SetAdvancedGetTextureMappingFromDocumentFunction (GET_TEXMAP_FROM_DOCUMENT)
static const ON_wString  | SpaceToString (ON_TextureMapping::TEXTURE_SPACE texture_mapping_space)
static ON_TextureMapping::TEXTURE_SPACE  | TextureSpaceFromUnsigned (unsigned int texture_space_as_unsigned)
static ON_TextureMapping::TYPE  | TypeFromUnsigned (unsigned int type_as_unsigned)
static const ON_wString  | TypeToString (ON_TextureMapping::TYPE texture_mapping_type)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Public Attributes
int  | m_remap_index = -1
Runtime index used when remapping texture_mappings for import/export. More...
int  | m_sort_index = -1
Runtime index used to sort texture_mappings in texture_mapping dialog. More...
const int  | m_texturemapping_sn
 Public Attributes inherited from ON_TextureMapping
bool  | m_bCapped = false
ON_Xform  | m_Nxyz = ON_Xform::IdentityTransformation
ON_TextureMapping::PROJECTION  | m_projection = ON_TextureMapping::PROJECTION::no_projection
ON_Xform  | m_Pxyz = ON_Xform::IdentityTransformation
ON_TextureMapping::TEXTURE_SPACE  | m_texture_space = ON_TextureMapping::TEXTURE_SPACE::single
ON_TextureMapping::TYPE  | m_type = ON_TextureMapping::TYPE::no_mapping
ON_Xform  | m_uvw = ON_Xform::IdentityTransformation
 Friends
class  | CRhinoTextureMappingTable
 Additional Inherited Members
 Public Types inherited from ON_TextureMapping
enum  | PROJECTION : unsigned int { PROJECTION::no_projection = 0, PROJECTION::clspt_projection = 1, PROJECTION::ray_projection = 2 }
enum  | TEXTURE_SPACE : unsigned int { TEXTURE_SPACE::single = 0, TEXTURE_SPACE::divided = 1 }
enum  | TYPE : unsigned int {
 TYPE::no_mapping = 0, TYPE::srfp_mapping = 1, TYPE::plane_mapping = 2, TYPE::cylinder_mapping = 3,
 TYPE::sphere_mapping = 4, TYPE::box_mapping = 5, TYPE::mesh_mapping_primitive = 6, TYPE::srf_mapping_primitive = 7,
 TYPE::brep_mapping_primitive = 8, TYPE::ocs_mapping = 9, TYPE::false_colors = 10, TYPE::wcs_projection = 11,
 TYPE::wcsbox_projection = 12
 }
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_TextureMapping
static const ON_TextureMapping  | SurfaceParameterTextureMapping
m_type = ON_TextureMapping::srfp_mapping m_id = ON_TextureMapping::SurfaceParameterTextureMappingId More...
static const ON_UUID  | SurfaceParameterTextureMappingId
{B988A6C2-61A6-45a7-AAEE-9AED7EF4E316} More...
static const ON_TextureMapping  | Unset
m_type = ON_TextureMapping::TYPE::no_mapping m_id = nil id More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Function Documentation
◆ LinkedInstanceDefinitionSerialNumber()
 unsigned int CRhinoTextureMapping::LinkedInstanceDefinitionSerialNumber  |  ( |   | ) |   const
Returns: 0: The linetype is not part of a linked instance definition 1-1000: These numbers are reserved for future use. >1000: CRhinoDoc::m_instance_defintion_table.FindBySerialNumber() can be used to find the instance definition. Remarks: The linked instance definition serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
◆ NextRuntimeSerialNumber()
 static unsigned int CRhinoTextureMapping::NextRuntimeSerialNumber  |  ( |   | )
static
◆ OcsMappingTransformForObject()
 static ON_Xform CRhinoTextureMapping::OcsMappingTransformForObject  |  ( |  const CRhinoObject &  |  object | )
static
◆ UseCount()
 unsigned int CRhinoTextureMapping::UseCount  |  ( |   | ) |   const
Returns: Number of object using this mapping.
◆ WorksessionReferenceModelSerialNumber()
 unsigned int CRhinoTextureMapping::WorksessionReferenceModelSerialNumber  |  ( |   | ) |   const
Returns: Worksession reference model id. 0: linetype is not in a reference model. 1: linetype is in an unidentified worksession reference model. 2-1000: reserved for future use >1000: Serial number of the worksession reference model.
 Remarks: The reference model serial number is a runtime value. It is not saved in files and it is generally different the next time a file is read.
Friends And Related Function Documentation
◆ CRhinoTextureMappingTable
 friend class CRhinoTextureMappingTable
friend
Member Data Documentation
◆ m_remap_index
 int CRhinoTextureMapping::m_remap_index = -1
Runtime index used when remapping texture_mappings for import/export.
◆ m_sort_index
 int CRhinoTextureMapping::m_sort_index = -1
Runtime index used to sort texture_mappings in texture_mapping dialog.
◆ m_texturemapping_sn
 const int CRhinoTextureMapping::m_texturemapping_sn
Runtime serial number of this linetype. This serial number is unique for each linetype in an instance of a Rhino application. This serial number is not saved in files and it is generally different the next time a file is read.