Public Member Functions | List of all members
ON_Skylight Class Reference
OpenNURBS
#include <opennurbs_skylight.h>
 Public Member Functions
ON_Skylight ()
ON_Skylight (const ON_Skylight &sl)
ON_Skylight (ON_XMLNode &model_node)
virtual  | ~ON_Skylight ()
virtual bool  | Enabled (void) const
Returns true if the skylight is enabled, else false. More...
ON_UUID  | EnvironmentId (void) const
bool  | EnvironmentOverride (void) const
virtual void *  | EVF (const wchar_t *func, void *data)
Emergency virtual function for future expansion. More...
virtual void  | OnInternalXmlChanged (const ON_Skylight *)
For internal use only. More...
virtual bool  | operator!= (const ON_Skylight &sl) const
virtual const ON_Skylight &  | operator= (const ON_Skylight &sl)
virtual bool  | operator== (const ON_Skylight &sl) const
virtual void  | SetEnabled (bool b)
Set the skylight enabled state. More...
void  | SetEnvironmentId (const ON_UUID &id)
void  | SetEnvironmentOverride (bool on)
virtual void  | SetShadowIntensity (double d)
Set the skylight shadow intensity. This is currently unused. More...
virtual double  | ShadowIntensity (void) const
Returns the skylight shadow intensity. This is currently unused. More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_Skylight() [1/3]
 ON_Skylight::ON_Skylight  |  ( |   | )
◆ ON_Skylight() [2/3]
 ON_Skylight::ON_Skylight  |  ( |  ON_XMLNode &  |  model_node | )
◆ ON_Skylight() [3/3]
 ON_Skylight::ON_Skylight  |  ( |  const ON_Skylight &  |  sl | )
◆ ~ON_Skylight()
 virtual ON_Skylight::~ON_Skylight  |  ( |   | )
virtual
Member Function Documentation
◆ Enabled()
 virtual bool ON_Skylight::Enabled  |  ( |  void  |   | ) |   const
virtual
Returns true if the skylight is enabled, else false.
◆ EnvironmentId()
 ON_UUID ON_Skylight::EnvironmentId  |  ( |  void  |   | ) |   const
DEPRECATED
◆ EnvironmentOverride()
 bool ON_Skylight::EnvironmentOverride  |  ( |  void  |   | ) |   const
< These methods are only here to support deprecated C# SDK methods. Please use the equivalent methods in ON_3dmRenderSettings. DEPRECATED
◆ EVF()
 virtual void* ON_Skylight::EVF  |  ( |  const wchar_t *  |  func,
|  void *  |  data
)
virtual
Emergency virtual function for future expansion.
◆ OnInternalXmlChanged()
 virtual void ON_Skylight::OnInternalXmlChanged  |  ( |  const ON_Skylight *  |   | )
virtual
For internal use only.
◆ operator!=()
 virtual bool ON_Skylight::operator!=  |  ( |  const ON_Skylight &  |  sl | ) |   const
virtual
◆ operator=()
 virtual const ON_Skylight& ON_Skylight::operator=  |  ( |  const ON_Skylight &  |  sl | )
virtual
◆ operator==()
 virtual bool ON_Skylight::operator==  |  ( |  const ON_Skylight &  |  sl | ) |   const
virtual
◆ SetEnabled()
 virtual void ON_Skylight::SetEnabled  |  ( |  bool  |  b | )
virtual
Set the skylight enabled state.
◆ SetEnvironmentId()
 void ON_Skylight::SetEnvironmentId  |  ( |  const ON_UUID &  |  id | )
DEPRECATED
◆ SetEnvironmentOverride()
 void ON_Skylight::SetEnvironmentOverride  |  ( |  bool  |  on | )
DEPRECATED
◆ SetShadowIntensity()
 virtual void ON_Skylight::SetShadowIntensity  |  ( |  double  |  d | )
virtual
Set the skylight shadow intensity. This is currently unused.
◆ ShadowIntensity()
 virtual double ON_Skylight::ShadowIntensity  |  ( |  void  |   | ) |   const
virtual
Returns the skylight shadow intensity. This is currently unused.