Public Member Functions | Public Attributes | List of all members
CRhinoTaperSpaceMorph Class Reference
Rhino
Taper morph. More...
#include <RhinoSdkSpaceMorph.h>
 Inheritance diagram for CRhinoTaperSpaceMorph:
 Public Member Functions
CRhinoTaperSpaceMorph ()
~CRhinoTaperSpaceMorph ()
bool  | IsIdentity (const ON_BoundingBox &bbox) const override
virtual ON_SpaceMorph override More...
ON_3dPoint  | MorphPoint (ON_3dPoint point) const override
virtual ON_SpaceMorph override More...
bool  | SetEndDistance (double)
bool  | SetEndDistance (ON_3dPoint)
 Public Member Functions inherited from CRhinoSpaceMorph
CRhinoSpaceMorph ()
virtual  | ~CRhinoSpaceMorph ()
 Public Member Functions inherited from ON_SpaceMorph
ON_SpaceMorph ()
virtual  | ~ON_SpaceMorph ()
virtual bool  | Ev1Der (ON_3dPoint rst, ON_3dPoint &xyz, ON_3dVector &Dr, ON_3dVector &Ds, ON_3dVector &Dt) const
bool  | IsIdentity (const class ON_Curve &Crv, double tol) const
bool  | IsIdentity (const class ON_Surface &Srf, double tol) const
bool  | IsIdentity (const ON_SimpleArray< ON_3dPoint > &Points, double tol) const
virtual ON_4dPoint  | Morph4dPoint (ON_4dPoint point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, double *point) const
void  | MorphPointList (int dim, bool is_rat, int count, int stride, float *point) const
virtual ON_3dVector  | MorphVector (ON_3dPoint tail_point, ON_3dVector vector) const
bool  | PreserveStructure () const
bool  | QuickPreview () const
void  | SetPreserveStructure (bool bPreserveStructure)
void  | SetQuickPreview (bool bQuickPreview)
void  | SetTolerance (double tolerance)
double  | Tolerance () const
 Public Attributes
bool  | m_bFlat
Create a one-directional, one-dimensional taper. More...
bool  | m_bInfiniteTaper
double  | m_end_radius
double  | m_length
ON_Plane  | m_plane
double  | m_start_radius
ON_Line  | m_taper_axis
Detailed Description
Taper morph.
Constructor & Destructor Documentation
◆ CRhinoTaperSpaceMorph()
 CRhinoTaperSpaceMorph::CRhinoTaperSpaceMorph  |  ( |   | )
◆ ~CRhinoTaperSpaceMorph()
 CRhinoTaperSpaceMorph::~CRhinoTaperSpaceMorph  |  ( |   | )
Member Function Documentation
◆ IsIdentity()
 bool CRhinoTaperSpaceMorph::IsIdentity  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
overridevirtual
virtual ON_SpaceMorph override
Reimplemented from ON_SpaceMorph.
◆ MorphPoint()
 ON_3dPoint CRhinoTaperSpaceMorph::MorphPoint  |  ( |  ON_3dPoint  |  point | ) |   const
overridevirtual
virtual ON_SpaceMorph override
Implements ON_SpaceMorph.
◆ SetEndDistance() [1/2]
 bool CRhinoTaperSpaceMorph::SetEndDistance  |  ( |  double  |   | )
Description: Validates and sets the end radius Parameters: double - [in] end radius Returns: true if end radius is successfully set
◆ SetEndDistance() [2/2]
 bool CRhinoTaperSpaceMorph::SetEndDistance  |  ( |  ON_3dPoint  |   | )
Description: Takes a point and calculates the end radius based on the distance from the origin of the taper plane Parameters: ON_3dPoint - [in] point from the plane origin defining an end radius Returns: true if end radius is successfully set
Member Data Documentation
◆ m_bFlat
 bool CRhinoTaperSpaceMorph::m_bFlat
Create a one-directional, one-dimensional taper.
◆ m_bInfiniteTaper
 bool CRhinoTaperSpaceMorph::m_bInfiniteTaper
If true the deformation happens throughout the object, even if the axis is shorter. Otherwise, the deformation takes place only the length of the axis. The length of the axis is important. If the axis is shorter than the object, the taper applies only to that part of the object.
◆ m_end_radius
 double CRhinoTaperSpaceMorph::m_end_radius
◆ m_length
 double CRhinoTaperSpaceMorph::m_length
◆ m_plane
 ON_Plane CRhinoTaperSpaceMorph::m_plane
◆ m_start_radius
 double CRhinoTaperSpaceMorph::m_start_radius
◆ m_taper_axis
 ON_Line CRhinoTaperSpaceMorph::m_taper_axis