Public Member Functions | List of all members
ON_ReferencedComponentSettings Class Reference
OpenNURBS
#include <opennurbs_instance.h>
 Public Member Functions
ON_ReferencedComponentSettings ()=default
ON_ReferencedComponentSettings (const ON_ReferencedComponentSettings &src)
~ON_ReferencedComponentSettings ()
void  | AfterLayerTableAddedToModel (const class ON_ComponentManifest &source_archive_manifest, const class ON_ComponentManifest &model_manifest, const class ON_ManifestMap &archive_to_model_map)
void  | AfterReferenceLayerTableRead (const class ON_ComponentManifest &source_archive_manifest, const class ON_ComponentManifest &model_manifest, const class ON_ManifestMap &archive_to_model_map, ON_Layer *linked_definition_parent_layer, unsigned int layer_count, ON_Layer **layers)
void  | BeforeLinkedDefinitionWrite (const class ON_ComponentManifest &model_manifest, const class ON_ComponentManifest &destination_archive_manifest, const class ON_ManifestMap &model_to_archive_map, const ON_Layer *linked_definition_parent_layer, void *context, const ON_Layer *(*ModelLayerFromIdFunc)(void *context, const ON_UUID &))
void  | ClearNestedLinkedIdefSettings ()
const ON_Layer *  | FindReferenceFileLayer (ON_UUID model_layer_id) const
bool  | HasLayerInformation () const
bool  | HasLayerTableInformation () const
bool  | HasParentLayerInformation () const
bool  | IsEmpty () const
bool  | IsNotEmpty () const
const ON_ReferencedComponentSettings *  | NestedLinkedIdefSettings (ON_UUID nested_idef_id) const
ON_ReferencedComponentSettings &  | operator= (const ON_ReferencedComponentSettings &src)
bool  | Read (ON_BinaryArchive &archive)
void  | SetNestedLinkedIdefSettings (ON_UUID nested_idef_id, const ON_ReferencedComponentSettings &nested_idef_settings)
bool  | Write (ON_BinaryArchive &archive) const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Constructor & Destructor Documentation
◆ ON_ReferencedComponentSettings() [1/2]
 ON_ReferencedComponentSettings::ON_ReferencedComponentSettings  |  ( |   | )
default
◆ ~ON_ReferencedComponentSettings()
 ON_ReferencedComponentSettings::~ON_ReferencedComponentSettings  |  ( |   | )
◆ ON_ReferencedComponentSettings() [2/2]
 ON_ReferencedComponentSettings::ON_ReferencedComponentSettings  |  ( |  const ON_ReferencedComponentSettings &  |  src | )
Member Function Documentation
◆ AfterLayerTableAddedToModel()
 void ON_ReferencedComponentSettings::AfterLayerTableAddedToModel  |  ( |  const class ON_ComponentManifest &  |  source_archive_manifest,
|  const class ON_ComponentManifest &  |  model_manifest,
|  const class ON_ManifestMap &  |  archive_to_model_map
)
Description: Update the mapping from reference file layer id to runtime model layer id. Typically this is done immediately after the reference file layers are added to the runtime model. Parameters: source_archive_manifest - [in] manifest of archive being read (may partially read) model_manifest - [in] manifest of runtime model (may partially created) archive_to_model_map - [in] Manifest map from reference file settings to runtime model settings. This map typically exists while the archive is being read and is destroyed after reading is complete. That's why the mapping has to be saved.
◆ AfterReferenceLayerTableRead()
 void ON_ReferencedComponentSettings::AfterReferenceLayerTableRead  |  ( |  const class ON_ComponentManifest &  |  source_archive_manifest,
|  const class ON_ComponentManifest &  |  model_manifest,
|  const class ON_ManifestMap &  |  archive_to_model_map,
|  ON_Layer *  |  linked_definition_parent_layer,
|  unsigned int  |  layer_count,
|  ON_Layer **  |  layers
)
Description: Update runtime layer color visibility, locked, ... settings in the layer table read from a reference file to the values to use in the runtime model. This is typically done right after the reference file layer table is read and before the layers are added to the runtime model. Parameters: source_archive_manifest - [in] manifest of archive being read (may partially read) model_manifest - [in] manifest of runtime model (may partially created) layer_count - [in] length of layers[] array; layers - [in/out] The input values should be the layer table read from the referenced file. The output values have color, visibility, locked, ... settings updated to the state they had the last time the model file (not the referenced file) was saved. linked_definition_parent_layer - [in/out] If linked_definition_parent_layer is not nullptr, its color, visibility, ... settings are updated to the state they had the last time the model file (not the referenced file) was saved. Remarks: The layer idenitification information (name, index, id) are not changed by this function.
◆ BeforeLinkedDefinitionWrite()
 void ON_ReferencedComponentSettings::BeforeLinkedDefinitionWrite  |  ( |  const class ON_ComponentManifest &  |  model_manifest,
|  const class ON_ComponentManifest &  |  destination_archive_manifest,
|  const class ON_ManifestMap &  |  model_to_archive_map,
|  const ON_Layer *  |  linked_definition_parent_layer,
|  void *  |  context,
|  const ON_Layer *(*)(void *context, const ON_UUID &)  |  ModelLayerFromIdFunc
)
Description: Save the current runtime layer color, visibility, ... states. Typically this is done immediately before a linked instance definition or worksession reference information is written. Calling the Write() function destroys the information created by BeforeWrite() because it is generally out-of-date if modeling resumes after writing. Parameters: model_manifest - [in] manifest of runtime model destination_archive_manifest - [in] manifest of archive being written (may partially written) model_to_archive_map - [in] Manifest map from model to destination_archive_manifest. linked_definition_parent_layer - [in] nullptr or the parent layer context - [in] first parameter passed to ModelLayerFromIdFunc ModelLayerFromIdFunc - [in] Function to get model layers from id
◆ ClearNestedLinkedIdefSettings()
 void ON_ReferencedComponentSettings::ClearNestedLinkedIdefSettings  |  ( |   | )
Description: Remove all nested linked instance definition settings from this ON_ReferencedComponentSettings. Remarks: Nested linked instance definitions (a linked file that itself contains linked instance definitions) are not saved in the archive of the model that references the top level linked file. Layer settings (color, visibility, ...) that the model applies to layers from a nested linked file are persisted by saving the nested instance definition's ON_ReferencedComponentSettings on its immediate parent's ON_ReferencedComponentSettings, which is saved in the model archive.
◆ FindReferenceFileLayer()
 const ON_Layer* ON_ReferencedComponentSettings::FindReferenceFileLayer  |  ( |  ON_UUID  |  model_layer_id | ) |   const
◆ HasLayerInformation()
 bool ON_ReferencedComponentSettings::HasLayerInformation  |  ( |   | ) |   const
◆ HasLayerTableInformation()
 bool ON_ReferencedComponentSettings::HasLayerTableInformation  |  ( |   | ) |   const
◆ HasParentLayerInformation()
 bool ON_ReferencedComponentSettings::HasParentLayerInformation  |  ( |   | ) |   const
◆ IsEmpty()
 bool ON_ReferencedComponentSettings::IsEmpty  |  ( |   | ) |   const
◆ IsNotEmpty()
 bool ON_ReferencedComponentSettings::IsNotEmpty  |  ( |   | ) |   const
◆ NestedLinkedIdefSettings()
 const ON_ReferencedComponentSettings* ON_ReferencedComponentSettings::NestedLinkedIdefSettings  |  ( |  ON_UUID  |  nested_idef_id | ) |   const
Description: Get the saved layer settings for a nested linked instance definition. Parameters: nested_idef_id - [in] Id of the nested linked instance definition as read from the instance definition table record in the immediate linked file. Returns: The stored settings or nullptr if none are stored for nested_idef_id. Remarks: See ClearNestedLinkedIdefSettings() remarks.
◆ operator=()
 ON_ReferencedComponentSettings& ON_ReferencedComponentSettings::operator=  |  ( |  const ON_ReferencedComponentSettings &  |  src | )
◆ Read()
 bool ON_ReferencedComponentSettings::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ SetNestedLinkedIdefSettings()
 void ON_ReferencedComponentSettings::SetNestedLinkedIdefSettings  |  ( |  ON_UUID  |  nested_idef_id,
|  const ON_ReferencedComponentSettings &  |  nested_idef_settings
)
Description: Save a copy of a nested linked instance definition's layer settings on this (the immediate parent's) ON_ReferencedComponentSettings so the settings persist in the archive of the model that references the top level linked file. Parameters: nested_idef_id - [in] Id of the nested linked instance definition. This id comes from the instance definition table record in the immediate linked file, so it is stable across readings of that file. nested_idef_settings - [in] The nested linked instance definition's current settings. A copy is stored. If nested_idef_settings.IsEmpty(), nothing is stored. Remarks: See ClearNestedLinkedIdefSettings() remarks.
◆ Write()
 bool ON_ReferencedComponentSettings::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const