Public Member Functions | Public Attributes | List of all members
CRhinoObjectPair Class Reference
Rhino
#include <rhinoSdkCommand.h>
 Public Member Functions
CRhinoObjectPair ()
 Public Attributes
CRhinoObject *  | m_object [2]
Constructor & Destructor Documentation
◆ CRhinoObjectPair()
 CRhinoObjectPair::CRhinoObjectPair  |  ( |   | )
Member Data Documentation
◆ m_object
 CRhinoObject* CRhinoObjectPair::m_object[2]