Public Attributes | List of all members
CRhinoOnChangeObjectSelectState::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
int  | m_object_deselected_count
number of objects that were deselected More...
const CRhinoObject *const *  | m_object_deselected_list
int  | m_object_selected_count
number of objects that were selected. More...
const CRhinoObject *const *  | m_object_selected_list
Member Data Documentation
◆ m_object_deselected_count
 int CRhinoOnChangeObjectSelectState::CParameters::m_object_deselected_count
number of objects that were deselected
◆ m_object_deselected_list
 const CRhinoObject* const* CRhinoOnChangeObjectSelectState::CParameters::m_object_deselected_list
list of objects that were deselected WARNING: These objects may be deleted at any time after Notify is called. Do not save these pointers and dereference them later. Use the runtime object serial number to safely save a reference to these objects.
◆ m_object_selected_count
 int CRhinoOnChangeObjectSelectState::CParameters::m_object_selected_count
number of objects that were selected.
◆ m_object_selected_list
 const CRhinoObject* const* CRhinoOnChangeObjectSelectState::CParameters::m_object_selected_list
list of objects that were selected WARNING: These objects may be deleted at any time after Notify is called. Do not save these pointers and dereference them later. Use the runtime object serial number to safely save a reference to these objects.