Public Member Functions | Protected Types | Protected Member Functions | List of all members
CRhinoObjectPropertiesModelessDockingDialog Class Reference
Rhino
CRhinoObjectPropertiesModelessDockingDialog. More...
#include <RhinoSdkObjectPropertiesModlessDockingDialog.h>
 Inheritance diagram for CRhinoObjectPropertiesModelessDockingDialog:
 Public Member Functions
const CRhinoObject *  | GetSelectedObject (int index) const
virtual int  | SelectedObjectCount () const
 Public Member Functions inherited from CRhinoUiModelessDockingDialog
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
virtual void  | OnExpandTab (int iTabIndex, bool bExpand)
virtual void  | OnHideTab (int iTabIndex, bool bHide)
virtual BOOL32  | OnInitDialog ()
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual BOOL32  | PreCreateWindow (CREATESTRUCT &cs)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Public Member Functions inherited from CRhinoUiDockBarClientExpandableTabPage
CRhinoUiDockBarClientExpandableTabPage (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDockBarClientExpandableTabPage (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDockBarClientExpandableTabPage ()
 Public Member Functions inherited from CRhinoUiExpandableTabPage
CRhinoUiExpandableTabPage (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiExpandableTabPage (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiExpandableTabPage ()
const CRhinoUiExpandableTabCtrlItem *  | GetExpandableTabCtrlItem () const
CRhinoUiExpandableTabCtrl *  | GetTabCtrl () const
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnSysColorChange ()
LPCTSTR  | PageName () const
bool  | SetUseSpecialColors (bool b)
bool  | UseSpecialColors () const
 Public Member Functions inherited from CRhinoUiDialog
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Protected Types
enum  | page_type {
 material_page = 0, light_page, custom_page, object_prop_page,
 dimension_page, leader_page, text_page, hatch_page,
 page_count
 }
 Protected Member Functions
CRhinoObjectPropertiesModelessDockingDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoObjectPropertiesModelessDockingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoObjectPropertiesModelessDockingDialog ()
virtual BOOL32  | AddPageToControlBar (const CRhinoObject *obj=NULL) const
void  | Construct ()
virtual void  | DimStyleTableEvent (CRhinoEventWatcher::dimstyle_event event, const CRhinoDimStyleTable &dimstyle_table, int dimstyle_index, const ON_DimStyle *old_settings)
virtual void  | GroupTableEvent (CRhinoEventWatcher::group_event event, const CRhinoGroupTable &group_table, int group_index, const ON_Group *old_settings)
virtual void  | HatchPatternTableEvent (CRhinoEventWatcher::hatchpattern_event event, const CRhinoHatchPatternTable &hatchpattern_table, int hatchpattern_index, const ON_HatchPattern *old_settings)
virtual void  | InitControls (const CRhinoObject *new_obj=NULL)
virtual void  | InstanceDefinitionTableEvent (CRhinoEventWatcher::idef_event event, const CRhinoInstanceDefinitionTable &idef_table, int idef_index, const ON_InstanceDefinition *old_settings)
virtual void  | LayerTableEvent (CRhinoEventWatcher::layer_event event, const CRhinoLayerTable &layer_table, int layer_index, const ON_Layer *old_settings)
virtual void  | LightTableEvent (CRhinoEventWatcher::light_event event, const CRhinoLightTable &light_table, int light_index, const ON_Light *old_settings)
virtual void  | LinetypeTableEvent (CRhinoEventWatcher::linetype_event event, const CRhinoLinetypeTable &linetype_table, int linetype_index, const ON_Linetype *old_settings)
virtual void  | MaterialTableEvent (CRhinoEventWatcher::material_event event, const CRhinoMaterialTable &material_table, int material_index, const ON_Material *old_settings)
virtual void  | OnAppSettingsChanged (const CRhinoAppSettings &new_app_settings)
virtual void  | OnBeginOpenDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bMerge, BOOL32 bReference)
virtual void  | OnBeginSaveDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bExportSelected)
virtual void  | OnCloseDocument (CRhinoDoc &doc)
virtual void  | OnDocumentPropertiesChanged (CRhinoDoc &doc)
virtual void  | OnEndOpenDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bMerge, BOOL32 bReference)
virtual void  | OnEndSaveDocument (CRhinoDoc &doc, const wchar_t *filename, BOOL32 bExportSelected)
virtual void  | OnModifyObjectAttributes (CRhinoDoc &doc, CRhinoObject &object, const CRhinoObjectAttributes &old_attributes)
virtual void  | OnNewDocument (CRhinoDoc &doc)
virtual void  | OnUpdateObjectMesh (CRhinoDoc &doc, CRhinoObject &object, ON::mesh_type mesh_type)
virtual page_type  | PageType () const
virtual CRhinoCommand::result  | RunScript (ON_SimpleArray< const CRhinoObject * > &objects)
 Protected Member Functions inherited from CRhinoUiModelessDockingDialog
CRhinoUiModelessDockingDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiModelessDockingDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiModelessDockingDialog ()
void  | Construct ()
 Protected Member Functions inherited from CRhinoUiExpandableTabPage
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
 Protected Member Functions inherited from CRhinoUiDialog
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
 Additional Inherited Members
 Public Types inherited from CRhinoUiDialog
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Attributes inherited from CRhinoUiDialog
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Attributes inherited from CRhinoUiModelessDockingDialog
UUID  | m_uuid
ON_wString  | m_wName
 Protected Attributes inherited from CRhinoUiDialog
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
Detailed Description
CRhinoObjectPropertiesModelessDockingDialog.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Member Enumeration Documentation
◆ page_type
 enum CRhinoObjectPropertiesModelessDockingDialog::page_type
protected
Methods you may override
Enumerator
material_page
Replace the material page with this page, only works are the current render plug-in.
light_page
Replace light page with this page, only works are the current render plug-in.
custom_page
User defined custom page.
object_prop_page
For internal use.
dimension_page
If page is provided by Rhino and only dimensions are selected activate this page.
leader_page
If page is provided by Rhino and leaders are selected activate this page.
text_page
If page is provided by Rhino and only text objects are selected activate this page.
hatch_page
If page is provided by Rhino and only hatch objects are selected activate this page.
page_count
reserved, do not use
Constructor & Destructor Documentation
◆ CRhinoObjectPropertiesModelessDockingDialog() [1/2]
 CRhinoObjectPropertiesModelessDockingDialog::CRhinoObjectPropertiesModelessDockingDialog  |  ( |  LPCTSTR  |  lpszTemplateName = NULL,
|  CWnd *  |  pParentWnd = NULL
)
protected
◆ CRhinoObjectPropertiesModelessDockingDialog() [2/2]
 CRhinoObjectPropertiesModelessDockingDialog::CRhinoObjectPropertiesModelessDockingDialog  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
protected
◆ ~CRhinoObjectPropertiesModelessDockingDialog()
 virtual CRhinoObjectPropertiesModelessDockingDialog::~CRhinoObjectPropertiesModelessDockingDialog  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ AddPageToControlBar()
 virtual BOOL32 CRhinoObjectPropertiesModelessDockingDialog::AddPageToControlBar  |  ( |  const CRhinoObject *  |  obj = NULL | ) |   const
protectedvirtual
◆ Construct()
 void CRhinoObjectPropertiesModelessDockingDialog::Construct  |  ( |   | )
protected
◆ DimStyleTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::DimStyleTableEvent  |  ( |  CRhinoEventWatcher::dimstyle_event  |  event,
|  const CRhinoDimStyleTable &  |  dimstyle_table,
|  int  |  dimstyle_index,
|  const ON_DimStyle *  |  old_settings
)
protectedvirtual
◆ GetSelectedObject()
 const CRhinoObject* CRhinoObjectPropertiesModelessDockingDialog::GetSelectedObject  |  ( |  int  |  index | ) |   const
◆ GroupTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::GroupTableEvent  |  ( |  CRhinoEventWatcher::group_event  |  event,
|  const CRhinoGroupTable &  |  group_table,
|  int  |  group_index,
|  const ON_Group *  |  old_settings
)
protectedvirtual
◆ HatchPatternTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::HatchPatternTableEvent  |  ( |  CRhinoEventWatcher::hatchpattern_event  |  event,
|  const CRhinoHatchPatternTable &  |  hatchpattern_table,
|  int  |  hatchpattern_index,
|  const ON_HatchPattern *  |  old_settings
)
protectedvirtual
◆ InitControls()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::InitControls  |  ( |  const CRhinoObject *  |  new_obj = NULL | )
protectedvirtual
Virtual interfaces
◆ InstanceDefinitionTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::InstanceDefinitionTableEvent  |  ( |  CRhinoEventWatcher::idef_event  |  event,
|  const CRhinoInstanceDefinitionTable &  |  idef_table,
|  int  |  idef_index,
|  const ON_InstanceDefinition *  |  old_settings
)
protectedvirtual
◆ LayerTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::LayerTableEvent  |  ( |  CRhinoEventWatcher::layer_event  |  event,
|  const CRhinoLayerTable &  |  layer_table,
|  int  |  layer_index,
|  const ON_Layer *  |  old_settings
)
protectedvirtual
◆ LightTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::LightTableEvent  |  ( |  CRhinoEventWatcher::light_event  |  event,
|  const CRhinoLightTable &  |  light_table,
|  int  |  light_index,
|  const ON_Light *  |  old_settings
)
protectedvirtual
◆ LinetypeTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::LinetypeTableEvent  |  ( |  CRhinoEventWatcher::linetype_event  |  event,
|  const CRhinoLinetypeTable &  |  linetype_table,
|  int  |  linetype_index,
|  const ON_Linetype *  |  old_settings
)
protectedvirtual
◆ MaterialTableEvent()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::MaterialTableEvent  |  ( |  CRhinoEventWatcher::material_event  |  event,
|  const CRhinoMaterialTable &  |  material_table,
|  int  |  material_index,
|  const ON_Material *  |  old_settings
)
protectedvirtual
◆ OnAppSettingsChanged()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnAppSettingsChanged  |  ( |  const CRhinoAppSettings &  |  new_app_settings | )
protectedvirtual
◆ OnBeginOpenDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnBeginOpenDocument  |  ( |  CRhinoDoc &  |  doc,
|  const wchar_t *  |  filename,
|  BOOL32  |  bMerge,
|  BOOL32  |  bReference
)
protectedvirtual
◆ OnBeginSaveDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnBeginSaveDocument  |  ( |  CRhinoDoc &  |  doc,
|  const wchar_t *  |  filename,
|  BOOL32  |  bExportSelected
)
protectedvirtual
◆ OnCloseDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnCloseDocument  |  ( |  CRhinoDoc &  |  doc | )
protectedvirtual
◆ OnDocumentPropertiesChanged()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnDocumentPropertiesChanged  |  ( |  CRhinoDoc &  |  doc | )
protectedvirtual
◆ OnEndOpenDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnEndOpenDocument  |  ( |  CRhinoDoc &  |  doc,
|  const wchar_t *  |  filename,
|  BOOL32  |  bMerge,
|  BOOL32  |  bReference
)
protectedvirtual
◆ OnEndSaveDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnEndSaveDocument  |  ( |  CRhinoDoc &  |  doc,
|  const wchar_t *  |  filename,
|  BOOL32  |  bExportSelected
)
protectedvirtual
◆ OnModifyObjectAttributes()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnModifyObjectAttributes  |  ( |  CRhinoDoc &  |  doc,
|  CRhinoObject &  |  object,
|  const CRhinoObjectAttributes &  |  old_attributes
)
protectedvirtual
◆ OnNewDocument()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnNewDocument  |  ( |  CRhinoDoc &  |  doc | )
protectedvirtual
◆ OnUpdateObjectMesh()
 virtual void CRhinoObjectPropertiesModelessDockingDialog::OnUpdateObjectMesh  |  ( |  CRhinoDoc &  |  doc,
|  CRhinoObject &  |  object,
|  ON::mesh_type  |  mesh_type
)
protectedvirtual
◆ PageType()
 virtual page_type CRhinoObjectPropertiesModelessDockingDialog::PageType  |  ( |   | ) |   const
protectedvirtual
Description: This defaults to custom_page. Override and return the system page you want to replace. Values of material_page and light_page are only meaningful if this page was added by a CRhinoRenderPlugIn and the plug-in is the current renderer.
◆ RunScript()
 virtual CRhinoCommand::result CRhinoObjectPropertiesModelessDockingDialog::RunScript  |  ( |  ON_SimpleArray< const CRhinoObject * > &  |  objects | )
protectedvirtual
◆ SelectedObjectCount()
 virtual int CRhinoObjectPropertiesModelessDockingDialog::SelectedObjectCount  |  ( |   | ) |   const
virtual
Access to selected objects list