Public Types | Public Member Functions | Public Attributes | Friends | List of all members
CRhinoHatchPatternTable Class Reference
Rhino
CRhinoHatchPatternTable class - A list of Hatch Pattern definitions. More...
#include <rhinoSdkHatchPattern.h>
 Inheritance diagram for CRhinoHatchPatternTable:
 Public Types
enum  | : unsigned int { DefaultHatchPatternCount = 9 }
 Public Member Functions
CRhinoHatchPatternTable (CRhinoDoc &)
~CRhinoHatchPatternTable ()
const ON_ComponentManifestItem &  | AddHatchPattern (bool bReference)
const ON_ComponentManifestItem &  | AddHatchPattern (const ON_HatchPattern &pattern, bool bReference, int *pIdx=NULL)
const ON_ComponentManifestItem &  | CreateHatchPattern (const ON_HatchPattern &hatch_pattern, unsigned int worksession_ref_model_sn, unsigned int linked_idef_sn)
const CRhinoHatchPattern &  | CurrentHatchPattern () const
const class CRhinoHatchPattern &  | DefaultHatchPattern () const
const class CRhinoHatchPattern *  | DefaultHatchPattern (const ON_ComponentManifestItem &hatch_pattern_manifest_item) const
const class CRhinoHatchPattern *  | DefaultHatchPatternFromId (ON_UUID hatch_pattern_id) const
bool  | DeleteHatchPattern (const ON_ComponentManifestItem &item, bool bQuiet)
bool  | DeleteHatchPattern (int pattern_index, bool bQuiet)
bool  | DeleteHatchPatterns (int pattern_index_count, const int *pattern_index, bool bQuiet)
CRhinoDoc &  | Document () const
void  | DrawPattern (const ON_HatchPattern &pattern, HDC pDC, const ON_4iRect &rect, double angle, COLORREF bkColor=RGB(255, 255, 255), COLORREF fgColor=RGB(0, 0, 0)) const
void  | DrawPattern (int pattern_index, CRhinoDib &, const ON_4iRect &rect, double angle, COLORREF bkColor=RGB(255, 255, 255), COLORREF fgColor=RGB(0, 0, 0)) const
int  | FindHatchPattern (const wchar_t *name, bool bIgnoreDeleted=true) const
unsigned int  | GetDefaultHatchPatterns (ON_SimpleArray< const CRhinoHatchPattern * > &default_hatch_pattern_list) const
unsigned int  | GetDefaultHatchPatterns (size_t default_hatch_pattern_list_capacity, const CRhinoHatchPattern **default_hatch_pattern_list) const
void  | GetSortedList (ON_SimpleArray< const CRhinoHatchPattern * > &sorted_list, bool bIgnoreDeleted, bool bIgnoreReference) const
void  | GetSortedList (ON_SimpleArray< const CRhinoHatchPattern * > &sorted_list, bool bIgnoreDeleted=false) const
void  | GetUnusedHatchPatternName (const wchar_t *root_name, ON_wString &unused_name) const
void  | GetUnusedHatchPatternName (ON_wString &unused_name) const
const CRhinoHatchPattern *  | HatchPattern (const ON_ComponentManifestItem &hatch_pattern_manifest_item) const
const CRhinoHatchPattern *  | HatchPattern (const ON_ComponentManifestItem &hatch_pattern_manifest_item, const CRhinoHatchPattern *not_found) const
int  | HatchPatternCount () const
const CRhinoHatchPattern *  | HatchPatternFromId (ON_UUID hatchpattern_id, bool bSearchDefaultHatchPatterns, bool bSearchDeletedHatchPatterns) const
const CRhinoHatchPattern *  | HatchPatternFromIndex (int hatchpattern_index, bool bSearchDefaultHatchPatterns, bool bSearchDeletedHatchPatterns) const
const CRhinoHatchPattern *  | HatchPatternFromName (const wchar_t *name, bool bSearchDefaultHatchPatterns) const
const ON_ComponentManifestItem &  | HatchPatternManifestItemFromId (ON_UUID hatchpattern_id, bool bSearchDefaultHatchPatterns, bool bSearchDeletedHatchPatterns) const
const ON_ComponentManifestItem &  | HatchPatternManifestItemFromIndex (int hatchpattern_index, bool bSearchDefaultHatchPatterns, bool bSearchDeletedHatchPatterns) const
const ON_ComponentManifestItem &  | HatchPatternManifestItemFromName (const wchar_t *name, bool bSearchDefaultHatchPatterns) const
bool  | InHatchPatternTable (const ON_HatchPattern *hatch_pattern) const
bool  | InUse (int hatch_pattern_index) const
bool  | IsBuiltinHatchPattern (const ON_HatchPattern *hatch_pattern) const
bool  | IsValidHatchPatternTableIndex (int hatch_pattern_index) const
void  | ListTable (ON_TextLog &text_log, unsigned int level_of_detail) const
bool  | ModifyHatchPattern (const ON_HatchPattern &pattern, const ON_ComponentManifestItem &item, bool bQuiet=false)
bool  | ModifyHatchPattern (const ON_HatchPattern &pattern, int pattern_index, bool bQuiet=false)
const CRhinoHatchPattern &  | operator[] (int pattern_index) const
bool  | SetCurrentHatchPattern (const ON_ComponentManifestItem &hatch_pattern_manifest_item, bool bQuiet=false)
bool  | SetCurrentHatchPatternIndex (int pattern_index, bool bQuiet=false)
void  | SetRemapIndex (int pattern_index, int remap_index)
void  | Sort (int(*compar)(const CRhinoHatchPattern *, const CRhinoHatchPattern *, void *), int(*cull)(const CRhinoHatchPattern *, void *), void *p)
const class CRhinoDocTableReference &  | TableReference () const
bool  | UndeleteHatchPattern (const ON_ComponentManifestItem &item)
bool  | UndeleteHatchPattern (int pattern_index)
bool  | UndoModifyHatchPattern (int hatchpattern_index, unsigned int ur_sn=0)
 Public Attributes
const CRhinoHatchPattern &  | Grid
index = -6, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Grid60
index = -7, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Hatch1
index = -2, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Hatch2
index = -3, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Hatch3
index = -4, id set, unique, and persistent More...
const CRhinoHatchPattern &  | HatchDash
index = -5, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Plus
index = -8, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Solid
index = -1, id set, unique, and persistent More...
const CRhinoHatchPattern &  | Squares
index = -9, id set, unique, and persistent More...
 Friends
class  | CRhinoDoc
Detailed Description
CRhinoHatchPatternTable class - A list of Hatch Pattern definitions.
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
DefaultHatchPatternCount
Constructor & Destructor Documentation
◆ CRhinoHatchPatternTable()
 CRhinoHatchPatternTable::CRhinoHatchPatternTable  |  ( |  CRhinoDoc &  |   | )
◆ ~CRhinoHatchPatternTable()
 CRhinoHatchPatternTable::~CRhinoHatchPatternTable  |  ( |   | )
Member Function Documentation
◆ AddHatchPattern() [1/2]
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::AddHatchPattern  |  ( |  bool  |  bReference | )
Description: Adds a new hatch pattern with default definition to the hatch pattern table.
Parameters: bReference - [in] true if this hatch pattern is a reference pattern. Reference hatch patterns are not saved in files.
Returns: index of new hatch pattern
Remarks: In some cases, calling AddHatchPattern() can cause the memory references previously returned by operator[] and CurrentHatchPattern() to become invalid.
◆ AddHatchPattern() [2/2]
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::AddHatchPattern  |  ( |  const ON_HatchPattern &  |  pattern,
|  bool  |  bReference,
|  int *  |  pIdx = NULL
)
Description: Adds a new hatch pattern with specified definition to the hatch pattern table.
Parameters: pattern - [in] definition of new hatch pattern. The information in pattern is copied. If pattern.Name() is empty the a unique name of the form "HatchPattern 01" will be automatically created.
bReference - [in] true if this layer is a reference hatch pattern. Reference hatch patterns are not saved in files.
pIdx - [out] May be NULL. If the hatch pattern is added, the index assigned it is returned here. If the pattern is not added because of a name collision, the index of the colliding record is returned here If the pattern was not added because of some other problem, ON_UNSET_INT_INDEX is returned.
Returns: @untitled table true hatch pattern was added false hatch pattern not added
◆ CreateHatchPattern()
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::CreateHatchPattern  |  ( |  const ON_HatchPattern &  |  hatch_pattern,
|  unsigned int  |  worksession_ref_model_sn,
|  unsigned int  |  linked_idef_sn
)
Description: Basic tool used to create a new hatch pattern with specified definition to the hatch pattern table. The AddHatchPattern() functions all use CreateLinetype() when a new linetype needs to be added to the linetype table.
Parameters: hatch_pattern - [in] definition of new hatch pattern.
 The information in hatch_pattern is copied.
 If hatch_pattern.HatchPatternName() is empty, then a unique name of the form "Hatch Pattern 01" will be automatically created.
worksession_ref_model_sn - [in] 0: hatch_pattern is not a reference layer 1: hatch_pattern is a reference linetype but not part of a worksession reference file 2-1000: reserved for future use >1000: worksession reference file serial number
linked_idef_sn - [in] 0: hatch_pattern is not from a liked instance definition 1-1000: reserved for future use >1000: instance definition serial number
Returns: @untitled table >=0 index of new hatch pattern -1 hatch pattern not added because a hatch pattern with that name already exists.
◆ CurrentHatchPattern()
 const CRhinoHatchPattern& CRhinoHatchPatternTable::CurrentHatchPattern  |  ( |   | ) |   const
Description: At all times, there is a "current" hatch pattern. Unless otherwise specified, new hatch objects are assigned the current hatch pattern. The current hatch pattern is never deleted.
Returns: Reference to the current hatch pattern. Note that this reference may become invalid after a call to AddHatchPattern().
◆ DefaultHatchPattern() [1/2]
 const class CRhinoHatchPattern& CRhinoHatchPatternTable::DefaultHatchPattern  |  ( |   | ) |   const
Description: Get the default hatch pattern to use when no identification is available.
◆ DefaultHatchPattern() [2/2]
 const class CRhinoHatchPattern* CRhinoHatchPatternTable::DefaultHatchPattern  |  ( |  const ON_ComponentManifestItem &  |  hatch_pattern_manifest_item | ) |   const
Description: Get the default hatch pattern identified by hatch_pattern_manifest_item. Parameters: hatch_pattern_manifest_item - [in] Returns: A pointer to the default hatch pattern with Id() = dimension_style_id or nullptr if hatch_pattern_id does not identify a default hatch pattern.
◆ DefaultHatchPatternFromId()
 const class CRhinoHatchPattern* CRhinoHatchPatternTable::DefaultHatchPatternFromId  |  ( |  ON_UUID  |  hatch_pattern_id | ) |   const
Description: Get the default hatch pattern identified by hatch_pattern_id. Parameters: hatch_pattern_id - [in] Returns: A pointer to the default hatch pattern with Id() = dimension_style_id or nullptr if hatch_pattern_id does not identify a default hatch pattern.
◆ DeleteHatchPattern() [1/2]
 bool CRhinoHatchPatternTable::DeleteHatchPattern  |  ( |  const ON_ComponentManifestItem &  |  item,
|  bool  |  bQuiet
)
◆ DeleteHatchPattern() [2/2]
 bool CRhinoHatchPatternTable::DeleteHatchPattern  |  ( |  int  |  pattern_index,
|  bool  |  bQuiet
)
Description: Deletes hatch pattern
Parameters: pattern_index - [in] zero based index of pattern to delete. This must be in the range 0 <= pattern_index < HatchPatternCount(). bQuiet - [in] If true, no warning message box appears if a layer the hatch pattern cannot be deleted because it is the current hatch pattern or it contains active geometry.
Returns: true if successful. false if pattern_index is out of range or the the hatch pattern cannot be deleted because it is the current hatch pattern or because it hatch pattern contains active geometry.
◆ DeleteHatchPatterns()
 bool CRhinoHatchPatternTable::DeleteHatchPatterns  |  ( |  int  |  pattern_index_count,
|  const int *  |  pattern_index,
|  bool  |  bQuiet
)
Description: Deletes multiple hatch patterns
Parameters: pattern_index_count - [in] length of pattern_index[] array. pattern_index - [in] array zero based indices of hatch patterns to delete. The indices must be in the range 0 <= pattern_index < HatchPatternCount(). bQuiet - [in] If true, no warning message box appears if a hatch pattern cannot be deleted because it is the current hatch pattern or it contains active geometry.
Returns: true if successful. false if pattern_index is out of range or the the hatch pattern cannot be deleted because it is the current pattern or because there is geometry referencing this hatch pattern.
◆ Document()
 CRhinoDoc& CRhinoHatchPatternTable::Document  |  ( |   | ) |   const
◆ DrawPattern() [1/2]
 void CRhinoHatchPatternTable::DrawPattern  |  ( |  const ON_HatchPattern &  |  pattern,
|  HDC  |  pDC,
|  const ON_4iRect &  |  rect,
|  double  |  angle,
|  COLORREF  |  bkColor = RGB(255, 255, 255),
|  COLORREF  |  fgColor = RGB(0, 0, 0)
) |   |  const
Description: Draw hatch pattern to a display context. Use this function to create preview images of hatch patterns. Parameters: pattern [in] - The hatch pattern to draw. hdc [in] - The display context to draw into rect [in] - The size of hatch pattern rectangle to draw. angle [in] - The rotation angle of the pattern display in radians. bkColor [in] - The background color. fgColor [in] - The foreground color.
◆ DrawPattern() [2/2]
 void CRhinoHatchPatternTable::DrawPattern  |  ( |  int  |  pattern_index,
|  CRhinoDib &  |  ,
|  const ON_4iRect &  |  rect,
|  double  |  angle,
|  COLORREF  |  bkColor = RGB(255, 255, 255),
|  COLORREF  |  fgColor = RGB(0, 0, 0)
) |   |  const
Description: Draw hatch pattern to a display context. Use this function to create preview images of hatch patterns. Parameters: pattern_index [in] - Index of the hatch pattern, in this table, to draw. hdc [in] - The display context to draw into rect [in] - The size of hatch pattern rectangle to draw. angle [in] - The rotation angle of the pattern display in radians. bkColor [in] - The background color. fgColor [in] - The foreground color.
◆ FindHatchPattern()
 int CRhinoHatchPatternTable::FindHatchPattern  |  ( |  const wchar_t *  |  name,
|  bool  |  bIgnoreDeleted = true
) |   |  const
Description: Finds the hatch pattern with a given name. Parameters: name - [in] name of hatch pattern to search for. The search ignores case. bIgnoreDeletedStyles - [in] parameter is unused. Returns: index = index of the hatch pattern with the given name. -(DefaultHatchPatternCount + 1) : no hatch pattern has the given name.
Deprecated:
use CRhinoHatchPatternTable::HatchPatternFromName()
◆ GetDefaultHatchPatterns() [1/2]
 unsigned int CRhinoHatchPatternTable::GetDefaultHatchPatterns  |  ( |  ON_SimpleArray< const CRhinoHatchPattern * > &  |  default_hatch_pattern_list | ) |   const
Description: Get a list of the default hatch patterns Returns: Number of hatch patterns added to the list. Remarks: The hatch pattern table has CRhinoHatchPatternTable::DefaultHatchPatternCount default hatch patterns.
◆ GetDefaultHatchPatterns() [2/2]
 unsigned int CRhinoHatchPatternTable::GetDefaultHatchPatterns  |  ( |  size_t  |  default_hatch_pattern_list_capacity,
|  const CRhinoHatchPattern **  |  default_hatch_pattern_list
) |   |  const
Description: Get a list of the default hatch patterns. Parameters: default_hatch_pattern_list_capacity - [in] Capacity of the default_hatch_pattern_list[] array. default_hatch_pattern_list - [out] List of default hatch patterns. Returns: Number of hatch patterns added to the list. Remarks: The hatch pattern table has CRhinoHatchPatternTable::DefaultHatchPatternCount default hatch patterns.
◆ GetSortedList() [1/2]
 void CRhinoHatchPatternTable::GetSortedList  |  ( |  ON_SimpleArray< const CRhinoHatchPattern * > &  |  sorted_list,
|  bool  |  bIgnoreDeleted,
|  bool  |  bIgnoreReference
) |   |  const
◆ GetSortedList() [2/2]
 void CRhinoHatchPatternTable::GetSortedList  |  ( |  ON_SimpleArray< const CRhinoHatchPattern * > &  |  sorted_list,
|  bool  |  bIgnoreDeleted = false
) |   |  const
Description: Gets an array of pointers to hatch patterns that is sorted by the values of CRhinoHatchPattern::m_sort_index.
Parameters: sorted_list - [out] this array is returned with length HatchPatternCount() and is sorted by the values of CRhinoLayer::m_sort_index. bIgnoreDeleted - [in] true means don't include deleted hatch patterns.
Remarks: Use Sort() to set the values of m_sort_index.
◆ GetUnusedHatchPatternName() [1/2]
 void CRhinoHatchPatternTable::GetUnusedHatchPatternName  |  ( |  const wchar_t *  |  root_name,
|  ON_wString &  |  unused_name
) |   |  const
◆ GetUnusedHatchPatternName() [2/2]
 void CRhinoHatchPatternTable::GetUnusedHatchPatternName  |  ( |  ON_wString &  |  unused_name | ) |   const
Description: Gets unsed layer name used as default when creating new layers
Parameters: result - [out] this is the wString which receives new name
◆ HatchPattern() [1/2]
 const CRhinoHatchPattern* CRhinoHatchPatternTable::HatchPattern  |  ( |  const ON_ComponentManifestItem &  |  hatch_pattern_manifest_item | ) |   const
◆ HatchPattern() [2/2]
 const CRhinoHatchPattern* CRhinoHatchPatternTable::HatchPattern  |  ( |  const ON_ComponentManifestItem &  |  hatch_pattern_manifest_item,
|  const CRhinoHatchPattern *  |  not_found
) |   |  const
◆ HatchPatternCount()
 int CRhinoHatchPatternTable::HatchPatternCount  |  ( |   | ) |   const
Returns: Number of patterns in the hatch pattern table, including deleted patterns.
Remarks: This count also spans slots emptied by a purge, so it can be larger than the number of hatch patterns that are actually there. See the PURGED TABLE SLOTS note in rhinoSdkDoc.h.
◆ HatchPatternFromId()
 const CRhinoHatchPattern* CRhinoHatchPatternTable::HatchPatternFromId  |  ( |  ON_UUID  |  hatchpattern_id,
|  bool  |  bSearchDefaultHatchPatterns,
|  bool  |  bSearchDeletedHatchPatterns
) |   |  const
◆ HatchPatternFromIndex()
 const CRhinoHatchPattern* CRhinoHatchPatternTable::HatchPatternFromIndex  |  ( |  int  |  hatchpattern_index,
|  bool  |  bSearchDefaultHatchPatterns,
|  bool  |  bSearchDeletedHatchPatterns
) |   |  const
◆ HatchPatternFromName()
 const CRhinoHatchPattern* CRhinoHatchPatternTable::HatchPatternFromName  |  ( |  const wchar_t *  |  name,
|  bool  |  bSearchDefaultHatchPatterns
) |   |  const
◆ HatchPatternManifestItemFromId()
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::HatchPatternManifestItemFromId  |  ( |  ON_UUID  |  hatchpattern_id,
|  bool  |  bSearchDefaultHatchPatterns,
|  bool  |  bSearchDeletedHatchPatterns
) |   |  const
◆ HatchPatternManifestItemFromIndex()
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::HatchPatternManifestItemFromIndex  |  ( |  int  |  hatchpattern_index,
|  bool  |  bSearchDefaultHatchPatterns,
|  bool  |  bSearchDeletedHatchPatterns
) |   |  const
◆ HatchPatternManifestItemFromName()
 const ON_ComponentManifestItem& CRhinoHatchPatternTable::HatchPatternManifestItemFromName  |  ( |  const wchar_t *  |  name,
|  bool  |  bSearchDefaultHatchPatterns
) |   |  const
Description: Finds the hatch pattern with a given name.
Parameters: name - [in]
 bSearchDefaultHatchPatterns - [in] Returns: id of hatch pattern or ON_nil_uuid if no hatch pattern has the name
◆ InHatchPatternTable()
 bool CRhinoHatchPatternTable::InHatchPatternTable  |  ( |  const ON_HatchPattern *  |  hatch_pattern | ) |   const
Returns: true The hatch_pattern is an element in this hatch pattern table.
◆ InUse()
 bool CRhinoHatchPatternTable::InUse  |  ( |  int  |  hatch_pattern_index | ) |   const
Description: Returns true if a hatch pattern is use by an object, layer, or instance definition. Parameters: hatch_pattern_index - [in] index of hatch pattern to query. Returns: true if successful.
◆ IsBuiltinHatchPattern()
 bool CRhinoHatchPatternTable::IsBuiltinHatchPattern  |  ( |  const ON_HatchPattern *  |  hatch_pattern | ) |   const
Returns: true The hatch_pattern is a default hatch pattern.
◆ IsValidHatchPatternTableIndex()
 bool CRhinoHatchPatternTable::IsValidHatchPatternTableIndex  |  ( |  int  |  hatch_pattern_index | ) |   const
Returns: true The hatch_pattern_index is a valid index of a hatch pattern element in this hatch pattern table.
◆ ListTable()
 void CRhinoHatchPatternTable::ListTable  |  ( |  ON_TextLog &  |  text_log,
|  unsigned int  |  level_of_detail
) |   |  const
◆ ModifyHatchPattern() [1/2]
 bool CRhinoHatchPatternTable::ModifyHatchPattern  |  ( |  const ON_HatchPattern &  |  pattern,
|  const ON_ComponentManifestItem &  |  item,
|  bool  |  bQuiet = false
)
◆ ModifyHatchPattern() [2/2]
 bool CRhinoHatchPatternTable::ModifyHatchPattern  |  ( |  const ON_HatchPattern &  |  pattern,
|  int  |  pattern_index,
|  bool  |  bQuiet = false
)
Description: Modify hatch pattern settings
Parameters: pattern - [in] new definition. This information is copied. pattern_index - [in] zero based index of pattern to set. This must be in the range 0 <= pattern_index < HatchPatternCount(). bQuiet - [in] if true, information message boxes pop up when illegal changes are attempted.
Returns: true if successful. false if pattern_index is out of range.
◆ operator[]()
 const CRhinoHatchPattern& CRhinoHatchPatternTable::operator[]  |  ( |  int  |  pattern_index | ) |   const
Description: Conceptually, the hatch pattern table is an array of PatternCount() hatch patterns. The operator[] can be used to get individual hatch patterns. A hatch pattern is either active or deleted and this state is reported by CRhinoHatchPattern::IsDeleted().
Parameters: pattern_index - zero based array index
Returns: Reference to the pattern. If pattern_index is out of range, the current pattern is returned. Note that this reference may become invalid after AddHatchPattern() is called.
Remarks: The default hatch pattern is returned for an in-range index whose slot was emptied by a purge, which happens when a worksession reference model is detached or a linked instance definition is purged. This is required rather than merely tolerated: worksession references and linked idefs to non-3dm files depend on this function always returning a usable pattern and the same answer every time.
To tell a real pattern from an emptied slot, test the index you asked for against the index you got back: the stand-in has a negative index, so i != table[i].Index() means slot i is empty. See the PURGED TABLE SLOTS note in rhinoSdkDoc.h.
◆ SetCurrentHatchPattern()
 bool CRhinoHatchPatternTable::SetCurrentHatchPattern  |  ( |  const ON_ComponentManifestItem &  |  hatch_pattern_manifest_item,
|  bool  |  bQuiet = false
)
◆ SetCurrentHatchPatternIndex()
 bool CRhinoHatchPatternTable::SetCurrentHatchPatternIndex  |  ( |  int  |  pattern_index,
|  bool  |  bQuiet = false
)
Description: At all times, there is a "current" hatch pattern. Unless otherwise specified, new hatch objects are assigned to the current hatch pattern. The current hatch pattern is never deleted.
Parameters: pattern_index - [in] value for new current hatch pattern. 0 <= pattern_index < HatchPatternCount(). bQuiet - [in] if true, then no warning message box pops up if the current pattern request can't be satisfied. Returns: true if current hatch pattern index successfully set.
◆ SetRemapIndex()
 void CRhinoHatchPatternTable::SetRemapIndex  |  ( |  int  |  pattern_index,
|  int  |  remap_index
)
◆ Sort()
 void CRhinoHatchPatternTable::Sort  |  ( |  int(*)(const CRhinoHatchPattern *, const CRhinoHatchPattern *, void *)  |  compar,
|  int(*)(const CRhinoHatchPattern *, void *)  |  cull,
|  void *  |  p
)
Description: Use this to set CRhinoHatchPattern::m_sort_index so that the values of m_sort_index run from 0 to HatchPatternCount()-1 and compare(HatchPattern_table[i],HatchPattern_table[j]) < 0 ) implies HatchPattern_table[i].m_sort_index < HatchPattern_table[j].m_sort_index.
Parameters: compare - [in] compare function with prototype int compare(const CRhinoHatchPattern* arg1,const CRhinoHatchPattern* arg2,void* p). that returns <0 if arg1<arg2, 0 if arg1=arg2, and >0 if arg1>arg2. cull - [in] optional filter function with prototype bool cull(const CRhinoHatchPattern* arg,void* p). that returns true if the hatch pattern should be ignored when sorting. Hatch patterns that are ignored are not included in the list returned by GetSortedList(). Pass 0 if you do not need to cull layers p - [in] pointer passed as last argument to compare() and cull().
Remarks: After calling Sort(), you can repeatedly call GetSortedList() to get a sorted list of CRhinoHatchPattern pointers. Sort() and GetSortedList() do not modify the order or persistent information in the layer table. They are intended to be used to get sorted lists of hatch patterns for dialogs, etc.
◆ TableReference()
 const class CRhinoDocTableReference& CRhinoHatchPatternTable::TableReference  |  ( |   | ) |   const
◆ UndeleteHatchPattern() [1/2]
 bool CRhinoHatchPatternTable::UndeleteHatchPattern  |  ( |  const ON_ComponentManifestItem &  |  item | )
◆ UndeleteHatchPattern() [2/2]
 bool CRhinoHatchPatternTable::UndeleteHatchPattern  |  ( |  int  |  pattern_index | )
Description: Undeletes a hatch pattern that has been deleted by DeleteHatchPattern().
Parameters: pattern_index - [in] zero based index of tyle to undelete. This must be in the range 0 <= pattern_index < HatchPatternCount().
Returns: true if successful.
◆ UndoModifyHatchPattern()
 bool CRhinoHatchPatternTable::UndoModifyHatchPattern  |  ( |  int  |  hatchpattern_index,
|  unsigned int  |  ur_sn = 0
)
Description: If the hatch pattern has been modified and the modification can be undone, then UndoModifyHatchPattern() will restore the hatch pattern to its previous state.
Returns: True if the hatch pattern had been modified and the modifications were undone.
See Also: CRhinoHatchPattern::IsModified.
Friends And Related Function Documentation
◆ CRhinoDoc
 friend class CRhinoDoc
friend
Member Data Documentation
◆ Grid
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Grid
index = -6, id set, unique, and persistent
◆ Grid60
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Grid60
index = -7, id set, unique, and persistent
◆ Hatch1
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Hatch1
index = -2, id set, unique, and persistent
◆ Hatch2
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Hatch2
index = -3, id set, unique, and persistent
◆ Hatch3
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Hatch3
index = -4, id set, unique, and persistent
◆ HatchDash
 const CRhinoHatchPattern& CRhinoHatchPatternTable::HatchDash
index = -5, id set, unique, and persistent
◆ Plus
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Plus
index = -8, id set, unique, and persistent
◆ Solid
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Solid
index = -1, id set, unique, and persistent
Built-in hatch patterns. Localized names, id set, unique, and persistent
◆ Squares
 const CRhinoHatchPattern& CRhinoHatchPatternTable::Squares
index = -9, id set, unique, and persistent