Public Member Functions | List of all members
CRhinoUiOptionsListCtrlFontComboBox Class Reference
RhinoUI
#include <RhinoSdkUiOptionsListCtrlItem.h>
 Inheritance diagram for CRhinoUiOptionsListCtrlFontComboBox:
 Public Member Functions
CRhinoUiOptionsListCtrlFontComboBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlFontComboBox ()
bool  | GetLogfont (LOGFONT &lf) const
void  | OnDrawItem (CDC &dc, const CRect &rItem, const CRect &rDeflate) const
void  | OnItemComboBoxSelChanged ()
bool  | PopulateComboBox ()
bool  | SetLogfont (const LOGFONT &lf)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlComboBox
CRhinoUiOptionsListCtrlComboBox (LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0, CRhinoUiComboBoxItemData::class_type ct=CRhinoUiComboBoxItemData::ct_strings)
virtual  | ~CRhinoUiOptionsListCtrlComboBox ()
virtual bool  | BeginEditItem (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit, begin_edit_item_reason eir)
bool  | DrawDownArrow () const
virtual void  | MeasureItem (LPMEASUREITEMSTRUCT)
void  | MoveItemWindow (CRhinoUiOptionsListCtrl &list_ctrl, const CRect rEdit)
virtual bool  | OnComboBoxPopulated ()
virtual void  | OnDrawDownArrow (CDC &dc, CRect &rItem, const CRect &rDeflate) const
afx_msg BOOL32  | OnMouseWheel (UINT nFlags, short zDelta, CPoint pt)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
virtual overrides More...
bool  | SetDrawDownArrow (bool b)
bool  | SetShowDropDownOnBeginEdit (bool b)
void  | SetText (LPCTSTR lps)
bool  | ShowDropDownOnBeginEdit () const
 Public Member Functions inherited from CRhinoUiComboBox
CRhinoUiComboBox ()
virtual  | ~CRhinoUiComboBox ()
int  | AddColorItem (LPCTSTR lpsColorName, COLORREF color, bool link_to_color_dialog=false)
int  | AddFontItem (const LOGFONT &lf)
int  | AddLayer (const CRhinoLayer &layer)
int  | AddLinetype (const ON_Linetype &linetype)
int  | AddPrintWidthItem (double cx)
COLORREF  | ColorFromListIndex (int iIndex, COLORREF crError=CRhinoUiPaintManager::error_color) const
bool  | ColorIsByLayer (COLORREF cr) const
bool  | ColorIsByParent (COLORREF cr) const
ON_wString  | ColorNameFromColorRef (COLORREF cr)
color_swatch_draw_style  | ColorSwatchDrawStyle () const
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
bool  | CreateAsOwnerDraw () const
virtual void  | DeleteItem (LPDELETEITEMSTRUCT)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
int  | FillLayerList (CRhinoDoc *doc, bool bUseSortedList, int(*compare)(const CRhinoLayer *, const CRhinoLayer *, void *)=NULL, int(*cull)(const CRhinoLayer *, void *)=NULL, void *p=0)
int  | FillLinetypeList (CRhinoDoc *doc, bool bUseSortedList, bool bIncludeByLayer, bool bIncludeByParent, bool bReadDefaultLinetypeFile, int(*compare)(const CRhinoLinetype *, const CRhinoLinetype *, void *)=NULL, int(*cull)(const CRhinoLinetype *, void *)=NULL, void *p=NULL)
int  | FillUsingInstalledFonts (bool bIncludeTrueType=true, bool bIncludeNonTrueType=true)
int  | FillUsingStandardColorList (bool bIncludeByLayerColor=true, bool bIncludeCustomColor=true, bool bIncludeByParentColor=true, bool bIncludeByDisplayColor=false)
int  | FillUsingStandardPrintWidths (bool bIncludeByLayer, bool bIncludeDefault, bool bIncludeByParent, bool bIncludeNoPrint, bool bIncludeHairline)
CRhinoUiComboBoxItemData *  | GetComboBoxItemData (int iIndex) const
COLORREF  | GetCurColor () const
int  | GetCurColor (COLORREF &color) const
int  | GetCurFont (LOGFONT &lf_out)
const RhinoUiLayerComboBoxItemData *  | GetCurLayer () const
const RhinoUiLinetypeComboBoxItemData *  | GetCurLinetype () const
const RhinoUiPrintWidthComboBoxItemData *  | GetCurPrintWidth () const
int  | GetFontIndex (const LOGFONT &lf)
int  | GetFontIndex (LPCTSTR lpsFontFace)
bool  | GetTextFromListIndex (int iIndex, CString &sResult) const
class CRhinoUiPopDownLayerWnd *  | LayerPopDownWindow () const
UUID  | LayerUUIDFromListIndex (int iIndex) const
RhinoUiLinetypeComboBoxItemData *  | LinetypeDataFromListIndex (int iIndex) const
const ON_Linetype *  | LinetypeReadFromFile (const UUID &uuiid) const
UUID  | LinetypeUUIDFromListIndex (int iIndex) const
int  | ListIndexFromLayerUUID (const UUID &uuid) const
int  | ListIndexFromLinetypeUUID (const UUID &uuid) const
int  | ListIndexFromPrintWidth (double cx) const
virtual CRhinoUiComboBoxItemData *  | NewCRhinoUiComboBoxItemData (CRhinoUiComboBoxItemData::class_type ct) const
afx_msg void  | OnCbnDropDown ()
afx_msg void  | OnCbnSelchange ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
virtual void  | OnCustomColorChanged (COLORREF cr, int iItemIndex)
afx_msg void  | OnDestroy ()
afx_msg void  | OnEditKillFocus ()
afx_msg void  | OnEditUpdate ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
void  | OnPrintWidthEditKillFocus ()
void  | OnPrintWidthEditUpdate ()
RhinoUiPrintWidthComboBoxItemData *  | PrintWidthDataFromListIndex (int iIndex) const
double  | PrintWidthFromString ()
color_swatch_draw_style  | SetColorSwatchDrawStyle (color_swatch_draw_style style)
bool  | SetCreateAsOwnerDraw (bool b)
COLORREF  | SetCurColor (COLORREF cr)
int  | SetCurFont (const LOGFONT &lf)
int  | SetCurFont (LPCTSTR lpsFontFace)
UUID  | SetCurLayer (UUID uuid, COLORREF cr)
UUID  | SetCurLinetype (UUID uuid)
double  | SetCurPrintWidth (double cx)
bool  | SetCustomColor (COLORREF cr)
 Public Member Functions inherited from CRhinoUiOptionsListCtrlItem
CRhinoUiOptionsListCtrlItem (const CRhinoUiOptionsListCtrlItem &)
CRhinoUiOptionsListCtrlItem (control_type ct=ct_invalid, LPCTSTR lpsLabel=NULL, LPCTSTR lpsText=NULL, int iIndentLevel=0)
virtual  | ~CRhinoUiOptionsListCtrlItem ()
bool  | AutoDelete () const
control_type  | ControlType () const
void  | DrawItemText (CDC &dc, const CString &s, const CRect &rItem, const CRect &rDeflate) const
bool  | GetItemProperty (item_property iprop) const
bool  | GetItemState (item_state istate) const
CRhinoUiOptionsListCtrl *  | GetListCtrl () const
int  | IndentLevel () const
bool  | IsEnabled () const
bool  | IsFullRowItem () const
bool  | IsItemExpandable () const
bool  | IsItemHidden () const
bool  | IsReadOnly () const
virtual int  | ItemHeight () const
unsigned int  | ItemID () const
LPCTSTR  | Label () const
COLORREF  | LabelBackGroundColor () const
COLORREF  | LabelTextColor () const
const CRhinoUiOptionsListCtrlItem &  | operator= (const CRhinoUiOptionsListCtrlItem &)
int  | ParentIndex () const
bool  | SetAutoDelete (bool b)
int  | SetIndentLevel (int iIndentLevel)
bool  | SetIsEnabled (bool b)
bool  | SetIsFullRowItem (bool b)
bool  | SetIsReadOnly (bool b)
bool  | SetItemProperty (item_property iprop, bool bEnabled)
bool  | SetItemState (item_state istate, bool bEnabled)
bool  | SetLabel (LPCTSTR lpsLabel)
COLORREF  | SetLabelBackGroundColor (COLORREF cr)
COLORREF  | SetLabelTextColor (COLORREF cr)
bool  | SetParentIndex (int iItem)
bool  | SetUseLabelColors (bool b)
virtual LPCTSTR  | Text () const
bool  | UseLabelColors () const
 Additional Inherited Members
 Public Types inherited from CRhinoUiComboBox
enum  | color_swatch_draw_style { square_swatch = 0, diamond_swatch, circle_swatch, force_32bit_image_list = 0xFFFFFFFF }
enum  | print_width_options {
 default_width = 0, no_print_width = - 1, by_layer_width = -10, by_parent_width = -15,
 list_box_error_width = -100, force_32bit_plot_width_option = 0xFFFFFFFF
 }
 Public Types inherited from CRhinoUiOptionsListCtrlItem
enum  | control_type {
 ct_static_text = 0, ct_edit_box, ct_check_box, ct_combo_box,
 ct_push_button, ct_ip_address, ct_radio_buttons, ct_color_combo_box,
 ct_color_button, ct_file, ct_font_combo, ct_layer_combo_box,
 ct_linetype_combo_box, ct_print_width_combo_box, ct_separator, ct_folder,
 ct_hyperlink, ct_custom_control, ct_invalid, force_32bit_control_type = 0xFFFFFFFF
 }
enum  | item_property {
 full_row_item_property = 1, use_label_colors_property = 2, is_group_combo_item_property = 4, property0 = 8,
 property1 = 0x10, property2 = 0x20, property3 = 0x40, property4 = 0x80,
 property5 = 0x100, property6 = 0x200, property7 = 0x400, property8 = 0x800,
 property9 = 0x1000, force_32bit_item_property = 0xFFFFFFFF
 }
enum  | item_state {
 expanded_state = 1, hidden_state = 2, enabled_state = 4, readonly_state = 8,
 hidden_group_state = 0x10, state0 = 0x20, state1 = 0x40, state2 = 0x80,
 state3 = 0x100, state4 = 0x200, state5 = 0x400, state6 = 0x800,
 state7 = 0x1000, state8 = 0x2000, state9 = 0x4000, force_32bit_item_state = 0xFFFFFFFF
 }
 Static Public Member Functions inherited from CRhinoUiComboBox
static UUID  | ByLayerLinetypeID ()
static UUID  | ByParentLinetypeID ()
static UUID  | ContinuousLinetypeID ()
static bool  | GetPrintWidthDisplayString (double cx, ON_wString &result)
static UUID  | ListBoxErrorUUID ()
static bool  | ReadPrintWidthFile (const wchar_t *lpsFileName, ON_SimpleArray< double > &widths, bool bQuietly)
 Protected Types inherited from CRhinoUiComboBox
enum  | change_mode { cm_selchange = 0, cm_editupdate, cm_nochange, force_32bit_change_mode = 0xFFFFFFFF }
 Protected Types inherited from CRhinoUiOptionsListCtrlItem
enum  | begin_edit_item_reason {
 eir_label_left_clicked = 0, eir_value_left_clicked, eir_f2_pressed, eir_navigation_key,
 force_32bit_begin_edit_item_reason = 0xFFFFFFFF
 }
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlComboBox
afx_msg void  | OnCbnSelchange ()
afx_msg void  | OnEditKillFocus ()
afx_msg void  | OnKillFocus (CWnd *pNewWnd)
void  | ShowLayerPopDownWnd (HWND hWnd, bool bShow)
CRhinoUiOptionsListCtrlComboBox. More...
 Protected Member Functions inherited from CRhinoUiComboBox
virtual LRESULT  | DefWindowProc (UINT message, WPARAM wParam, LPARAM lParam)
void  | DestroyLayerPopDownWnd ()
virtual BOOL32  | OnChildNotify (UINT message, WPARAM wParam, LPARAM lParam, LRESULT *pResult)
virtual BOOL32  | OnWndMsg (UINT message, WPARAM wParam, LPARAM lParam, LRESULT *pResult)
virtual void  | PostNcDestroy ()
virtual void  | PreSubclassWindow ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Member Functions inherited from CRhinoUiOptionsListCtrlItem
bool  | ForwardOnMouseWheel (CWnd &wnd, UINT nFlags, short zDelta, CPoint pt)
bool  | SetControlType (control_type ct)
 Protected Attributes inherited from CRhinoUiOptionsListCtrlComboBox
bool  | m_bDrawDownArrow
bool  | m_bIncludeEditCtrl
bool  | m_bOwnerDraw
bool  | m_bShowDropDownOnBeginEdit
bool  | m_bShowingDropDown
bool  | m_bSort
 Protected Attributes inherited from CRhinoUiComboBox
bool  | m_bIncludeNonTrueType
bool  | m_bIncludeTrueType
bool  | m_bInOnPrintWidthEditKillFocus
bool  | m_bShowReferenceLayers
change_mode  | m_change_mode
COLORREF  | m_crCustom
RhinoUiColorComboBoxItemData  | m_current_color
CRhinoUiComboBoxItemData m_current;. More...
RhinoUiFontComboBoxItemData  | m_current_font
RhinoUiLayerComboBoxItemData  | m_current_layer
RhinoUiLinetypeComboBoxItemData  | m_current_linetype
RhinoUiPrintWidthComboBoxItemData  | m_current_print_width
CRhinoUiComboBoxItemData::class_type  | m_fill_class_type
ON_ObjectArray< ON_Linetype >  | m_from_file_linetypes
class CRhinoUiPopDownLayerWnd *  | m_pWndLayerPopDown
color_swatch_draw_style  | m_swatch_style
 Protected Attributes inherited from CRhinoUiOptionsListCtrlItem
CPoint  | m_ptEndTrackSelect
Detailed Description
CRhinoUiOptionsListCtrlFontComboBox
Display a combo box containing a list of currently installed fonts. This list may be filtered to only display TrueType and/or non-TrueType fonts. See CRhinoUiComboBox for details.
See Also: class CRhinoUiComboBox() class CRhinoUiOptionsListCtrlComboBox()
Constructor & Destructor Documentation
◆ CRhinoUiOptionsListCtrlFontComboBox()
 CRhinoUiOptionsListCtrlFontComboBox::CRhinoUiOptionsListCtrlFontComboBox  |  ( |  LPCTSTR  |  lpsLabel = NULL,
|  LPCTSTR  |  lpsText = NULL,
|  int  |  iIndentLevel = 0
)
Description: Constructor
Parameters: lpsLabel [in] Label for this item, appears in left column of options list lpsText [in] Text associated with this item, appears in right column of options list
See Also: class CRhinoUiComboBox() class CRhinoUiOptionsListCtrlComboBox()
◆ ~CRhinoUiOptionsListCtrlFontComboBox()
 virtual CRhinoUiOptionsListCtrlFontComboBox::~CRhinoUiOptionsListCtrlFontComboBox  |  ( |   | )
virtual
Description: Destructor
See Also: class CRhinoUiComboBox() class CRhinoUiOptionsListCtrlComboBox()
Member Function Documentation
◆ GetLogfont()
 bool CRhinoUiOptionsListCtrlFontComboBox::GetLogfont  |  ( |  LOGFONT &  |  lf | ) |   const
Description: Get description of the last selected font.
Parameters: lf[out] LOGFONT structure to receive font information.
Returns: Returns true if lf is filled in.
See Also: CRhinoUiOptionsListCtrlFontComboBox::SetLogFont() CRhinoUiOptionsListCtrlFontComboBox::OnItemComboBoxSelChanged()
◆ OnDrawItem()
 void CRhinoUiOptionsListCtrlFontComboBox::OnDrawItem  |  ( |  CDC &  |  dc,
|  const CRect &  |  rItem,
|  const CRect &  |  rDeflate
) |   |  const
virtual
Description: CRhinoUiOptionsListCtrlComboBox override to display font name and sample.
Parameters: See CRhinoUiOptionsListCtrlItem::OnDrawItem()
See Also: CRhinoUiOptionsListCtrlItem::OnDrawItem()
Reimplemented from CRhinoUiOptionsListCtrlComboBox.
◆ OnItemComboBoxSelChanged()
 void CRhinoUiOptionsListCtrlFontComboBox::OnItemComboBoxSelChanged  |  ( |   | )
virtual
Description: CRhinoUiOptionsListCtrlComboBox override, calls base class.
Overridden to save currently selected LOGFONT
See Also: CRhinoUiOptionsListCtrlComboBox::OnItemComboBoxSelChanged()
Reimplemented from CRhinoUiOptionsListCtrlComboBox.
◆ PopulateComboBox()
 bool CRhinoUiOptionsListCtrlFontComboBox::PopulateComboBox  |  ( |   | )
virtual
Description: CRhinoUiOptionsListCtrlComboBox override
Overridden to fill combo box with list of fonts installed on this computer.
Returns: See CRhinoUiOptionsListCtrlComboBox::PopulateComboBox()
See Also: CRhinoUiOptionsListCtrlComboBox::PopulateComboBox() CRhinoUiComboBox::FillUsingInstalledFonts()
Reimplemented from CRhinoUiOptionsListCtrlComboBox.
◆ SetLogfont()
 bool CRhinoUiOptionsListCtrlFontComboBox::SetLogfont  |  ( |  const LOGFONT &  |  lf | )
Description: Set default font description. This will be displayed when the item is not selected and become the default value for the font combo box the first time is displayed.
Parameters: lf[in] Description of default font
Returns: Returns true if font descriptions was successfully saved.
See Also: CRhinoUiOptionsListCtrlFontComboBox::GetLogFont() CRhinoUiOptionsListCtrlFontComboBox::OnItemComboBoxSelChanged()