Public Attributes | Static Public Attributes | List of all members
ON_DepthImageTriangle Class Reference
OpenNURBS
#include <opennurbs_plus_idimage.h>
 Public Attributes
const class ON_DepthImage *  | m_image
unsigned int  | m_triangle_index
const class ON_DepthImageTriangleMesh *  | m_triangle_mesh
unsigned int  | m_triangle_status
ON_DepthImageTriangleMesh.m_triangle_status value. More...
 Static Public Attributes
static const ON_DepthImageTriangle  | Unset
Detailed Description
Description: ON_DepthImageTriangle is used to pass image triangle information to ON_DepthImage shaders.
Member Data Documentation
◆ m_image
 const class ON_DepthImage* ON_DepthImageTriangle::m_image
◆ m_triangle_index
 unsigned int ON_DepthImageTriangle::m_triangle_index
◆ m_triangle_mesh
 const class ON_DepthImageTriangleMesh* ON_DepthImageTriangle::m_triangle_mesh
◆ m_triangle_status
 unsigned int ON_DepthImageTriangle::m_triangle_status
ON_DepthImageTriangleMesh.m_triangle_status value.
◆ Unset
 const ON_DepthImageTriangle ON_DepthImageTriangle::Unset
static