Public Member Functions | Static Public Member Functions | Protected Member Functions | List of all members
CRhRdkTexture::IColorAdjuster Class Referenceabstract
#include <RhRdkTexture.h>
 Public Member Functions
virtual bool  | AdjustColor (CRhRdkColor &color) const =0
virtual void  | DeleteThis (void)=0
virtual bool  | On (void) const =0
virtual bool  | operator!= (const IColorAdjuster *ica) const
virtual bool  | operator== (const IColorAdjuster *) const =0
 Static Public Member Functions
static DWORD  | CRC (const IColorAdjuster &pca)
static RDK_DEPRECATED DWORD  | CRC (IColorAdjuster *pca)
 Protected Member Functions
virtual  | ~IColorAdjuster ()
Constructor & Destructor Documentation
◆ ~IColorAdjuster()
 virtual CRhRdkTexture::IColorAdjuster::~IColorAdjuster  |  ( |   | )
inlineprotectedvirtual
Member Function Documentation
◆ AdjustColor()
 virtual bool CRhRdkTexture::IColorAdjuster::AdjustColor  |  ( |  CRhRdkColor &  |  color | ) |   const
pure virtual
◆ CRC() [1/2]
 static DWORD CRhRdkTexture::IColorAdjuster::CRC  |  ( |  const IColorAdjuster &  |  pca | )
static
◆ CRC() [2/2]
 static RDK_DEPRECATED DWORD CRhRdkTexture::IColorAdjuster::CRC  |  ( |  IColorAdjuster *  |  pca | )
static
◆ DeleteThis()
 virtual void CRhRdkTexture::IColorAdjuster::DeleteThis  |  ( |  void  |   | )
pure virtual
◆ On()
 virtual bool CRhRdkTexture::IColorAdjuster::On  |  ( |  void  |   | ) |   const
pure virtual
◆ operator!=()
 virtual bool CRhRdkTexture::IColorAdjuster::operator!=  |  ( |  const IColorAdjuster *  |  ica | ) |   const
inlinevirtual
◆ operator==()
 virtual bool CRhRdkTexture::IColorAdjuster::operator==  |  ( |  const IColorAdjuster *  |   | ) |   const
pure virtual