Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoZebraAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoZebraAnalysisSettings ()
CRhinoZebraAnalysisSettings (const CRhinoZebraAnalysisSettings &other)
~CRhinoZebraAnalysisSettings ()
void  | Defaults ()
const CRhinoIsoDrawEffect &  | IsoDrawEffectSettings () const
void  | LoadProfile (CRhinoProfileContext &pc)
load from settings More...
bool  | operator!= (const CRhinoZebraAnalysisSettings &other) const
CRhinoZebraAnalysisSettings &  | operator= (const CRhinoZebraAnalysisSettings &other)
bool  | operator== (const CRhinoZebraAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save to settings More...
void  | SetIsoDrawEffectSettings (const CRhinoIsoDrawEffect &settings)
void  | SetUseIsoDrawEffectSettings (bool enable)
bool  | UseIsoDrawEffectSettings () const
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
BYTE  | m_show_isoparms
ON_Color  | m_stripe_color
BYTE  | m_stripe_direction
0 = horizontal, 1 = vertical More...
int  | m_stripe_thickness
0 = thinnest ... 6 = thickest More...
BYTE  | reserved [2]
 Static Public Attributes
static const CRhinoZebraAnalysisSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoZebraAnalysisSettings() [1/2]
 CRhinoZebraAnalysisSettings::CRhinoZebraAnalysisSettings  |  ( |   | )
◆ ~CRhinoZebraAnalysisSettings()
 CRhinoZebraAnalysisSettings::~CRhinoZebraAnalysisSettings  |  ( |   | )
◆ CRhinoZebraAnalysisSettings() [2/2]
 CRhinoZebraAnalysisSettings::CRhinoZebraAnalysisSettings  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | )
Member Function Documentation
◆ Defaults()
 void CRhinoZebraAnalysisSettings::Defaults  |  ( |   | )
◆ IsoDrawEffectSettings()
 const CRhinoIsoDrawEffect& CRhinoZebraAnalysisSettings::IsoDrawEffectSettings  |  ( |   | ) |   const
◆ LoadProfile()
 void CRhinoZebraAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from settings
◆ operator!=()
 bool CRhinoZebraAnalysisSettings::operator!=  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | ) |   const
◆ operator=()
 CRhinoZebraAnalysisSettings& CRhinoZebraAnalysisSettings::operator=  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | )
◆ operator==()
 bool CRhinoZebraAnalysisSettings::operator==  |  ( |  const CRhinoZebraAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoZebraAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoZebraAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save to settings
◆ SetIsoDrawEffectSettings()
 void CRhinoZebraAnalysisSettings::SetIsoDrawEffectSettings  |  ( |  const CRhinoIsoDrawEffect &  |  settings | )
◆ SetUseIsoDrawEffectSettings()
 void CRhinoZebraAnalysisSettings::SetUseIsoDrawEffectSettings  |  ( |  bool  |  enable | )
◆ UseIsoDrawEffectSettings()
 bool CRhinoZebraAnalysisSettings::UseIsoDrawEffectSettings  |  ( |   | ) |   const
◆ Validate()
 void CRhinoZebraAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoZebraAnalysisSettings CRhinoZebraAnalysisSettings::Default
static
◆ m_show_isoparms
 BYTE CRhinoZebraAnalysisSettings::m_show_isoparms
◆ m_stripe_color
 ON_Color CRhinoZebraAnalysisSettings::m_stripe_color
◆ m_stripe_direction
 BYTE CRhinoZebraAnalysisSettings::m_stripe_direction
0 = horizontal, 1 = vertical
◆ m_stripe_thickness
 int CRhinoZebraAnalysisSettings::m_stripe_thickness
0 = thinnest ... 6 = thickest
◆ reserved
 BYTE CRhinoZebraAnalysisSettings::reserved[2]