Public Types | Public Member Functions | Protected Member Functions | List of all members
CRhinoObjectColorComboBox Class Reference
Rhino
CRhinoObjectColorComboBox window. More...
#include <RhinoSdkObjectColorComboBox.h>
 Inheritance diagram for CRhinoObjectColorComboBox:
 Public Types
enum  | object_colors {
 by_layer_color = 0, by_parent_color = 1, black_color, white_color,
 red_color, yellow_color, green_color, cyan_color,
 blue_color, magenta_color, custom_color, color_count
 }
Attributes. More...
 Public Member Functions
CRhinoObjectColorComboBox ()
Construction. More...
virtual  | ~CRhinoObjectColorComboBox ()
}}AFX_VIRTUAL More...
virtual int  | GetCurrentColor (ON_Color &color, object_colors &obj_color)
virtual BOOL32  | OnSelectionChanged ()
Call from ON_CBN_SELCHANGE handler. More...
virtual void  | SetCurrentColor (ON_Color color, object_colors obj_color=by_layer_color)
 Public Member Functions inherited from CRhinoUiColorComboBox
CRhinoUiColorComboBox ()
virtual  | ~CRhinoUiColorComboBox ()
bool  | AddColorItem (const char *lpsColorName, COLORREF color)
bool  | AddColorItem (const wchar_t *lpsColorName, COLORREF color)
CRhinoUiColorComboBoxItem *  | ItemFromIndex (int nIndex)
void  | SetColorPalette (HPALETTE pal)
 Protected Member Functions
virtual void  | Initialize ()
Generated message map functions. More...
virtual void  | PreSubclassWindow ()
Operations. More...
 Protected Member Functions inherited from CRhinoUiColorComboBox
bool  | _AddColorItem (LPCTSTR lpsColorName, COLORREF color)
virtual int  | CompareItem (LPCOMPAREITEMSTRUCT)
virtual void  | DrawItem (LPDRAWITEMSTRUCT)
 Additional Inherited Members
 Public Attributes inherited from CRhinoUiColorComboBox
CObArray  | m_items
 Protected Attributes inherited from CRhinoUiColorComboBox
HPALETTE  | m_hPalette
Detailed Description
CRhinoObjectColorComboBox window.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ object_colors
 enum CRhinoObjectColorComboBox::object_colors
Attributes.
Enumerator
by_layer_color
by_parent_color
black_color
white_color
red_color
yellow_color
green_color
cyan_color
blue_color
magenta_color
custom_color
color_count
Constructor & Destructor Documentation
◆ CRhinoObjectColorComboBox()
 CRhinoObjectColorComboBox::CRhinoObjectColorComboBox  |  ( |   | )
Construction.
◆ ~CRhinoObjectColorComboBox()
 virtual CRhinoObjectColorComboBox::~CRhinoObjectColorComboBox  |  ( |   | )
virtual
}}AFX_VIRTUAL
Implementation
Member Function Documentation
◆ GetCurrentColor()
 virtual int CRhinoObjectColorComboBox::GetCurrentColor  |  ( |  ON_Color &  |  color,
|  object_colors &  |  obj_color
)
virtual
◆ Initialize()
 virtual void CRhinoObjectColorComboBox::Initialize  |  ( |   | )
protectedvirtual
Generated message map functions.
◆ OnSelectionChanged()
 virtual BOOL32 CRhinoObjectColorComboBox::OnSelectionChanged  |  ( |   | )
virtual
Call from ON_CBN_SELCHANGE handler.
◆ PreSubclassWindow()
 virtual void CRhinoObjectColorComboBox::PreSubclassWindow  |  ( |   | )
protectedvirtual
Operations.
Overrides ClassWizard generated virtual function overrides {{AFX_VIRTUAL(CRhinoObjectColorComboBox)
Reimplemented from CRhinoUiColorComboBox.
◆ SetCurrentColor()
 virtual void CRhinoObjectColorComboBox::SetCurrentColor  |  ( |  ON_Color  |  color,
|  object_colors  |  obj_color = by_layer_color
)
virtual