Public Member Functions | List of all members
ON_UuidIndexList2 Class Reference
OpenNURBS
#include <opennurbs_array.h>
 Public Member Functions
ON_UuidIndexList2 ()
ON_UuidIndexList2 (const ON_UuidIndexList2 &src)
~ON_UuidIndexList2 ()
bool  | AddUuidIndex (const ON_UUID &uuid, int index)
unsigned int  | Count () const
bool  | FindUuid (const ON_UUID &uuid) const
bool  | FindUuid (const ON_UUID &uuid, int *index) const
bool  | FindUuidIndex (const ON_UUID &uuid, int index) const
unsigned int  | GetUuids (ON_SimpleArray< ON_UUID > &uuid_list) const
void  | ImproveSearchSpeed ()
ON_UuidIndexList2 &  | operator= (const ON_UuidIndexList2 &src)
void  | RemoveAll ()
bool  | RemoveUuid (const ON_UUID &uuid)
void  | Reserve (size_t capacity)
Constructor & Destructor Documentation
◆ ON_UuidIndexList2() [1/2]
 ON_UuidIndexList2::ON_UuidIndexList2  |  ( |   | )
◆ ~ON_UuidIndexList2()
 ON_UuidIndexList2::~ON_UuidIndexList2  |  ( |   | )
◆ ON_UuidIndexList2() [2/2]
 ON_UuidIndexList2::ON_UuidIndexList2  |  ( |  const ON_UuidIndexList2 &  |  src | )
Member Function Documentation
◆ AddUuidIndex()
 bool ON_UuidIndexList2::AddUuidIndex  |  ( |  const ON_UUID &  |  uuid,
|  int  |  index
)
◆ Count()
 unsigned int ON_UuidIndexList2::Count  |  ( |   | ) |   const
◆ FindUuid() [1/2]
 bool ON_UuidIndexList2::FindUuid  |  ( |  const ON_UUID &  |  uuid | ) |   const
◆ FindUuid() [2/2]
 bool ON_UuidIndexList2::FindUuid  |  ( |  const ON_UUID &  |  uuid,
|  int *  |  index
) |   |  const
◆ FindUuidIndex()
 bool ON_UuidIndexList2::FindUuidIndex  |  ( |  const ON_UUID &  |  uuid,
|  int  |  index
) |   |  const
◆ GetUuids()
 unsigned int ON_UuidIndexList2::GetUuids  |  ( |  ON_SimpleArray< ON_UUID > &  |  uuid_list | ) |   const
◆ ImproveSearchSpeed()
 void ON_UuidIndexList2::ImproveSearchSpeed  |  ( |   | )
◆ operator=()
 ON_UuidIndexList2& ON_UuidIndexList2::operator=  |  ( |  const ON_UuidIndexList2 &  |  src | )
◆ RemoveAll()
 void ON_UuidIndexList2::RemoveAll  |  ( |   | )
◆ RemoveUuid()
 bool ON_UuidIndexList2::RemoveUuid  |  ( |  const ON_UUID &  |  uuid | )
◆ Reserve()
 void ON_UuidIndexList2::Reserve  |  ( |  size_t  |  capacity | )