Public Member Functions | Public Attributes | List of all members
CRhinoUiTabbedSheetCtrlGDI Class Reference
RhinoUI
#include <RhinoSdkUiTabbedSheetCtrl.h>
 Public Member Functions
CRhinoUiTabbedSheetCtrlGDI (CRhinoUiTabbedSheetCtrl &tabctrl)
void  | Init ()
 Public Attributes
CBrush  | m_brush_active
CBrush  | m_brush_inactive
COLORREF  | m_crActiveTab
COLORREF  | m_crActiveText
COLORREF  | m_crNormalTab
COLORREF  | m_crNormalText
CPen  | m_pen_black
CPen  | m_pen_edge
CPen  | m_pen_white
CRhinoUiTabbedSheetCtrl &  | m_tabctrl
Detailed Description
CRhinoUiTabbedSheetCtrlGDI
Constructor & Destructor Documentation
◆ CRhinoUiTabbedSheetCtrlGDI()
 CRhinoUiTabbedSheetCtrlGDI::CRhinoUiTabbedSheetCtrlGDI  |  ( |  CRhinoUiTabbedSheetCtrl &  |  tabctrl | )
Member Function Documentation
◆ Init()
 void CRhinoUiTabbedSheetCtrlGDI::Init  |  ( |   | )
Member Data Documentation
◆ m_brush_active
 CBrush CRhinoUiTabbedSheetCtrlGDI::m_brush_active
◆ m_brush_inactive
 CBrush CRhinoUiTabbedSheetCtrlGDI::m_brush_inactive
◆ m_crActiveTab
 COLORREF CRhinoUiTabbedSheetCtrlGDI::m_crActiveTab
◆ m_crActiveText
 COLORREF CRhinoUiTabbedSheetCtrlGDI::m_crActiveText
◆ m_crNormalTab
 COLORREF CRhinoUiTabbedSheetCtrlGDI::m_crNormalTab
◆ m_crNormalText
 COLORREF CRhinoUiTabbedSheetCtrlGDI::m_crNormalText
◆ m_pen_black
 CPen CRhinoUiTabbedSheetCtrlGDI::m_pen_black
◆ m_pen_edge
 CPen CRhinoUiTabbedSheetCtrlGDI::m_pen_edge
◆ m_pen_white
 CPen CRhinoUiTabbedSheetCtrlGDI::m_pen_white
◆ m_tabctrl
 CRhinoUiTabbedSheetCtrl& CRhinoUiTabbedSheetCtrlGDI::m_tabctrl