Classes | Public Types | Public Member Functions | Static Public Member Functions | Protected Member Functions | Friends | List of all members
CRhRdkDocument Class Reference
RDK
#include <RhRdkDocument.h>
 Inheritance diagram for CRhRdkDocument:
 Classes
class  | CTypeBrowserParams
 Public Types
enum  | : unsigned int {
 it_Normal = 0x0000, it_IncludeDefault = 0x0001, it_IncludeProxies = 0x0002, it_IncludeAutoDeleted = 0x0004,
 it_ForDisplay = 0x0008
 }
enum  | {
 ccbu_hide_new_tab = 0x0001, ccbu_hide_existing_tab = 0x0002, ccbu_multiple_selection = 0x0004, ccbu_allow_none = 0x0008,
 ccbu_disable_import_button = 0x0010, ccbu_hide_copy_or_share = 0x0020, ccbu_force32bit = 0xFFFFFFFF
 }
enum  | {
 ccc_AllowNone = 0x0001, ccc_AutoEdit = 0x0002, ccc_Preserve = 0x0004, ccc_AutoEditBM = 0x0008,
 ccc_NoGroupChange = 0x0010, ccc_HideNewTab = 0x0020, ccc_HideExistingTab = 0x0040, ccc_HarvestMask = 0xF000,
 ccc_HarvestUseOpt = 0x0000, ccc_HarvestAlways = 0x1000, ccc_HarvestNever = 0x2000, ccc_force32bit = 0xFFFFFFFF
 }
using  | ContentNewExistingBrowserParams = CTypeBrowserParams
enum  | SctbResult : unsigned int {
 SctbResult::kNone, SctbResult::kNew, SctbResult::kCopy, SctbResult::kInstance,
 SctbResult::kImport, SctbResult::kReference
 }
 Public Member Functions
virtual RDK_DEPRECATED bool  | ApplyToneMappingWhileRendering (void) const
virtual bool  | AttachContent (CRhRdkContent &c, CRhRdkEventWatcher::AttachReason reason=CRhRdkEventWatcher::AttachReason::Attach)
virtual CRhRdkDocument &  | BeginChange (RhRdkChangeContext cc) const
virtual const CRhRdkContent *  | ChangeChildContent (CRhRdkContent &parent, const wchar_t *wszChildSlotName, const CRhRdkContentKindList &allowedKinds, UINT ccc_Flags=ccc_AllowNone|ccc_AutoEdit)
virtual RDK_DEPRECATED bool  | ChangeContent (const CRhRdkContent &oldContent, CRhRdkContent &newContent, bool bPreserve=true)
virtual RDK_DEPRECATED bool  | ChooseContent (UUID &uuidInstanceInOut, const CRhRdkContentKindList &kinds, UINT rdkcce_Flags) const
virtual const IRhRdkContentList *  | ContentList (CRhRdkContent::Kinds kind) const
IRhRdkContents &  | Contents (void)
const IRhRdkContents &  | Contents (void) const
virtual const CRhRdkContent *  | CreateContentByType (const UUID &uuidNewType, const CRhRdkContent *pParent=nullptr, const wchar_t *wszChildSlotName=L"", UINT uFlags=0)
virtual bool  | CreateContentByUser (OUT CRhRdkContentArray &contents, const UUID &uuidDefaultType, const UUID &uuidDefaultInstance, const CRhRdkContentKindList &allowedKinds, UINT ccbu_flags=0)
RDK_DEPRECATED IRhRdkCurrentEnvironment &  | CurrentEnvironment (void)
const RDK_DEPRECATED IRhRdkCurrentEnvironment &  | CurrentEnvironment (void) const
ON_wString  | DebugString (int uuid_len) const
RDK_DEPRECATED ON_wString  | DebugString (void) const
virtual void  | DeleteThis (void)
virtual CRhRdkContent *  | DetachContent (const CRhRdkContent &c, CRhRdkEventWatcher::DetachReason reason=CRhRdkEventWatcher::DetachReason::Detach)
RDK_DEPRECATED IRhRdkDithering &  | Dithering (void)
const RDK_DEPRECATED IRhRdkDithering &  | Dithering (void) const
virtual RDK_DEPRECATED bool  | EmbedSupportFilesOn (void) const
virtual bool  | EndChange (void)
virtual const IRhRdkContentList &  | EnvironmentList (void) const
virtual const CRhRdkContent *  | FindContentInstance (const UUID &uuidInstance, bool bCheckGlobal) const
virtual void  | FindContentInstanceByName (const CRhRdkContentKindList &kinds, const wchar_t *wszName, bool bCaseSensitive, bool bRecurse, CRhRdkContentArray &aContentOut) const
virtual const CRhRdkContent *  | FindContentWithSameNameAndAppearance (const CRhRdkContent &c) const
virtual void  | GetContentFilterInfo (CRhRdkContentFilterInfo &infoOut) const
virtual void  | GetEmbeddedFilesList (TextureReportFilter filter, ON_ClassArray< ON_wString > &sFiles) const
virtual RDK_DEPRECATED void  | GetToneMapperParams (IRhRdk_XMLSection &section) const
RDK_DEPRECATED IRhRdkGroundPlane &  | GroundPlane (void)
const RDK_DEPRECATED IRhRdkGroundPlane &  | GroundPlane (void) const
virtual UUID  | Id (void) const
CImpl &  | Impl (void) const
virtual bool  | IsContentFilteredOut (const CRhRdkContent &c) const
virtual bool  | IsRenderEngineExcluded (const UUID &uuidRenderEngine) const
virtual bool  | IsSandbox (void) const
RDK_DEPRECATED IRhRdkLinearWorkflow &  | LinearWorkflow (void)
const RDK_DEPRECATED IRhRdkLinearWorkflow &  | LinearWorkflow (void) const
bool  | Match (const CRhRdkDocument &other) const
bool  | Match (const CRhRdkDocument *pOther) const
virtual const IRhRdkContentList &  | MaterialList (void) const
virtual IRhRdkContentIterator *  | NewContentIterator (const CRhRdkContentKindList &kinds, unsigned int it_Flags) const
RDK_DEPRECATED IRhRdkPostEffects &  | PostEffects (void)
const RDK_DEPRECATED IRhRdkPostEffects &  | PostEffects (void) const
RDK_DEPRECATED UUID  | PostEffectSelection (const wchar_t *) const
RDK_DEPRECATED IRhRdkRenderChannels &  | RenderChannels (void)
const RDK_DEPRECATED IRhRdkRenderChannels &  | RenderChannels (void) const
virtual_su bool  | ReplaceContent (const CRhRdkContent &oldContent, CRhRdkContent &newContent, bool bPreserve=true)
virtual CRhinoDoc *  | RhinoDoc (void) const
virtual unsigned int  | RhinoDocSerial (void) const
RDK_DEPRECATED IRhRdkSafeFrame &  | SafeFrame (void)
const RDK_DEPRECATED IRhRdkSafeFrame &  | SafeFrame (void) const
virtual RDK_DEPRECATED void  | SetApplyToneMappingWhileRendering (bool b)
virtual void  | SetContentFilterInfo (const CRhRdkContentFilterInfo &infoNew, const CRhRdkContentFilterInfo &infoOld)
virtual RDK_DEPRECATED void  | SetEmbedSupportFilesOn (bool b)
RDK_DEPRECATED void  | SetPostEffectSelection (const wchar_t *, const UUID &)
virtual void  | SetSetting (const wchar_t *wszName, const CRhRdkVariant &vValue)
virtual CRhRdkVariant  | Setting (const wchar_t *wszName) const
virtual RDK_DEPRECATED void  | SetToneMapperParams (const IRhRdk_XMLSection &section)
virtual RDK_DEPRECATED void  | SetToneMappingMethod (eRdkToneMappingMethod tmm)
virtual RDK_DEPRECATED void  | SetToneMappingMethod (IRhRdkToneMapping::Methods tmm)
virtual_su bool  | ShowContentInstanceBrowser (IN OUT UUID &instance_id, const CRhRdkContentKindList &kinds, UINT rdkcce_flags) const
virtual_su SctbResult  | ShowContentNewExistingBrowser (const ContentNewExistingBrowserParams &params, OUT CRhRdkContentIdArray &ids) const
RDK_DEPRECATED virtual_su SctbResult  | ShowContentTypeBrowser (const CTypeBrowserParams &, CRhRdkInstanceIdArray &) const
virtual RDK_DEPRECATED SctbResult  | ShowContentTypeBrowser (const UUID &, const UUID &, const CRhRdkContentKindList &, CRhRdkInstanceIdArray &, UINT=0) const
RDK_DEPRECATED IRhRdkSkylight &  | Skylight (void)
const RDK_DEPRECATED IRhRdkSkylight &  | Skylight (void) const
RDK_DEPRECATED IRhRdkSun &  | Sun (void)
const RDK_DEPRECATED IRhRdkSun &  | Sun (void) const
virtual const IRhRdkContentList &  | TextureList (void) const
virtual TextureReportResult  | TextureReport (TextureReportFilter initialFilter, bool bAllowAbort, bool bForceDisplayIfEmpty) const
virtual RDK_DEPRECATED IRhRdkToneMapping::Methods  | ToneMappingMethod (void) const
ON_UnitSystem  | UnitSystem (void) const
virtual void  | UpdateDocumentTables (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Static Public Member Functions
static const CRhRdkDocument &  | Get (const CRhinoDoc &doc)
static const CRhRdkDocument *  | Get (const CRhRdkContentArray &aContent)
static const CRhRdkDocument *  | Get (const UUID &uuidRdkDoc)
static bool  | Match (const CRhRdkDocument *pRdkDoc, const CRhRdkDocument &other)
static bool  | Match (const CRhRdkDocument *pRdkDoc1, const CRhRdkDocument *pRdkDoc2)
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions
CRhRdkDocument (bool)
CRhRdkDocument (unsigned int)
virtual  | ~CRhRdkDocument ()
 Friends
class  | CRhRdkDocuments
class  | IRhRdkContents
Member Typedef Documentation
◆ ContentNewExistingBrowserParams
 using CRhRdkDocument::ContentNewExistingBrowserParams = CTypeBrowserParams
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum : unsigned int
Enumerator
it_Normal
it_IncludeDefault
it_IncludeProxies
it_IncludeAutoDeleted
it_ForDisplay
◆ anonymous enum
 anonymous enum
Bit-flags for CreateContentByUser() and ShowContentNewExistingBrowser() uFlags.
Enumerator
ccbu_hide_new_tab
ccbu_hide_existing_tab
ccbu_multiple_selection
ccbu_allow_none
ccbu_disable_import_button
ccbu_hide_copy_or_share
ccbu_force32bit
◆ anonymous enum
 anonymous enum
Bit-flags for ChangeChildContent() uFlags.
Enumerator
ccc_AllowNone
ccc_AutoEdit
ccc_Preserve
ccc_AutoEditBM
ccc_NoGroupChange
ccc_HideNewTab
ccc_HideExistingTab
ccc_HarvestMask
ccc_HarvestUseOpt
ccc_HarvestAlways
ccc_HarvestNever
ccc_force32bit
◆ SctbResult
 enum CRhRdkDocument::SctbResult : unsigned int
strong
Result of ShowContentNewExistingBrowser()
Enumerator
kNone
kNew
kCopy
kInstance
kImport
kReference
Constructor & Destructor Documentation
◆ CRhRdkDocument() [1/2]
 CRhRdkDocument::CRhRdkDocument  |  ( |  bool  |   | )
explicitprotected
◆ CRhRdkDocument() [2/2]
 CRhRdkDocument::CRhRdkDocument  |  ( |  unsigned int  |   | )
explicitprotected
◆ ~CRhRdkDocument()
 virtual CRhRdkDocument::~CRhRdkDocument  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ ApplyToneMappingWhileRendering()
 virtual RDK_DEPRECATED bool CRhRdkDocument::ApplyToneMappingWhileRendering  |  ( |  void  |   | ) |   const
virtual
Returns
true if tone mapping is to be applied when rendering, else false.
◆ AttachContent()
 virtual bool CRhRdkDocument::AttachContent  |  ( |  CRhRdkContent &  |  c,
|  CRhRdkEventWatcher::AttachReason  |  reason = CRhRdkEventWatcher::AttachReason::Attach
)
virtual
Attach a content to the document by transferring ownership of it to the document.
Parameters
c | is the content to attach.
reason | is the reason for the operation. If the reason is 'Attach' and content undo was not recorded by the caller, then content undo will be recorded automatically.
Note
If successful, ownership of the content will be transferred to the document. If not, ownership will remain with the caller. Failure to attach usually indicates that there is already a content with the same instance id in the document. This situation is not allowed and the new content will be rejected.
 If the content is a child or already attached to this or another document, the method will fail.
Returns
true if successful, else false.
◆ BeginChange()
 virtual CRhRdkDocument& CRhRdkDocument::BeginChange  |  ( |  RhRdkChangeContext  |  cc | ) |   const
virtual
Begins a change or batch of changes. This returns a non-const reference to this document which you should use to make your changes. Calls to this method are counted; you must call EndChange() once for every call to BeginChange(). Please do not use const_cast or any other means of circumventing this requirement.
Parameters
cc | is the change context.
Note
If you override this method, please be sure to call the base class.
See also
EndChange()
Returns
A non-const reference to this document.
◆ ChangeChildContent()
 virtual const CRhRdkContent* CRhRdkDocument::ChangeChildContent  |  ( |  CRhRdkContent &  |  parent,
|  const wchar_t *  |  wszChildSlotName,
|  const CRhRdkContentKindList &  |  allowedKinds,
|  UINT  |  ccc_Flags = ccc_AllowNone|ccc_AutoEdit
)
virtual
Change a content's child by allowing the user to choose the new content type from a content browser dialog. The child is created if it does not exist, otherwise the old child is deleted and replaced by the new child (unless ccc_Preserve is specified in which case the old child is optionally preserved as a child of the new child).
Parameters
parent | is the content whose child is to be manipulated.
wszChildSlotName | is the child-slot name of the child to be manipulated.
allowedKinds | determines which content kinds are allowed to be chosen from the content browser dialog.
ccc_Flags | is a set of flags for controlling the operation of the function (see ccc_ enum above).
Note
If parent is not attached to this document (either top-level or child), the function will fail.
Returns
A pointer to the new content if successful, null if it fails or if the user cancels. If you want to modify the content you will need to call BeginChange() to get a non-const reference.
See also
BeginChange()
◆ ChangeContent()
 virtual RDK_DEPRECATED bool CRhRdkDocument::ChangeContent  |  ( |  const CRhRdkContent &  |  oldContent,
|  CRhRdkContent &  |  newContent,
|  bool  |  bPreserve = true
)
virtual
Replace a content in the document. Deprecated in favor of ReplaceContent().
◆ ChooseContent()
 virtual RDK_DEPRECATED bool CRhRdkDocument::ChooseContent  |  ( |  UUID &  |  uuidInstanceInOut,
|  const CRhRdkContentKindList &  |  kinds,
|  UINT  |  rdkcce_Flags
) |   |  const
virtual
◆ ContentList()
 virtual const IRhRdkContentList* CRhRdkDocument::ContentList  |  ( |  CRhRdkContent::Kinds  |  kind | ) |   const
virtual
Returns
A pointer to the content list for a particular content kind.
Parameters
kind | is the content kind for which to find the list.
Note
This pointer is to const because you can only read the list.
 If kind is 'Unset', the method will return null.
 If the document is being closed, the method will return null.
Returns
A pointer to the content list for the given kind or null on failure.
◆ Contents() [1/2]
 IRhRdkContents& CRhRdkDocument::Contents  |  ( |  void  |   | )
◆ Contents() [2/2]
 const IRhRdkContents& CRhRdkDocument::Contents  |  ( |  void  |   | ) |   const
◆ CreateContentByType()
 virtual const CRhRdkContent* CRhRdkDocument::CreateContentByType  |  ( |  const UUID &  |  uuidNewType,
|  const CRhRdkContent *  |  pParent = nullptr,
|  const wchar_t *  |  wszChildSlotName = L"",
|  UINT  |  uFlags = 0
)
virtual
Creates a new content of the specified type and attaches it to the document.
Note
This method calls Initialize() on the new content. If this fails, the content is deleted and this method returns null.
 This function cannot be used to create temporary contents that you delete after use. Contents created by this function are owned by RDK and appear in the content editor. To create a temporary content which is owned by you, call RhRdkContentFactories().NewContentFromType().
See also
IRhRdkContentFactories::NewContentFromType()
Parameters
uuidNewType | is the type of the content to create.
pParent | is the parent content. If not null, this must be an RDK-owned content that is attached to the document (either top-level or child). The new content then becomes its child. If null, the new content is added to the document's top-level content list instead.
wszChildSlotName | is the unique child identifier to use for the new content when creating it as a child of pParent (i.e., when pParent is not null).
uFlags | is for future use only.
Returns
A const pointer to the new content if successful, else null. If you want to modify the content you will need to call BeginChange() to get a non-const reference.
See also
BeginChange()
◆ CreateContentByUser()
 virtual bool CRhRdkDocument::CreateContentByUser  |  ( |  OUT CRhRdkContentArray &  |  contents,
|  const UUID &  |  uuidDefaultType,
|  const UUID &  |  uuidDefaultInstance,
|  const CRhRdkContentKindList &  |  allowedKinds,
|  UINT  |  ccbu_flags = 0
)
virtual
Create one or more new content(s) chosen by the user and attach them to the document.
Note
This function cannot be used to create temporary content that you delete after use. Contents created by this function are owned by RDK and appear in the content editor.
Parameters
contents | accepts the new content(s). If you want to modify the contents you will need to call BeginChange() to get a non-const reference.
See also
BeginChange()
Parameters
uuidDefaultType | is the default content type.
uuidDefaultInstance | is the default selected content instance.
allowedKinds | determines which content kinds are allowed to be chosen from the dialog.
ccbu_flags | is from the enum above with prefix ccbu_ – NOTE: ccbu_hide_copy_or_share is ignored.
Returns
true if successful, else false.
◆ CurrentEnvironment() [1/2]
 RDK_DEPRECATED IRhRdkCurrentEnvironment& CRhRdkDocument::CurrentEnvironment  |  ( |  void  |   | )
◆ CurrentEnvironment() [2/2]
 const RDK_DEPRECATED IRhRdkCurrentEnvironment& CRhRdkDocument::CurrentEnvironment  |  ( |  void  |   | ) |   const
◆ DebugString() [1/2]
 ON_wString CRhRdkDocument::DebugString  |  ( |  int  |  uuid_len | ) |   const
◆ DebugString() [2/2]
 RDK_DEPRECATED ON_wString CRhRdkDocument::DebugString  |  ( |  void  |   | ) |   const
◆ DeleteThis()
 virtual void CRhRdkDocument::DeleteThis  |  ( |  void  |   | )
virtual
This method is implemented as
delete this;
◆ DetachContent()
 virtual CRhRdkContent* CRhRdkDocument::DetachContent  |  ( |  const CRhRdkContent &  |  c,
|  CRhRdkEventWatcher::DetachReason  |  reason = CRhRdkEventWatcher::DetachReason::Detach
)
virtual
Detach a content from the document. Ownership of the content will be transferred to either the caller or the undo system, depending on the 'reason' parameter.
Note
From Rhino 9 onwards, this method records undo if the reason is 'Delete'.
Parameters
c | is the content to detach. If successful, ownership of the content will be transferred to the caller if the reason is anything other than 'Delete', or to the undo system if the reason is 'Delete'.
reason | is the reason for the operation.
Returns
A pointer to the non-const content if the reason is not 'Delete' and the operation succeeds. If the reason is 'Delete', the method returns null because the content has been transferred to the undo system and is no longer available for clients to use. If the method does return a content, then it is safe to delete that content.
Note
If the content is a child or not attached to this document, the method will fail.
◆ Dithering() [1/2]
 RDK_DEPRECATED IRhRdkDithering& CRhRdkDocument::Dithering  |  ( |  void  |   | )
◆ Dithering() [2/2]
 const RDK_DEPRECATED IRhRdkDithering& CRhRdkDocument::Dithering  |  ( |  void  |   | ) |   const
◆ EmbedSupportFilesOn()
 virtual RDK_DEPRECATED bool CRhRdkDocument::EmbedSupportFilesOn  |  ( |  void  |   | ) |   const
virtual
◆ EndChange()
 virtual bool CRhRdkDocument::EndChange  |  ( |  void  |   | )
virtual
Ends a change or batch of changes. Calls to this method are counted; you must call EndChange() once for every call to BeginChange().
Note
If you override this method, please be sure to call the base class.
See also
BeginChange()
Returns
true if a change has actually occurred, else false.
◆ EnvironmentList()
 virtual const IRhRdkContentList& CRhRdkDocument::EnvironmentList  |  ( |  void  |   | ) |   const
virtual
Returns
A reference to the environment list.
Note
This reference is to const because you can only read the list.
◆ FindContentInstance()
 virtual const CRhRdkContent* CRhRdkDocument::FindContentInstance  |  ( |  const UUID &  |  uuidInstance,
|  bool  |  bCheckGlobal
) |   |  const
virtual
Find a content by its instance id. All document-registered contents (including children) will be checked.
Parameters
bCheckGlobal | determines if global contents should also be checked. Global contents are non-document contents that happen to be on the stack or the heap. If this is true, global contents will be checked if the content was not found in the document. If false, the search is restricted to document contents only.
Note
Prior to May 1st 2018, the bCheckGlobal parameter defaulted to true. This default has been removed because it is important to think carefully about whether or not you need the global check. If you are reading this because you suddenly got a compiler error, you can add ", true" to your call if you want to keep the same behavior (which by default was checking globally if not found in the document).
 Cloned contents are never found as they are not registered in documents or globally.
Parameters
uuidInstance | is the instance id of the content to find.
Returns
A const pointer to the content or null if not found. If you want to modify the content you will need to call BeginChange() to get a non-const reference.
See also
BeginChange()
◆ FindContentInstanceByName()
 virtual void CRhRdkDocument::FindContentInstanceByName  |  ( |  const CRhRdkContentKindList &  |  kinds,
|  const wchar_t *  |  wszName,
|  bool  |  bCaseSensitive,
|  bool  |  bRecurse,
|  CRhRdkContentArray &  |  aContentOut
) |   |  const
virtual
Searches for contents with a particular instance name.
Parameters
kinds | specifies which top-level content kinds should be searched.
wszName | is the name to search for.
bCaseSensitive | specifies if the name check is case-sensitive or not.
bRecurse | specifies if children of top-level contents should be searched.
aContentOut | accepts all the contents that satisfy the search. If you want to modify these contents you will need to call BeginChange() to get a non-const reference.
See also
BeginChange()
◆ FindContentWithSameNameAndAppearance()
 virtual const CRhRdkContent* CRhRdkDocument::FindContentWithSameNameAndAppearance  |  ( |  const CRhRdkContent &  |  c | ) |   const
virtual
Searches for a content with the same name and appearance as another content.
Note
The name check is case-insensitive. The 'appearance' is the render CRC of the content.
Parameters
c | is the content to match against.
Returns
A pointer to a similar content if found, else null.
◆ Get() [1/3]
 static const CRhRdkDocument& CRhRdkDocument::Get  |  ( |  const CRhinoDoc &  |  doc | )
static
Get the RDK document which is associated with the given Rhino document.
Parameters
doc | is the Rhino document.
Returns
A reference to the RDK document associated with the given Rhino document.
◆ Get() [2/3]
 static const CRhRdkDocument* CRhRdkDocument::Get  |  ( |  const CRhRdkContentArray &  |  aContent | )
static
Get the RDK document which is associated with an array of content.
Note
If all the content is not attached to the same document, the method will fail.
Parameters
aContent | is the array of content.
Returns
A pointer to the common RDK document or null if none.
◆ Get() [3/3]
 static const CRhRdkDocument* CRhRdkDocument::Get  |  ( |  const UUID &  |  uuidRdkDoc | )
static
Get an RDK document by its unique identifier.
Parameters
uuidRdkDoc | is the identifier of the RDK document.
Returns
A pointer to the RDK document identified by uuidRdkDoc, or null if not found.
◆ GetContentFilterInfo()
 virtual void CRhRdkDocument::GetContentFilterInfo  |  ( |  CRhRdkContentFilterInfo &  |  infoOut | ) |   const
virtual
◆ GetEmbeddedFilesList()
 virtual void CRhRdkDocument::GetEmbeddedFilesList  |  ( |  TextureReportFilter  |  filter,
|  ON_ClassArray< ON_wString > &  |  sFiles
) |   |  const
virtual
◆ GetToneMapperParams()
 virtual RDK_DEPRECATED void CRhRdkDocument::GetToneMapperParams  |  ( |  IRhRdk_XMLSection &  |  section | ) |   const
virtual
This method is obsolete.
◆ GroundPlane() [1/2]
 RDK_DEPRECATED IRhRdkGroundPlane& CRhRdkDocument::GroundPlane  |  ( |  void  |   | )
◆ GroundPlane() [2/2]
 const RDK_DEPRECATED IRhRdkGroundPlane& CRhRdkDocument::GroundPlane  |  ( |  void  |   | ) |   const
◆ Id()
 virtual UUID CRhRdkDocument::Id  |  ( |  void  |   | ) |   const
virtual
Returns
the unique identifier of this RDK document.
◆ Impl()
 CImpl& CRhRdkDocument::Impl  |  ( |  void  |   | ) |   const
◆ IsContentFilteredOut()
 virtual bool CRhRdkDocument::IsContentFilteredOut  |  ( |  const CRhRdkContent &  |  c | ) |   const
virtual
Returns
true if content is filtered out according to document filter settings.
◆ IsRenderEngineExcluded()
 virtual bool CRhRdkDocument::IsRenderEngineExcluded  |  ( |  const UUID &  |  uuidRenderEngine | ) |   const
virtual
◆ IsSandbox()
 virtual bool CRhRdkDocument::IsSandbox  |  ( |  void  |   | ) |   const
virtual
A 'sandbox' document is a temporary document that is not associated with a Rhino document. Sandboxes are used to hold and manipulate temporary contents in, for example, the Modal Editor.
Returns
true if the document is a sandbox document, else false.
◆ LinearWorkflow() [1/2]
 RDK_DEPRECATED IRhRdkLinearWorkflow& CRhRdkDocument::LinearWorkflow  |  ( |  void  |   | )
◆ LinearWorkflow() [2/2]
 const RDK_DEPRECATED IRhRdkLinearWorkflow& CRhRdkDocument::LinearWorkflow  |  ( |  void  |   | ) |   const
◆ Match() [1/4]
 bool CRhRdkDocument::Match  |  ( |  const CRhRdkDocument &  |  other | ) |   const
Checks if this document is the same as another document (by id).
◆ Match() [2/4]
 bool CRhRdkDocument::Match  |  ( |  const CRhRdkDocument *  |  pOther | ) |   const
Checks if this document is the same as another document (by id).
◆ Match() [3/4]
 static bool CRhRdkDocument::Match  |  ( |  const CRhRdkDocument *  |  pRdkDoc,
|  const CRhRdkDocument &  |  other
)
static
Checks if two document are the same (by id).
◆ Match() [4/4]
 static bool CRhRdkDocument::Match  |  ( |  const CRhRdkDocument *  |  pRdkDoc1,
|  const CRhRdkDocument *  |  pRdkDoc2
)
static
Checks if two document are the same (by id).
◆ MaterialList()
 virtual const IRhRdkContentList& CRhRdkDocument::MaterialList  |  ( |  void  |   | ) |   const
virtual
Returns
A reference to the material list.
Note
This reference is to const because you can only read the list.
◆ NewContentIterator()
 virtual IRhRdkContentIterator* CRhRdkDocument::NewContentIterator  |  ( |  const CRhRdkContentKindList &  |  kinds,
|  unsigned int  |  it_Flags
) |   |  const
virtual
Get a new content iterator. The caller shall delete the iterator after use.
Parameters
kinds | specifies the content kinds to return.
it_Flags | are flags that control the iterator. See above.
◆ PostEffects() [1/2]
 RDK_DEPRECATED IRhRdkPostEffects& CRhRdkDocument::PostEffects  |  ( |  void  |   | )
◆ PostEffects() [2/2]
 const RDK_DEPRECATED IRhRdkPostEffects& CRhRdkDocument::PostEffects  |  ( |  void  |   | ) |   const
◆ PostEffectSelection()
 RDK_DEPRECATED UUID CRhRdkDocument::PostEffectSelection  |  ( |  const wchar_t *  |   | ) |   const
◆ RenderChannels() [1/2]
 RDK_DEPRECATED IRhRdkRenderChannels& CRhRdkDocument::RenderChannels  |  ( |  void  |   | )
◆ RenderChannels() [2/2]
 const RDK_DEPRECATED IRhRdkRenderChannels& CRhRdkDocument::RenderChannels  |  ( |  void  |   | ) |   const
◆ ReplaceContent()
 virtual_su bool CRhRdkDocument::ReplaceContent  |  ( |  const CRhRdkContent &  |  oldContent,
|  CRhRdkContent &  |  newContent,
|  bool  |  bPreserve = true
)
Replace a content in the document.
Parameters
oldContent | is the content to detach and delete.
newContent | is the content to attach in place of oldContent. If successful, the old content will be deleted and ownership of the new content will be transferred to the document.
bPreserve | determines whether or not the instance id and notes are preserved. If true, the instance id of the old content is preserved in the new content. This means that any objects or layers that were referencing the old content will reference the new content. The same applies to the ground plane. The content's notes are also preserved. TODO: The name preserving is currently being reconsidered. [ANDY]
Note
The old content can be top-level or a child.
 If the old content is not attached to this document, the method will fail.
 If the new content is a child already attached to this or another document, the method will fail.
Returns
true if successful, else false.
◆ RhinoDoc()
 virtual CRhinoDoc* CRhRdkDocument::RhinoDoc  |  ( |  void  |   | ) |   const
virtual
Returns
a pointer to the Rhino document associated with this RDK document. This will return null if the RDK document is not associated with a Rhino document.
◆ RhinoDocSerial()
 virtual unsigned int CRhRdkDocument::RhinoDocSerial  |  ( |  void  |   | ) |   const
virtual
Returns
the serial number of the Rhino document associated with this RDK document. This will return zero if the RDK document is not associated with a Rhino document.
◆ SafeFrame() [1/2]
 RDK_DEPRECATED IRhRdkSafeFrame& CRhRdkDocument::SafeFrame  |  ( |  void  |   | )
◆ SafeFrame() [2/2]
 const RDK_DEPRECATED IRhRdkSafeFrame& CRhRdkDocument::SafeFrame  |  ( |  void  |   | ) |   const
◆ SetApplyToneMappingWhileRendering()
 virtual RDK_DEPRECATED void CRhRdkDocument::SetApplyToneMappingWhileRendering  |  ( |  bool  |  b | )
virtual
Set whether or not tone mapping is to be applied when rendering.
◆ SetContentFilterInfo()
 virtual void CRhRdkDocument::SetContentFilterInfo  |  ( |  const CRhRdkContentFilterInfo &  |  infoNew,
|  const CRhRdkContentFilterInfo &  |  infoOld
)
virtual
◆ SetEmbedSupportFilesOn()
 virtual RDK_DEPRECATED void CRhRdkDocument::SetEmbedSupportFilesOn  |  ( |  bool  |  b | )
virtual
◆ SetPostEffectSelection()
 RDK_DEPRECATED void CRhRdkDocument::SetPostEffectSelection  |  ( |  const wchar_t *  |  ,
|  const UUID &
)
◆ SetSetting()
 virtual void CRhRdkDocument::SetSetting  |  ( |  const wchar_t *  |  wszName,
|  const CRhRdkVariant &  |  vValue
)
virtual
Set a document setting by its name.
◆ Setting()
 virtual CRhRdkVariant CRhRdkDocument::Setting  |  ( |  const wchar_t *  |  wszName | ) |   const
virtual
Get a document setting by its name.
◆ SetToneMapperParams()
 virtual RDK_DEPRECATED void CRhRdkDocument::SetToneMapperParams  |  ( |  const IRhRdk_XMLSection &  |  section | )
virtual
This method is obsolete.
◆ SetToneMappingMethod() [1/2]
 virtual RDK_DEPRECATED void CRhRdkDocument::SetToneMappingMethod  |  ( |  eRdkToneMappingMethod  |  tmm | )
virtual
This method is obsolete.
◆ SetToneMappingMethod() [2/2]
 virtual RDK_DEPRECATED void CRhRdkDocument::SetToneMappingMethod  |  ( |  IRhRdkToneMapping::Methods  |  tmm | )
virtual
This method is deprecated in favor of CRhinoDoc::Properties().RenderSettings().PostEffects().
◆ ShowContentInstanceBrowser()
 virtual_su bool CRhRdkDocument::ShowContentInstanceBrowser  |  ( |  IN OUT UUID &  |  instance_id,
|  const CRhRdkContentKindList &  |  kinds,
|  UINT  |  rdkcce_flags
) |   |  const
Allows the user to choose a content by displaying the Content Instance Browser dialog.
Parameters
instance_id | sets the initially selected content and receives the instance id of the chosen content.
kinds | specifies the kind(s) of content that should be displayed in the browser.
rdkcce_flags | specifies flags controlling the browser. See enum in RhRdkDefinitions.h
Returns
true if the user chooses a content, false if the dialog is cancelled.
◆ ShowContentNewExistingBrowser()
 virtual_su SctbResult CRhRdkDocument::ShowContentNewExistingBrowser  |  ( |  const ContentNewExistingBrowserParams &  |  params,
|  OUT CRhRdkContentIdArray &  |  ids
) |   |  const
Shows the Content New / Existing Browser to allow the user to choose one or more new or existing contents.
Parameters
params | specifies various parameters that control the browser.
contents | accepts the UUID(s) of the chosen item(s). Depending on SctbResult, this can be type ids of content types or instance ids of existing contents.
Returns
A value from the SctbResult enum giving the result of the operation.
◆ ShowContentTypeBrowser() [1/2]
 RDK_DEPRECATED virtual_su SctbResult CRhRdkDocument::ShowContentTypeBrowser  |  ( |  const CTypeBrowserParams &  |  ,
|  CRhRdkInstanceIdArray &
) |   |  const
This method is deprecated in favor of ShowContentNewExistingBrowser().
◆ ShowContentTypeBrowser() [2/2]
 virtual RDK_DEPRECATED SctbResult CRhRdkDocument::ShowContentTypeBrowser  |  ( |  const UUID &  |  ,
|  const UUID &  |  ,
|  const CRhRdkContentKindList &  |  ,
|  CRhRdkInstanceIdArray &  |  ,
|  UINT  |   = 0
) |   |  const
virtual
This method is deprecated in favor of ShowContentNewExistingBrowser().
◆ Skylight() [1/2]
 RDK_DEPRECATED IRhRdkSkylight& CRhRdkDocument::Skylight  |  ( |  void  |   | )
◆ Skylight() [2/2]
 const RDK_DEPRECATED IRhRdkSkylight& CRhRdkDocument::Skylight  |  ( |  void  |   | ) |   const
◆ Sun() [1/2]
 RDK_DEPRECATED IRhRdkSun& CRhRdkDocument::Sun  |  ( |  void  |   | )
◆ Sun() [2/2]
 const RDK_DEPRECATED IRhRdkSun& CRhRdkDocument::Sun  |  ( |  void  |   | ) |   const
◆ TextureList()
 virtual const IRhRdkContentList& CRhRdkDocument::TextureList  |  ( |  void  |   | ) |   const
virtual
Returns
A reference to the texture list.
Note
This reference is to const because you can only read the list.
◆ TextureReport()
 virtual TextureReportResult CRhRdkDocument::TextureReport  |  ( |  TextureReportFilter  |  initialFilter,
|  bool  |  bAllowAbort,
|  bool  |  bForceDisplayIfEmpty
) |   |  const
virtual
◆ ToneMappingMethod()
 virtual RDK_DEPRECATED IRhRdkToneMapping::Methods CRhRdkDocument::ToneMappingMethod  |  ( |  void  |   | ) |   const
virtual
This method is deprecated in favor of CRhinoDoc::Properties().RenderSettings().PostEffects().
◆ UnitSystem()
 ON_UnitSystem CRhRdkDocument::UnitSystem  |  ( |  void  |   | ) |   const
◆ UpdateDocumentTables()
 virtual void CRhRdkDocument::UpdateDocumentTables  |  ( |  void  |   | )
virtual
Calls UpdateDocumentTables() on all the contents in the RDK document.
Friends And Related Function Documentation
◆ CRhRdkDocuments
 friend class CRhRdkDocuments
friend
◆ IRhRdkContents
 friend class IRhRdkContents
friend