Public Member Functions | List of all members
CRhinoKeepKinkySurfaces Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoKeepKinkySurfaces ()
CRhinoKeepKinkySurfaces (bool bKeep)
~CRhinoKeepKinkySurfaces ()
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoKeepKinkySurfaces() [1/2]
 CRhinoKeepKinkySurfaces::CRhinoKeepKinkySurfaces  |  ( |   | )
This constructor saves the current value of
RhinoApp().AppSettings().GeneralSettings().m_bSplitCreasedSurfaces
in m_bSavedSetting and then sets the app setting to false.
◆ CRhinoKeepKinkySurfaces() [2/2]
 CRhinoKeepKinkySurfaces::CRhinoKeepKinkySurfaces  |  ( |  bool  |  bKeep | )
This constructor saves the current value of
RhinoApp().AppSettings().GeneralSettings().m_bSplitCreasedSurfaces
in m_bSavedSetting and then sets the app setting to !bKeep.
◆ ~CRhinoKeepKinkySurfaces()
 CRhinoKeepKinkySurfaces::~CRhinoKeepKinkySurfaces  |  ( |   | )
The destructor sets
RhinoApp().AppSettings().GeneralSettings().m_bSplitCreasedSurfaces
to the value saved in m_bSavedSetting.