Public Member Functions | List of all members
ON_SubDFaceEdgeIterator Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDFaceEdgeIterator ()
ON_SubDFaceEdgeIterator (const ON_SubDFace *face)
ON_SubDFaceEdgeIterator (const ON_SubDFace *face, const ON_SubDEdge *first_edge)
const ON_SubDEdge *  | CurrentEdge () const
unsigned int  | CurrentEdgeIndex () const
unsigned int  | EdgeCount () const
const ON_SubDEdge *  | FirstEdge ()
unsigned int  | FirstEdgeIndex () const
unsigned int  | Initialize (const ON_SubDFace *face)
unsigned int  | Initialize (const ON_SubDFace *face, const ON_SubDEdge *first_edge)
const ON_SubDEdge *  | NextEdge ()
const ON_SubDEdge *  | NextEdge (bool bReturnNullAtFirstEdge)
const ON_SubDEdge *  | PrevEdge ()
const ON_SubDEdge *  | PrevEdge (bool bReturnNullAtFirstEdge)
Detailed Description
ON_SubDFaceEdgeIterator
Constructor & Destructor Documentation
◆ ON_SubDFaceEdgeIterator() [1/3]
 ON_SubDFaceEdgeIterator::ON_SubDFaceEdgeIterator  |  ( |   | )
◆ ON_SubDFaceEdgeIterator() [2/3]
 ON_SubDFaceEdgeIterator::ON_SubDFaceEdgeIterator  |  ( |  const ON_SubDFace *  |  face | )
Description: Construct an iterator for going around the edges on a face. Parameters: face - [in] first_edge - [in] starting edge for the iterator or nullptr to start at face->Edge(0).
◆ ON_SubDFaceEdgeIterator() [3/3]
 ON_SubDFaceEdgeIterator::ON_SubDFaceEdgeIterator  |  ( |  const ON_SubDFace *  |  face,
|  const ON_SubDEdge *  |  first_edge
)
Member Function Documentation
◆ CurrentEdge()
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::CurrentEdge  |  ( |   | ) |   const
Returns: Current edge.
◆ CurrentEdgeIndex()
 unsigned int ON_SubDFaceEdgeIterator::CurrentEdgeIndex  |  ( |   | ) |   const
◆ EdgeCount()
 unsigned int ON_SubDFaceEdgeIterator::EdgeCount  |  ( |   | ) |   const
◆ FirstEdge()
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::FirstEdge  |  ( |   | )
Returns: Resets the iterator and returns the first edge.
◆ FirstEdgeIndex()
 unsigned int ON_SubDFaceEdgeIterator::FirstEdgeIndex  |  ( |   | ) |   const
◆ Initialize() [1/2]
 unsigned int ON_SubDFaceEdgeIterator::Initialize  |  ( |  const ON_SubDFace *  |  face | )
Description: Initialize an iterator for going around the edges on a face. Parameters: face - [in] first_edge - [in] starting edge for the iterator or nullptr to start at face->Edge(0).
◆ Initialize() [2/2]
 unsigned int ON_SubDFaceEdgeIterator::Initialize  |  ( |  const ON_SubDFace *  |  face,
|  const ON_SubDEdge *  |  first_edge
)
◆ NextEdge() [1/2]
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::NextEdge  |  ( |   | )
Description: Increments the iterator and returns the edge.
◆ NextEdge() [2/2]
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::NextEdge  |  ( |  bool  |  bReturnNullAtFirstEdge | )
Parameters: bReturnNullAtFirstEdge = [in] If true and the next edge would be FirstEdge(), the nullptr is returned and CurrentEdge() is not changed. Description: Increments the iterator and returns the edge.
◆ PrevEdge() [1/2]
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::PrevEdge  |  ( |   | )
Description: Decrements the iterator and returns the edge.
◆ PrevEdge() [2/2]
 const ON_SubDEdge* ON_SubDFaceEdgeIterator::PrevEdge  |  ( |  bool  |  bReturnNullAtFirstEdge | )
Parameters: bReturnNullAtLastEdge = [in] If true and the previous edge would be FirstEdge(), the nullptr is returned and CurrentEdge() is not changed. Description: Decrements the iterator and returns the edge.