Public Attributes | List of all members
CRhinoTargetDocChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
unsigned int  | m_previous_target_rhino_doc_sn
Member Data Documentation
◆ m_previous_target_rhino_doc_sn
 unsigned int CRhinoTargetDocChanged::CParameters::m_previous_target_rhino_doc_sn