Public Member Functions | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiPopUpListWnd Class Reference
RhinoUI
#include <RhinoSdkUiPopUpListWnd.h>
 Inheritance diagram for CRhinoUiPopUpListWnd:
 Public Member Functions
CRhinoUiPopUpListWnd ()
protected constructor used by dynamic creation More...
virtual  | ~CRhinoUiPopUpListWnd ()
bool  | AdjustWidth ()
Adjust list to fit widest item. More...
bool  | AutoDelete ()
Delete this pointer when windows is destroyed. More...
virtual BOOL32  | CreatePopUpListBox (const RECT &rect, CWnd *pParentWnd, UINT nListBoxStyles=LBS_HASSTRINGS|LBS_NOINTEGRALHEIGHT)
Step 1: Create list box. More...
virtual void  | DeletePopUpListBox ()
bool  | DestroyOnClickOnListItem ()
Destroy window when on list item box click. More...
bool  | DestroyOnKillFocus ()
bool  | DisplayPopUpListBox (int nCmdShow=SW_SHOW)
bool  | HideOnClickOnListItem ()
Hide window when list box looses focus. More...
bool  | HideOnKillFocus ()
CRhinoUiPopuUpListBox &  | ListBox ()
virtual void  | ListItemClickedOn (int item_index, int x_col)
bool  | LockWindowTop ()
virtual CRhinoUiPopuUpListBox *  | NewPopUpListBox ()
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
virtual void  | OnLBChar (UINT nChar, UINT nRepCnt, UINT nFlags)
virtual void  | OnLBKeyDown (int item_index, UINT nChar, UINT nRepCnt, UINT nFlags)
virtual BOOL32  | OnLBOnLButtonUpInColumn (int item, int x_down, int x_up)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
void  | SetAdjustWidth (bool adjust=true)
void  | SetAutoDelete (bool b=true)
void  | SetDestroyOnClickOnListItem (bool b=true)
void  | SetDestroyOnKillFocus (bool b=true)
void  | SetHideOnClickOnListItem (bool b=true)
void  | SetHideOnKillFocus (bool b=true)
void  | SetLockWindowTop (bool lock=true)
void  | SetMaximumClientArea (CRect &rc)
Maximum client area for list box. More...
void  | SizeToContent ()
 Protected Member Functions
virtual void  | PostNcDestroy ()
 Protected Attributes
CRhinoUiPopuUpListBox *  | mp_list_box
 Friends
class  | CRhinoUiPopuUpListBox
Constructor & Destructor Documentation
◆ CRhinoUiPopUpListWnd()
 CRhinoUiPopUpListWnd::CRhinoUiPopUpListWnd  |  ( |   | )
protected constructor used by dynamic creation
◆ ~CRhinoUiPopUpListWnd()
 virtual CRhinoUiPopUpListWnd::~CRhinoUiPopUpListWnd  |  ( |   | )
virtual
Member Function Documentation
◆ AdjustWidth()
 bool CRhinoUiPopUpListWnd::AdjustWidth  |  ( |   | )
Adjust list to fit widest item.
◆ AutoDelete()
 bool CRhinoUiPopUpListWnd::AutoDelete  |  ( |   | )
Delete this pointer when windows is destroyed.
◆ CreatePopUpListBox()
 virtual BOOL32 CRhinoUiPopUpListWnd::CreatePopUpListBox  |  ( |  const RECT &  |  rect,
|  CWnd *  |  pParentWnd,
|  UINT  |  nListBoxStyles = LBS_HASSTRINGS|LBS_NOINTEGRALHEIGHT
)
virtual
Step 1: Create list box.
◆ DeletePopUpListBox()
 virtual void CRhinoUiPopUpListWnd::DeletePopUpListBox  |  ( |   | )
virtual
Description: ONLY override if you overrider NewPopUpListBox(). This method will be called to destroy your list box objcet. The pointer returned by NewPopUpListBox() is stored in CRhinoUiPopUpListWnd::mp_list_box.
◆ DestroyOnClickOnListItem()
 bool CRhinoUiPopUpListWnd::DestroyOnClickOnListItem  |  ( |   | )
Destroy window when on list item box click.
◆ DestroyOnKillFocus()
 bool CRhinoUiPopUpListWnd::DestroyOnKillFocus  |  ( |   | )
Destroy window when list box looses focus. If this returns TRUE then HideWindowOnKillFocus() never gets called
◆ DisplayPopUpListBox()
 bool CRhinoUiPopUpListWnd::DisplayPopUpListBox  |  ( |  int  |  nCmdShow = SW_SHOW | )
Step 2: Add list box items Step 3: Adjust list box size and display
◆ HideOnClickOnListItem()
 bool CRhinoUiPopUpListWnd::HideOnClickOnListItem  |  ( |   | )
Hide window when list box looses focus.
◆ HideOnKillFocus()
 bool CRhinoUiPopUpListWnd::HideOnKillFocus  |  ( |   | )
Hide window when list box looses focus. Only gets called if DestroyOnKillFocus() returns false
◆ ListBox()
 CRhinoUiPopuUpListBox& CRhinoUiPopUpListWnd::ListBox  |  ( |   | )
◆ ListItemClickedOn()
 virtual void CRhinoUiPopUpListWnd::ListItemClickedOn  |  ( |  int  |  item_index,
|  int  |  x_col
)
virtual
Description: Called by list box OnLButtonUp() method if mouse comes up on the same item it went down on and in the same column. See OnLBOnLButtonUpInColumn( ...) Parameters: item_index [in] - list index for item clicked on
◆ LockWindowTop()
 bool CRhinoUiPopUpListWnd::LockWindowTop  |  ( |   | )
Lock top of window and adust bottom to fit list item if TRUE otherwise lock bottom and adjust top.
◆ NewPopUpListBox()
 virtual CRhinoUiPopuUpListBox* CRhinoUiPopUpListWnd::NewPopUpListBox  |  ( |   | )
virtual
Description: Override if you want to provide your onwn owner draw list box or want to do your own custom messaging and return your derived object
◆ OnCreate()
 afx_msg int CRhinoUiPopUpListWnd::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiPopUpListWnd::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnLBChar()
 virtual void CRhinoUiPopUpListWnd::OnLBChar  |  ( |  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
virtual
Description: Called by list box OnChar( ...) method Parameters: See CWnd::OnChar()
◆ OnLBKeyDown()
 virtual void CRhinoUiPopUpListWnd::OnLBKeyDown  |  ( |  int  |  item_index,
|  UINT  |  nChar,
|  UINT  |  nRepCnt,
|  UINT  |  nFlags
)
virtual
Description: Called by list box OnKeyDown() method. Parameters: item_index [in] - currently selected list item nChar [in] see CWnd::OnKeyDown(...) nRepCnt [in] see CWnd::OnKeyDown(...) nFlags [in] see CWnd::OnKeyDown(...)
◆ OnLBOnLButtonUpInColumn()
 virtual BOOL32 CRhinoUiPopUpListWnd::OnLBOnLButtonUpInColumn  |  ( |  int  |  item,
|  int  |  x_down,
|  int  |  x_up
)
virtual
Description: Called by list box OnLButtonUp() method if mouse comes up on the same item it went down on. The base class assumes there is only one column and returns true. Override this function if you are owner drawing this control and want to do column validation. See ListItemClickedOn() Parameters: x_down [in] - x point coordinate where mouse went down x_up [in] - x point coordinage where mouse came up
◆ OnPaint()
 afx_msg void CRhinoUiPopUpListWnd::OnPaint  |  ( |   | )
◆ OnSize()
 afx_msg void CRhinoUiPopUpListWnd::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ PostNcDestroy()
 virtual void CRhinoUiPopUpListWnd::PostNcDestroy  |  ( |   | )
protectedvirtual
◆ SetAdjustWidth()
 void CRhinoUiPopUpListWnd::SetAdjustWidth  |  ( |  bool  |  adjust = true | )
default value is true
◆ SetAutoDelete()
 void CRhinoUiPopUpListWnd::SetAutoDelete  |  ( |  bool  |  b = true | )
◆ SetDestroyOnClickOnListItem()
 void CRhinoUiPopUpListWnd::SetDestroyOnClickOnListItem  |  ( |  bool  |  b = true | )
◆ SetDestroyOnKillFocus()
 void CRhinoUiPopUpListWnd::SetDestroyOnKillFocus  |  ( |  bool  |  b = true | )
◆ SetHideOnClickOnListItem()
 void CRhinoUiPopUpListWnd::SetHideOnClickOnListItem  |  ( |  bool  |  b = true | )
◆ SetHideOnKillFocus()
 void CRhinoUiPopUpListWnd::SetHideOnKillFocus  |  ( |  bool  |  b = true | )
◆ SetLockWindowTop()
 void CRhinoUiPopUpListWnd::SetLockWindowTop  |  ( |  bool  |  lock = true | )
◆ SetMaximumClientArea()
 void CRhinoUiPopUpListWnd::SetMaximumClientArea  |  ( |  CRect &  |  rc | )
Maximum client area for list box.
◆ SizeToContent()
 void CRhinoUiPopUpListWnd::SizeToContent  |  ( |   | )
Friends And Related Function Documentation
◆ CRhinoUiPopuUpListBox
 friend class CRhinoUiPopuUpListBox
friend
Member Data Documentation
◆ mp_list_box
 CRhinoUiPopuUpListBox* CRhinoUiPopUpListWnd::mp_list_box
protected