Public Types | Public Member Functions | Public Attributes | Protected Member Functions | Protected Attributes | Friends | List of all members
CRhinoUiDialog Class Reference
RhinoUI
CRhinoUiDialog dialog. More...
#include <RhinoSdkUiDialog.h>
 Inheritance diagram for CRhinoUiDialog:
 Public Types
enum  | rhino_dialog_flags { is_dockbar_dialog = 1, force_32bit_rhino_flag = 0xFFFFFFFF }
Reserved for future use. More...
 Public Member Functions
CRhinoUiDialog (LPCTSTR lpszTemplateName=NULL, CWnd *pParentWnd=NULL)
CRhinoUiDialog (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual  | ~CRhinoUiDialog ()
bool  | AddResizeControl (bool b)
bool  | AllowEscapeAndEnter () const
void  | CallOnUpdateUi ()
virtual BOOL32  | Create (LPCTSTR lpszTemplateName, CWnd *pParentWnd=NULL)
Modeless construct. More...
virtual BOOL32  | Create (UINT nIDTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd=NULL)
virtual BOOL32  | CreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd=NULL, void *lpDialogInit=NULL)
AFX_MODULE_STATE *  | DialogModuleState ()
UINT  | DialogTemplateID () const
LPCTSTR  | DialogTemplateName () const
void  | DisableAllDialogItems ()
INT_PTR  | DoModal ()
void  | EnableAllDlgControls (bool bEnable)
bool  | EnableDialogItem (UINT nItemID, bool bEnable)
int  | EnableDialogItems (CUIntArray &nItemIDArray, bool bEnable)
int  | EnableDialogItems (UINT *nItemIDArray, int iArraySize, bool bEnable)
virtual bool  | ForwardLMouseDblClickMessagesToParent (CPoint point)
virtual bool  | ForwardLMouseDownMessagesToParent (CPoint point)
bool  | GetDlgItemRect (UINT nID, CRect &rc)
bool  | IsDialogItemEnabled (UINT nItemID) const
bool  | IsResizable ()
bool  | IsRhinoFlagSet (rhino_dialog_flags flag) const
afx_msg int  | OnCreate (LPCREATESTRUCT lpCreateStruct)
afx_msg HBRUSH  | OnCtlColor (CDC *pDC, CWnd *pWnd, UINT nCtlColor)
afx_msg void  | OnDestroy ()
afx_msg void  | OnGetMinMaxInfo (MINMAXINFO *lpMMI)
virtual BOOL32  | OnInitDialog ()
afx_msg void  | OnLButtonDblClk (UINT nFlags, CPoint point)
afx_msg void  | OnLButtonDown (UINT nFlags, CPoint point)
afx_msg LRESULT  | OnNcHitTest (CPoint point)
afx_msg void  | OnPaint ()
afx_msg void  | OnSize (UINT nType, int cx, int cy)
virtual void  | OnUnhandledEscapeAndEnter (UINT nChar)
virtual bool  | OverrideAllowEscapeAndEnter (MSG *msg)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const char *lpsCaption=0, bool bActiveWindow=TRUE)
void  | PaintGradientTitleRect (CDC *pDC, LPRECT lpRect, const wchar_t *lpsCaption=0, bool bActiveWindow=TRUE)
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
void  | RestoreAllDisabledDialogItems ()
int  | RhinoFlags () const
bool  | SetAllowEscapeAndEnter (bool b)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const char *lpsToolTip)
bool  | SetDlgItemToolTip (CWnd *pWndCtrl, const wchar_t *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const char *lpsToolTip)
bool  | SetDlgItemToolTip (UINT nID, const wchar_t *lpsToolTip)
bool  | SetMinSizeToCurrentSize ()
bool  | SetRhinoFlag (rhino_dialog_flags flag, bool b)
int  | SetRhinoFlags (int iFlags)
void  | SetToolTipOwner (CWnd *pWnd)
Ported from CRhinoUiDialog. More...
 Public Attributes
bool  | m_allow_auto_resize
CRhinoUiLocalizeDialog  | m_localize
For internal use only. More...
CRhinoUiDialogItemResizer  | m_Resize
 Protected Member Functions
bool  | _SetDlgItemToolTip (CWnd *pWndCtrl, LPCTSTR lpsToolTip)
void  | Construct ()
virtual void  | DoDataExchange (CDataExchange *pDX)
DDX/DDV support. More...
BOOL32  | RhCreateDlgIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (HGLOBAL hDialogTemplate, CWnd *pParentWnd, HINSTANCE hInst)
BOOL32  | RhCreateIndirect (LPCDLGTEMPLATE lpDialogTemplate, CWnd *pParentWnd, void *lpDialogInit, HINSTANCE hInst)
INT_PTR  | RhDoModal ()
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
bool  | m_activate_tool_tip
bool  | m_allow_escape_and_enter
bool  | m_bAddResizer
UUID  | m_plugin_id
CRect  | m_rcGripper
CRect  | m_rcPage
int  | m_rhino_flags
CSize  | m_sizeGripper
CSize  | m_sizeMax
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
CSize  | m_sizeMin
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead. More...
UINT  | m_template_name_id
CString  | m_template_name_string
CToolTipCtrl  | m_tool_tip
CWnd *  | m_tool_tip_owner
 Friends
class  | CRhinoUiDialogItemResizer
class  | CRhinoUiLocalizeDialog
Detailed Description
CRhinoUiDialog dialog.
Member Enumeration Documentation
◆ rhino_dialog_flags
 enum CRhinoUiDialog::rhino_dialog_flags
Reserved for future use.
Enumerator
is_dockbar_dialog
If you are a dialog that will be embedded in a docking windows, set this flag in our dialog's constructor.
force_32bit_rhino_flag
for internal use only, this allows adding additional values without breaking the SDK in the future
Constructor & Destructor Documentation
◆ CRhinoUiDialog() [1/2]
 CRhinoUiDialog::CRhinoUiDialog  |  ( |  LPCTSTR  |  lpszTemplateName = NULL,
|  CWnd *  |  pParentWnd = NULL
)
Description: Constructors
Parameters: lpszTemplateName [in] Contains a null-terminated string that is the name of a dialog-box template resource. nIDTemplate [in] Contains the identifier of a dialog-box template resource. pParentWnd [in] Pointer to the parent or owner window object of type CWnd to which the dialog object belongs. If it is NULL, the dialog object parent window is set to the main application window. See Also: CDialog
◆ CRhinoUiDialog() [2/2]
 CRhinoUiDialog::CRhinoUiDialog  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
◆ ~CRhinoUiDialog()
 virtual CRhinoUiDialog::~CRhinoUiDialog  |  ( |   | )
virtual
Description: Destructor
Member Function Documentation
◆ _SetDlgItemToolTip()
 bool CRhinoUiDialog::_SetDlgItemToolTip  |  ( |  CWnd *  |  pWndCtrl,
|  LPCTSTR  |  lpsToolTip
)
protected
◆ AddResizeControl()
 bool CRhinoUiDialog::AddResizeControl  |  ( |  bool  |  b | )
◆ AllowEscapeAndEnter()
 bool CRhinoUiDialog::AllowEscapeAndEnter  |  ( |   | ) |   const
Description: If true allow escape and enter keys to close dialog box. The default value allows escape and enter keys to close the dialog. Use SetAllowEscapeAndEnter( false) to change the default.
Returns: If true escape and enter keys will close the dialog
See Also: CRhinoUiDialog::SetAllowEscapeAndEnter()
◆ CallOnUpdateUi()
 void CRhinoUiDialog::CallOnUpdateUi  |  ( |   | )
◆ Construct()
 void CRhinoUiDialog::Construct  |  ( |   | )
protected
◆ Create() [1/2]
 virtual BOOL32 CRhinoUiDialog::Create  |  ( |  LPCTSTR  |  lpszTemplateName,
|  CWnd *  |  pParentWnd = NULL
)
virtual
Modeless construct.
Reimplemented in CRhinoDialog.
◆ Create() [2/2]
 virtual BOOL32 CRhinoUiDialog::Create  |  ( |  UINT  |  nIDTemplate,
|  CWnd *  |  pParentWnd = NULL
)
virtual
Reimplemented in CRhinoDialog.
◆ CreateIndirect() [1/2]
 virtual BOOL32 CRhinoUiDialog::CreateIndirect  |  ( |  HGLOBAL  |  hDialogTemplate,
|  CWnd *  |  pParentWnd = NULL
)
virtual
◆ CreateIndirect() [2/2]
 virtual BOOL32 CRhinoUiDialog::CreateIndirect  |  ( |  LPCDLGTEMPLATE  |  lpDialogTemplate,
|  CWnd *  |  pParentWnd = NULL,
|  void *  |  lpDialogInit = NULL
)
virtual
◆ DialogModuleState()
 AFX_MODULE_STATE* CRhinoUiDialog::DialogModuleState  |  ( |   | )
Description: Return the module state that was current when this dialog object was created.
Returns: Return the module state that was current when this dialog object was created.
◆ DialogTemplateID()
 UINT CRhinoUiDialog::DialogTemplateID  |  ( |   | ) |   const
Description: Template ID passed to dialog constructor.
Returns: Return template ID passed to dialog constructor.
See Also: CRhinoUiDialog::CRhinoUiDialog()
◆ DialogTemplateName()
 LPCTSTR CRhinoUiDialog::DialogTemplateName  |  ( |   | ) |   const
Description: Template name passed to dialog constructor.
Returns: Return template name passed to dialog constructor.
See Also: CRhinoUiDialog::CRhinoUiDialog()
◆ DisableAllDialogItems()
 void CRhinoUiDialog::DisableAllDialogItems  |  ( |   | )
Description: Call this method to temporarily disable every control in this dialog. Prior to disabling a control the controls enabled state is pushed to a restore list. The control enabed state list is used by the RestoreAllDisabledDialogItems() method to return the controls to there original state.
See Also: CRhinoUiDialog::RestoreAllDisabledDialogItems()
◆ DoDataExchange()
 virtual void CRhinoUiDialog::DoDataExchange  |  ( |  CDataExchange *  |  pDX | )
protectedvirtual
DDX/DDV support.
Reimplemented in CRhinoDialog, CRhinoUiTabCtrlPage, CRhinoPrintControlsBase, and CRhinoUiDockBarDialog.
◆ DoModal()
 INT_PTR CRhinoUiDialog::DoModal  |  ( |   | )
◆ EnableAllDlgControls()
 void CRhinoUiDialog::EnableAllDlgControls  |  ( |  bool  |  bEnable | )
Description: Call this method to enable or disable every control in this dialog.
◆ EnableDialogItem()
 bool CRhinoUiDialog::EnableDialogItem  |  ( |  UINT  |  nItemID,
|  bool  |  bEnable
)
Description: Retrieves a pointer to the specified control or child window in this dialog box and enables or disables the control window based on the value of the bEnable argument.
Parameters: nItemID [in] Specifies the identifier of the control to be enabled or disabled bEnable [in] Specifies whether to enable or disable the window. If this parameter is true, the window is enabled. If the parameter is false, the window is disabled.
Returns: Returns true if nItemID is a valid control identifier otherwise returns false.
See Also: CRhinoUiDialog::EnableDialogItems() CRhinoUiDialog::IsDialogItemEnabled()
◆ EnableDialogItems() [1/2]
 int CRhinoUiDialog::EnableDialogItems  |  ( |  CUIntArray &  |  nItemIDArray,
|  bool  |  bEnable
)
Description: Retrieves a pointer to the specified controls or child windows in this dialog box and enables or disables the control windows based on the value of the bEnable argument.
Parameters: nItemID [in] Specifies the identifiers of the controls to be enabled or disabled. bEnable [in] Specifies whether to enable or disable the windows. If this parameter is true, the windows are enabled. If the parameter is false, the windows are disabled.
Returns: Returns true if nItemID is a valid control identifier otherwise returns false.
See Also: CRhinoUiDialog::EnableDialogItem() CRhinoUiDialog::IsDialogItemEnabled()
◆ EnableDialogItems() [2/2]
 int CRhinoUiDialog::EnableDialogItems  |  ( |  UINT *  |  nItemIDArray,
|  int  |  iArraySize,
|  bool  |  bEnable
)
Description: Retrieves a pointer to the specified controls or child windows in this dialog box and enables or disables the control windows based on the value of the bEnable argument.
Parameters: nItemID [in] Specifies the identifiers of the controls to be enabled or disabled. iArraySize [in] Specifies the size of the nItemID array. bEnable [in] Specifies whether to enable or disable the windows. If this parameter is true, the windows are enabled. If the parameter is false, the windows are disabled.
Returns: Returns true if nItemID is a valid control identifier otherwise returns false.
See Also: CRhinoUiDialog::EnableDialogItem() CRhinoUiDialog::IsDialogItemEnabled()
◆ ForwardLMouseDblClickMessagesToParent()
 virtual bool CRhinoUiDialog::ForwardLMouseDblClickMessagesToParent  |  ( |  CPoint  |  point | )
virtual
Description: When the left mouse button is double clicked on the client area but not down on a control the dialog can forward the message to its parent window. You would want to do this if you dialog was modless and embedded in a container that handles mouse down events.
Parameters: point [in] Specifies the x- and y-coordinate of the cursor. These coordinates are always relative to the upper-left corner of the window.
Returns: The default behavior is to return false. To change this you will need to derive a new class from this one and override this method.
See Also: CRhinoUiDialog::ForwardLMouseDownMessagesToParent()
Reimplemented in CRhinoUiDockBarClientExpandableTabPage, CRhinoUiModelessDockingDialog, and CRhinoUiDockBarDialog.
◆ ForwardLMouseDownMessagesToParent()
 virtual bool CRhinoUiDialog::ForwardLMouseDownMessagesToParent  |  ( |  CPoint  |  point | )
virtual
Description: When the left mouse button goes down over client area of the dialog but not down on a control the dialog can forward the message to its parent window. You would want to do this if you dialog was modless and embedded in a container that handles mouse down events.
Parameters: point [in] Specifies the x- and y-coordinate of the cursor. These coordinates are always relative to the upper-left corner of the window.
Returns: The default behavior is to return false. To change this you will need to derive a new class from this one and override this method.
See Also: CRhinoUiDialog::ForwardLMouseDblClickMessagesToParent()
Reimplemented in CRhinoUiDockBarClientExpandableTabPage, CRhinoUiModelessDockingDialog, and CRhinoUiDockBarDialog.
◆ GetDlgItemRect()
 bool CRhinoUiDialog::GetDlgItemRect  |  ( |  UINT  |  nID,
|  CRect &  |  rc
)
◆ IsDialogItemEnabled()
 bool CRhinoUiDialog::IsDialogItemEnabled  |  ( |  UINT  |  nItemID | ) |   const
Description: Retrieves a pointer to the specified control or child window in this dialog box returns true if it found and is enabled or false if the control is not found or the enabled. value of the bEnable argument.
Parameters: nItemID [in] Specifies the identifier of the control to check.
Returns: Returns true if nItemID is a valid control identifier and is enabled otherwise returns false.
See Also: CRhinoUiDialog::EnableDialogItems() CRhinoUiDialog::EnableDialogItem()
◆ IsResizable()
 bool CRhinoUiDialog::IsResizable  |  ( |   | )
◆ IsRhinoFlagSet()
 bool CRhinoUiDialog::IsRhinoFlagSet  |  ( |  rhino_dialog_flags  |  flag | ) |   const
Description: Call this method to determine if a flag is currently set.
Parameters: flag [in] Specifies the identifier of the flag to check.
Returns: Returns true if the flag is set otherwise returns false.
See Also: CRhinoUiDialog::SetRhinoFlags() CRhinoUiDialog::RhinoFlags() CRhinoUiDialog::SetRhinoFlag()
◆ OnCreate()
 afx_msg int CRhinoUiDialog::OnCreate  |  ( |  LPCREATESTRUCT  |  lpCreateStruct | )
◆ OnCtlColor()
 afx_msg HBRUSH CRhinoUiDialog::OnCtlColor  |  ( |  CDC *  |  pDC,
|  CWnd *  |  pWnd,
|  UINT  |  nCtlColor
)
◆ OnDestroy()
 afx_msg void CRhinoUiDialog::OnDestroy  |  ( |   | )
◆ OnGetMinMaxInfo()
 afx_msg void CRhinoUiDialog::OnGetMinMaxInfo  |  ( |  MINMAXINFO *  |  lpMMI | )
◆ OnInitDialog()
 virtual BOOL32 CRhinoUiDialog::OnInitDialog  |  ( |   | )
virtual
Reimplemented in CRhinoTabbedDockBarDialog, CRhinoDialog, CRhRdkResizingDialog, CRhinoUiExpandableTabPage, CRhinoPrintControlsBase, and CRhinoUiModelessDockingDialog.
◆ OnLButtonDblClk()
 afx_msg void CRhinoUiDialog::OnLButtonDblClk  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnLButtonDown()
 afx_msg void CRhinoUiDialog::OnLButtonDown  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnNcHitTest()
 afx_msg LRESULT CRhinoUiDialog::OnNcHitTest  |  ( |  CPoint  |  point | )
◆ OnPaint()
 afx_msg void CRhinoUiDialog::OnPaint  |  ( |   | )
◆ OnSize()
 afx_msg void CRhinoUiDialog::OnSize  |  ( |  UINT  |  nType,
|  int  |  cx,
|  int  |  cy
)
◆ OnUnhandledEscapeAndEnter()
 virtual void CRhinoUiDialog::OnUnhandledEscapeAndEnter  |  ( |  UINT  |  nChar | )
virtual
Description: If AllowEscapeAndEnter is set to true, the dialog will not close when these keys are pressed. If there is no control on the dialog that should receive these characters, they are "eaten" by the dailog and nothing happens. This function allows you to perform some action when in the case where the enter and escape would be "eaten".
Parameters: nChar [in] either VK_ESCAPE or VK_RETURN
See Also: CRhinoUiDialog::AllowEscapeAndEnter() CRhinoUiDialog::SetAllowEscapeAndEnter( bool b)
Reimplemented in CRhinoUiModelessDockingDialog.
◆ OverrideAllowEscapeAndEnter()
 virtual bool CRhinoUiDialog::OverrideAllowEscapeAndEnter  |  ( |  MSG *  |  msg | )
virtual
Description: Override this method to allow the escape and enter keys to get forwarded to multi-line controls like rich text boxes in hosted user controls.
Parameters: msg [in] Value passed to CRhinoUiDialog::PreTranslate message. Look at msg->wParam to see if it is equal to VK_ENTER or VK_ESCAPE. msg->hWnd Will contain the window handle of the target control.
Returns: true Disregard the AllowEscapeAndEnter() and forward the message. false Go ahead and suppress the message.
See Also: CRhinoUiDialog::AllowEscapeAndEnter() CRhinoUiDialog::SetAllowEscapeAndEnter( bool b)
◆ PaintGradientTitleRect() [1/2]
 void CRhinoUiDialog::PaintGradientTitleRect  |  ( |  CDC *  |  pDC,
|  LPRECT  |  lpRect,
|  const char *  |  lpsCaption = 0,
|  bool  |  bActiveWindow = TRUE
)
If Windows supports gradient window captions and they are enabled then gradient fill the specified rectangle otherwise solid fill it. If lpsCaption points to a string then paint it left justified and vertically center justified.
◆ PaintGradientTitleRect() [2/2]
 void CRhinoUiDialog::PaintGradientTitleRect  |  ( |  CDC *  |  pDC,
|  LPRECT  |  lpRect,
|  const wchar_t *  |  lpsCaption = 0,
|  bool  |  bActiveWindow = TRUE
)
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiDialog::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
Reimplemented in CRhinoTabbedDockBarDialog, CRhinoDialog, and CRhinoUiModelessDockingDialog.
◆ RestoreAllDisabledDialogItems()
 void CRhinoUiDialog::RestoreAllDisabledDialogItems  |  ( |   | )
Description: Call this method to return dialog controls to there original enabled state. This method will only do something if DisableAllDialogItems() was previously called.
See Also: CRhinoUiDialog::DisableAllDialogItems()
◆ RhCreateDlgIndirect()
 BOOL32 CRhinoUiDialog::RhCreateDlgIndirect  |  ( |  LPCDLGTEMPLATE  |  lpDialogTemplate,
|  CWnd *  |  pParentWnd,
|  HINSTANCE  |  hInst
)
protected
◆ RhCreateIndirect() [1/2]
 BOOL32 CRhinoUiDialog::RhCreateIndirect  |  ( |  HGLOBAL  |  hDialogTemplate,
|  CWnd *  |  pParentWnd,
|  HINSTANCE  |  hInst
)
protected
◆ RhCreateIndirect() [2/2]
 BOOL32 CRhinoUiDialog::RhCreateIndirect  |  ( |  LPCDLGTEMPLATE  |  lpDialogTemplate,
|  CWnd *  |  pParentWnd,
|  void *  |  lpDialogInit,
|  HINSTANCE  |  hInst
)
protected
◆ RhDoModal()
 INT_PTR CRhinoUiDialog::RhDoModal  |  ( |   | )
protected
◆ RhinoFlags()
 int CRhinoUiDialog::RhinoFlags  |  ( |   | ) |   const
Description: Call this method to get the current flag settings. This is provided as a way of adding functionality to this class without breaking the sdk.
Returns: Returns current flags value
See Also: CRhinoUiDialog::SetRhinoFlags() CRhinoUiDialog::IsRhinoFlagSet() CRhinoUiDialog::SetRhinoFlag()
◆ SetAllowEscapeAndEnter()
 bool CRhinoUiDialog::SetAllowEscapeAndEnter  |  ( |  bool  |  b | )
Description: Set this to true if you do not want the escape and enter keys to close this dialog. You will want to do this when embedding a modless dialog in a control bar.
Parameters: b [in] If true then escape and enter keys will close the dialog box otherwise nothing will happen when these keys are pressed.
Returns: Previous value for AllowEscapeAndEnter()
See Also: CRhinoUiDialog::AllowEscapeAndEnter()
◆ SetDlgItemToolTip() [1/4]
 bool CRhinoUiDialog::SetDlgItemToolTip  |  ( |  CWnd *  |  pWndCtrl,
|  const char *  |  lpsToolTip
)
◆ SetDlgItemToolTip() [2/4]
 bool CRhinoUiDialog::SetDlgItemToolTip  |  ( |  CWnd *  |  pWndCtrl,
|  const wchar_t *  |  lpsToolTip
)
◆ SetDlgItemToolTip() [3/4]
 bool CRhinoUiDialog::SetDlgItemToolTip  |  ( |  UINT  |  nID,
|  const char *  |  lpsToolTip
)
◆ SetDlgItemToolTip() [4/4]
 bool CRhinoUiDialog::SetDlgItemToolTip  |  ( |  UINT  |  nID,
|  const wchar_t *  |  lpsToolTip
)
◆ SetMinSizeToCurrentSize()
 bool CRhinoUiDialog::SetMinSizeToCurrentSize  |  ( |   | )
◆ SetRhinoFlag()
 bool CRhinoUiDialog::SetRhinoFlag  |  ( |  rhino_dialog_flags  |  flag,
|  bool  |  b
)
Description: Call this method to set a specific flag value.
Parameters: flag [in] Flag to set b [in] New value for the flag
Returns: Returns previous value
See Also: CRhinoUiDialog::SetRhinoFlags() CRhinoUiDialog::IsRhinoFlagSet() CRhinoUiDialog::RhinoFlags()
◆ SetRhinoFlags()
 int CRhinoUiDialog::SetRhinoFlags  |  ( |  int  |  iFlags | )
Description: Call this method to set multiple rhino flags.
Parameters: iFlags [in] Specifies the new flags value.
Returns: Returns previous value
See Also: CRhinoUiDialog::RhinoFlags() CRhinoUiDialog::IsRhinoFlagSet() CRhinoUiDialog::SetRhinoFlag()
◆ SetToolTipOwner()
 void CRhinoUiDialog::SetToolTipOwner  |  ( |  CWnd *  |  pWnd | )
Ported from CRhinoUiDialog.
◆ WindowProc()
 virtual LRESULT CRhinoUiDialog::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protectedvirtual
Reimplemented in CRhinoTabbedDockBarDialog, CRhinoDialog, and CRhinoUiModelessDockingDialog.
Friends And Related Function Documentation
◆ CRhinoUiDialogItemResizer
 friend class CRhinoUiDialogItemResizer
friend
◆ CRhinoUiLocalizeDialog
 friend class CRhinoUiLocalizeDialog
friend
Member Data Documentation
◆ m_activate_tool_tip
 bool CRhinoUiDialog::m_activate_tool_tip
protected
◆ m_allow_auto_resize
 bool CRhinoUiDialog::m_allow_auto_resize
◆ m_allow_escape_and_enter
 bool CRhinoUiDialog::m_allow_escape_and_enter
protected
◆ m_bAddResizer
 bool CRhinoUiDialog::m_bAddResizer
protected
◆ m_localize
 CRhinoUiLocalizeDialog CRhinoUiDialog::m_localize
For internal use only.
◆ m_plugin_id
 UUID CRhinoUiDialog::m_plugin_id
protected
◆ m_rcGripper
 CRect CRhinoUiDialog::m_rcGripper
protected
◆ m_rcPage
 CRect CRhinoUiDialog::m_rcPage
protected
◆ m_Resize
 CRhinoUiDialogItemResizer CRhinoUiDialog::m_Resize
◆ m_rhino_flags
 int CRhinoUiDialog::m_rhino_flags
protected
◆ m_sizeGripper
 CSize CRhinoUiDialog::m_sizeGripper
protected
◆ m_sizeMax
 CSize CRhinoUiDialog::m_sizeMax
protected
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead.
◆ m_sizeMin
 CSize CRhinoUiDialog::m_sizeMin
protected
Defaults to 0,0 which means no clamp, if other than 0,0 use this instead.
◆ m_template_name_id
 UINT CRhinoUiDialog::m_template_name_id
protected
◆ m_template_name_string
 CString CRhinoUiDialog::m_template_name_string
protected
◆ m_tool_tip
 CToolTipCtrl CRhinoUiDialog::m_tool_tip
protected
◆ m_tool_tip_owner
 CWnd* CRhinoUiDialog::m_tool_tip_owner
protected