Public Types | Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoCurvatureAnalysisSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Types
enum  | { kappa_gaussian, kappa_mean, kappa_minradius, kappa_maxradius }
 Public Member Functions
CRhinoCurvatureAnalysisSettings ()
ON__UINT32  | ColorMappingCRC () const
void  | Defaults ()
const ON_Interval  | HueRangeRadians () const
const ON_SurfaceCurvatureColorMapping  | KappaColors () const
const ON_Interval  | KappaRange () const
Returns
Range of curvatures to map to the hues from red to purple.
 More...
ON::curvature_style  | KappaStyle () const
Returns
Style of curvature being analyzed (Gaussian, mean, ...).
 More...
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
const ON_MappingTag  | MappingTag () const
The curvature vertex color mapping tag is used to mark vertex colors when they are set by curvature color analysis. More...
bool  | operator!= (const CRhinoCurvatureAnalysisSettings &other) const
bool  | operator== (const CRhinoCurvatureAnalysisSettings &other) const
const wchar_t *  | ProfileKey () const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
clamp settings to valid values More...
 Public Attributes
ON_Interval  | m_gauss_range
ON_Interval  | m_maxradius_range
ON_Interval  | m_mean_range
ON_Interval  | m_minradius_range
bool  | m_show_isoparms
enum CRhinoCurvatureAnalysisSettings:: { ... }  | m_style
 Static Public Attributes
static const CRhinoCurvatureAnalysisSettings  | Default
Detailed Description
Member Enumeration Documentation
◆ anonymous enum
 anonymous enum
Enumerator
kappa_gaussian
kappa_mean
kappa_minradius
kappa_maxradius
Constructor & Destructor Documentation
◆ CRhinoCurvatureAnalysisSettings()
 CRhinoCurvatureAnalysisSettings::CRhinoCurvatureAnalysisSettings  |  ( |   | )
Member Function Documentation
◆ ColorMappingCRC()
 ON__UINT32 CRhinoCurvatureAnalysisSettings::ColorMappingCRC  |  ( |   | ) |   const
Returns
The 32 bit CRC of these curvature analysis settings.
◆ Defaults()
 void CRhinoCurvatureAnalysisSettings::Defaults  |  ( |   | )
◆ HueRangeRadians()
 const ON_Interval CRhinoCurvatureAnalysisSettings::HueRangeRadians  |  ( |   | ) |   const
◆ KappaColors()
 const ON_SurfaceCurvatureColorMapping CRhinoCurvatureAnalysisSettings::KappaColors  |  ( |   | ) |   const
◆ KappaRange()
 const ON_Interval CRhinoCurvatureAnalysisSettings::KappaRange  |  ( |   | ) |   const
Returns
Range of curvatures to map to the hues from red to purple.
◆ KappaStyle()
 ON::curvature_style CRhinoCurvatureAnalysisSettings::KappaStyle  |  ( |   | ) |   const
Returns
Style of curvature being analyzed (Gaussian, mean, ...).
◆ LoadProfile()
 void CRhinoCurvatureAnalysisSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ MappingTag()
 const ON_MappingTag CRhinoCurvatureAnalysisSettings::MappingTag  |  ( |   | ) |   const
The curvature vertex color mapping tag is used to mark vertex colors when they are set by curvature color analysis.
Returns
The vertex color mapping tag for these curvature analysis settings.
◆ operator!=()
 bool CRhinoCurvatureAnalysisSettings::operator!=  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  other | ) |   const
◆ operator==()
 bool CRhinoCurvatureAnalysisSettings::operator==  |  ( |  const CRhinoCurvatureAnalysisSettings &  |  other | ) |   const
◆ ProfileKey()
 const wchar_t* CRhinoCurvatureAnalysisSettings::ProfileKey  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoCurvatureAnalysisSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoCurvatureAnalysisSettings::Validate  |  ( |   | )
clamp settings to valid values
Member Data Documentation
◆ Default
 const CRhinoCurvatureAnalysisSettings CRhinoCurvatureAnalysisSettings::Default
static
◆ m_gauss_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_gauss_range
◆ m_maxradius_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_maxradius_range
◆ m_mean_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_mean_range
◆ m_minradius_range
 ON_Interval CRhinoCurvatureAnalysisSettings::m_minradius_range
◆ m_show_isoparms
 bool CRhinoCurvatureAnalysisSettings::m_show_isoparms
◆ m_style
 enum { ... } CRhinoCurvatureAnalysisSettings::m_style