Public Member Functions | Protected Member Functions | Protected Attributes | List of all members
CRhinoUiToolTip Class Reference
RhinoUI
CRhinoUiToolTip. More...
#include <RhinoSdkUiToolTip.h>
 Inheritance diagram for CRhinoUiToolTip:
 Public Member Functions
CRhinoUiToolTip ()
virtual  | ~CRhinoUiToolTip ()
virtual bool  | CreateToolTip (CWnd *pWndParent)
void  | DestroyToolTip ()
bool  | HideOnMouseOver () const
If true then the tool tip will hide itself on a WM_MOUSEMOVE event. More...
afx_msg void  | OnActivateApp (BOOL32 bActive, DWORD dwThreadID)
afx_msg void  | OnDestroy ()
afx_msg void  | OnMouseMove (UINT nFlags, CPoint point)
afx_msg void  | OnPaint ()
virtual BOOL32  | PreTranslateMessage (MSG *pMsg)
bool  | SetHideOnMouseOver (bool b)
void  | SetToolTipBackgroundColor (COLORREF cr)
bool  | SetToolTipText (const wchar_t *lps)
void  | SetToolTipTextColor (COLORREF cr)
virtual bool  | ShowToolTip (bool bShow, LPRECT lpRect)
COLORREF  | ToolTipBackgroundColor () const
const wchar_t *  | ToolTipText () const
COLORREF  | ToolTipTextColor () const
 Protected Member Functions
COLORREF  | DrawBkgrndColor () const
COLORREF  | DrawTextColor () const
void  | PaintBkgrnd (CDC &dc)
virtual bool  | RecalcLayout (CSize &szWindow)
virtual LRESULT  | WindowProc (UINT message, WPARAM wParam, LPARAM lParam)
 Protected Attributes
bool  | m_bDestroyTT
bool  | m_bHideOnMouseOver
bool  | m_bRecalcLayout
COLORREF  | m_crBkgrnd
COLORREF  | m_crText
int  | m_cx
int  | m_cy
HWND  | m_hWndParent
CRect  | m_rTip
CString  | m_sWndCls
CSize  | m_szBorders
ON_wString  | m_wTipText
Detailed Description
CRhinoUiToolTip.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiToolTip()
 CRhinoUiToolTip::CRhinoUiToolTip  |  ( |   | )
◆ ~CRhinoUiToolTip()
 virtual CRhinoUiToolTip::~CRhinoUiToolTip  |  ( |   | )
virtual
Member Function Documentation
◆ CreateToolTip()
 virtual bool CRhinoUiToolTip::CreateToolTip  |  ( |  CWnd *  |  pWndParent | )
virtual
◆ DestroyToolTip()
 void CRhinoUiToolTip::DestroyToolTip  |  ( |   | )
◆ DrawBkgrndColor()
 COLORREF CRhinoUiToolTip::DrawBkgrndColor  |  ( |   | ) |   const
protected
◆ DrawTextColor()
 COLORREF CRhinoUiToolTip::DrawTextColor  |  ( |   | ) |   const
protected
◆ HideOnMouseOver()
 bool CRhinoUiToolTip::HideOnMouseOver  |  ( |   | ) |   const
If true then the tool tip will hide itself on a WM_MOUSEMOVE event.
◆ OnActivateApp()
 afx_msg void CRhinoUiToolTip::OnActivateApp  |  ( |  BOOL32  |  bActive,
|  DWORD  |  dwThreadID
)
◆ OnDestroy()
 afx_msg void CRhinoUiToolTip::OnDestroy  |  ( |   | )
◆ OnMouseMove()
 afx_msg void CRhinoUiToolTip::OnMouseMove  |  ( |  UINT  |  nFlags,
|  CPoint  |  point
)
◆ OnPaint()
 afx_msg void CRhinoUiToolTip::OnPaint  |  ( |   | )
◆ PaintBkgrnd()
 void CRhinoUiToolTip::PaintBkgrnd  |  ( |  CDC &  |  dc | )
protected
◆ PreTranslateMessage()
 virtual BOOL32 CRhinoUiToolTip::PreTranslateMessage  |  ( |  MSG *  |  pMsg | )
virtual
◆ RecalcLayout()
 virtual bool CRhinoUiToolTip::RecalcLayout  |  ( |  CSize &  |  szWindow | )
protectedvirtual
◆ SetHideOnMouseOver()
 bool CRhinoUiToolTip::SetHideOnMouseOver  |  ( |  bool  |  b | )
◆ SetToolTipBackgroundColor()
 void CRhinoUiToolTip::SetToolTipBackgroundColor  |  ( |  COLORREF  |  cr | )
If CRhinoUiPaintManager::unset_color passed for color value then GetSysColor( COLOR_INFOBK) is used
◆ SetToolTipText()
 bool CRhinoUiToolTip::SetToolTipText  |  ( |  const wchar_t *  |  lps | )
◆ SetToolTipTextColor()
 void CRhinoUiToolTip::SetToolTipTextColor  |  ( |  COLORREF  |  cr | )
If CRhinoUiPaintManager::unset_color passed for color value then GetSysColor( COLOR_INFOTEXT) is used
◆ ShowToolTip()
 virtual bool CRhinoUiToolTip::ShowToolTip  |  ( |  bool  |  bShow,
|  LPRECT  |  lpRect
)
virtual
◆ ToolTipBackgroundColor()
 COLORREF CRhinoUiToolTip::ToolTipBackgroundColor  |  ( |   | ) |   const
If CRhinoUiPaintManager::unset_color is returned then GetSysColor( COLOR_INFOBK) is used
◆ ToolTipText()
 const wchar_t* CRhinoUiToolTip::ToolTipText  |  ( |   | ) |   const
◆ ToolTipTextColor()
 COLORREF CRhinoUiToolTip::ToolTipTextColor  |  ( |   | ) |   const
If CRhinoUiPaintManager::unset_color is returned then GetSysColor( COLOR_INFOTEXT) is used
◆ WindowProc()
 virtual LRESULT CRhinoUiToolTip::WindowProc  |  ( |  UINT  |  message,
|  WPARAM  |  wParam,
|  LPARAM  |  lParam
)
protectedvirtual
Member Data Documentation
◆ m_bDestroyTT
 bool CRhinoUiToolTip::m_bDestroyTT
protected
◆ m_bHideOnMouseOver
 bool CRhinoUiToolTip::m_bHideOnMouseOver
protected
◆ m_bRecalcLayout
 bool CRhinoUiToolTip::m_bRecalcLayout
protected
◆ m_crBkgrnd
 COLORREF CRhinoUiToolTip::m_crBkgrnd
protected
◆ m_crText
 COLORREF CRhinoUiToolTip::m_crText
protected
◆ m_cx
 int CRhinoUiToolTip::m_cx
protected
◆ m_cy
 int CRhinoUiToolTip::m_cy
protected
◆ m_hWndParent
 HWND CRhinoUiToolTip::m_hWndParent
protected
◆ m_rTip
 CRect CRhinoUiToolTip::m_rTip
protected
◆ m_sWndCls
 CString CRhinoUiToolTip::m_sWndCls
protected
◆ m_szBorders
 CSize CRhinoUiToolTip::m_szBorders
protected
◆ m_wTipText
 ON_wString CRhinoUiToolTip::m_wTipText
protected