Public Member Functions | Static Public Member Functions | List of all members
CRhinoZBuffer Class Reference
Rhino
#include <RhinoSdkDisplayPipeline_OGL.h>
 Public Member Functions
CRhinoZBuffer ()
Assumes active viewport projection... More...
CRhinoZBuffer (const CRhinoViewport &)
Uses passed in viewport projection... More...
~CRhinoZBuffer ()
const float *  | Array ()
bool  | Capture ()
bool  | Capture (const ON_4iRect &)
const ON_4iRect &  | CaptureRect ()
Returns the current capture rect (area)... More...
void  | EnableGroundPlane (bool)
void  | EnableShading (bool)
const CRhinoDib &  | GrayscaleDib ()
int  | Height ()
int  | HitCount ()
float  | MaxZ ()
float  | MinZ ()
capture area... More...
void  | Reset ()
const CRhinoViewport *  | RhinoVP ()
void  | SetCaptureRect (const ON_4iRect &)
Defines the capture area... More...
void  | SetDisplayMode (const ON_UUID &dmid)
void  | SetProjection (const CRhinoViewport &)
Resets zbuffer with viewport projection... More...
void  | ShowAnnotations (bool)
void  | ShowClippingPlanes (bool)
void  | ShowCurves (bool)
void  | ShowGrips (bool)
void  | ShowIsocurves (bool)
void  | ShowLights (bool)
void  | ShowMeshWires (bool)
void  | ShowPoints (bool)
void  | ShowText (bool)
int  | Size ()
const ON_Viewport &  | VP ()
int  | Width ()
const ON_3dPoint &  | WorldPoint (int x, int y)
Retrieves zbuffer value at (x,y) in world coordinates... More...
float  | ZValue (int x, int y)
capture area... More...
float  | ZValueMax (int x, int y, int r)
float  | ZValueMin (int x, int y, int r)
void  | ZValueMinMax (int x, int y, int r, float &min_z, float &max_z)
 Static Public Member Functions
static bool  | Capturing (void)
Constructor & Destructor Documentation
◆ CRhinoZBuffer() [1/2]
 CRhinoZBuffer::CRhinoZBuffer  |  ( |   | )
Assumes active viewport projection...
◆ CRhinoZBuffer() [2/2]
 CRhinoZBuffer::CRhinoZBuffer  |  ( |  const CRhinoViewport &  |   | )
Uses passed in viewport projection...
◆ ~CRhinoZBuffer()
 CRhinoZBuffer::~CRhinoZBuffer  |  ( |   | )
Member Function Documentation
◆ Array()
 const float* CRhinoZBuffer::Array  |  ( |   | )
◆ Capture() [1/2]
 bool CRhinoZBuffer::Capture  |  ( |   | )
◆ Capture() [2/2]
 bool CRhinoZBuffer::Capture  |  ( |  const ON_4iRect &  |   | )
◆ CaptureRect()
 const ON_4iRect& CRhinoZBuffer::CaptureRect  |  ( |   | )
Returns the current capture rect (area)...
Note: This may not be the same as the capture area height...
◆ Capturing()
 static bool CRhinoZBuffer::Capturing  |  ( |  void  |   | )
static
◆ EnableGroundPlane()
 void CRhinoZBuffer::EnableGroundPlane  |  ( |  bool  |   | )
◆ EnableShading()
 void CRhinoZBuffer::EnableShading  |  ( |  bool  |   | )
◆ GrayscaleDib()
 const CRhinoDib& CRhinoZBuffer::GrayscaleDib  |  ( |   | )
Retrieves the zbuffer in the form of a grayscale
◆ Height()
 int CRhinoZBuffer::Height  |  ( |   | )
Note: This may not be the same as the capture area width... Returns the height of the entire ZBuffer...
◆ HitCount()
 int CRhinoZBuffer::HitCount  |  ( |   | )
Returns the number of points within the capture
◆ MaxZ()
 float CRhinoZBuffer::MaxZ  |  ( |   | )
area that contain z values that don't fall on the near or far clipping planes... Returns maximum Z value that's < 1.0 within the
◆ MinZ()
 float CRhinoZBuffer::MinZ  |  ( |   | )
capture area...
Returns minimum Z value that's > 0.0 within the
◆ Reset()
 void CRhinoZBuffer::Reset  |  ( |   | )
◆ RhinoVP()
 const CRhinoViewport* CRhinoZBuffer::RhinoVP  |  ( |   | )
dib (bitmap) with increasing Z values converging to black (0)...
◆ SetCaptureRect()
 void CRhinoZBuffer::SetCaptureRect  |  ( |  const ON_4iRect &  |   | )
Defines the capture area...
◆ SetDisplayMode()
 void CRhinoZBuffer::SetDisplayMode  |  ( |  const ON_UUID &  |  dmid | )
Sets display mode used in creating zbuffer... This also resets the display attributes to the ones found in the display mode...
◆ SetProjection()
 void CRhinoZBuffer::SetProjection  |  ( |  const CRhinoViewport &  |   | )
Resets zbuffer with viewport projection...
◆ ShowAnnotations()
 void CRhinoZBuffer::ShowAnnotations  |  ( |  bool  |   | )
◆ ShowClippingPlanes()
 void CRhinoZBuffer::ShowClippingPlanes  |  ( |  bool  |   | )
◆ ShowCurves()
 void CRhinoZBuffer::ShowCurves  |  ( |  bool  |   | )
◆ ShowGrips()
 void CRhinoZBuffer::ShowGrips  |  ( |  bool  |   | )
◆ ShowIsocurves()
 void CRhinoZBuffer::ShowIsocurves  |  ( |  bool  |   | )
◆ ShowLights()
 void CRhinoZBuffer::ShowLights  |  ( |  bool  |   | )
◆ ShowMeshWires()
 void CRhinoZBuffer::ShowMeshWires  |  ( |  bool  |   | )
◆ ShowPoints()
 void CRhinoZBuffer::ShowPoints  |  ( |  bool  |   | )
◆ ShowText()
 void CRhinoZBuffer::ShowText  |  ( |  bool  |   | )
◆ Size()
 int CRhinoZBuffer::Size  |  ( |   | )
◆ VP()
 const ON_Viewport& CRhinoZBuffer::VP  |  ( |   | )
◆ Width()
 int CRhinoZBuffer::Width  |  ( |   | )
Returns the width of the entire ZBuffer...
◆ WorldPoint()
 const ON_3dPoint& CRhinoZBuffer::WorldPoint  |  ( |  int  |  x,
|  int  |  y
)
Retrieves zbuffer value at (x,y) in world coordinates...
Retrieves the smallest and largest (i.e. closest and most distant) Z value within a square of radius 'r' centered at (x, y).
◆ ZValue()
 float CRhinoZBuffer::ZValue  |  ( |  int  |  x,
|  int  |  y
)
capture area...
Retrieves the raw zbuffer value at (x,y)...
◆ ZValueMax()
 float CRhinoZBuffer::ZValueMax  |  ( |  int  |  x,
|  int  |  y,
|  int  |  r
)
Retrieves the largest (i.e. most distant) Z value within a square of radius 'r' centered at (x, y).
◆ ZValueMin()
 float CRhinoZBuffer::ZValueMin  |  ( |  int  |  x,
|  int  |  y,
|  int  |  r
)
Retrieves the smallest (i.e. closest) Z value within a square of radius 'r' centered at (x, y).
◆ ZValueMinMax()
 void CRhinoZBuffer::ZValueMinMax  |  ( |  int  |  x,
|  int  |  y,
|  int  |  r,
|  float &  |  min_z,
|  float &  |  max_z
)