Public Member Functions | List of all members
CRhRdkSunStorage Class Referenceabstract
RDK
#include <RhRdkSunStorage.h>
 Inheritance diagram for CRhRdkSunStorage:
 Public Member Functions
virtual void  | _InternalSetAziAlt (double, double) override
virtual double  | Altitude (void) const override
virtual double  | Azimuth (void) const override
virtual void  | BeginNotifyBracket (void) override
virtual void  | CopyFromStorage (const CRhRdkSunStorage &s)=0
virtual int  | DaylightSavingMinutes (void) const override
virtual bool  | DaylightSavingOn (void) const override
virtual bool  | EnableAllowed (void) const override
virtual bool  | EnableOn (void) const override
virtual void  | EndNotifyBracket (void) override
virtual void *  | EVF (const wchar_t *, void *) override
virtual void  | HandleNotify (void)
virtual double  | Latitude (void) const override
virtual bool  | LoadFromFile (const wchar_t *wszFullPath) override=0
virtual void  | LocalDateTime (int &iYearOut, int &iMonthOut, int &iDayOut, double &dHoursOut) const override
virtual double  | Longitude (void) const override
virtual bool  | ManualControlAllowed (void) const override
virtual bool  | ManualControlOn (void) const override
virtual double  | North (void) const override
virtual bool  | SaveToFile (const wchar_t *wszFullPath) const override=0
virtual void  | SetAltitude (double dAltitude) override
virtual void  | SetAziAlt (double dAzi, double dAlt) const =0
virtual void  | SetAzimuth (double dAzimuth) override
virtual void  | SetDaylightSavingMinutes (int iMinutes) override
virtual void  | SetDaylightSavingOn (bool bOn) override
virtual void  | SetEnableAllowed (bool bOn) override
virtual void  | SetEnableOn (bool bOn) override
virtual void  | SetLatitude (double dLatitude) override
virtual void  | SetLocalDateTime (int iYear, int iMonth, int iDay, double dHours) override
virtual void  | SetLongitude (double dLongitude) override
virtual void  | SetManualControlAllowed (bool bEnabled) override
virtual void  | SetManualControlOn (bool bOn) override
virtual void  | SetNorth (double dNorth) override
virtual void  | SetShadowIntensity (double dIntensity) override
virtual void  | SetTimeZone (double dHours) override
virtual void  | SetTimeZone (double dHours, bool bAutoAdjustTime)
virtual void  | SetUTCDateTime (int iYear, int iMonth, int iDay, double dHours) override
virtual bool  | SetValue (const wchar_t *wszName, const CRhRdkVariant &v)=0
virtual double  | ShadowIntensity (void) const override
virtual double  | TimeZone (void) const override
void  | ToSun (class IRhRdkSun &sun) const
virtual void  | UTCDateTime (int &iYearOut, int &iMonthOut, int &iDayOut, double &dHoursOut) const override
virtual CRhRdkVariant  | Value (const wchar_t *wszName, const CRhRdkVariant &vDefault) const =0
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkSun
virtual  | ~IRhRdkSun ()
virtual IRhRdkSun &  | BeginChange (RhRdkChangeContext cc) const =0
virtual void  | CopyFrom (const IRhRdkSun &other)=0
virtual bool  | Edit (void)=0
virtual bool  | EndChange (void)=0
virtual bool  | ReadFromArchive (ON_BinaryArchive &archive)=0
virtual_su void  | SetIntensity (double dIntensity)
virtual void  | SetVector (const ON_3dVector &v)=0
virtual bool  | WriteToArchive (ON_BinaryArchive &archive) const =0
 Public Member Functions inherited from IRhRdkSunRO
virtual DWORD  | CRC (void) const =0
virtual_su double  | Intensity (void) const
virtual bool  | IsEqual (const class IRhRdkSun &other) const =0
virtual bool  | IsValid (void) const =0
virtual ON_Light  | Light (void) const =0
virtual ON_3dVector  | Vector (void) const =0
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Static Public Member Functions inherited from IRhRdkSun
static IRhRdkSun *  | New (void)
 Protected Member Functions inherited from IRhRdkSunRO
virtual  | ~IRhRdkSunRO ()
Detailed Description
This class is deprecated and only here to avoid breaking the SDK.
None of the methods are implemented since it's almost certain that no 3rd-party was using this class.
Member Function Documentation
◆ _InternalSetAziAlt()
 virtual void CRhRdkSunStorage::_InternalSetAziAlt  |  ( |  double  |  ,
|  double
)
overridevirtual
Implements IRhRdkSun.
◆ Altitude()
 virtual double CRhRdkSunStorage::Altitude  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The altitude of the sun in degrees.
Implements IRhRdkSunRO.
◆ Azimuth()
 virtual double CRhRdkSunStorage::Azimuth  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The azimuth of the sun in degrees. The value increases Eastwards with North as zero.
Note
This value is not affected by the direction of north.
See also
North()
Implements IRhRdkSunRO.
◆ BeginNotifyBracket()
 virtual void CRhRdkSunStorage::BeginNotifyBracket  |  ( |  void  |   | )
overridevirtual
Call this before doing multiple 'Set' operations.
Implements IRhRdkSun.
◆ CopyFromStorage()
 virtual void CRhRdkSunStorage::CopyFromStorage  |  ( |  const CRhRdkSunStorage &  |  s | )
pure virtual
◆ DaylightSavingMinutes()
 virtual int CRhRdkSunStorage::DaylightSavingMinutes  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The daylight saving of the observer in minutes.
Implements IRhRdkSunRO.
◆ DaylightSavingOn()
 virtual bool CRhRdkSunStorage::DaylightSavingOn  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if daylight saving is on, else false.
Implements IRhRdkSunRO.
◆ EnableAllowed()
 virtual bool CRhRdkSunStorage::EnableAllowed  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if enabling/disabling the sun is allowed, else false.
Implements IRhRdkSunRO.
◆ EnableOn()
 virtual bool CRhRdkSunStorage::EnableOn  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the sun is enabled, else false.
Implements IRhRdkSunRO.
◆ EndNotifyBracket()
 virtual void CRhRdkSunStorage::EndNotifyBracket  |  ( |  void  |   | )
overridevirtual
Call this after doing multiple 'Set' operations.
Implements IRhRdkSun.
◆ EVF()
 virtual void* CRhRdkSunStorage::EVF  |  ( |  const wchar_t *  |  wszFunc,
|  void *  |  pvData
)
overridevirtual
Emergency virtual function for future expansion.
Reimplemented from CRhRdkObject.
◆ HandleNotify()
 virtual void CRhRdkSunStorage::HandleNotify  |  ( |  void  |   | )
virtual
◆ Latitude()
 virtual double CRhRdkSunStorage::Latitude  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The latitude of the observer.
Implements IRhRdkSunRO.
◆ LoadFromFile()
 virtual bool CRhRdkSunStorage::LoadFromFile  |  ( |  const wchar_t *  |  wszFullPath | )
overridepure virtual
Load the sun from a file.
Implements IRhRdkSun.
◆ LocalDateTime()
 virtual void CRhRdkSunStorage::LocalDateTime  |  ( |  int &  |  iYearOut,
|  int &  |  iMonthOut,
|  int &  |  iDayOut,
|  double &  |  dHoursOut
) |   |  const
overridevirtual
Retrieves the local date and time of the observer.
Parameters
iYearOut | accepts the year in the range 1800 to 2199.
iMonthOut | accepts the month in the range 1 to 12.
iDayOut | accepts the day in the range 1 to 31.
dHoursOut | accepts the time expressed as decimal hours in the range 0 to 24.
Implements IRhRdkSunRO.
◆ Longitude()
 virtual double CRhRdkSunStorage::Longitude  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The longitude of the observer.
Implements IRhRdkSunRO.
◆ ManualControlAllowed()
 virtual bool CRhRdkSunStorage::ManualControlAllowed  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if the manual control of the sun position is allowed, else false.
Implements IRhRdkSunRO.
◆ ManualControlOn()
 virtual bool CRhRdkSunStorage::ManualControlOn  |  ( |  void  |   | ) |   const
overridevirtual
Returns
true if manual control of the sun position is in effect, else false.
Implements IRhRdkSunRO.
◆ North()
 virtual double CRhRdkSunStorage::North  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The world angle corresponding to North in degrees. This angle is zero along the x-axis and increases anticlockwise.
Implements IRhRdkSunRO.
◆ SaveToFile()
 virtual bool CRhRdkSunStorage::SaveToFile  |  ( |  const wchar_t *  |  wszFullPath | ) |   const
overridepure virtual
Saves the sun to a file.
Implements IRhRdkSunRO.
◆ SetAltitude()
 virtual void CRhRdkSunStorage::SetAltitude  |  ( |  double  |  dAltitude | )
overridevirtual
Set the sun's altitude when manual control is in effect.
Parameters
dAltitude | is the sun's altitude in degrees in the range -90 to +90.
Implements IRhRdkSun.
◆ SetAziAlt()
 virtual void CRhRdkSunStorage::SetAziAlt  |  ( |  double  |  dAzi,
|  double  |  dAlt
) |   |  const
pure virtual
◆ SetAzimuth()
 virtual void CRhRdkSunStorage::SetAzimuth  |  ( |  double  |  dAzimuth | )
overridevirtual
Set the azimuth of the sun when manual control is in effect.
Parameters
dAzimuth | is the sun's azimuth in degrees. The value increases Eastwards with North as zero.
Note
This value is not affected by the direction of north.
See also
North()
Implements IRhRdkSun.
◆ SetDaylightSavingMinutes()
 virtual void CRhRdkSunStorage::SetDaylightSavingMinutes  |  ( |  int  |  iMinutes | )
overridevirtual
Set the daylight saving of the observer in minutes, in the range 0 to 120.
Implements IRhRdkSun.
◆ SetDaylightSavingOn()
 virtual void CRhRdkSunStorage::SetDaylightSavingOn  |  ( |  bool  |  bOn | )
overridevirtual
Set whether or not the observer is using daylight saving time.
Implements IRhRdkSun.
◆ SetEnableAllowed()
 virtual void CRhRdkSunStorage::SetEnableAllowed  |  ( |  bool  |  bAllowed | )
overridevirtual
Set whether or not enabling/disabling the sun is allowed.
Implements IRhRdkSun.
◆ SetEnableOn()
 virtual void CRhRdkSunStorage::SetEnableOn  |  ( |  bool  |  bOn | )
overridevirtual
Set whether or not the sun is enabled.
Implements IRhRdkSun.
◆ SetLatitude()
 virtual void CRhRdkSunStorage::SetLatitude  |  ( |  double  |  dLatitude | )
overridevirtual
Set the latitude of the observer.
Parameters
dLatitude | is the observer's latitude in degrees in the range -90 to +90.
Implements IRhRdkSun.
◆ SetLocalDateTime()
 virtual void CRhRdkSunStorage::SetLocalDateTime  |  ( |  int  |  iYear,
|  int  |  iMonth,
|  int  |  iDay,
|  double  |  dHours
)
overridevirtual
Set the local date and time of the observer.
Parameters
iYear | is the year which must lie between RDK_SUN_MIN_YEAR and RDK_SUN_MAX_YEAR inclusive.
iMonth | is the month in the range 1 to 12.
iDay | is the day in the range 1 to 31.
dHours | is the time expressed as decimal hours in the range 0 to 24.
Implements IRhRdkSun.
◆ SetLongitude()
 virtual void CRhRdkSunStorage::SetLongitude  |  ( |  double  |  dLongitude | )
overridevirtual
Set the longitude of the observer.
Parameters
dLongitude | is the observer's longitude in degrees in the range -180 to +180.
Implements IRhRdkSun.
◆ SetManualControlAllowed()
 virtual void CRhRdkSunStorage::SetManualControlAllowed  |  ( |  bool  |  bAllowed | )
overridevirtual
Set whether or not manual control of the sun position is allowed.
Implements IRhRdkSun.
◆ SetManualControlOn()
 virtual void CRhRdkSunStorage::SetManualControlOn  |  ( |  bool  |  bManual | )
overridevirtual
Set whether or not manual control of the sun position is in effect.
Implements IRhRdkSun.
◆ SetNorth()
 virtual void CRhRdkSunStorage::SetNorth  |  ( |  double  |  dNorth | )
overridevirtual
Set the azimuth corresponding to North.
Parameters
dNorth | is the world angle corresponding to North in degrees in the range 0 to 360. This angle is zero along the x-axis and increases anticlockwise.
Implements IRhRdkSun.
◆ SetShadowIntensity()
 virtual void CRhRdkSunStorage::SetShadowIntensity  |  ( |  double  |  dIntensity | )
overridevirtual
ShadowIntensity is currently unused.
Implements IRhRdkSun.
◆ SetTimeZone() [1/2]
 virtual void CRhRdkSunStorage::SetTimeZone  |  ( |  double  |  dHours | )
overridevirtual
Set the time zone of the observer in hours, in the range -12 to +13.
Implements IRhRdkSun.
◆ SetTimeZone() [2/2]
 virtual void CRhRdkSunStorage::SetTimeZone  |  ( |  double  |  dHours,
|  bool  |  bAutoAdjustTime
)
virtual
◆ SetUTCDateTime()
 virtual void CRhRdkSunStorage::SetUTCDateTime  |  ( |  int  |  iYear,
|  int  |  iMonth,
|  int  |  iDay,
|  double  |  dHours
)
overridevirtual
Set the date and time of the observer as Coordinated Universal Time (UTC).
Parameters
iYear | is the year which must lie between RDK_SUN_MIN_YEAR and RDK_SUN_MAX_YEAR inclusive.
iMonth | is the month in the range 1 to 12.
iDay | is the day in the range 1 to 31.
dHours | is the time expressed as decimal hours in the range 0 to 24.
Implements IRhRdkSun.
◆ SetValue()
 virtual bool CRhRdkSunStorage::SetValue  |  ( |  const wchar_t *  |  wszName,
|  const CRhRdkVariant &  |  v
)
pure virtual
◆ ShadowIntensity()
 virtual double CRhRdkSunStorage::ShadowIntensity  |  ( |  void  |   | ) |   const
overridevirtual
ShadowIntensity is currently unused.
Implements IRhRdkSunRO.
◆ TimeZone()
 virtual double CRhRdkSunStorage::TimeZone  |  ( |  void  |   | ) |   const
overridevirtual
Returns
The time zone of the observer in hours.
Implements IRhRdkSunRO.
◆ ToSun()
 void CRhRdkSunStorage::ToSun  |  ( |  class IRhRdkSun &  |  sun | ) |   const
◆ UTCDateTime()
 virtual void CRhRdkSunStorage::UTCDateTime  |  ( |  int &  |  iYearOut,
|  int &  |  iMonthOut,
|  int &  |  iDayOut,
|  double &  |  dHoursOut
) |   |  const
overridevirtual
Retrieves the date and time of the observer as Coordinated Universal Time (UTC).
Parameters
iYearOut | accepts the year in the range RDK_SUN_MIN_YEAR to RDK_SUN_MAX_YEAR.
iMonthOut | accepts the month in the range 1 to 12.
iDayOut | accepts the day in the range 1 to 31.
dHoursOut | accepts the time expressed as decimal hours in the range 0 to 24.
Implements IRhRdkSunRO.
◆ Value()
 virtual CRhRdkVariant CRhRdkSunStorage::Value  |  ( |  const wchar_t *  |  wszName,
|  const CRhRdkVariant &  |  vDefault
) |   |  const
pure virtual