Public Member Functions | List of all members
CRhinoTextDotUserInterfaceObject Class Reference
Rhino
#include <rhinoSdkUserInterfaceObject.h>
 Inheritance diagram for CRhinoTextDotUserInterfaceObject:
 Public Member Functions
CRhinoTextDotUserInterfaceObject ()
CRhinoTextDotUserInterfaceObject (ON_3dPoint location, const wchar_t *text)
virtual  | ~CRhinoTextDotUserInterfaceObject ()
double  | CameraDepth (const ON_Plane &cameraPlane) const override
void  | Draw (CRhinoDisplayPipeline &dp) override
void  | Draw (CRhinoDisplayPipeline &dp, const ON_Color &fillColor, const ON_Color &textColor, const ON_Color &borderColor)
bool  | IsMouseOver (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseEnter (const CRhinoMouseEventArgs &mouse) override
void  | OnMouseLeave (const CRhinoMouseEventArgs &mouse) override
void  | SetDotColors (const ON_Color &background, const ON_Color &border, const ON_Color &text)
void  | SetDotLocation (const ON_3dPoint &center)
void  | SetText (const wchar_t *text)
void  | SetTextHeightPoints (int height, bool mouseOver)
int  | TextHeightPoints (bool mouseOver) const
 Public Member Functions inherited from CRhinoUserInterfaceObject
CRhinoUserInterfaceObject ()
virtual  | ~CRhinoUserInterfaceObject ()
virtual bool  | AcceptsKeyboardFocus () const
void  | Animate (CRhinoAnimatingDouble &value, double target, double duration, AnimationStyle style, CRhinoDoc *doc)
void  | BindToActiveViewport (bool on)
void  | BindToViewport (unsigned int viewport_sn)
int  | DisplayOrder () const
ON_UUID  | DocumentGroupId () const
unsigned int  | DocumentRuntimeSerialNumber () const
bool  | GetData (const wchar_t *key, bool &value) const
bool  | GetData (const wchar_t *key, double &value) const
bool  | GetData (const wchar_t *key, int &value) const
bool  | GetData (const wchar_t *key, ON_UUID &value) const
bool  | GetData (const wchar_t *key, ON_wString &value) const
bool  | HasKeyboardFocus () const
bool  | HasMouseCapture () const
bool  | IsBoundToActiveViewport () const
unsigned int  | IsBoundToViewport () const
bool  | MoveKeyboardFocusToSibling (bool forward, CRhinoDoc *doc)
virtual bool  | OnCharacter (unsigned int character, unsigned int flags)
virtual void  | OnKeyboardFocusChanged (bool hasFocus)
virtual bool  | OnKeyDown (unsigned int virtualKey, unsigned int flags)
virtual void  | OnMouseClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDoubleClick (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseDown (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseMove (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseUp (const CRhinoMouseEventArgs &mouse)
virtual void  | OnMouseWheel (const CRhinoMouseEventArgs &mouse, int delta)
virtual CRhinoCommand::result  | OnRunCommand (const CRhinoCommandContext &context, const CRhinoMouseEventArgs &mouse)
virtual void  | OnTrackpadScroll (const CRhinoMouseEventArgs &mouse, float horizontal, float vertical)
CRhinoUserInterfaceObject *  | Parent ()
const CRhinoUserInterfaceObject *  | Parent () const
bool  | ReceivesMouseWheelEvents () const
bool  | ReceivesTrackpadScrollEvents () const
bool  | RegisterForAllDocuments ()
void  | RunCommand (const CRhinoMouseEventArgs &mouse)
unsigned int  | RuntimeSerialNumber () const
void  | SetCursor (HCURSOR cursor)
void  | SetData (const wchar_t *key, bool value)
void  | SetData (const wchar_t *key, const wchar_t *value)
void  | SetData (const wchar_t *key, double value)
void  | SetData (const wchar_t *key, int value)
void  | SetData (const wchar_t *key, ON_UUID value)
void  | SetDisplayOrder (int order)
void  | SetReceivesMouseWheelEvents (bool enable)
void  | SetReceivesTrackpadScrollEvents (bool enable)
void  | SetTooltip (const wchar_t *tooltip)
void  | SetVisible (bool visible)
bool  | UnregisterFromAllDocuments ()
bool  | Visible () const
 Additional Inherited Members
 Public Types inherited from CRhinoUserInterfaceObject
enum  | FocusReason : int { FocusReason::Unknown = 0, FocusReason::Pointer = 1, FocusReason::Navigation = 2 }
 Static Public Member Functions inherited from CRhinoUserInterfaceObject
static void  | ClearKeyboardFocus (CRhinoDoc *doc)
static FocusReason  | KeyboardFocusReason ()
 Protected Member Functions inherited from CRhinoUserInterfaceObject
virtual void  | ContinueAnimate (CRhinoDoc *doc)
void  | ReleaseKeyboardFocus (CRhinoDoc *doc)
void  | SetKeyboardFocus (CRhinoDoc *doc, FocusReason reason=FocusReason::Unknown)
void  | SetMouseCapture (CRhinoDoc *doc)
 Protected Attributes inherited from CRhinoUserInterfaceObject
class CRhUserInterfaceObjectPrivate *  | m_private = nullptr
Constructor & Destructor Documentation
◆ CRhinoTextDotUserInterfaceObject() [1/2]
 CRhinoTextDotUserInterfaceObject::CRhinoTextDotUserInterfaceObject  |  ( |   | )
◆ CRhinoTextDotUserInterfaceObject() [2/2]
 CRhinoTextDotUserInterfaceObject::CRhinoTextDotUserInterfaceObject  |  ( |  ON_3dPoint  |  location,
|  const wchar_t *  |  text
)
◆ ~CRhinoTextDotUserInterfaceObject()
 virtual CRhinoTextDotUserInterfaceObject::~CRhinoTextDotUserInterfaceObject  |  ( |   | )
virtual
Member Function Documentation
◆ CameraDepth()
 double CRhinoTextDotUserInterfaceObject::CameraDepth  |  ( |  const ON_Plane &  |  cameraPlane | ) |   const
overridevirtual
Description: If this is a "world space" type user interface object (grip, text dot, direction arrow), this function returns the minimum distance to the camera to allow for depth sorting user interface objects before drawing them. The default return value is ON_UNSET_VALUE
Reimplemented from CRhinoUserInterfaceObject.
◆ Draw() [1/2]
 void CRhinoTextDotUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp | )
overridevirtual
Description: All user interface objects must implement a Draw function. This is where drawing using the input display pipeline is performed. The base class Draw function does nothing.
Reimplemented from CRhinoUserInterfaceObject.
◆ Draw() [2/2]
 void CRhinoTextDotUserInterfaceObject::Draw  |  ( |  CRhinoDisplayPipeline &  |  dp,
|  const ON_Color &  |  fillColor,
|  const ON_Color &  |  textColor,
|  const ON_Color &  |  borderColor
)
◆ IsMouseOver()
 bool CRhinoTextDotUserInterfaceObject::IsMouseOver  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Return true if the input mouse is considered to be over this object
Reimplemented from CRhinoUserInterfaceObject.
◆ OnMouseEnter()
 void CRhinoTextDotUserInterfaceObject::OnMouseEnter  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Called when first goes over this object (IsMouseOver returns true)
Reimplemented from CRhinoUserInterfaceObject.
◆ OnMouseLeave()
 void CRhinoTextDotUserInterfaceObject::OnMouseLeave  |  ( |  const CRhinoMouseEventArgs &  |  mouse | )
overridevirtual
Description: Called when mouse leaves this object (IsMouseOver returns false)
Reimplemented from CRhinoUserInterfaceObject.
◆ SetDotColors()
 void CRhinoTextDotUserInterfaceObject::SetDotColors  |  ( |  const ON_Color &  |  background,
|  const ON_Color &  |  border,
|  const ON_Color &  |  text
)
◆ SetDotLocation()
 void CRhinoTextDotUserInterfaceObject::SetDotLocation  |  ( |  const ON_3dPoint &  |  center | )
◆ SetText()
 void CRhinoTextDotUserInterfaceObject::SetText  |  ( |  const wchar_t *  |  text | )
◆ SetTextHeightPoints()
 void CRhinoTextDotUserInterfaceObject::SetTextHeightPoints  |  ( |  int  |  height,
|  bool  |  mouseOver
)
◆ TextHeightPoints()
 int CRhinoTextDotUserInterfaceObject::TextHeightPoints  |  ( |  bool  |  mouseOver | ) |   const