Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_MeshThicknessAnalysisPoint Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Public Member Functions
ON_MeshThicknessAnalysisPoint ()=default
ON_MeshThicknessAnalysisPoint (const ON_MeshThicknessAnalysisPoint &)=default
~ON_MeshThicknessAnalysisPoint ()=default
ON_MeshThicknessAnalysisPoint &  | operator= (const ON_MeshThicknessAnalysisPoint &)=default
 Public Attributes
ON_3dPoint  | m_closest_point = ON_3dPoint::UnsetPoint
Location of the point on the other side. More...
double  | m_distance = ON_UNSET_POSITIVE_VALUE
ON__INT_PTR  | m_mesh_context = 0
m_mesh_context = value of the ON_MeshThicknessAnalysis::AddMesh() mesh_context parameter. More...
unsigned int  | m_mesh_id = ON_UNSET_UINT_INDEX
m_mesh_id = value returned by ON_MeshThicknessAnalysis::AddMesh(). More...
unsigned int  | m_mesh_vertex_index = ON_UNSET_UINT_INDEX
m_mesh_vertex_index = ON_Mesh vertex index. More...
ON_3dPoint  | m_vertex_point = ON_3dPoint::UnsetPoint
Location of the mesh vertex. More...
 Static Public Attributes
static const ON_MeshThicknessAnalysisPoint  | UnsetPoint
Constructor & Destructor Documentation
◆ ON_MeshThicknessAnalysisPoint() [1/2]
 ON_MeshThicknessAnalysisPoint::ON_MeshThicknessAnalysisPoint  |  ( |   | )
default
◆ ~ON_MeshThicknessAnalysisPoint()
 ON_MeshThicknessAnalysisPoint::~ON_MeshThicknessAnalysisPoint  |  ( |   | )
default
◆ ON_MeshThicknessAnalysisPoint() [2/2]
 ON_MeshThicknessAnalysisPoint::ON_MeshThicknessAnalysisPoint  |  ( |  const ON_MeshThicknessAnalysisPoint &  |   | )
default
Member Function Documentation
◆ operator=()
 ON_MeshThicknessAnalysisPoint& ON_MeshThicknessAnalysisPoint::operator=  |  ( |  const ON_MeshThicknessAnalysisPoint &  |   | )
default
Member Data Documentation
◆ m_closest_point
 ON_3dPoint ON_MeshThicknessAnalysisPoint::m_closest_point = ON_3dPoint::UnsetPoint
Location of the point on the other side.
◆ m_distance
 double ON_MeshThicknessAnalysisPoint::m_distance = ON_UNSET_POSITIVE_VALUE
If the distance from the vertex to the other side was greater than the max_distance parameter in the CalculateVertexDistance call, then 0 <= m_distance = ON_UNSET_POSITIVE_VALUE
◆ m_mesh_context
 ON__INT_PTR ON_MeshThicknessAnalysisPoint::m_mesh_context = 0
m_mesh_context = value of the ON_MeshThicknessAnalysis::AddMesh() mesh_context parameter.
◆ m_mesh_id
 unsigned int ON_MeshThicknessAnalysisPoint::m_mesh_id = ON_UNSET_UINT_INDEX
m_mesh_id = value returned by ON_MeshThicknessAnalysis::AddMesh().
◆ m_mesh_vertex_index
 unsigned int ON_MeshThicknessAnalysisPoint::m_mesh_vertex_index = ON_UNSET_UINT_INDEX
m_mesh_vertex_index = ON_Mesh vertex index.
◆ m_vertex_point
 ON_3dPoint ON_MeshThicknessAnalysisPoint::m_vertex_point = ON_3dPoint::UnsetPoint
Location of the mesh vertex.
◆ UnsetPoint
 const ON_MeshThicknessAnalysisPoint ON_MeshThicknessAnalysisPoint::UnsetPoint
static