Public Member Functions | Public Attributes | List of all members
ON_ClippingPlaneInfo Class Reference
OpenNURBS
#include <opennurbs_plane.h>
 Public Member Functions
void  | Default ()
double  | Depth () const
bool  | DepthEnabled () const
Default is false. More...
bool  | Read (ON_BinaryArchive &)
void  | SetDepth (double depth)
void  | SetDepthEnabled (bool on)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bEnabled = false
ON_PlaneEquation  | m_plane_equation
ON_UUID  | m_plane_id = ON_nil_uuid
Member Function Documentation
◆ Default()
 void ON_ClippingPlaneInfo::Default  |  ( |   | )
◆ Depth()
 double ON_ClippingPlaneInfo::Depth  |  ( |   | ) |   const
A distance where the clipping plane does not clip geometry. A positive value is equivalent to placing another clipping plane at a distance from this clipping plane along it's normal and then flipping it
The depth must also be enabled to be effective
◆ DepthEnabled()
 bool ON_ClippingPlaneInfo::DepthEnabled  |  ( |   | ) |   const
Default is false.
◆ Read()
 bool ON_ClippingPlaneInfo::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ SetDepth()
 void ON_ClippingPlaneInfo::SetDepth  |  ( |  double  |  depth | )
Negative depth values are currently not allowed. If a negative depth value is passed to this function, it will not the internal depth value
◆ SetDepthEnabled()
 void ON_ClippingPlaneInfo::SetDepthEnabled  |  ( |  bool  |  on | )
◆ Write()
 bool ON_ClippingPlaneInfo::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bEnabled
 bool ON_ClippingPlaneInfo::m_bEnabled = false
◆ m_plane_equation
 ON_PlaneEquation ON_ClippingPlaneInfo::m_plane_equation
C++ defaults for construction, destruction, copy construction and operator= work fine. A point is visible if m_plane_equation.ValueAt(point) <= 0. (This is the opposite convention from what OpenGL uses.)
◆ m_plane_id
 ON_UUID ON_ClippingPlaneInfo::m_plane_id = ON_nil_uuid