Public Attributes | List of all members
CRhinoDocSectionStyleTableChanged::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
CRhinoDocSectionStyleTableChanged::EventType  | m_event_type
The section style table event. More...
const ON_SectionStyle *  | m_old_settings
unsigned int  | m_rhino_doc_sn
The serial number of the document which contains the section style table. More...
int  | m_section_style_index
The index of the section style that was added, deleted, undeleted, or modified. More...
Member Data Documentation
◆ m_event_type
 CRhinoDocSectionStyleTableChanged::EventType CRhinoDocSectionStyleTableChanged::CParameters::m_event_type
The section style table event.
◆ m_old_settings
 const ON_SectionStyle* CRhinoDocSectionStyleTableChanged::CParameters::m_old_settings
If the event is CRhinoDocSectionStyleTableChanged::EventType::SectionStyleModified, then the old section section style. Otherwise, this parameter is nullptr. WARNING: This objects may be deleted at any time after Notify is called. Do not save the pointer and dereference it later.
◆ m_rhino_doc_sn
 unsigned int CRhinoDocSectionStyleTableChanged::CParameters::m_rhino_doc_sn
The serial number of the document which contains the section style table.
◆ m_section_style_index
 int CRhinoDocSectionStyleTableChanged::CParameters::m_section_style_index
The index of the section style that was added, deleted, undeleted, or modified.