Public Types | Public Member Functions | List of all members
RhinoMeshUnwrapper Class Reference
Rhino
#include <rhinoSdkMeshUtilities.h>
 Public Types
enum  | UnwrapMethod : int { UnwrapMethod::LSCM = 0, UnwrapMethod::ABFPP = 1, UnwrapMethod::ARAP = 2 }
Unwrapping method used More...
 Public Member Functions
RhinoMeshUnwrapper (const ON_SimpleArray< ON_Mesh * > &meshes)
Creates an unwrapper object for an array of meshes More...
RhinoMeshUnwrapper (ON_Mesh &mesh)
Creates an unwrapper object for a single mesh. More...
virtual  | ~RhinoMeshUnwrapper ()
virtual void *  | EVF (const wchar_t *, void *)
Emergency virtual function More...
void  | SetSymmetryTip (const ON_Plane &symmetryTip)
Sets symmetry tip plane. Unwrapper tries to keep unwrap result symmetric to that plane. More...
bool  | Unwrap (UnwrapMethod method)
Unwraps the meshes and stores the results to the m_T arrays. More...
Detailed Description
Class for unwrapping meshes Unwraps and packs the meshes and stores the result to m_T array.
Member Enumeration Documentation
◆ UnwrapMethod
 enum RhinoMeshUnwrapper::UnwrapMethod : int
strong
Unwrapping method used
Enumerator
LSCM
Least squares conformal map, Rhino 7 standard method
ABFPP
ABF++, angle based flattening
ARAP
ARAP, as rigid as possible
Constructor & Destructor Documentation
◆ RhinoMeshUnwrapper() [1/2]
 RhinoMeshUnwrapper::RhinoMeshUnwrapper  |  ( |  ON_Mesh &  |  mesh | )
Creates an unwrapper object for a single mesh.
Parameters
mesh | Mesh to unwrap
◆ RhinoMeshUnwrapper() [2/2]
 RhinoMeshUnwrapper::RhinoMeshUnwrapper  |  ( |  const ON_SimpleArray< ON_Mesh * > &  |  meshes | )
Creates an unwrapper object for an array of meshes
Parameters
meshes | Meshes to be uwrapped
◆ ~RhinoMeshUnwrapper()
 virtual RhinoMeshUnwrapper::~RhinoMeshUnwrapper  |  ( |   | )
virtual
Member Function Documentation
◆ EVF()
 virtual void* RhinoMeshUnwrapper::EVF  |  ( |  const wchar_t *  |  ,
|  void *
)
inlinevirtual
Emergency virtual function
Returns
◆ SetSymmetryTip()
 void RhinoMeshUnwrapper::SetSymmetryTip  |  ( |  const ON_Plane &  |  symmetryTip | )
Sets symmetry tip plane. Unwrapper tries to keep unwrap result symmetric to that plane.
Parameters
symmetryTip | Symmetry tip plane
◆ Unwrap()
 bool RhinoMeshUnwrapper::Unwrap  |  ( |  UnwrapMethod  |  method | )
Unwraps the meshes and stores the results to the m_T arrays.
Parameters
method | Unwrap method to be used
Returns
True on success