Public Member Functions | Public Attributes | List of all members
CRhinoGumballDragSettings Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumballDragSettings ()
void  | CheckShiftAndControlKeysXX ()
void  | SetToDefaultDragSettings ()
 Public Attributes
bool  | m_bRelocateGumball
bool  | m_bSnappingEnabled
double  | m_rotation_snap
int  | m_scale_mode
0 free, 1 x=y, 2 y=z, 3 z=x, 4 x=y=z More...
double  | m_translation_snap
Constructor & Destructor Documentation
◆ CRhinoGumballDragSettings()
 CRhinoGumballDragSettings::CRhinoGumballDragSettings  |  ( |   | )
User interface events can modify the way the gumball dragging is interpreted. GUMBALL_MODE parameters indicate what atomic control is being changed. This class indicates how the action should be interpreted.
Member Function Documentation
◆ CheckShiftAndControlKeysXX()
 void CRhinoGumballDragSettings::CheckShiftAndControlKeysXX  |  ( |   | )
If the shift key is depressed, then m_bSnappingEnabled is set to true. If the control key is depressed, then m_bRelocateGumball is set to true.
◆ SetToDefaultDragSettings()
 void CRhinoGumballDragSettings::SetToDefaultDragSettings  |  ( |   | )
m_bRelocateGumball = false, m_bSnappingEnabled = false
Member Data Documentation
◆ m_bRelocateGumball
 bool CRhinoGumballDragSettings::m_bRelocateGumball
◆ m_bSnappingEnabled
 bool CRhinoGumballDragSettings::m_bSnappingEnabled
If true, the gumball is being relocated and should not transform objects.
◆ m_rotation_snap
 double CRhinoGumballDragSettings::m_rotation_snap
Rotation snapping: m_rotation_snap is an angle in radians. If the angle is > 0, then any rotation will be a multiple of this angle.
◆ m_scale_mode
 int CRhinoGumballDragSettings::m_scale_mode
0 free, 1 x=y, 2 y=z, 3 z=x, 4 x=y=z
Scale lock: If scaling is occurring, m_scale_mode determines if dragging one scale grip should be applied to other scale directions.
◆ m_translation_snap
 double CRhinoGumballDragSettings::m_translation_snap
Translation snapping: If m_translation_snap > 0.0, then any axis translation distances will be a multiple of this distance.