Public Types | Public Member Functions | Public Attributes | List of all members
ON_PostEffect Class Reference
OpenNURBS
Class ON_PostEffect represents a single post effect. More...
#include <opennurbs_post_effects.h>
 Public Types
enum  | Types : unsigned int { Types::Unset, Types::Early, Types::ToneMapping, Types::Late }
 Public Member Functions
ON_PostEffect ()=delete
You can't create a post effect with no name, id or type. More...
ON_PostEffect (class ON_PostEffects &peps, Types type, const ON_UUID &id, const wchar_t *local_name)
ON_PostEffect (const ON_PostEffect &pep)
virtual  | ~ON_PostEffect ()
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
Returns a CRC of the state of this post effect. More...
virtual bool  | GetAllParameters (ON_PostEffectParams &params) const
virtual ON_XMLVariant  | GetParameter (const wchar_t *param_name) const
< Post effects can have any number of arbitrary parameters. More...
virtual ON_UUID  | Id (void) const
Returns the unique id of this post effect. More...
virtual ON_wString  | LocalName (void) const
Returns the localized name of this post effect. More...
virtual bool  | On (void) const
< Read/write properties. More...
virtual bool  | operator!= (const ON_PostEffect &pep) const
virtual const ON_PostEffect &  | operator= (const ON_PostEffect &pep)
virtual bool  | operator== (const ON_PostEffect &pep) const
virtual bool  | SetAllParameters (const ON_PostEffectParams &params)
virtual void  | SetOn (bool on)
virtual bool  | SetParameter (const wchar_t *param_name, const ON_XMLVariant &param_value)
virtual void  | SetShown (bool shown)
virtual bool  | Shown (void) const
virtual Types  | Type (void) const
< Read-only properties. More...
virtual ON_XMLNode &  | XMLNode (void)
< Other. More...
virtual const ON_XMLNode &  | XMLNode (void) const
 Public Attributes
CImpl *  | _impl
Detailed Description
Class ON_PostEffect represents a single post effect.
Member Enumeration Documentation
◆ Types
 enum ON_PostEffect::Types : unsigned int
strong
Enumerator
Unset
Early
Early post effects operate on HDR (float) image data.
ToneMapping
Tone mapping post effects convert HDR image data to LDR (8-bit) image data.
Late
Late post effects operate on LDR image data.
Constructor & Destructor Documentation
◆ ON_PostEffect() [1/3]
 ON_PostEffect::ON_PostEffect  |  ( |   | )
delete
You can't create a post effect with no name, id or type.
◆ ON_PostEffect() [2/3]
 ON_PostEffect::ON_PostEffect  |  ( |  class ON_PostEffects &  |  peps,
|  Types  |  type,
|  const ON_UUID &  |  id,
|  const wchar_t *  |  local_name
)
◆ ON_PostEffect() [3/3]
 ON_PostEffect::ON_PostEffect  |  ( |  const ON_PostEffect &  |  pep | )
◆ ~ON_PostEffect()
 virtual ON_PostEffect::~ON_PostEffect  |  ( |   | )
virtual
Member Function Documentation
◆ DataCRC()
 virtual ON__UINT32 ON_PostEffect::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
virtual
Returns a CRC of the state of this post effect.
◆ GetAllParameters()
 virtual bool ON_PostEffect::GetAllParameters  |  ( |  ON_PostEffectParams &  |  params | ) |   const
virtual
Get all the parameters in one go. Returns true if successful or false if the parameters could not be retrieved.
◆ GetParameter()
 virtual ON_XMLVariant ON_PostEffect::GetParameter  |  ( |  const wchar_t *  |  param_name | ) |   const
virtual
< Post effects can have any number of arbitrary parameters.
Get a parameter by its name. Param 'param_name' is the name of the parameter to set. Returns the value if successful or null if the parameter was not found.
◆ Id()
 virtual ON_UUID ON_PostEffect::Id  |  ( |  void  |   | ) |   const
virtual
Returns the unique id of this post effect.
◆ LocalName()
 virtual ON_wString ON_PostEffect::LocalName  |  ( |  void  |   | ) |   const
virtual
Returns the localized name of this post effect.
◆ On()
 virtual bool ON_PostEffect::On  |  ( |  void  |   | ) |   const
virtual
< Read/write properties.
Returns true if the post effect is 'on'. Only early and late post effects can be on. This corresponds to the check box next to the post effect's name in the user interface.
◆ operator!=()
 virtual bool ON_PostEffect::operator!=  |  ( |  const ON_PostEffect &  |  pep | ) |   const
virtual
◆ operator=()
 virtual const ON_PostEffect& ON_PostEffect::operator=  |  ( |  const ON_PostEffect &  |  pep | )
virtual
◆ operator==()
 virtual bool ON_PostEffect::operator==  |  ( |  const ON_PostEffect &  |  pep | ) |   const
virtual
◆ SetAllParameters()
 virtual bool ON_PostEffect::SetAllParameters  |  ( |  const ON_PostEffectParams &  |  params | )
virtual
Set all the parameters in one go. Returns true if successful or false if the parameters could not be set.
◆ SetOn()
 virtual void ON_PostEffect::SetOn  |  ( |  bool  |  on | )
virtual
Set if the post effect is 'on'. Only early and late post effects can be on. This corresponds to the check box next to the post effect's name in the user interface.
◆ SetParameter()
 virtual bool ON_PostEffect::SetParameter  |  ( |  const wchar_t *  |  param_name,
|  const ON_XMLVariant &  |  param_value
)
virtual
Set a parameter by its name. Param 'param_name' is the name of the parameter to set. Param 'param_value' specifies the type and value to set. Returns true if successful or false if the parameter could not be set.
◆ SetShown()
 virtual void ON_PostEffect::SetShown  |  ( |  bool  |  shown | )
virtual
Set if the post effect is shown. Only early and late post effects can be shown. This corresponds to the post effect appearing in the list in the user interface.
◆ Shown()
 virtual bool ON_PostEffect::Shown  |  ( |  void  |   | ) |   const
virtual
Returns true if the post effect is shown. Only early and late post effects can be shown. This corresponds to the post effect appearing in the list in the user interface.
◆ Type()
 virtual Types ON_PostEffect::Type  |  ( |  void  |   | ) |   const
virtual
< Read-only properties.
Returns the type of this post effect.
◆ XMLNode() [1/2]
 virtual ON_XMLNode& ON_PostEffect::XMLNode  |  ( |  void  |   | )
virtual
< Other.
Returns the XML node that stores the state of this post effect.
◆ XMLNode() [2/2]
 virtual const ON_XMLNode& ON_PostEffect::XMLNode  |  ( |  void  |   | ) |   const
virtual
Member Data Documentation
◆ _impl
 CImpl* ON_PostEffect::_impl