Public Member Functions | Protected Member Functions | List of all members
CRhinoCurveObject Class Reference
Rhino
#include <rhinoSdkCurveObject.h>
 Inheritance diagram for CRhinoCurveObject:
 Public Member Functions
CRhinoCurveObject ()
assigns a new object UUID More...
CRhinoCurveObject (const CRhinoCurveObject &other)
copies source object UUID More...
CRhinoCurveObject (const ON_3dmObjectAttributes &attributes)
assigns a new object UUID More...
~CRhinoCurveObject ()
ON_BoundingBox  | BoundingBox () const override
ON_BoundingBox  | BoundingBox (const CRhinoViewport *pViewport) const override
const ON_Curve *  | Curve () const
class CRhCurveDisplay *  | CurveDisplay (bool createIfNull=true) const
void  | DeleteCurveDisplay () const
void  | DeleteFromDocNotification () override
void  | Draw (CRhinoDisplayPipeline &dp) const override
Draws object based on pipeline display attributes... More...
void  | DrawHighlightedSubObjects (CRhinoDisplayPipeline &) const override
void  | DrawSubObject (CRhinoDisplayPipeline &, ON_COMPONENT_INDEX) const override
Draws wireframe representation of a sub object. More...
void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT override
void  | EnableGrips (bool gripsOn) override
bool  | GetFrame (ON_Plane &plane) const override
int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const override
int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const override
int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, bool bUseCurveDisplay, const CRhinoViewport *pViewport=nullptr) const
int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const CRhinoViewport *pViewport=nullptr) const override
bool  | GetTightBoundingBox (ON_BoundingBox &tightBbox, bool growBox=false, const ON_Xform *xform=nullptr) const override
bool  | GetVisibleIntervals (ON_SimpleArray< ON_Interval > &intervals) const
int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curveList) const override
bool  | HighlightRequiresRedraw () const override
bool  | HighlightSubObject (ON_COMPONENT_INDEX component_index, bool bHighlight=true) const override
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
bool  | IsSolid () const override
bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX component_index) const override
true if specified component is highlighted More...
bool  | IsSubObjectSelected (ON_COMPONENT_INDEX component_index) const override
ON::object_type  | ObjectType () const override
Returns ON::curve_object. More...
CRhinoCurveObject &  | operator= (const CRhinoCurveObject &other)
copies source object UUID More...
int  | Pick (const CRhinoPickContext &, CRhinoObjRefArray &) const override
bool  | PickFilter (const CRhinoGetObject &, bool) const override
int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const override
ON_Curve *  | SetCurve (const ON_BezierCurve &curve)
ON_Curve *  | SetCurve (const ON_Curve &curve)
void  | SetCurve (ON_Curve *pCurve)
const wchar_t *  | ShortDescription (bool plural) const override
Returns "curve" or "curves". More...
bool  | SnapTo (const CRhinoSnapContext &snapContext, CRhinoSnapEvent &snapEvent) const override
int  | UnhighlightAllSubObjects () override
returns number of changed subobjects More...
int  | UnselectAllSubObjects () override
returns number of unselected subobjects More...
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
virtual void  | AddToDocNotification ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh * > &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=NULL) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
virtual ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Protected Member Functions
int  | SubObjectsAreHighlighted () const override
returns number of highlighted subobjects More...
int  | SubObjectsAreSelected () const override
returns number of selected subobjects More...
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoCurveObject() [1/3]
 CRhinoCurveObject::CRhinoCurveObject  |  ( |   | )
assigns a new object UUID
◆ CRhinoCurveObject() [2/3]
 CRhinoCurveObject::CRhinoCurveObject  |  ( |  const ON_3dmObjectAttributes &  |  attributes | )
assigns a new object UUID
◆ ~CRhinoCurveObject()
 CRhinoCurveObject::~CRhinoCurveObject  |  ( |   | )
◆ CRhinoCurveObject() [3/3]
 CRhinoCurveObject::CRhinoCurveObject  |  ( |  const CRhinoCurveObject &  |  other | )
copies source object UUID
Member Function Documentation
◆ BoundingBox() [1/2]
 ON_BoundingBox CRhinoCurveObject::BoundingBox  |  ( |   | ) |   const
overridevirtual
Description: Gets 3d axis aligned bounding box that contains the object.
Returns: 3d bounding box
Remarks: The default implementation uses m_geometry->BoundingBox(), lazy evaluation, and caches the result in m_bbox.
 If you override this function, then you must set m_bbox.
Reimplemented from CRhinoObject.
◆ BoundingBox() [2/2]
 ON_BoundingBox CRhinoCurveObject::BoundingBox  |  ( |  const CRhinoViewport *  |  pViewport | ) |   const
override
◆ Curve()
 const ON_Curve* CRhinoCurveObject::Curve  |  ( |   | ) |   const
◆ CurveDisplay()
 class CRhCurveDisplay* CRhinoCurveObject::CurveDisplay  |  ( |  bool  |  createIfNull = true | ) |   const
◆ DeleteCurveDisplay()
 void CRhinoCurveObject::DeleteCurveDisplay  |  ( |   | ) |   const
Description: If you change a setting that requires the curve segments to be updated, then call this function.
◆ DeleteFromDocNotification()
 void CRhinoCurveObject::DeleteFromDocNotification  |  ( |   | )
overridevirtual
Description: This call informs an object it is about to be deleted. Some objects, like clipping planes, need to do a little extra cleanup before they are deleted.
Reimplemented from CRhinoObject.
◆ Draw()
 void CRhinoCurveObject::Draw  |  ( |  CRhinoDisplayPipeline &  |   | ) |   const
overridevirtual
Draws object based on pipeline display attributes...
Reimplemented from CRhinoObject.
◆ DrawHighlightedSubObjects()
 void CRhinoCurveObject::DrawHighlightedSubObjects  |  ( |  CRhinoDisplayPipeline &  |   | ) |   const
overridevirtual
Draws wireframe representation of highlighted sub objects. objects that support subobject highlighting must override this function
Reimplemented from CRhinoObject.
◆ DrawSubObject()
 void CRhinoCurveObject::DrawSubObject  |  ( |  CRhinoDisplayPipeline &  |  ,
|  ON_COMPONENT_INDEX
) |   |  const
overridevirtual
Draws wireframe representation of a sub object.
Reimplemented from CRhinoObject.
◆ DrawV6()
 void CRhinoCurveObject::DrawV6  |  ( |  class CRhinoObjectDrawContext *  |  draw_context | ) |   const
overridevirtual
Rhino V6 object drawing function.
Ideally, DrawV6() will replace all the drawing functions below. The single parameter will indicate what should be drawn, where it is being drawn, and how it should appear. If that happens, then this function will be renamed "Draw".
For now it is called DrawV6() so it is easy to search for it.
The class CRhinoObjectDrawContext is defined in rhinoSdkDraw.h.
For now, you must include rhinoSdkDraw.h by hand. Once the header file rhinoSdkDraw.h is being changed less than once a day, it will be included by rhinoSdk.h.
Reimplemented from CRhinoObject.
◆ EnableGrips()
 void CRhinoCurveObject::EnableGrips  |  ( |  bool  |  bGripsOn | )
overridevirtual
Description: Turns on the object's default editing grips Parameters: bDefaultGripsOn - [in] True to turn on the object's default grips. False to turn off any grips. See Also: CRhinoObject::GripsOn CRhinoObject::GetGrips
Reimplemented from CRhinoObject.
◆ GetFrame()
 bool CRhinoCurveObject::GetFrame  |  ( |  ON_Plane &  |  plane | ) |   const
overridevirtual
Description: virtual CRhinoObject::GetFrame override Calls GetFrameAt(domain[0]) Parameters: plane - [out] frame for curve Returns: true if successful
Reimplemented from CRhinoObject.
◆ GetHighlightedSubObjects()
 int CRhinoCurveObject::GetHighlightedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all highlighted sub-objects Parameters: component_indices - [out] component indices of highlighted sub-objects. Returns: number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ GetSelectedSubObjects()
 int CRhinoCurveObject::GetSelectedSubObjects  |  ( |  ON_SimpleArray< ON_COMPONENT_INDEX > &  |  component_indices | ) |   const
overridevirtual
Description: Get a list of all selected sub-objects Parameters: component_indices - [out] component indices of selected sub-objects. Returns: number of selected subobjects
Reimplemented from CRhinoObject.
◆ GetSubObjects() [1/2]
 int CRhinoCurveObject::GetSubObjects  |  ( |  ON_SimpleArray< CRhinoObject * > &  |  subObjects,
|  bool  |  bUseCurveDisplay,
|  const CRhinoViewport *  |  pViewport = nullptr
) |   |  const
Description: Gets curve subobjects or displayed subobjects if bUseCurveDisplay is set to true. Returns: Count of subobjects created.
◆ GetSubObjects() [2/2]
 int CRhinoCurveObject::GetSubObjects  |  ( |  ON_SimpleArray< CRhinoObject * > &  |  subObjects,
|  const CRhinoViewport *  |  pViewport = nullptr
) |   |  const
override
◆ GetTightBoundingBox()
 bool CRhinoCurveObject::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
Description: Get tight bounding box of this Rhino object. Parameters: tight_bbox - [in/out] tight bounding box bGrowBox -[in] (default=false)
 If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of this Rhino object. xform -[in] (default=NULL) If not NULL, the tight bounding box of the transformed Rhino object is calculated. The Rhino object is not modified. Returns: True if the returned tight_bbox is set to a valid bounding box.
Reimplemented from CRhinoObject.
◆ GetVisibleIntervals()
 bool CRhinoCurveObject::GetVisibleIntervals  |  ( |  ON_SimpleArray< ON_Interval > &  |  intervals | ) |   const
Description: Fetches the visible curve intervals (dashes and/or dots of a curve) for a given linetype. In the case that the curve is continuous (no line styling), intervals contains a single interval representing the whole curve.
◆ GetWireframeCurves()
 int CRhinoCurveObject::GetWireframeCurves  |  ( |  ON_SimpleArray< ON_Curve * > &  |  curve_list | ) |   const
overridevirtual
Description: Get curves that are used to display the object's wireframe. Parameters: curve_list - [in] 3d world space wireframe curves are appended to this list. The caller is responsible for deleting the curves. Returns: Number of curves appended to the list.
Reimplemented from CRhinoObject.
◆ HighlightRequiresRedraw()
 bool CRhinoCurveObject::HighlightRequiresRedraw  |  ( |   | ) |   const
overridevirtual
true if pixels used by highlighted object differ from pixels used by highlighted object.
Reimplemented from CRhinoObject.
◆ HighlightSubObject()
 bool CRhinoCurveObject::HighlightSubObject  |  ( |  ON_COMPONENT_INDEX  |  component_index,
|  bool  |  bHighlight = true
) |   |  const
overridevirtual
Reimplemented from CRhinoObject.
◆ InitialObjectFrame()
 ON_Plane CRhinoCurveObject::InitialObjectFrame  |  ( |  const CRhinoDoc &  |   | ) |   const
◆ IsSolid()
 bool CRhinoCurveObject::IsSolid  |  ( |   | ) |   const
overridevirtual
Returns true if object is a closed solid otherwise false. GetMeshes may return more than one mesh to represent a solid object.
Reimplemented from CRhinoObject.
◆ IsSubObjectHighlighted()
 bool CRhinoCurveObject::IsSubObjectHighlighted  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
true if specified component is highlighted
Reimplemented from CRhinoObject.
◆ IsSubObjectSelected()
 bool CRhinoCurveObject::IsSubObjectSelected  |  ( |  ON_COMPONENT_INDEX  |  component_index | ) |   const
overridevirtual
Description: Check sub-object selection state. Parameters: component_index - [in] index of subobject to check Remarks: subobject cannot be persistently selected Returns: @untitled table false sub-object is not selected true sub-object is selected
Reimplemented from CRhinoObject.
◆ ObjectType()
 ON::object_type CRhinoCurveObject::ObjectType  |  ( |   | ) |   const
overridevirtual
Returns ON::curve_object.
Implements CRhinoObject.
◆ operator=()
 CRhinoCurveObject& CRhinoCurveObject::operator=  |  ( |  const CRhinoCurveObject &  |  other | )
copies source object UUID
◆ Pick()
 int CRhinoCurveObject::Pick  |  ( |  const CRhinoPickContext &  |  pick_context,
|  CRhinoObjRefArray &  |  pick_list
) |   |  const
overridevirtual
Description: Expert level tool. Should not normally be used by Rhino plug-ins. Parameters: pick_list: [in/out] If object should be picked, it is appended to the pick_list Returns: Number of items added to pick_list.
Reimplemented from CRhinoObject.
◆ PickFilter()
 bool CRhinoCurveObject::PickFilter  |  ( |  const CRhinoGetObject &  |  ,
|  bool
) |   |  const
override
◆ SelectSubObject()
 int CRhinoCurveObject::SelectSubObject  |  ( |  ON_COMPONENT_INDEX  |  component_index,
|  bool  |  bSelect = true,
|  bool  |  bSynchHighlight = true,
|  bool  |  bPersistentSelect = false
) |   |  const
overridevirtual
Description: Reports if an object can be selected. Parameters: component_index - [in] index of subobject to check bSelect - [in] (default=true) bSynchHighlight - [in] (default=true) If true, then the object is highlighted if it is selected and not highlighted if is not selected. bPersistentSelect - [in] (default=false) Subobjects that are persistently selected stay selected when a command terminates. Returns: 0: object is not selected 1: object is selected 2: object is selected persistently Remarks: Objects that are locked, hidden, or on locked or hidden layers cannot be selected. If IsSelectableWithGripsOn() returns false, then an that object is not selectable if it has grips turned on. See Also: CRhinoDoc::UnselectAll CRhinoView::UnselectAllSubObjects
Reimplemented from CRhinoObject.
◆ SetCurve() [1/3]
 ON_Curve* CRhinoCurveObject::SetCurve  |  ( |  const ON_BezierCurve &  |  curve | )
Description: Specify the curve geometry. Parameters: curve - [in] curve geometry copied to object Returns: Pointer to curve geometry on CRhinoCurveObject.
◆ SetCurve() [2/3]
 ON_Curve* CRhinoCurveObject::SetCurve  |  ( |  const ON_Curve &  |  curve | )
Description: Specify the curve geometry. Parameters: curve - [in] curve geometry copied to object Returns: Pointer to curve geometry on CRhinoCurveObject.
◆ SetCurve() [3/3]
 void CRhinoCurveObject::SetCurve  |  ( |  ON_Curve *  |  pCurve | )
Description: Specify the curve geometry. Parameters: pCurve - [in] ~CRhinoCurveObject() will delete this curve
◆ ShortDescription()
 const wchar_t* CRhinoCurveObject::ShortDescription  |  ( |  bool  |  plural | ) |   const
overridevirtual
Returns "curve" or "curves".
Implements CRhinoObject.
◆ SnapTo()
 bool CRhinoCurveObject::SnapTo  |  ( |  const CRhinoSnapContext &  |  snap_context,
|  CRhinoSnapEvent &  |  snap_event
) |   |  const
overridevirtual
Description: Low level tool for internal use only. See definition of CRhinoObject::SnapTo for detailed information. Remarks: This function should not be used in Rhino plug-ins.
Reimplemented from CRhinoObject.
◆ SubObjectsAreHighlighted()
 int CRhinoCurveObject::SubObjectsAreHighlighted  |  ( |   | ) |   const
overrideprotectedvirtual
returns number of highlighted subobjects
Reimplemented from CRhinoObject.
◆ SubObjectsAreSelected()
 int CRhinoCurveObject::SubObjectsAreSelected  |  ( |   | ) |   const
overrideprotectedvirtual
returns number of selected subobjects
Reimplemented from CRhinoObject.
◆ UnhighlightAllSubObjects()
 int CRhinoCurveObject::UnhighlightAllSubObjects  |  ( |   | )
overridevirtual
returns number of changed subobjects
Reimplemented from CRhinoObject.
◆ UnselectAllSubObjects()
 int CRhinoCurveObject::UnselectAllSubObjects  |  ( |   | )
overridevirtual
returns number of unselected subobjects
Reimplemented from CRhinoObject.