Public Member Functions | List of all members
CRhRdkRenderWindowEventSink Class Referenceabstract
RDK
#include <RhRdkRenderWindowEventSink.h>
 Inheritance diagram for CRhRdkRenderWindowEventSink:
 Public Member Functions
virtual UUID  | InterfaceId (void) const final override
virtual void  | OnLButtonDblClick (const CPoint &pt)=0
virtual void  | OnLButtonDown (const CPoint &pt)=0
virtual void  | OnLButtonUp (const CPoint &pt)=0
virtual void  | OnRButtonDblClick (const CPoint &pt)=0
virtual void  | OnRButtonDown (const CPoint &pt)=0
virtual void  | OnRButtonUp (const CPoint &pt)=0
 Public Member Functions inherited from CRhRdkExtension
CRhRdkExtension ()
virtual  | ~CRhRdkExtension ()
virtual UUID  | PlugInId (void) const =0
bool  | Unregister (void)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
Detailed Description
This interface is deprecated in favor of CRhRdkRenderWindowMouseEventWatcher.
Member Function Documentation
◆ InterfaceId()
 virtual UUID CRhRdkRenderWindowEventSink::InterfaceId  |  ( |  void  |   | ) |   const
finaloverridevirtual
Returns the unique interface id of this extension.
Implements CRhRdkExtension.
◆ OnLButtonDblClick()
 virtual void CRhRdkRenderWindowEventSink::OnLButtonDblClick  |  ( |  const CPoint &  |  pt | )
pure virtual
◆ OnLButtonDown()
 virtual void CRhRdkRenderWindowEventSink::OnLButtonDown  |  ( |  const CPoint &  |  pt | )
pure virtual
◆ OnLButtonUp()
 virtual void CRhRdkRenderWindowEventSink::OnLButtonUp  |  ( |  const CPoint &  |  pt | )
pure virtual
◆ OnRButtonDblClick()
 virtual void CRhRdkRenderWindowEventSink::OnRButtonDblClick  |  ( |  const CPoint &  |  pt | )
pure virtual
◆ OnRButtonDown()
 virtual void CRhRdkRenderWindowEventSink::OnRButtonDown  |  ( |  const CPoint &  |  pt | )
pure virtual
◆ OnRButtonUp()
 virtual void CRhRdkRenderWindowEventSink::OnRButtonUp  |  ( |  const CPoint &  |  pt | )
pure virtual