Public Attributes | List of all members
CRhMeshBooleanOptionsPrivate Class Reference
Rhino
#include <rhinoSdkMeshUtilities.h>
 Public Attributes
ON_SimpleArray< unsigned > *  | m_firstNewlyAddedFace
ON_ClassArray< ON_SimpleArray< int > > *  | m_inputMap = nullptr
Member Data Documentation
◆ m_firstNewlyAddedFace
 ON_SimpleArray<unsigned>* CRhMeshBooleanOptionsPrivate::m_firstNewlyAddedFace
◆ m_inputMap
 ON_ClassArray<ON_SimpleArray<int> >* CRhMeshBooleanOptionsPrivate::m_inputMap = nullptr
RH-94152: borrowed. When non-null, the boolean fills it with one index set per output mesh, listing the input-mesh indices that contributed to it (see SourceMeshIndexMap below).