Public Member Functions | Public Attributes | List of all members
CRhinoMeshBooleanOptions Class Reference
Rhino
Contains additional information about mesh booleans. This class can have more methods added. More...
#include <rhinoSdkMeshUtilities.h>
 Public Member Functions
CRhinoMeshBooleanOptions ()
~CRhinoMeshBooleanOptions ()
void  | RequestFirstNewlyAddedFacesList (ON_SimpleArray< unsigned > *list)
Retuns a list with the first index, the first index of the first newly added mesh face, and as secondo index, the count of new faces after that index. More...
void  | RequestSourceMeshIndexMap (ON_ClassArray< ON_SimpleArray< int >> *map)
Requests an input-to-output index map for the next boolean run (RH-94152). When set, the boolean fills 'map' with one entry per output mesh (parallel to the OutMeshes result), each listing the indices of the input meshes that contributed faces to that output. For the two-set operations (Difference/Intersection/Split) the indices are flat-concatenated: the first set occupies 0..n0-1 and the second set occupies n0..n0+n1-1. The pointer is borrowed; the caller owns the storage. More...
ON_ClassArray< ON_SimpleArray< int > > *  | SourceMeshIndexMap () const
Returns the index map requested via RequestSourceMeshIndexMap, or null. More...
 Public Attributes
ON_Terminator *  | m_cancel = nullptr
bool  | m_ngons = true
ON_ProgressReporter *  | m_reporter = nullptr
ON_TextLog *  | m_text_log = nullptr
Detailed Description
Contains additional information about mesh booleans. This class can have more methods added.
Constructor & Destructor Documentation
◆ ~CRhinoMeshBooleanOptions()
 CRhinoMeshBooleanOptions::~CRhinoMeshBooleanOptions  |  ( |   | )
◆ CRhinoMeshBooleanOptions()
 CRhinoMeshBooleanOptions::CRhinoMeshBooleanOptions  |  ( |   | )
Member Function Documentation
◆ RequestFirstNewlyAddedFacesList()
 void CRhinoMeshBooleanOptions::RequestFirstNewlyAddedFacesList  |  ( |  ON_SimpleArray< unsigned > *  |  list | )
Retuns a list with the first index, the first index of the first newly added mesh face, and as secondo index, the count of new faces after that index.
Parameters
list | The indices of the new faces, as addessed in the summary.
◆ RequestSourceMeshIndexMap()
 void CRhinoMeshBooleanOptions::RequestSourceMeshIndexMap  |  ( |  ON_ClassArray< ON_SimpleArray< int >> *  |  map | )
Requests an input-to-output index map for the next boolean run (RH-94152). When set, the boolean fills 'map' with one entry per output mesh (parallel to the OutMeshes result), each listing the indices of the input meshes that contributed faces to that output. For the two-set operations (Difference/Intersection/Split) the indices are flat-concatenated: the first set occupies 0..n0-1 and the second set occupies n0..n0+n1-1. The pointer is borrowed; the caller owns the storage.
Parameters
map | Receives the per-output index sets, or null to disable.
◆ SourceMeshIndexMap()
 ON_ClassArray<ON_SimpleArray<int> >* CRhinoMeshBooleanOptions::SourceMeshIndexMap  |  ( |   | ) |   const
Returns the index map requested via RequestSourceMeshIndexMap, or null.
Member Data Documentation
◆ m_cancel
 ON_Terminator* CRhinoMeshBooleanOptions::m_cancel = nullptr
◆ m_ngons
 bool CRhinoMeshBooleanOptions::m_ngons = true
◆ m_reporter
 ON_ProgressReporter* CRhinoMeshBooleanOptions::m_reporter = nullptr
◆ m_text_log
 ON_TextLog* CRhinoMeshBooleanOptions::m_text_log = nullptr