Public Member Functions | List of all members
CRhRdkDocRenderedImageAdjust Class Reference
RDK
#include <IRhRdkDithering.h>
 Inheritance diagram for CRhRdkDocRenderedImageAdjust:
 Public Member Functions
CRhRdkDocRenderedImageAdjust (const CRhinoDoc &doc)
 Public Member Functions inherited from CRhRdkImageAdjust
CRhRdkImageAdjust ()
CRhRdkImageAdjust (const CRhRdkImageAdjust &a)
virtual  | ~CRhRdkImageAdjust ()
virtual IRhRdkDithering::Methods  | Dither (void) const override
virtual void *  | EVF (const wchar_t *, void *) override
virtual float  | Gamma (void) const override
virtual bool  | IsEqual (const IRhRdkImageAdjust &a) const override
bool  | operator!= (const CRhRdkImageAdjust &a) const
const CRhRdkImageAdjust &  | operator= (const CRhRdkImageAdjust &a)
const CRhRdkImageAdjust &  | operator= (const IRhRdkImageAdjust &a)
bool  | operator== (const CRhRdkImageAdjust &a) const
bool  | operator== (const IRhRdkImageAdjust &a) const
virtual void  | SetDither (IRhRdkDithering::Methods dm) override
virtual void  | SetGamma (float f) override
virtual IRhRdkToneMapping &  | ToneMapping (void) const override
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from IRhRdkImageAdjust
virtual  | ~IRhRdkImageAdjust ()
 Protected Attributes inherited from CRhRdkImageAdjust
CImpl *  | m_pImpl
Detailed Description
This class is obsolete and only kept for SDK backward compatibility. It is not implemented.
Constructor & Destructor Documentation
◆ CRhRdkDocRenderedImageAdjust()
 CRhRdkDocRenderedImageAdjust::CRhRdkDocRenderedImageAdjust  |  ( |  const CRhinoDoc &  |  doc | )