Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | Friends | List of all members
ON_ErrorEvent Class Reference
OpenNURBS
#include <opennurbs_error.h>
 Public Types
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Warning = 1, Type::Error = 2, Type::Assert = 3,
 Type::Custom = 4, Type::SubDError = 5, Type::BrepError = 6, Type::NotValid = 7
 }
 Public Member Functions
ON_ErrorEvent ()=default
ON_ErrorEvent (const ON_ErrorEvent &)
ON_ErrorEvent (ON_ErrorEvent::Type event_type, const char *file_name, unsigned int line_number, const char *function_name, const char *description)
~ON_ErrorEvent ()=default
const char *  | Description () const
void  | Dump (class ON_TextLog &text_log) const
ON_ErrorEvent::Type  | EventType () const
const char *  | FileName () const
const char *  | FunctionName () const
unsigned int  | LineNumber () const
ON_ErrorEvent &  | operator= (const ON_ErrorEvent &)
const ON_String  | ToString () const
 Static Public Member Functions
static const ON_ErrorEvent  | Create (ON_ErrorEvent::Type event_type, const char *file_name, unsigned int line_number, const char *function_name, const char *description)
static const char *  | TypeToString (ON_ErrorEvent::Type event_type)
 Static Public Attributes
static const ON_ErrorEvent  | Unset
 Friends
class  | ON_ErrorLog
Member Enumeration Documentation
◆ Type
 enum ON_ErrorEvent::Type : unsigned char
strong
Enumerator
Unset
Warning
call to ON_WARNING / ON_Warning / ON_WarningEx
Error
call to ON_ERROR / ON_Error / ON_ErrorEx
Assert
call to ON_ASSERT / ON_AssertEx
Custom
custom
SubDError
call to ON_SubDIncrementErrorCount()
BrepError
call to ON_BrepIncrementErrorCount()
NotValid
call to ON_IsNotValid()
Constructor & Destructor Documentation
◆ ON_ErrorEvent() [1/3]
 ON_ErrorEvent::ON_ErrorEvent  |  ( |   | )
default
◆ ~ON_ErrorEvent()
 ON_ErrorEvent::~ON_ErrorEvent  |  ( |   | )
default
◆ ON_ErrorEvent() [2/3]
 ON_ErrorEvent::ON_ErrorEvent  |  ( |  const ON_ErrorEvent &  |   | )
◆ ON_ErrorEvent() [3/3]
 ON_ErrorEvent::ON_ErrorEvent  |  ( |  ON_ErrorEvent::Type  |  event_type,
|  const char *  |  file_name,
|  unsigned int  |  line_number,
|  const char *  |  function_name,
|  const char *  |  description
)
Member Function Documentation
◆ Create()
 static const ON_ErrorEvent ON_ErrorEvent::Create  |  ( |  ON_ErrorEvent::Type  |  event_type,
|  const char *  |  file_name,
|  unsigned int  |  line_number,
|  const char *  |  function_name,
|  const char *  |  description
)
static
◆ Description()
 const char* ON_ErrorEvent::Description  |  ( |   | ) |   const
◆ Dump()
 void ON_ErrorEvent::Dump  |  ( |  class ON_TextLog &  |  text_log | ) |   const
◆ EventType()
 ON_ErrorEvent::Type ON_ErrorEvent::EventType  |  ( |   | ) |   const
◆ FileName()
 const char* ON_ErrorEvent::FileName  |  ( |   | ) |   const
◆ FunctionName()
 const char* ON_ErrorEvent::FunctionName  |  ( |   | ) |   const
◆ LineNumber()
 unsigned int ON_ErrorEvent::LineNumber  |  ( |   | ) |   const
◆ operator=()
 ON_ErrorEvent& ON_ErrorEvent::operator=  |  ( |  const ON_ErrorEvent &  |   | )
◆ ToString()
 const ON_String ON_ErrorEvent::ToString  |  ( |   | ) |   const
◆ TypeToString()
 static const char* ON_ErrorEvent::TypeToString  |  ( |  ON_ErrorEvent::Type  |  event_type | )
static
Friends And Related Function Documentation
◆ ON_ErrorLog
 friend class ON_ErrorLog
friend
Member Data Documentation
◆ Unset
 const ON_ErrorEvent ON_ErrorEvent::Unset
static