Static Public Member Functions | List of all members
CRhinoGetDimOrdinate Class Reference
Rhino
Class to interactively get user input for radial dimensions. More...
#include <RhinoSdkDimension.h>
 Static Public Member Functions
static CRhinoCommand::result  | GetDimOrdinate (unsigned int doc_sn, ON_DimOrdinate *&output_dimension, CRhinoObjRef &point_ref, ON_3dPoint &basepoint, ON_Plane dimension_plane, double &kink_offset, ON_DimOrdinate::MeasuredDirection &direction, bool &bBaseOverride, bool bInteractive)
Detailed Description
Class to interactively get user input for radial dimensions.
Member Function Documentation
◆ GetDimOrdinate()
 static CRhinoCommand::result CRhinoGetDimOrdinate::GetDimOrdinate  |  ( |  unsigned int  |  doc_sn,
|  ON_DimOrdinate *&  |  output_dimension,
|  CRhinoObjRef &  |  point_ref,
|  ON_3dPoint &  |  basepoint,
|  ON_Plane  |  dimension_plane,
|  double &  |  kink_offset,
|  ON_DimOrdinate::MeasuredDirection &  |  direction,
|  bool &  |  bBaseOverride,
|  bool  |  bInteractive
)
static
Description: Gets an ordinate dimension from user input Will allocate dim_out memory which caller must delete Parameters: doc_sn, [in] Serial no of the document for annotation styles output_dimension [out] Resulting dimension point_ref, [out] ObjRef of object selected to dimension basepoint, [in/out] Reference point for dimensions dimension_plane [in] Plane where dimension is made kink_offset [in/out] Distance perpendicular to measured direction between kinks when dimenson is offset from point being dimensioned direction [in/out] Xaxis - dimension meadures parallel to x axis yaxis - dimension meadures parallel to y axis bBaseOverride [out] true if basepoint has been changed bInteractive, [in] true: run in interactive mode false - run in script mode Returns: Failure: No dimension gotten Success: Got a dimension