Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_3dmProperties Class Reference
OpenNURBS
#include <opennurbs_3dm_properties.h>
 Public Member Functions
ON_3dmProperties ()=default
ON_3dmProperties (const ON_3dmProperties &)=default
~ON_3dmProperties ()=default
void  | Dump (ON_TextLog &) const
bool  | IsEmpty () const
ON_3dmProperties &  | operator= (const ON_3dmProperties &)=default
bool  | Read (ON_BinaryArchive &archive)
bool  | Write (ON_BinaryArchive &archive) const
 Public Attributes
ON_wString  | m_3dmArchiveFullPathName
ON_3dmApplication  | m_Application
application that created 3DM file More...
ON_3dmNotes  | m_Notes
ON_WindowsBitmap  | m_PreviewImage
preview image of model More...
ON_3dmRevisionHistory  | m_RevisionHistory
 Static Public Attributes
static const ON_3dmProperties  | Empty
Constructor & Destructor Documentation
◆ ON_3dmProperties() [1/2]
 ON_3dmProperties::ON_3dmProperties  |  ( |   | )
default
◆ ~ON_3dmProperties()
 ON_3dmProperties::~ON_3dmProperties  |  ( |   | )
default
◆ ON_3dmProperties() [2/2]
 ON_3dmProperties::ON_3dmProperties  |  ( |  const ON_3dmProperties &  |   | )
default
Member Function Documentation
◆ Dump()
 void ON_3dmProperties::Dump  |  ( |  ON_TextLog &  |   | ) |   const
◆ IsEmpty()
 bool ON_3dmProperties::IsEmpty  |  ( |   | ) |   const
◆ operator=()
 ON_3dmProperties& ON_3dmProperties::operator=  |  ( |  const ON_3dmProperties &  |   | )
default
◆ Read()
 bool ON_3dmProperties::Read  |  ( |  ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_3dmProperties::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
Remarks: If archive.ArchiveFileName() is not empty, that value is written in place of m_3dmArchiveFullPathName in the 3dm archive. If archive.ArchiveFileName() is empty, then m_3dmArchiveFullPathName is written in the 3dm archive.
Member Data Documentation
◆ Empty
 const ON_3dmProperties ON_3dmProperties::Empty
static
◆ m_3dmArchiveFullPathName
 ON_wString ON_3dmProperties::m_3dmArchiveFullPathName
name of .3dm archive when it was written. Used to find referenced files when the archive is moved or copied and then read.
◆ m_Application
 ON_3dmApplication ON_3dmProperties::m_Application
application that created 3DM file
◆ m_Notes
 ON_3dmNotes ON_3dmProperties::m_Notes
◆ m_PreviewImage
 ON_WindowsBitmap ON_3dmProperties::m_PreviewImage
preview image of model
◆ m_RevisionHistory
 ON_3dmRevisionHistory ON_3dmProperties::m_RevisionHistory