Classes | Public Member Functions | Static Public Member Functions | Public Attributes | Protected Member Functions | List of all members
CRhinoAnnotation Class Reference
Rhino
#include <RhinoSdkRichText.h>
 Inheritance diagram for CRhinoAnnotation:
 Classes
class  | TextFieldUpdater
 Public Member Functions
~CRhinoAnnotation ()=default
const ON_Annotation *  | Annotation () const
ON_Annotation *  | AnnotationToModify ()
ON::AnnotationType  | AnnotationType () const
ON_BoundingBox  | BoundingBox () const override
CRhinoObject override. More...
ON_BoundingBox  | BoundingBox (const CRhinoViewport *pViewport) const override
CRhinoObject override. More...
virtual ON_BoundingBox  | BoundingBox (const CRhinoViewport *vp, const ON_DimStyle *dimstyle) const
bool  | ContainsMeasurableTextFields () const
const ON_DimStyle &  | GetEffectiveDimensionStyle (const CRhinoDoc *doc) const
bool  | GetTightBoundingBox (ON_BoundingBox &tight_bbox, bool bGrowBox, const ON_Xform *xform) const override
CRhinoObject override. More...
bool  | GetTightBoundingBoxOld (ON_BoundingBox &tight_bbox, bool bGrowBox, const ON_Xform *xform) const
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
bool  | IsActiveInViewport (const CRhinoViewport &viewport) const override
bool  | IsVisibleInViewport (const CRhinoViewport &vp) const
bool  | IsVisibleInViewport (const CRhinoViewport &vp, const ON_Xform &xform) const
bool  | IsVisibleInViewport (CRhinoDisplayPipeline &dp) const
CRhinoAnnotation *  | MatchAnnotationObject (const CRhinoAnnotation &matchto) const
Return a new object like this with properties of matchto. More...
ON::object_type  | ObjectType (void) const override
const ON_DimStyle &  | ParentDimensionStyle (const CRhinoDoc *doc) const
const ON_UUID  | ParentDimensionStyleId () const
const ON_wString  | PlainText () const
const ON_Plane &  | Plane () const
const ON_wString  | RichText () const
const ON_TextContent *  | TextContent () const
 Public Member Functions inherited from CRhinoObject
CRhinoObject ()
assigns a new object UUID More...
CRhinoObject (const CRhinoObject &)
copies source object UUID More...
CRhinoObject (const ON_3dmObjectAttributes &)
virtual  | ~CRhinoObject ()
virtual void  | AddToDocNotification ()
BOOL32  | AttachAttributeUserData (ON_UserData *pUserData)
bool  | AttachGeometryUserData (ON_UserData *pUserData)
CRhinoObjectAttributes &  | Attributes ()
virtual const CRhinoObjectAttributes &  | Attributes () const
virtual void  | BeginTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
virtual ON_BoundingBox  | BoundingBox (const class CRhinoViewport *pViewport) const
unsigned int  | BrepReferenceCount () const
class CRhObjectReferenceCounter *  | BrepReferenceCounter (void) const
void  | BrepReferenceCounter_DestroyRuntimeCache (bool bDelete) const
bool  | BrepReferenceCounterExists () const
bool  | CopyHistoryOnReplace () const
virtual int  | CreateMeshes (ON::mesh_type mesh_type, const ON_MeshParameters &mp, bool bIgnoreCustom=false)
BOOL32  | DeleteAttributeUserData (ON_UUID userdata_uuid)
void  | DeleteDynamicTransform ()
virtual void  | DeleteFromDocNotification ()
bool  | DeleteGeometryUserData (ON_UUID userdata_uuid)
void  | DestroyMeshes (ON::mesh_type mesh_type)
virtual void  | DestroyMeshes (ON::mesh_type mesh_type, bool bDeleteMeshes)
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object override More...
class CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
virtual void  | Draw (class CRhinoDisplayPipeline &) const
Draws object based on pipeline display attributes... More...
void  | Draw (CRhinoViewport &) const
virtual void  | DrawGrips (class CRhinoDisplayPipeline &) const
virtual void  | DrawHighlightedSubObjects (class CRhinoDisplayPipeline &) const
virtual void  | DrawSubObject (class CRhinoDisplayPipeline &, ON_COMPONENT_INDEX) const
Draws wireframe representation of a sub object. More...
virtual void  | DrawV6 (class CRhinoObjectDrawContext *draw_context) const RHINO_NOEXCEPT
virtual CRhinoObject *  | DuplicateRhinoObject () const
*enum ANALYSIS_MODE **bool  | EnableAnalysisMode (ON_UUID am_id, bool bEnable=true) const
new way (not virtual) More...
virtual bool  | EnableCustomGrips (class CRhinoObjectGrips *custom_grips)
virtual void  | EnableGrips (bool bGripsOn)
virtual void  | EndTransform (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory)
const ON_Geometry *  | Geometry () const
returns a pointer to the object's geometry More...
ON_UserData *  | GetAttributeUserData (ON_UUID userdata_uuid) const
bool  | GetDynamicTransform (ON_Xform &dynamic_xform) const
virtual bool  | GetFrame (ON_Plane &plane) const
ON_UserData *  | GetGeometryUserData (ON_UUID userdata_uuid) const
virtual int  | GetGrips (ON_SimpleArray< class CRhinoGripObject * > &grip_list) const
virtual int  | GetHighlightedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
std::vector< std::shared_ptr< const ON_Mesh > >  | GetMeshes (ON::mesh_type mesh_type) const
virtual int  | GetMeshes (ON::mesh_type mesh_type, ON_SimpleArray< const ON_Mesh * > &meshes) const
void  | GetRenderMeshParameters (ON_MeshParameters &mp) const
virtual int  | GetSelectedSubObjects (ON_SimpleArray< ON_COMPONENT_INDEX > &component_indices) const
virtual int  | GetSubobjectMaterialComponents (ON_SimpleArray< ON_COMPONENT_INDEX > &components_with_subobject_materials) const
virtual int  | GetSubObjects (ON_SimpleArray< CRhinoObject * > &subObjects, const class CRhinoViewport *pViewport=NULL) const
virtual int  | GetWireframeCurves (ON_SimpleArray< ON_Curve * > &curve_list) const
const class CRhinoGripsEnabler *  | GripsEnabler () const
int  | GripsOn () const
bool  | GripsSelected () const
void  | HandleSelection (void) const
bool  | HasCustomRenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, ON__UINT32 *flags=nullptr, const class CRhinoPlugIn *requestingPlugIn=nullptr, const class CDisplayPipelineAttributes *pAttributes=nullptr) const
Determine if custom render meshes will be supplied for a particular object. More...
bool  | HasDynamicTransform () const
virtual bool  | HasSubobjectMaterials (void) const
bool  | Highlight (bool bHighlight=true) const
virtual bool  | HighlightRequiresRedraw () const
virtual bool  | HighlightSubObject (ON_COMPONENT_INDEX component_index, bool bHighlight=true) const
const CRhinoHistoryRecord *  | HistoryRecord () const
const ON_UUID  | Id () const
bool  | InAnalysisMode () const
bool  | InAnalysisMode (const ON_UUID &am_id) const
bool AnalysisMode( ANALYSIS_MODE am ) const; ///< old way More...
ON_Plane  | InitialObjectFrame (const CRhinoDoc &) const
const class CRhinoVisualAnalysisMode *  | InShadedAnalysisMode () const
unsigned int  | IsActiveInDocument () const
virtual bool  | IsActiveInViewport (const class CRhinoViewport &) const
virtual bool  | IsDeletable () const
bool  | IsDeleted () const
virtual bool  | IsGroupObject () const
bool  | IsHidden () const
int  | IsHighlighted (BOOL32 bCheckSubObjects=false) const
highlighted state (almost always = IsSelected() except in one or two commands) More...
bool  | IsInstanceDefinitionGeometry () const
int  | IsInstanceDefinitionGeometryEx () const
bool  | IsLocked () const
int  | IsMarked () const
virtual bool  | IsMeshable (ON::mesh_type) const
Returns true if the object is capable of having a mesh of the specified type. More...
bool  | IsModelObject () const
bool  | IsNormal () const
bool  | IsPageObject () const
int  | IsProxy () const
bool  | IsReference () const
bool  | IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
bool  | IsSelectable (bool bIgnoreSelectionState=false, bool bIgnoreGripsState=false) const
int  | IsSelected (bool bCheckSubObjects=false) const
virtual bool  | IsSolid () const
virtual bool  | IsSubObjectHighlighted (ON_COMPONENT_INDEX component_index) const
true if specified component is highlighted More...
bool  | IsSubObjectSelectable (ON_COMPONENT_INDEX component_index, bool bIgnoreSelectionState=false) const
virtual bool  | IsSubObjectSelected (ON_COMPONENT_INDEX component_index) const
bool  | IsValid (ON_TextLog *text_log=nullptr) const override
bool  | IsVisible () const
unsigned int  | LinkedInstanceDefinitionSerialNumber () const
void  | Mark (int)
void  | MemoryRelocate () override
virtual ON_Object override More...
virtual int  | MeshCount (ON::mesh_type mesh_type, const ON_MeshParameters *mp=0) const
virtual const class CDisplayPipelineAttributes *  | MeshDisplayAttributes (int mesh_index, const ON_Mesh &mesh, const class CDisplayPipelineAttributes &display_attrs) const
const ON_ModelComponent &  | ModelComponent () const
ON_UUID  | ModelObjectId () const override
virtual bool  | ModifyAttributes (const ON_3dmObjectAttributes &new_attributes, bool bEnableUndo=true, bool bQuiet=false)
const ON_wString  | Name () const
ON_Color  | ObjectDrawColor (bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, bool bIgnoreObjectState=false) const
ON_Color  | ObjectDrawColor (const CRhinoObjectAttributes &attributes, const ON_UUID &viewport_id, bool bIgnoreObjectState) const
ON_Plane  | ObjectFrame (const ON_COMPONENT_INDEX &ci, unsigned int objectframe_flags) const
const class CRhinoLayer &  | ObjectLayer () const
const class CRhinoLayer *  | ObjectLayerPtr () const
const CRhinoLinetype &  | ObjectLinetype () const
const CRhinoLinetype *  | ObjectLinetypePtr () const
virtual const CRhinoMaterial &  | ObjectMaterial () const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_3dmObjectAttributes &attrs) const
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
This is now the preferred version of the function. This should be used to get materials component-wise in all cases. More...
virtual const CRhinoMaterial &  | ObjectMaterial (const ON_UUID &plugin_id) const
virtual const CRhRdkMaterial *  | ObjectRdkMaterial (const ON_COMPONENT_INDEX &ci, const ON_UUID &plugin_id=RhinoDefaultRendererId(), const ON_3dmObjectAttributes *attrs=NULL) const
virtual ON_wString  | OnDoubleClick (const CRhinoDoubleClickContext &double_click_context) const
CRhinoObject &  | operator= (const CRhinoObject &)
copies source object UUID More...
bool  | PerViewportIsVisible (ON_UUID viewport_id) const
virtual int  | Pick (const CRhinoPickContext &pick_context, class CRhinoObjRefArray &pick_list) const
virtual bool  | PickFilter (const class CRhinoGetObject &, bool) const
virtual void  | PreDrawUpdate (CRhinoDisplayPipeline &dp) const
virtual bool  | PrepareToWrite (int archive_3dm_version)
virtual bool  | PromotePreviewMeshes (ON::mesh_type)
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, bool recursive, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. Simple version with no need for flags. More...
std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes >  | RenderMeshes (ON::mesh_type mt, const ON_Viewport *vp=nullptr, const class CRhRdkObjectAncestry *ancestry_only_for_by_parent_attributes=nullptr, ON__UINT32 *flags=nullptr, const CRhinoPlugIn *requestingPlugIn=nullptr, const CDisplayPipelineAttributes *pAttributes=nullptr, std::shared_ptr< const RhRdk::CustomRenderMeshes::IRenderMeshes > optional_initial_primitives=nullptr) const
Returns a complete set of custom render meshes (primitives) for the object. More...
unsigned int  | RuntimeSerialNumber () const
int  | Select (bool bSelect, bool bSynchHighlight, bool bPersistentSelect, bool bIgnoreGripsState, bool bIgnoreLayerLocking, bool bIgnoreLayerVisibility) const
int  | Select (bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=true, bool bIgnoreGripsState=false) const
virtual int  | SelectSubObject (ON_COMPONENT_INDEX component_index, bool bSelect=true, bool bSynchHighlight=true, bool bPersistentSelect=false) const
bool  | SetCachedTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id) const
bool  | SetCachedTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, const ON_SimpleArray< ON_TextureMapping::TYPE > &mappings_to_cache) const
void  | SetCopyHistoryOnReplace (bool bCopy) const
bool  | SetDynamicTransform (const ON_Xform &dynamic_xform)
bool  | SetHistory (class CRhinoHistory &history)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Plane &plane)
void  | SetObjectFrame (const ON_COMPONENT_INDEX &ci, const ON_Xform &wcs_to_ocs)
virtual bool  | SetRenderMeshParameters (const ON_MeshParameters &mp)
virtual bool  | SetTextureCoordinates (const ON_TextureMapping &mapping, const ON_Xform *object_xform, bool bLazy=true) const
virtual bool  | SetTextureCoordinatesFromPlugIn (const ON_UUID &plugin_id, int mapping_channel_id) const
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int worksession_ref_model_serial_number)
virtual const wchar_t *  | ShortDescription (bool bPlural) const =0
virtual unsigned int  | SizeOf () const override
returns number of bytes used by this particular instance More...
virtual bool  | SnapTo (const CRhinoSnapContext &snap_context, CRhinoSnapEvent &snap_event) const
ON::active_space  | Space () const
virtual ON_ComponentStatus  | SubObjectStatus () const
virtual bool  | SupportsBrepProxyReferenceCounting () const
bool  | UndoModifyAttributes (unsigned int ur_sn=0)
virtual int  | UnhighlightAllSubObjects ()
returns number of changed subobjects More...
virtual int  | UnselectAllSubObjects ()
returns number of unselected subobjects More...
void  | UpdateBoundingBox ()
virtual bool  | VetoTransformObject (CRhinoDoc &doc, bool bDeleteOriginal, bool bAddNewObjectToDoc, bool bAddTransformHistory) const
unsigned int  | WorksessionReferenceModelSerialNumber () const
bool  | WorksessionReferenceModelSerialNumberIsExplicit () const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
virtual void  | Dump (ON_TextLog &) const
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual bool  | Read (ON_BinaryArchive &binary_archive)
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
virtual bool  | Write (ON_BinaryArchive &binary_archive) const
 Static Public Member Functions
static int  | CompareFonts (const ON_Font *const *lhs, const ON_Font *const *rhs)
Compare fonts by RichTextName and Quartet member. More...
static int  | FontUse (const CRhinoAnnotation *annotation, const ON_DimStyle *effective_dimstyle, ON_Font *default_font, ON_SimpleArray< const ON_Font * > &fonts_used)
static double  | GetAnnotationScale (const CRhinoDoc *doc, const ON_DimStyle *dimstyle, const CRhinoViewport *pVP)
static bool  | ParseFields (const ON_TextContent *text, const CRhinoAnnotation *annotation, const CRhinoObject *top_parent)
static bool  | ParseFields (const ON_TextContent *text, const CRhinoAnnotation *annotation, const CRhinoObject *top_parent, bool forceUpdate)
static void  | UpdateTextFields (const CRhinoAnnotation *annotation, const CRhinoObject *top_object, bool forceupdate)
 Static Public Member Functions inherited from CRhinoObject
static const CRhinoObject *  | FromId (unsigned int rhino_doc_runtime_serial_number, ON_UUID rhino_object_id)
static const CRhinoObject *  | FromRuntimeSerialNumber (unsigned int rhino_doc_runtime_serial_number, unsigned int rhino_object_runtime_serial_number)
static unsigned int  | NextRuntimeObjectSerialNumber ()
 Public Attributes
const ON_wString ON_ClassArray< ON_wString > &  | font_table_entries
const ON_wString  | rtf_string
 Public Attributes inherited from CRhinoObject
class CRhObjectSdkExtension *  | m__object_sdk_extension
const class CRhinoObjectVisualAnalysisMode *  | m_analysis_mode_list
list of enabled analysis modes More...
CRhinoCacheHandle  | m_cache
class CRhinoObjectGrips *  | m_grips
managed by derived objects More...
unsigned char  | m_use_preview_mesh
 Protected Member Functions
CRhinoAnnotation ()=default
CRhinoAnnotation (const CRhinoAnnotation &src)
CRhinoAnnotation (const ON_3dmObjectAttributes &)
CRhinoAnnotation &  | operator= (const CRhinoAnnotation &src)
 Protected Member Functions inherited from CRhinoObject
void  | Destroy ()
virtual bool  | InternalVirtual_IsSelectable (bool bIgnoreSelectionState, bool bIgnoreGripsState, bool bIgnoreLocking, bool bIgnoreVisibility) const
virtual bool  | IsSelectableWithGripsOn () const
true if can be selected while grips are on More...
virtual int  | SubObjectsAreHighlighted () const
returns number of highlighted subobjects More...
virtual int  | SubObjectsAreSelected () const
returns number of selected subobjects More...
virtual void  | SynchAttributes ()
light objects are special because they are not in the geometry lists More...
 Additional Inherited Members
 Public Types inherited from CRhinoObject
enum  | GEOMETRY_TYPE {
 unknown_object_type = ON::object_type::unknown_object_type, point_object = ON::object_type::point_object, pointset_object = ON::object_type::pointset_object, curve_object = ON::object_type::curve_object,
 surface_object = ON::object_type::surface_object, polysrf_object = ON::object_type::polysrf_filter, edge_object = ON::object_type::edge_filter, polyedge_object = ON::object_type::polyedge_filter,
 loop_object = ON::object_type::loop_object, brepvertex_filter = ON::object_type::brepvertex_filter, mesh_object = ON::object_type::mesh_object, annotation_object = ON::object_type::annotation_object,
 light_object = ON::object_type::light_object, instance_reference = ON::object_type::instance_reference, grip_object = ON::object_type::grip_object, morph_control_object = ON::object_type::morph_control_object,
 subd_object = ON::object_type::subd_object, meshvertex_filter = ON::object_type::meshvertex_filter, meshedge_filter = ON::object_type::meshedge_filter, meshface_filter = ON::object_type::meshface_filter,
 meshcomponent_reference = ON::object_type::meshcomponent_reference, cage_object = ON::object_type::cage_object, hatch_object = ON::object_type::hatch_object, phantom_object = ON::object_type::phantom_object,
 extrusion_object = ON::object_type::extrusion_object, any_object = ON::object_type::any_object
 }
enum  | List : unsigned int {
 List::None = 0, List::ActiveModel, List::ActiveModelIdef, List::ReferenceModel,
 List::ReferenceModelIdef, List::Deleted, List::Grip, List::Light
 }
enum  | objectframe_flags : unsigned int { objectframe_standard = 0, objectframe_include_scale_transforms = 1, objectframe_return_unset = 2 }
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from CRhinoObject
static int  | m_no_show_mark
 Protected Attributes inherited from CRhinoObject
ON_BoundingBox  | m_bbox
world coordinate bounding box More...
unsigned char  | m_geomem_type
ON_Geometry *  | m_geometry
const CRhinoHistoryRecord *  | m_history_record
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoAnnotation() [1/3]
 CRhinoAnnotation::CRhinoAnnotation  |  ( |   | )
protecteddefault
◆ CRhinoAnnotation() [2/3]
 CRhinoAnnotation::CRhinoAnnotation  |  ( |  const CRhinoAnnotation &  |  src | )
protected
◆ CRhinoAnnotation() [3/3]
 CRhinoAnnotation::CRhinoAnnotation  |  ( |  const ON_3dmObjectAttributes &  |   | )
protected
◆ ~CRhinoAnnotation()
 CRhinoAnnotation::~CRhinoAnnotation  |  ( |   | )
default
Member Function Documentation
◆ Annotation()
 const ON_Annotation* CRhinoAnnotation::Annotation  |  ( |   | ) |   const
Returns: A pointer to a const ON_Annotation that can be queried. You must always check for a nullptr before dreferencing.
◆ AnnotationToModify()
 ON_Annotation* CRhinoAnnotation::AnnotationToModify  |  ( |   | )
Returns: A pointer to an ON_Annotation that can be modified. The CRhinoAnnotation object must be non-const and must not be in a document. You must always check for a nullptr before dreferencing.
◆ AnnotationType()
 ON::AnnotationType CRhinoAnnotation::AnnotationType  |  ( |   | ) |   const
◆ BoundingBox() [1/3]
 ON_BoundingBox CRhinoAnnotation::BoundingBox  |  ( |   | ) |   const
overridevirtual
CRhinoObject override.
Reimplemented from CRhinoObject.
◆ BoundingBox() [2/3]
 ON_BoundingBox CRhinoAnnotation::BoundingBox  |  ( |  const CRhinoViewport *  |  pViewport | ) |   const
override
CRhinoObject override.
◆ BoundingBox() [3/3]
 virtual ON_BoundingBox CRhinoAnnotation::BoundingBox  |  ( |  const CRhinoViewport *  |  vp,
|  const ON_DimStyle *  |  dimstyle
) |   |  const
virtual
◆ CompareFonts()
 static int CRhinoAnnotation::CompareFonts  |  ( |  const ON_Font *const *  |  lhs,
|  const ON_Font *const *  |  rhs
)
static
Compare fonts by RichTextName and Quartet member.
◆ ContainsMeasurableTextFields()
 bool CRhinoAnnotation::ContainsMeasurableTextFields  |  ( |   | ) |   const
◆ FontUse()
 static int CRhinoAnnotation::FontUse  |  ( |  const CRhinoAnnotation *  |  annotation,
|  const ON_DimStyle *  |  effective_dimstyle,
|  ON_Font *  |  default_font,
|  ON_SimpleArray< const ON_Font * > &  |  fonts_used
)
static
finds the fonts used by the input annotation default_font - The font from the parent dimstyle - That font may or may not be used by the annotation fonts_used - An array of the fonts actually used to display the text. This list may or may not include the default_font. If there are fonts other than the default font listed in fonts_used, those are override fonts. returns the number of override fonts found or -1 for error
◆ GetAnnotationScale()
 static double CRhinoAnnotation::GetAnnotationScale  |  ( |  const CRhinoDoc *  |  doc,
|  const ON_DimStyle *  |  dimstyle,
|  const CRhinoViewport *  |  pVP
)
static
Annotative scale according to viewport Returns viewport dependent scale multipler for annotative text When main view is paperspace: 1.0 when current viewport is the page != 1.0 when current viewport is a detail (except at 1:1 zoom) When main view is modelspace: scale is only determined by "ModelSpaceTextScale" setting
◆ GetEffectiveDimensionStyle()
 const ON_DimStyle& CRhinoAnnotation::GetEffectiveDimensionStyle  |  ( |  const CRhinoDoc *  |  doc | ) |   const
Parameters: doc - [in] If doc is nullptr, then this->Document() is used. When the CRhinoAnnotation is managed by a CRhinoDoc, this is always the correct doc. In rare cases when a CRhinoAnnotation object is being created has not been added to a CRhinoDoc, the doc parameter must be non-null. Returns: If the annotation object has overrides, returns the override dimension style managed by the ON_Annotation object. Override styles always have nil ids, empty names, unset indices. Otherwise, returns the parent dimension style which is in the doc style table. The parent style always has a non nil id, a non-empty name, and an CRhinoDoc style index.
◆ GetTightBoundingBox()
 bool CRhinoAnnotation::GetTightBoundingBox  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox,
|  const ON_Xform *  |  xform
) |   |  const
overridevirtual
CRhinoObject override.
Reimplemented from CRhinoObject.
◆ GetTightBoundingBoxOld()
 bool CRhinoAnnotation::GetTightBoundingBoxOld  |  ( |  ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox,
|  const ON_Xform *  |  xform
) |   |  const
◆ InitialObjectFrame()
 ON_Plane CRhinoAnnotation::InitialObjectFrame  |  ( |  const CRhinoDoc &  |   | ) |   const
◆ IsActiveInViewport()
 bool CRhinoAnnotation::IsActiveInViewport  |  ( |  const CRhinoViewport &  |  viewport | ) |   const
override
◆ IsVisibleInViewport() [1/3]
 bool CRhinoAnnotation::IsVisibleInViewport  |  ( |  const CRhinoViewport &  |  vp | ) |   const
◆ IsVisibleInViewport() [2/3]
 bool CRhinoAnnotation::IsVisibleInViewport  |  ( |  const CRhinoViewport &  |  vp,
|  const ON_Xform &  |  xform
) |   |  const
◆ IsVisibleInViewport() [3/3]
 bool CRhinoAnnotation::IsVisibleInViewport  |  ( |  CRhinoDisplayPipeline &  |  dp | ) |   const
◆ MatchAnnotationObject()
 CRhinoAnnotation* CRhinoAnnotation::MatchAnnotationObject  |  ( |  const CRhinoAnnotation &  |  matchto | ) |   const
Return a new object like this with properties of matchto.
◆ ObjectType()
 ON::object_type CRhinoAnnotation::ObjectType  |  ( |  void  |   | ) |   const
overridevirtual
Description: Returns a constant that determines the type of CRhinoObject. Returns: @untitled table ON::point_object CRhinoPointObject ON::pointset_object CRhinoPointCloudObject ON::curve_object CRhinoCurveObject ON::brep_object CRhinoBrepObject ON::mesh_object CRhinoMeshObject ON::annotation_object CRhinoAnnotation ON::light_object CRhinoLight Remarks: A brep object can be a surface or polysurface. An annotation object can be anything derived from CRhinoAnnotation.
Implements CRhinoObject.
◆ operator=()
 CRhinoAnnotation& CRhinoAnnotation::operator=  |  ( |  const CRhinoAnnotation &  |  src | )
protected
◆ ParentDimensionStyle()
 const ON_DimStyle& CRhinoAnnotation::ParentDimensionStyle  |  ( |  const CRhinoDoc *  |  doc | ) |   const
Parameters: doc - [in] If doc is nullptr, then this->Document() is used. When the CRhinoAnnotation is managed by a CRhinoDoc, this is always the correct doc. In rare cases when a CRhinoAnnotation object is being created has not been added to a CRhinoDoc, the doc parameter must be non-null. Returns: The parent dimension style which is always in the doc style table. The parent style always has a non nil id and a non-empty name. If there is not an override, then this is the style used by the object. If there is an override, then this is the style used for settings that are not overridden.
◆ ParentDimensionStyleId()
 const ON_UUID CRhinoAnnotation::ParentDimensionStyleId  |  ( |   | ) |   const
Returns: The id of the parent dimension style. If there is not an override, then this is the style used by the object. If there is an override, then this is the style used for settings that are not overridden.
◆ ParseFields() [1/2]
 static bool CRhinoAnnotation::ParseFields  |  ( |  const ON_TextContent *  |  text,
|  const CRhinoAnnotation *  |  annotation,
|  const CRhinoObject *  |  top_parent
)
static
void UpdateTextFields( CRhinoDisplayPipeline& dp);
◆ ParseFields() [2/2]
 static bool CRhinoAnnotation::ParseFields  |  ( |  const ON_TextContent *  |  text,
|  const CRhinoAnnotation *  |  annotation,
|  const CRhinoObject *  |  top_parent,
|  bool  |  forceUpdate
)
static
◆ PlainText()
 const ON_wString CRhinoAnnotation::PlainText  |  ( |   | ) |   const
Returns: Text information with rich text formatting insturctions removed.
◆ Plane()
 const ON_Plane& CRhinoAnnotation::Plane  |  ( |   | ) |   const
◆ RichText()
 const ON_wString CRhinoAnnotation::RichText  |  ( |   | ) |   const
Returns: Raw text that can contain rich text formatting insturctions.
◆ TextContent()
 const ON_TextContent* CRhinoAnnotation::TextContent  |  ( |   | ) |   const
◆ UpdateTextFields()
 static void CRhinoAnnotation::UpdateTextFields  |  ( |  const CRhinoAnnotation *  |  annotation,
|  const CRhinoObject *  |  top_object,
|  bool  |  forceupdate
)
static
Member Data Documentation
◆ font_table_entries
 const ON_wString ON_ClassArray<ON_wString>& CRhinoAnnotation::font_table_entries
◆ rtf_string
 const ON_wString CRhinoAnnotation::rtf_string
input: rtf_string - Rtf text string to search for the fonts in the font table output: font_table_entries - An array of the names in the font table returns true if there was a font table, false if there wasn't one static bool RtfFontTableEntries(