Public Member Functions | List of all members
CRhinoLicenseLease Class Reference
Rhino
#include <rhinoSdkPlugIn.h>
 Public Member Functions
CRhinoLicenseLease (const CRhinoLicenseLease &other)
CRhinoLicenseLease (const wchar_t *product_id, const wchar_t *group_name, const wchar_t *group_id, const wchar_t *user_name, const wchar_t *user_id, const wchar_t *product_title, const wchar_t *product_version, const wchar_t *product_edition, const wchar_t *lease_id, time_t iat, time_t exp)
CRhinoLicenseLease (const wchar_t *product_id, const wchar_t *group_name, const wchar_t *group_id, const wchar_t *user_name, const wchar_t *user_id, const wchar_t *product_title, const wchar_t *product_version, const wchar_t *product_edition, const wchar_t *lease_id, time_t iat, time_t exp, time_t renewable_until)
~CRhinoLicenseLease ()
time_t  | Exp () const
ON_wString  | GroupId () const
ON_wString  | GroupName () const
time_t  | Iat () const
bool  | IsExpired () const
True if the lease is expired. Otherwise false. More...
ON_wString  | LeaseId () const
The unique id of the lease. More...
CRhinoLicenseLease &  | operator= (const CRhinoLicenseLease &other)
ON_wString  | ProductEdition () const
The edition of the product whom the lease represents. I.E. 'Commercial'. More...
ON_wString  | ProductId () const
The product id of the lease. More...
ON_wString  | ProductTitle () const
The title of the product whom the lease represents. I.E. 'Rhinoceros'. More...
ON_wString  | ProductVersion () const
The version of the product whom the lease represents. I.E. '6.0'. More...
time_t  | RenewableUntil () const
ON_wString  | UserId () const
The id of the user whom the lease belongs to. More...
ON_wString  | UserName () const
The display name of the user whom the lease belongs to. More...
Detailed Description
class CRhinoLicenseLease Description: This class represents a lease from the Cloud Zoo for a particular product.
Constructor & Destructor Documentation
◆ CRhinoLicenseLease() [1/3]
 CRhinoLicenseLease::CRhinoLicenseLease  |  ( |  const wchar_t *  |  product_id,
|  const wchar_t *  |  group_name,
|  const wchar_t *  |  group_id,
|  const wchar_t *  |  user_name,
|  const wchar_t *  |  user_id,
|  const wchar_t *  |  product_title,
|  const wchar_t *  |  product_version,
|  const wchar_t *  |  product_edition,
|  const wchar_t *  |  lease_id,
|  time_t  |  iat,
|  time_t  |  exp
)
◆ CRhinoLicenseLease() [2/3]
 CRhinoLicenseLease::CRhinoLicenseLease  |  ( |  const wchar_t *  |  product_id,
|  const wchar_t *  |  group_name,
|  const wchar_t *  |  group_id,
|  const wchar_t *  |  user_name,
|  const wchar_t *  |  user_id,
|  const wchar_t *  |  product_title,
|  const wchar_t *  |  product_version,
|  const wchar_t *  |  product_edition,
|  const wchar_t *  |  lease_id,
|  time_t  |  iat,
|  time_t  |  exp,
|  time_t  |  renewable_until
)
◆ CRhinoLicenseLease() [3/3]
 CRhinoLicenseLease::CRhinoLicenseLease  |  ( |  const CRhinoLicenseLease &  |  other | )
◆ ~CRhinoLicenseLease()
 CRhinoLicenseLease::~CRhinoLicenseLease  |  ( |   | )
Member Function Documentation
◆ Exp()
 time_t CRhinoLicenseLease::Exp  |  ( |   | ) |   const
The time the lease expires, represented as the number of seconds that have passed since midnight, 1st January 1970 UTC.
◆ GroupId()
 ON_wString CRhinoLicenseLease::GroupId  |  ( |   | ) |   const
The id of the group whom the lease belongs to. If it is an empty string, then the lease does not belong to a group.
◆ GroupName()
 ON_wString CRhinoLicenseLease::GroupName  |  ( |   | ) |   const
The display name of the group whom the lease belongs to. If it is an empty string, then the lease does not belong to a group.
◆ Iat()
 time_t CRhinoLicenseLease::Iat  |  ( |   | ) |   const
The time the lease was issued, represented as the number of seconds that have passed since midnight, 1st January 1970 UTC.
◆ IsExpired()
 bool CRhinoLicenseLease::IsExpired  |  ( |   | ) |   const
True if the lease is expired. Otherwise false.
◆ LeaseId()
 ON_wString CRhinoLicenseLease::LeaseId  |  ( |   | ) |   const
The unique id of the lease.
◆ operator=()
 CRhinoLicenseLease& CRhinoLicenseLease::operator=  |  ( |  const CRhinoLicenseLease &  |  other | )
◆ ProductEdition()
 ON_wString CRhinoLicenseLease::ProductEdition  |  ( |   | ) |   const
The edition of the product whom the lease represents. I.E. 'Commercial'.
◆ ProductId()
 ON_wString CRhinoLicenseLease::ProductId  |  ( |   | ) |   const
The product id of the lease.
◆ ProductTitle()
 ON_wString CRhinoLicenseLease::ProductTitle  |  ( |   | ) |   const
The title of the product whom the lease represents. I.E. 'Rhinoceros'.
◆ ProductVersion()
 ON_wString CRhinoLicenseLease::ProductVersion  |  ( |   | ) |   const
The version of the product whom the lease represents. I.E. '6.0'.
◆ RenewableUntil()
 time_t CRhinoLicenseLease::RenewableUntil  |  ( |   | ) |   const
If the license backing this lease expires, its expiration date will be set here. Otherwise, RenewableUntil will return a COleDateTime object with .invalid set to true.
◆ UserId()
 ON_wString CRhinoLicenseLease::UserId  |  ( |   | ) |   const
The id of the user whom the lease belongs to.
◆ UserName()
 ON_wString CRhinoLicenseLease::UserName  |  ( |   | ) |   const
The display name of the user whom the lease belongs to.