Public Types | Public Member Functions | Public Attributes | List of all members
CArgsRhinoLoft Class Reference
Rhino
#include <rhinoSdkLoft.h>
 Public Types
enum  | eLoftEnds {
 leTight = 0, leStraight = 1, leLoose = 2, leNatural = 3,
 leTangent = 4
 }
enum  | eLoftSimplify { lsNone = 0, lsRebuild = 1, lsRefit = 2 }
enum  | eLoftType {
 ltNormal = 0, ltLoose = 1, ltTight = 2, ltStraight = 3,
 ltUniform = 4
 }
15 April 2015 - Removed ltDevelopable More...
 Public Member Functions
CArgsRhinoLoft ()
~CArgsRhinoLoft ()
double  | AngleToleranceRadians () const
BOOL32  | Closed () const
int  | CurveCount () const
ON_3dPoint  | EndPoint () const
int  | LoftType () const
BOOL32  | MatchEndTangent () const
BOOL32  | MatchStartTangent () const
int  | RebuildPointCount () const
double  | RefitTolerance () const
void  | SetAngleToleranceRadians (double tol)
void  | SetClosed (BOOL32 closed=TRUE)
void  | SetEndPoint (const ON_3dPoint &point)
void  | SetLoftType (int type)
void  | SetMatchEndTangent (BOOL32 match=TRUE)
void  | SetMatchStartTangent (BOOL32 match=TRUE)
void  | SetRebuildPointCount (int count)
void  | SetRefitTolerance (double tol)
void  | SetSimplifyMethod (int method)
void  | SetStartPoint (const ON_3dPoint &point)
int  | SimplifyMethod () const
ON_3dPoint  | StartPoint () const
BOOL32  | UseEndPoint () const
BOOL32  | UseStartPoint () const
 Public Attributes
double  | m_angle_tolerance_radians
BOOL32  | m_bAllowEndTangent
set if the end curve is an edge More...
BOOL32  | m_bAllowStartTangent
set if the start curve is an edge More...
BOOL32  | m_bClosed
ON_SimpleArray< bool >  | m_bRevCurve
shape curves reversed from input direction More...
BOOL32  | m_bUseEndpoint
BOOL32  | m_bUseStartpoint
int  | m_end_condition
eLoftEnds More...
ON_3dPoint  | m_endpoint
int  | m_loft_type
eLoftType More...
ON_SimpleArray< const CRhinoLoftCurve * >  | m_loftcurves
int  | m_rebuild_point_count
double  | m_refit_tolerance
int  | m_simplify_method
eLoftSimplify More...
int  | m_start_condition
ON_3dPoint  | m_startpoint
Member Enumeration Documentation
◆ eLoftEnds
 enum CArgsRhinoLoft::eLoftEnds
Enumerator
leTight
leStraight
leLoose
leNatural
leTangent
◆ eLoftSimplify
 enum CArgsRhinoLoft::eLoftSimplify
Enumerator
lsNone
lsRebuild
lsRefit
◆ eLoftType
 enum CArgsRhinoLoft::eLoftType
15 April 2015 - Removed ltDevelopable
Enumerator
ltNormal
ltLoose
ltTight
ltStraight
ltUniform
Constructor & Destructor Documentation
◆ CArgsRhinoLoft()
 CArgsRhinoLoft::CArgsRhinoLoft  |  ( |   | )
◆ ~CArgsRhinoLoft()
 CArgsRhinoLoft::~CArgsRhinoLoft  |  ( |   | )
Member Function Documentation
◆ AngleToleranceRadians()
 double CArgsRhinoLoft::AngleToleranceRadians  |  ( |   | ) |   const
◆ Closed()
 BOOL32 CArgsRhinoLoft::Closed  |  ( |   | ) |   const
◆ CurveCount()
 int CArgsRhinoLoft::CurveCount  |  ( |   | ) |   const
CArgsRhinoLoft( const CArgsRhinoLoftEx& src); CArgsRhinoLoft& operator=( const CArgsRhinoLoftEx& src);
◆ EndPoint()
 ON_3dPoint CArgsRhinoLoft::EndPoint  |  ( |   | ) |   const
◆ LoftType()
 int CArgsRhinoLoft::LoftType  |  ( |   | ) |   const
◆ MatchEndTangent()
 BOOL32 CArgsRhinoLoft::MatchEndTangent  |  ( |   | ) |   const
◆ MatchStartTangent()
 BOOL32 CArgsRhinoLoft::MatchStartTangent  |  ( |   | ) |   const
◆ RebuildPointCount()
 int CArgsRhinoLoft::RebuildPointCount  |  ( |   | ) |   const
◆ RefitTolerance()
 double CArgsRhinoLoft::RefitTolerance  |  ( |   | ) |   const
◆ SetAngleToleranceRadians()
 void CArgsRhinoLoft::SetAngleToleranceRadians  |  ( |  double  |  tol | )
◆ SetClosed()
 void CArgsRhinoLoft::SetClosed  |  ( |  BOOL32  |  closed = TRUE | )
◆ SetEndPoint()
 void CArgsRhinoLoft::SetEndPoint  |  ( |  const ON_3dPoint &  |  point | )
◆ SetLoftType()
 void CArgsRhinoLoft::SetLoftType  |  ( |  int  |  type | )
◆ SetMatchEndTangent()
 void CArgsRhinoLoft::SetMatchEndTangent  |  ( |  BOOL32  |  match = TRUE | )
◆ SetMatchStartTangent()
 void CArgsRhinoLoft::SetMatchStartTangent  |  ( |  BOOL32  |  match = TRUE | )
◆ SetRebuildPointCount()
 void CArgsRhinoLoft::SetRebuildPointCount  |  ( |  int  |  count | )
◆ SetRefitTolerance()
 void CArgsRhinoLoft::SetRefitTolerance  |  ( |  double  |  tol | )
◆ SetSimplifyMethod()
 void CArgsRhinoLoft::SetSimplifyMethod  |  ( |  int  |  method | )
◆ SetStartPoint()
 void CArgsRhinoLoft::SetStartPoint  |  ( |  const ON_3dPoint &  |  point | )
◆ SimplifyMethod()
 int CArgsRhinoLoft::SimplifyMethod  |  ( |   | ) |   const
◆ StartPoint()
 ON_3dPoint CArgsRhinoLoft::StartPoint  |  ( |   | ) |   const
◆ UseEndPoint()
 BOOL32 CArgsRhinoLoft::UseEndPoint  |  ( |   | ) |   const
◆ UseStartPoint()
 BOOL32 CArgsRhinoLoft::UseStartPoint  |  ( |   | ) |   const
Member Data Documentation
◆ m_angle_tolerance_radians
 double CArgsRhinoLoft::m_angle_tolerance_radians
◆ m_bAllowEndTangent
 BOOL32 CArgsRhinoLoft::m_bAllowEndTangent
set if the end curve is an edge
◆ m_bAllowStartTangent
 BOOL32 CArgsRhinoLoft::m_bAllowStartTangent
set if the start curve is an edge
◆ m_bClosed
 BOOL32 CArgsRhinoLoft::m_bClosed
◆ m_bRevCurve
 ON_SimpleArray<bool> CArgsRhinoLoft::m_bRevCurve
shape curves reversed from input direction
◆ m_bUseEndpoint
 BOOL32 CArgsRhinoLoft::m_bUseEndpoint
◆ m_bUseStartpoint
 BOOL32 CArgsRhinoLoft::m_bUseStartpoint
◆ m_end_condition
 int CArgsRhinoLoft::m_end_condition
eLoftEnds
◆ m_endpoint
 ON_3dPoint CArgsRhinoLoft::m_endpoint
◆ m_loft_type
 int CArgsRhinoLoft::m_loft_type
eLoftType
◆ m_loftcurves
 ON_SimpleArray<const CRhinoLoftCurve*> CArgsRhinoLoft::m_loftcurves
◆ m_rebuild_point_count
 int CArgsRhinoLoft::m_rebuild_point_count
◆ m_refit_tolerance
 double CArgsRhinoLoft::m_refit_tolerance
◆ m_simplify_method
 int CArgsRhinoLoft::m_simplify_method
eLoftSimplify
◆ m_start_condition
 int CArgsRhinoLoft::m_start_condition
◆ m_startpoint
 ON_3dPoint CArgsRhinoLoft::m_startpoint