Public Member Functions | List of all members
CRhinoOptionsPageEventArgs Class Reference
Rhino
#include <RhinoSdkPages.h>
 Public Member Functions
CRhinoOptionsPageEventArgs (class IRhinoOptionsPageHost *host)
CRhinoOptionsPageEventArgs (const CRhinoOptionsPageEventArgs &src)
~CRhinoOptionsPageEventArgs ()
CRhinoDoc *  | Document () const
unsigned int  | DocumentRuntimeSerialNumber () const
class IRhinoOptionsPageHost *  | Host () const
const CRhinoOptionsPageEventArgs &  | operator= (const CRhinoOptionsPageEventArgs &src)
Detailed Description
class CRhinoOptionsPageEventArgs
Description: Arguments class passed to IRhinoOptionsPage notification methods.
Constructor & Destructor Documentation
◆ CRhinoOptionsPageEventArgs() [1/2]
 CRhinoOptionsPageEventArgs::CRhinoOptionsPageEventArgs  |  ( |  class IRhinoOptionsPageHost *  |  host | )
 Description: Default constructor. Parameters: documentRuntimeSerailNumber [in] = The document associated with this event
◆ ~CRhinoOptionsPageEventArgs()
 CRhinoOptionsPageEventArgs::~CRhinoOptionsPageEventArgs  |  ( |   | )
 Description: Destructor.
◆ CRhinoOptionsPageEventArgs() [2/2]
 CRhinoOptionsPageEventArgs::CRhinoOptionsPageEventArgs  |  ( |  const CRhinoOptionsPageEventArgs &  |  src | )
 Description: Copy constructor.
Member Function Documentation
◆ Document()
 CRhinoDoc* CRhinoOptionsPageEventArgs::Document  |  ( |   | ) |   const
 Description: Call this method to get the associated host document. Returns: The associated host document.
◆ DocumentRuntimeSerialNumber()
 unsigned int CRhinoOptionsPageEventArgs::DocumentRuntimeSerialNumber  |  ( |   | ) |   const
 Description: Call this method to get the associated host documents runtime serial number. Returns: The associated host documents runtime serial number.
◆ Host()
 class IRhinoOptionsPageHost* CRhinoOptionsPageEventArgs::Host  |  ( |   | ) |   const
 Description: The Options page host.
◆ operator=()
 const CRhinoOptionsPageEventArgs& CRhinoOptionsPageEventArgs::operator=  |  ( |  const CRhinoOptionsPageEventArgs &  |  src | )
 Description: Operator =