Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_BrepQuadFacePack Class Reference
OpenNURBS
#include <opennurbs_brep.h>
 Public Member Functions
ON_BrepQuadFacePack ()=default
ON_BrepQuadFacePack (const ON_BrepQuadFacePack &)=default
~ON_BrepQuadFacePack ()=default
ON_Brep *  | Brep () const
unsigned  | FaceCount () const
unsigned  | FaceCount (bool dir) const
unsigned  | FaceCount (int dir) const
const ON_NurbsSurface *  | GetSurface ()
const ON_NurbsSurface *  | GetSurfaceMixedKnots ()
const ON_NurbsSurface *  | GetSurfaceMultipleKnots ()
const ON_NurbsSurface *  | GetSurfaceSimpleKnots ()
const bool  | GetTrims (const ON_NurbsSurface *srf, ON_SimpleArray< int > *trim_origs_pack, ON_ObjectArray< ON_NurbsCurve > *trim_curves_pack)
bool  | IsEmpty () const
bool  | IsNotEmpty () const
const bool  | MatchPackFacesStructure ()
ON_BrepQuadFacePack &  | operator= (const ON_BrepQuadFacePack &)=default
const bool  | OrientPackFaces ()
 Static Public Member Functions
static const ON_BrepQuadFacePack  | GetPack (unsigned int pack_seed_size, const ON_BrepFace *face, unsigned int pack_id)
static const ON_BrepQuadFacePack  | GetPackTagged (const ON_BrepFace *face, unsigned count)
 Public Attributes
ON_BrepQuadFacePackSide  | m_corners [4] {}
ON_2udex  | m_size = ON_2udex::Zero
 Static Public Attributes
static const ON_BrepQuadFacePack  | Empty
Constructor & Destructor Documentation
◆ ON_BrepQuadFacePack() [1/2]
 ON_BrepQuadFacePack::ON_BrepQuadFacePack  |  ( |   | )
default
◆ ~ON_BrepQuadFacePack()
 ON_BrepQuadFacePack::~ON_BrepQuadFacePack  |  ( |   | )
default
◆ ON_BrepQuadFacePack() [2/2]
 ON_BrepQuadFacePack::ON_BrepQuadFacePack  |  ( |  const ON_BrepQuadFacePack &  |   | )
default
Member Function Documentation
◆ Brep()
 ON_Brep* ON_BrepQuadFacePack::Brep  |  ( |   | ) |   const
◆ FaceCount() [1/3]
 unsigned ON_BrepQuadFacePack::FaceCount  |  ( |   | ) |   const
inline
◆ FaceCount() [2/3]
 unsigned ON_BrepQuadFacePack::FaceCount  |  ( |  bool  |  dir | ) |   const
inline
◆ FaceCount() [3/3]
 unsigned ON_BrepQuadFacePack::FaceCount  |  ( |  int  |  dir | ) |   const
inline
◆ GetPack()
 static const ON_BrepQuadFacePack ON_BrepQuadFacePack::GetPack  |  ( |  unsigned int  |  pack_seed_size,
|  const ON_BrepFace *  |  face,
|  unsigned int  |  pack_id
)
static
Parameters: pack_seed_size - [in] >= 0 The minimum size quad grid that will be returned is pack_seed_size X pack_seed_size. face - [in] The quad pack will be grown around this face. pack_id - [in] If a quad pack is found, this is the id that will be assigned to each ON_BrepFace.m_pack_id in the quad pack. Returns: If a pack is found, ON_BrepQuadFacePack has details. Otherwise, ON_BrepQuadFacePack::Empty is returned.
◆ GetPackTagged()
 static const ON_BrepQuadFacePack ON_BrepQuadFacePack::GetPackTagged  |  ( |  const ON_BrepFace *  |  face,
|  unsigned  |  count
)
static
◆ GetSurface()
 const ON_NurbsSurface* ON_BrepQuadFacePack::GetSurface  |  ( |   | )
◆ GetSurfaceMixedKnots()
 const ON_NurbsSurface* ON_BrepQuadFacePack::GetSurfaceMixedKnots  |  ( |   | )
◆ GetSurfaceMultipleKnots()
 const ON_NurbsSurface* ON_BrepQuadFacePack::GetSurfaceMultipleKnots  |  ( |   | )
◆ GetSurfaceSimpleKnots()
 const ON_NurbsSurface* ON_BrepQuadFacePack::GetSurfaceSimpleKnots  |  ( |   | )
◆ GetTrims()
 const bool ON_BrepQuadFacePack::GetTrims  |  ( |  const ON_NurbsSurface *  |  srf,
|  ON_SimpleArray< int > *  |  trim_origs_pack,
|  ON_ObjectArray< ON_NurbsCurve > *  |  trim_curves_pack
)
◆ IsEmpty()
 bool ON_BrepQuadFacePack::IsEmpty  |  ( |   | ) |   const
inline
◆ IsNotEmpty()
 bool ON_BrepQuadFacePack::IsNotEmpty  |  ( |   | ) |   const
inline
◆ MatchPackFacesStructure()
 const bool ON_BrepQuadFacePack::MatchPackFacesStructure  |  ( |   | )
◆ operator=()
 ON_BrepQuadFacePack& ON_BrepQuadFacePack::operator=  |  ( |  const ON_BrepQuadFacePack &  |   | )
default
◆ OrientPackFaces()
 const bool ON_BrepQuadFacePack::OrientPackFaces  |  ( |   | )
Member Data Documentation
◆ Empty
 const ON_BrepQuadFacePack ON_BrepQuadFacePack::Empty
static
◆ m_corners
 ON_BrepQuadFacePackSide ON_BrepQuadFacePack::m_corners[4] {}
◆ m_size
 ON_2udex ON_BrepQuadFacePack::m_size = ON_2udex::Zero