Public Member Functions | Public Attributes | List of all members
ON_3dmViewTraceImage Class Reference
OpenNURBS
#include <opennurbs_3dm_settings.h>
 Public Member Functions
ON_3dmViewTraceImage ()
~ON_3dmViewTraceImage ()
void  | Default ()
bool  | operator!= (const ON_3dmViewTraceImage &) const
bool  | operator== (const ON_3dmViewTraceImage &) const
bool  | Read (ON_BinaryArchive &)
bool  | Write (ON_BinaryArchive &) const
 Public Attributes
bool  | m_bFiltered
true if image should be filtered (bilinear) before displayed. More...
bool  | m_bGrayScale
true if image should be black and white More...
bool  | m_bHidden
true if image is currently hidden from view More...
double  | m_height
ON_FileReference  | m_image_file_reference
ON_Plane  | m_plane
view window relative position and state in parent frame More...
double  | m_width
Detailed Description
ON_3dmViewTraceImage
Constructor & Destructor Documentation
◆ ON_3dmViewTraceImage()
 ON_3dmViewTraceImage::ON_3dmViewTraceImage  |  ( |   | )
◆ ~ON_3dmViewTraceImage()
 ON_3dmViewTraceImage::~ON_3dmViewTraceImage  |  ( |   | )
Member Function Documentation
◆ Default()
 void ON_3dmViewTraceImage::Default  |  ( |   | )
◆ operator!=()
 bool ON_3dmViewTraceImage::operator!=  |  ( |  const ON_3dmViewTraceImage &  |   | ) |   const
◆ operator==()
 bool ON_3dmViewTraceImage::operator==  |  ( |  const ON_3dmViewTraceImage &  |   | ) |   const
◆ Read()
 bool ON_3dmViewTraceImage::Read  |  ( |  ON_BinaryArchive &  |   | )
◆ Write()
 bool ON_3dmViewTraceImage::Write  |  ( |  ON_BinaryArchive &  |   | ) |   const
Member Data Documentation
◆ m_bFiltered
 bool ON_3dmViewTraceImage::m_bFiltered
true if image should be filtered (bilinear) before displayed.
◆ m_bGrayScale
 bool ON_3dmViewTraceImage::m_bGrayScale
true if image should be black and white
◆ m_bHidden
 bool ON_3dmViewTraceImage::m_bHidden
true if image is currently hidden from view
◆ m_height
 double ON_3dmViewTraceImage::m_height
◆ m_image_file_reference
 ON_FileReference ON_3dmViewTraceImage::m_image_file_reference
◆ m_plane
 ON_Plane ON_3dmViewTraceImage::m_plane
view window relative position and state in parent frame
◆ m_width
 double ON_3dmViewTraceImage::m_width