Static Public Member Functions | List of all members
ON_FileSystem Class Reference
OpenNURBS
#include <opennurbs_file_utilities.h>
 Static Public Member Functions
static bool  | IsDirectory (const char *path)
static bool  | IsDirectory (const wchar_t *path)
static bool  | IsDirectoryWithWriteAccess (const char *path)
static bool  | IsDirectoryWithWriteAccess (const wchar_t *path)
static bool  | IsFile (const char *path)
static bool  | IsFile (const wchar_t *path)
static bool  | PathExists (const char *path)
static bool  | PathExists (const wchar_t *path)
static bool  | RemoveFile (const char *file_path)
static bool  | RemoveFile (const wchar_t *file_path)
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org.
Member Function Documentation
◆ IsDirectory() [1/2]
 static bool ON_FileSystem::IsDirectory  |  ( |  const char *  |  path | )
static
Returns: True if path is a directory. False otherwise.
◆ IsDirectory() [2/2]
 static bool ON_FileSystem::IsDirectory  |  ( |  const wchar_t *  |  path | )
static
Returns: True if path is a directory. False otherwise.
◆ IsDirectoryWithWriteAccess() [1/2]
 static bool ON_FileSystem::IsDirectoryWithWriteAccess  |  ( |  const char *  |  path | )
static
Returns: True if path is a directory where files can be written. False otherwise.
◆ IsDirectoryWithWriteAccess() [2/2]
 static bool ON_FileSystem::IsDirectoryWithWriteAccess  |  ( |  const wchar_t *  |  path | )
static
Returns: True if path is a directory where files can be written. False otherwise.
◆ IsFile() [1/2]
 static bool ON_FileSystem::IsFile  |  ( |  const char *  |  path | )
static
Returns: True if path is a file. False otherwise.
◆ IsFile() [2/2]
 static bool ON_FileSystem::IsFile  |  ( |  const wchar_t *  |  path | )
static
Returns: True if path is a file. False otherwise.
◆ PathExists() [1/2]
 static bool ON_FileSystem::PathExists  |  ( |  const char *  |  path | )
static
◆ PathExists() [2/2]
 static bool ON_FileSystem::PathExists  |  ( |  const wchar_t *  |  path | )
static
◆ RemoveFile() [1/2]
 static bool ON_FileSystem::RemoveFile  |  ( |  const char *  |  file_path | )
static
Description Remove a file Parameters: file_path - [in] name of file to delete Returns: True if the file existed and was removed.
◆ RemoveFile() [2/2]
 static bool ON_FileSystem::RemoveFile  |  ( |  const wchar_t *  |  file_path | )
static
Description Remove a file Parameters: file_path - [in] name of file to delete Returns: True if the file existed and was removed.