Public Member Functions | Friends | List of all members
CRhinoDib::CFastPixelAccess Class Reference
#include <RhinoSdkUiDibMac.h>
 Public Member Functions
CFastPixelAccess (const CFastPixelAccess &)=delete
Copying. More...
CFastPixelAccess (const CFastPixelAccess &)=delete
Copying. More...
CFastPixelAccess (CRhinoDib &dib)
CFastPixelAccess (CRhinoDib &dib)
~CFastPixelAccess ()
~CFastPixelAccess ()
CRhinoDib &  | Dib (void)
CRhinoDib &  | Dib (void)
BOOL32  | GetPixel (long x, long y, int &r, int &g, int &b, int &alpha) const
BOOL32  | GetPixel (long x, long y, int &r, int &g, int &b, int &alpha) const
int  | Height (void) const
int  | Height (void) const
bool  | IsValid (void) const
bool  | IsValid (void) const
const CFastPixelAccess &  | operator= (const CFastPixelAccess &)=delete
const CFastPixelAccess &  | operator= (const CFastPixelAccess &)=delete
BOOL32  | SetPixel (long x, long y, int r, int g, int b, int alpha=255)
BOOL32  | SetPixel (long x, long y, int r, int g, int b, int alpha=255)
int  | Width (void) const
int  | Width (void) const
 Friends
class  | Impl
Constructor & Destructor Documentation
◆ CFastPixelAccess() [1/4]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  CRhinoDib &  |  dib | )
◆ ~CFastPixelAccess() [1/2]
 CRhinoDib::CFastPixelAccess::~CFastPixelAccess  |  ( |   | )
◆ CFastPixelAccess() [2/4]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  const CFastPixelAccess &  |   | )
delete
Copying.
◆ CFastPixelAccess() [3/4]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  CRhinoDib &  |  dib | )
◆ ~CFastPixelAccess() [2/2]
 CRhinoDib::CFastPixelAccess::~CFastPixelAccess  |  ( |   | )
◆ CFastPixelAccess() [4/4]
 CRhinoDib::CFastPixelAccess::CFastPixelAccess  |  ( |  const CFastPixelAccess &  |   | )
delete
Copying.
Member Function Documentation
◆ Dib() [1/2]
 CRhinoDib& CRhinoDib::CFastPixelAccess::Dib  |  ( |  void  |   | )
◆ Dib() [2/2]
 CRhinoDib& CRhinoDib::CFastPixelAccess::Dib  |  ( |  void  |   | )
◆ GetPixel() [1/2]
 BOOL32 CRhinoDib::CFastPixelAccess::GetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int &  |  r,
|  int &  |  g,
|  int &  |  b,
|  int &  |  alpha
) |   |  const
Note that these functions will call CRhinoDib::GetPixel or SetPixel if IsValid returns false (so they will also be slow) but in most cases, these functions will be way, way faster than the raw functions on CRhinoDib, as long as the object is retained during the pixel loop
◆ GetPixel() [2/2]
 BOOL32 CRhinoDib::CFastPixelAccess::GetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int &  |  r,
|  int &  |  g,
|  int &  |  b,
|  int &  |  alpha
) |   |  const
Note that these functions will call CRhinoDib::GetPixel or SetPixel if IsValid returns false (so they will also be slow) but in most cases, these functions will be way, way faster than the raw functions on CRhinoDib, as long as the object is retained during the pixel loop
◆ Height() [1/2]
 int CRhinoDib::CFastPixelAccess::Height  |  ( |  void  |   | ) |   const
◆ Height() [2/2]
 int CRhinoDib::CFastPixelAccess::Height  |  ( |  void  |   | ) |   const
◆ IsValid() [1/2]
 bool CRhinoDib::CFastPixelAccess::IsValid  |  ( |  void  |   | ) |   const
◆ IsValid() [2/2]
 bool CRhinoDib::CFastPixelAccess::IsValid  |  ( |  void  |   | ) |   const
◆ operator=() [1/2]
 const CFastPixelAccess& CRhinoDib::CFastPixelAccess::operator=  |  ( |  const CFastPixelAccess &  |   | )
delete
◆ operator=() [2/2]
 const CFastPixelAccess& CRhinoDib::CFastPixelAccess::operator=  |  ( |  const CFastPixelAccess &  |   | )
delete
◆ SetPixel() [1/2]
 BOOL32 CRhinoDib::CFastPixelAccess::SetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int  |  r,
|  int  |  g,
|  int  |  b,
|  int  |  alpha = 255
)
◆ SetPixel() [2/2]
 BOOL32 CRhinoDib::CFastPixelAccess::SetPixel  |  ( |  long  |  x,
|  long  |  y,
|  int  |  r,
|  int  |  g,
|  int  |  b,
|  int  |  alpha = 255
)
◆ Width() [1/2]
 int CRhinoDib::CFastPixelAccess::Width  |  ( |  void  |   | ) |   const
◆ Width() [2/2]
 int CRhinoDib::CFastPixelAccess::Width  |  ( |  void  |   | ) |   const
Friends And Related Function Documentation
◆ Impl
 Impl
friend