Public Member Functions | Public Attributes | List of all members
CRhinoGripStatus Class Reference
Rhino
#include <rhinoSdkGrips.h>
 Public Member Functions
CRhinoGripStatus ()
~CRhinoGripStatus ()
bool  | IsVisible () const
 Public Attributes
bool  | m_bAffectedBySoftTransform
bool  | m_bCulled
volitile and view dependent More...
bool  | m_bHighlighted
bool  | m_bLocked
bool  | m_bMoved
bool  | m_bVisible
CRhinoGripDirections  | m_directions
Constructor & Destructor Documentation
◆ CRhinoGripStatus()
 CRhinoGripStatus::CRhinoGripStatus  |  ( |   | )
◆ ~CRhinoGripStatus()
 CRhinoGripStatus::~CRhinoGripStatus  |  ( |   | )
Member Function Documentation
◆ IsVisible()
 bool CRhinoGripStatus::IsVisible  |  ( |   | ) |   const
Member Data Documentation
◆ m_bAffectedBySoftTransform
 bool CRhinoGripStatus::m_bAffectedBySoftTransform
◆ m_bCulled
 bool CRhinoGripStatus::m_bCulled
volitile and view dependent
◆ m_bHighlighted
 bool CRhinoGripStatus::m_bHighlighted
◆ m_bLocked
 bool CRhinoGripStatus::m_bLocked
◆ m_bMoved
 bool CRhinoGripStatus::m_bMoved
◆ m_bVisible
 bool CRhinoGripStatus::m_bVisible
◆ m_directions
 CRhinoGripDirections CRhinoGripStatus::m_directions