Public Types | Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_HatchPattern Class Reference
OpenNURBS
#include <opennurbs_hatch.h>
 Inheritance diagram for ON_HatchPattern:
 Public Types
enum  | HatchFillType : unsigned int { HatchFillType::Solid = 0, HatchFillType::Lines = 1 }
 Public Types inherited from ON_ModelComponent
enum  | Attributes : unsigned int {
 NoAttributes = 0U, ComponentSerialNumberAttribute = 0x0001U, TypeAttribute = 0x0002U, ModelSerialNumberAttribute = 0x0004U,
 IdAttribute = 0x0008U, IndexAttribute = 0x0010U, NameAttribute = 0x0020U, ParentIdAttribute = 0x0040U,
 DeletedNameAttribute = 0x0080U, ComponentStatusAttribute = 0x0100U, BinaryArchiveAttributes = 0x78U, AllAttributes = 0x1FFU,
 SystemComponentAttribute = 0x8000U
 }
enum  | Type : unsigned char {
 Type::Unset = 0, Type::Image = 1, Type::TextureMapping = 2, Type::Material = 3,
 Type::RenderMaterial = Material, Type::LinePattern = 4, Type::Layer = 5, Type::Group = 6,
 Type::TextStyle = 7, Type::DimStyle = 8, Type::RenderLight = 9, Type::HatchPattern = 10,
 Type::InstanceDefinition = 11, Type::ModelGeometry = 12, Type::HistoryRecord = 13, Type::RenderContent = 14,
 Type::EmbeddedFile = 15, Type::ObsoleteValue = 16, Type::SectionStyle = 17, Type::Markup = 18,
 Type::PageViewGroup = 19, Type::NumOf, Type::Mixed = 0xFE
 }
The ON_ModelComponent::Type enum has a value for each explicit component type and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator instance to iterate over the ON_ModelComponent::Type values. /summary> More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Public Member Functions
ON_HatchPattern () ON_NOEXCEPT
ON_HatchPattern (const ON_HatchPattern &)
~ON_HatchPattern ()=default
int  | AddHatchLine (const ON_HatchLine &line)
bool  | AlwaysModelDistances () const
const ON_wString &  | Description () const
void  | Dump (ON_TextLog &) const override
for debugging More...
ON_HatchPattern::HatchFillType  | FillType () const
Interface. More...
const ON_HatchLine *  | HatchLine (int index) const
int  | HatchLineCount () const
Interface functions for line hatches. More...
const ON_ClassArray< ON_HatchLine > &  | HatchLines () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Object overrides. More...
ON_HatchPattern &  | operator= (const ON_HatchPattern &)=default
ON::LengthUnitSystem  | PatternUnitSystem () const
bool  | Read (ON_BinaryArchive &) override
void  | RemoveAllHatchLines ()
bool  | RemoveHatchLine (int index)
void  | SetAlwaysModelDistances (bool on)
void  | SetDescription (const wchar_t *pDescription)
void  | SetFillType (ON_HatchPattern::HatchFillType fill_type)
int  | SetHatchLines (const ON_ClassArray< ON_HatchLine > &lines)
int  | SetHatchLines (size_t count, const ON_HatchLine *lines)
bool  | SetPatternUnitSystem (ON::LengthUnitSystem us)
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_ModelComponent
ON_ModelComponent () ON_NOEXCEPT
ON_ModelComponent (const ON_ModelComponent &source)
ON_ModelComponent (ON_ModelComponent::Type component_type) ON_NOEXCEPT
ON_ModelComponent (ON_ModelComponent::Type component_type, const ON_ModelComponent &source) ON_NOEXCEPT
Locked status of source attributes is not copied to permit copy and modify operations. More...
~ON_ModelComponent ()=default
bool  | ChangeName (const wchar_t *new_name, class ON_ComponentManifest *manifest)
bool  | ClearComponentType ()
bool  | ClearId ()
bool  | ClearIndex ()
unsigned int  | ClearModelComponentAttributes (unsigned int attributes_filter)
bool  | ClearModelComponentStatus ()
bool  | ClearModelSerialNumber ()
bool  | ClearName ()
bool  | ClearParentId ()
int  | CompareName (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareName (const wchar_t *other_name) const
int  | CompareNameExact (const ON_UUID &other_parent_id, const wchar_t *other_name) const
int  | CompareNameExact (const wchar_t *other_name) const
ON_ModelComponent::Type  | ComponentType () const
bool  | ComponentTypeIsLocked () const
bool  | ComponentTypeIsSet () const
ON__UINT64  | ContentVersionNumber () const
unsigned int  | CopyFrom (const ON_ModelComponent &src, unsigned int attributes_filter)
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
const ON_wString  | DeletedName () const
const ON_NameHash &  | DeletedNameHash () const
bool  | DeletedNameIsSet () const
bool  | DeleteName ()
void  | Dump (ON_TextLog &) const override
bool  | EraseIdentification (bool bIgnoreLocks)
const wchar_t *  | GetName (ON_wString &component_name) const
const ON_UUID &  | Id () const
bool  | IdIsLocked () const
bool  | IdIsNil () const
bool  | IdIsNotNil () const
bool  | IdIsSet () const
const ON_UUID &  | IfIdIsNilSetId ()
int  | Index () const
int  | Index (int unset_index_value) const
bool  | IndexIsLocked () const
bool  | IndexIsSet () const
unsigned int  | InstanceDefinitionModelSerialNumber () const
bool  | IsDeleted () const
bool  | IsHidden () const
bool  | IsLocked () const
bool  | IsReferenceComponent () const
bool  | IsSystemComponent () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
void  | LockAllSettingsExceptName ()
void  | LockComponentType ()
void  | LockId ()
void  | LockIndex ()
void  | LockModelComponentStatus ()
void  | LockModelSerialNumber ()
void  | LockName ()
void  | LockParentId ()
ON_ComponentStatus  | ModelComponentStatus () const
bool  | ModelComponentStatusIsLocked () const
bool  | ModelComponentStatusIsSet () const
ON_UUID  | ModelObjectId () const override
unsigned int  | ModelSerialNumber () const
bool  | ModelSerialNumberIsLocked () const
bool  | ModelSerialNumberIsSet () const
const ON_wString  | Name () const
const wchar_t *  | NameAsPointer () const
const ON_NameHash &  | NameHash () const
bool  | NameIsEmpty () const
bool  | NameIsLocked () const
bool  | NameIsNotEmpty () const
bool  | NameIsSet () const
const ON_NameHash  | NewNameHash (const wchar_t *new_name) const
ON_ModelComponent &  | operator= (const ON_ModelComponent &source)
const ON_UUID &  | ParentId () const
bool  | ParentIdIsLocked () const
bool  | ParentIdIsNil () const
bool  | ParentIdIsNotNil () const
bool  | ParentIdIsSet () const
bool  | ReadModelComponentAttributes (class ON_BinaryArchive &archive)
unsigned int  | ReferenceModelSerialNumber () const
ON__UINT64  | RuntimeSerialNumber () const
const ON_UUID &  | SetAndLockId ()
bool  | SetAsSystemComponent ()
bool  | SetAsUnsetSystemComponent ()
bool  | SetComponentType (ON_ModelComponent::Type component_component_type)
bool  | SetDeletedModelComponentState (bool bDeleted, class ON_ComponentManifest *manifest)
void  | SetHiddenModelComponentState (bool bHidden)
const ON_UUID &  | SetId ()
bool  | SetId (const ON_UUID &component_id)
bool  | SetIdentification (const class ON_ComponentManifestItem &manifest_item, const wchar_t *manifest_name, bool bSetId, bool bParentId, bool bSetName, bool bSetIndex)
bool  | SetIndex (int component_index)
bool  | SetLocalizedSystemComponentName (const wchar_t *system_component_localized_name)
void  | SetLockedModelComponentState (bool bLocked)
bool  | SetModelComponentStatus (ON_ComponentStatus component_status)
bool  | SetModelSerialNumber (unsigned int model_serial_number)
bool  | SetModelSerialNumber (unsigned int model_serial_number, unsigned int reference_model_serial_number, unsigned int instance_definition_model_serial_number)
bool  | SetName (const wchar_t *component_name)
bool  | SetParentId (const ON_UUID &parent_id)
bool  | SetWorksessionReferenceModelSerialNumber (unsigned int reference_model_serial_number)
unsigned int  | SizeOf () const override
bool  | UndeleteName ()
bool  | WriteModelComponentAttributes (class ON_BinaryArchive &archive, unsigned int attributes_filter) const
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
virtual ON::object_type  | ObjectType () const
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static int  | Compare (const ON_HatchPattern &a, const ON_HatchPattern &b)
compare everything except Index() value. More...
static int  | CompareAppearance (const ON_HatchPattern &a, const ON_HatchPattern &b)
static const ON_HatchPattern *  | FromModelComponentRef (const class ON_ModelComponentReference &model_component_reference, const ON_HatchPattern *none_return_value)
static ON_HatchPattern::HatchFillType  | HatchFillTypeFromUnsigned (unsigned hatch_fill_type_as_unsigned)
 Static Public Member Functions inherited from ON_ModelComponent
static int  | CompareId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareIdAndName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareName (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameAndId (const ON_ModelComponent &a, const ON_ModelComponent &b)
static int  | CompareNameExact (const ON_ModelComponent &a, const ON_ModelComponent &b)
static ON_ModelComponent::Type  | ComponentTypeFromUnsigned (unsigned int component_type_as_unsigned)
static bool  | ComponentTypeIsValid (ON_ModelComponent::Type component_type)
static bool  | ComponentTypeIsValidAndNotMixed (ON_ModelComponent::Type component_type)
static const ON_wString  | ComponentTypeToString (ON_ModelComponent::Type)
static bool  | IndexRequired (ON_ModelComponent::Type component_type)
static unsigned int  | Internal_SystemComponentHelper ()
For internal use. Never call this function. More...
static const wchar_t *  | IsNamePathSeparator (const wchar_t *s)
*static const wchar_t *  | IsReferencePrefixDelimiter (const wchar_t *s)
static const wchar_t *  | IsReferencePrefixSeparator (const wchar_t *s)
static bool  | IsValidComponentName (const class ON_ComponentManifest &model_manfest, const ON_ModelComponent &model_component, bool bPermitReferencePrefix, ON_wString &valid_name)
static bool  | IsValidComponentName (const ON_wString &candidate_component_name)
static bool  | IsValidComponentName (const wchar_t *candidate_component_name)
static bool  | IsValidComponentName (size_t length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (int length, const wchar_t *candidate_component_name)
static bool  | IsValidComponentNameFirstCodePoint (ON__UINT32 unicode_code_point)
static const ON_wString  | NameLeaf (const wchar_t *name)
static const ON_wString  | NameParent (const wchar_t *name, bool bIncludeReference)
static const ON_wString  | NameReferencePrefix (const wchar_t *name)
static ON__UINT64  | NextRuntimeSerialNumber ()
static const ON_wString  | RemoveAllReferencePrefixDelimiters (const wchar_t *name)
static const ON_wString  | RemoveReferencePrefix (const wchar_t *name)
static const ON_wString  | RemoveTrailingNamePathSeparator (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixDelimiter (const wchar_t *name)
static const ON_wString  | RemoveTrailingReferencePrefixSeparator (const wchar_t *name)
static void  | SplitName (const wchar_t *name, ON_wString &reference_prefix, ON_wString &name_parent, ON_wString &name_leaf)
static bool  | UniqueNameIgnoresCase (ON_ModelComponent::Type component_type)
static bool  | UniqueNameIncludesParent (ON_ModelComponent::Type component_type)
static bool  | UniqueNameRequired (ON_ModelComponent::Type component_type)
 Static Public Attributes
static const ON_HatchPattern  | Grid
index = -6, id set, unique and persistent More...
static const ON_HatchPattern  | Grid60
index = -7, id set, unique and persistent More...
static const ON_HatchPattern  | Hatch1
index = -2, id set, unique and persistent More...
static const ON_HatchPattern  | Hatch2
index = -3, id set, unique and persistent More...
static const ON_HatchPattern  | Hatch3
index = -4, id set, unique and persistent More...
static const ON_HatchPattern  | HatchDash
index = -5, id set, unique and persistent More...
static const ON_HatchPattern  | Plus
index = -8, id set, unique and persistent More...
static const ON_HatchPattern  | Solid
index = -1, id set, unique and persistent More...
static const ON_HatchPattern  | Squares
index = -9, id set, unique and persistent More...
static const ON_HatchPattern  | Unset
index = ON_UNSET_INT_INDEX, id = nil More...
 Static Public Attributes inherited from ON_ModelComponent
static const ON_wString  | NamePathSeparator
static const ON_wString  | ReferencePrefixDelimiter
static const ON_wString  | ReferencePrefixSeparator
static const ON_ModelComponent  | Unset
*static const ON_wString WorksessionReferencePrefix *const  | wchar_t
 Additional Inherited Members
 Protected Member Functions inherited from ON_ModelComponent
void  | IncrementContentVersionNumber () const
Detailed Description
class ON_HatchPattern /////////////////////////////////////////////////////////////// Fill definition for a hatch
The hatch will be one of ON_Hatch::ON_HatchPattern::HatchFillType::Lines - pat file style definition ON_Hatch::ON_HatchPattern::HatchFillType::Gradient - uses a color function ON_Hatch::ON_HatchPattern::HatchFillType::Solid - uses entity color
Member Enumeration Documentation
◆ HatchFillType
 enum ON_HatchPattern::HatchFillType : unsigned int
strong
Enumerator
Solid
uses entity color
Lines
pat file definition
Constructor & Destructor Documentation
◆ ON_HatchPattern() [1/2]
 ON_HatchPattern::ON_HatchPattern  |  ( |   | )
◆ ~ON_HatchPattern()
 ON_HatchPattern::~ON_HatchPattern  |  ( |   | )
default
◆ ON_HatchPattern() [2/2]
 ON_HatchPattern::ON_HatchPattern  |  ( |  const ON_HatchPattern &  |   | )
Member Function Documentation
◆ AddHatchLine()
 int ON_HatchPattern::AddHatchLine  |  ( |  const ON_HatchLine &  |  line | )
Description: Add an ON_HatchLine to the pattern Parameters: line - [in] the line to add Return: >= 0 index of the new line -1 on failure
◆ AlwaysModelDistances()
 bool ON_HatchPattern::AlwaysModelDistances  |  ( |   | ) |   const
Description: When true, pattern hatch lines are displayed always in models distances When false (default), lengths and widths are interpreted as lengths and widths on a page layout or in actual output prints
◆ Compare()
 static int ON_HatchPattern::Compare  |  ( |  const ON_HatchPattern &  |  a,
|  const ON_HatchPattern &  |  b
)
static
compare everything except Index() value.
◆ CompareAppearance()
 static int ON_HatchPattern::CompareAppearance  |  ( |  const ON_HatchPattern &  |  a,
|  const ON_HatchPattern &  |  b
)
static
Compare all settings (type, lines, ...) that effect the appearance. Ignore Index(), Id(), Name()
◆ Description()
 const ON_wString& ON_HatchPattern::Description  |  ( |   | ) |   const
Description: Get a short description of the pattern Parameters: string - [out] The string is returned here
◆ Dump()
 void ON_HatchPattern::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
◆ FillType()
 ON_HatchPattern::HatchFillType ON_HatchPattern::FillType  |  ( |   | ) |   const
Interface.
Description: Return the pattern's fill type Parameters:
◆ FromModelComponentRef()
 static const ON_HatchPattern* ON_HatchPattern::FromModelComponentRef  |  ( |  const class ON_ModelComponentReference &  |  model_component_reference,
|  const ON_HatchPattern *  |  none_return_value
)
static
Parameters: model_component_reference - [in] none_return_value - [in] value to return if ON_Layer::Cast(model_component_ref.ModelComponent()) is nullptr Returns: If ON_Layer::Cast(model_component_ref.ModelComponent()) is not nullptr, that pointer is returned. Otherwise, none_return_value is returned.
◆ HatchFillTypeFromUnsigned()
 static ON_HatchPattern::HatchFillType ON_HatchPattern::HatchFillTypeFromUnsigned  |  ( |  unsigned  |  hatch_fill_type_as_unsigned | )
static
◆ HatchLine()
 const ON_HatchLine* ON_HatchPattern::HatchLine  |  ( |  int  |  index | ) |   const
Description: Get the ON_HatchLine at index Parameters: index - [in] Index of the line to get Return: the hatch line nullptr if index is out of range
◆ HatchLineCount()
 int ON_HatchPattern::HatchLineCount  |  ( |   | ) |   const
Interface functions for line hatches.
Description: Get the number of ON_HatchLines in the pattern Parameters: Return: number of lines
◆ HatchLines()
 const ON_ClassArray<ON_HatchLine>& ON_HatchPattern::HatchLines  |  ( |   | ) |   const
◆ IsValid()
 bool ON_HatchPattern::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
ON_Object overrides.
Reimplemented from ON_Object.
◆ operator=()
 ON_HatchPattern& ON_HatchPattern::operator=  |  ( |  const ON_HatchPattern &  |   | )
default
◆ PatternUnitSystem()
 ON::LengthUnitSystem ON_HatchPattern::PatternUnitSystem  |  ( |   | ) |   const
Description: When ON::LengthUnitSystem::None, pattern hatch lines are always in models distances Else, hatch lines are definied using the returned unit system.
◆ Read()
 bool ON_HatchPattern::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ RemoveAllHatchLines()
 void ON_HatchPattern::RemoveAllHatchLines  |  ( |   | )
Description: Remove all of the hatch line from the pattern Parameters:
Return: true - success false - index out of range
◆ RemoveHatchLine()
 bool ON_HatchPattern::RemoveHatchLine  |  ( |  int  |  index | )
Description: Remove a hatch line from the pattern Parameters: index - [in] Index of the line to remove Return: true - success false - index out of range
◆ SetAlwaysModelDistances()
 void ON_HatchPattern::SetAlwaysModelDistances  |  ( |  bool  |  on | )
Description: Set how hatch lines are interpreted when displayed in layouts or printed
◆ SetDescription()
 void ON_HatchPattern::SetDescription  |  ( |  const wchar_t *  |  pDescription | )
Description: Set the short description of the pattern Parameters: pDescription - [in] the new description Returns:
◆ SetFillType()
 void ON_HatchPattern::SetFillType  |  ( |  ON_HatchPattern::HatchFillType  |  fill_type | )
Description: Set the pattern's fill type Parameters: type - [in] the new filltype
◆ SetHatchLines() [1/2]
 int ON_HatchPattern::SetHatchLines  |  ( |  const ON_ClassArray< ON_HatchLine > &  |  lines | )
Description: Set all of the hatch lines at once. Existing hatchlines are deleted. Parameters: lines - [in] Array of lines to add. Lines are copied Return: number of lines added
◆ SetHatchLines() [2/2]
 int ON_HatchPattern::SetHatchLines  |  ( |  size_t  |  count,
|  const ON_HatchLine *  |  lines
)
◆ SetPatternUnitSystem()
 bool ON_HatchPattern::SetPatternUnitSystem  |  ( |  ON::LengthUnitSystem  |  us | )
Description: Set how hatch lines lengths are defined.
◆ Write()
 bool ON_HatchPattern::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
Member Data Documentation
◆ Grid
 const ON_HatchPattern ON_HatchPattern::Grid
static
index = -6, id set, unique and persistent
◆ Grid60
 const ON_HatchPattern ON_HatchPattern::Grid60
static
index = -7, id set, unique and persistent
◆ Hatch1
 const ON_HatchPattern ON_HatchPattern::Hatch1
static
index = -2, id set, unique and persistent
◆ Hatch2
 const ON_HatchPattern ON_HatchPattern::Hatch2
static
index = -3, id set, unique and persistent
◆ Hatch3
 const ON_HatchPattern ON_HatchPattern::Hatch3
static
index = -4, id set, unique and persistent
◆ HatchDash
 const ON_HatchPattern ON_HatchPattern::HatchDash
static
index = -5, id set, unique and persistent
◆ Plus
 const ON_HatchPattern ON_HatchPattern::Plus
static
index = -8, id set, unique and persistent
◆ Solid
 const ON_HatchPattern ON_HatchPattern::Solid
static
index = -1, id set, unique and persistent
◆ Squares
 const ON_HatchPattern ON_HatchPattern::Squares
static
index = -9, id set, unique and persistent
◆ Unset
 const ON_HatchPattern ON_HatchPattern::Unset
static
index = ON_UNSET_INT_INDEX, id = nil