Public Member Functions | Static Public Member Functions | Static Public Attributes | List of all members
ON_TextDot Class Reference
OpenNURBS
#include <opennurbs_annotationbase.h>
 Inheritance diagram for ON_TextDot:
 Public Member Functions
ON_TextDot ()
ON_TextDot (const ON_TextDot &)=default
ON_TextDot (ON_3dPoint center_point, const wchar_t *primary_text, const wchar_t *secondary_text)
~ON_TextDot ()
bool  | AlwaysOnTop () const
bool  | Bold () const
ON_3dPoint  | CenterPoint () const
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Dimension () const override
void  | Dump (ON_TextLog &log) const override
void  | EmergencyDestroy ()
const wchar_t *  | FontFace () const
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override
 More...
int  | HeightInPoints () const
bool  | IsDeformable () const override
virtual ON_Geometry::IsDeformable() override More...
bool  | IsMorphable () const override
virtual ON_Geometry override More...
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
bool  | Italic () const
bool  | MakeDeformable () override
virtual ON_Geometry::MakeDeformable() override More...
bool  | Morph (const ON_SpaceMorph &morph) override
virtual ON_Geometry override More...
ON::object_type  | ObjectType () const override
ON_TextDot &  | operator= (const ON_TextDot &)=default
const ON_3dPoint &  | Point () const
const wchar_t *  | PrimaryText () const
bool  | Read (ON_BinaryArchive &ar) override
const wchar_t *  | SecondaryText () const
void  | SetAlwaysOnTop (bool bAlwaysOnTop)
void  | SetBold (bool bBold)
void  | SetCenterPoint (ON_3dPoint center_point)
void  | SetFontFace (const wchar_t *font_face)
void  | SetHeightInPoints (int height_in_points)
void  | SetItalic (bool bItalic)
void  | SetPoint (const ON_3dPoint &point)
void  | SetPrimaryText (const wchar_t *primary_dot_text)
void  | SetSecondaryText (const wchar_t *secondary_dot_text)
void  | SetTextString (const wchar_t *string)
void  | SetTransparent (bool bTransparent)
unsigned int  | SizeOf () const override
virtual ON_Object::SizeOf override More...
const wchar_t *  | TextString () const
bool  | Transform (const ON_Xform &xform) override
bool  | Transparent () const
bool  | Write (ON_BinaryArchive &ar) const override
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | HasBrepForm () const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
virtual void  | DestroyRuntimeCache (bool bDelete=true)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Static Public Member Functions
static ON_TextDot *  | CreateFromV2AnnotationTextDot (const class ON_OBSOLETE_V2_TextDot &V2_text_dot, const class ON_3dmAnnotationContext *annotation_context, ON_TextDot *destination)
 Static Public Attributes
static const wchar_t *  | DefaultFontFace
Arial. More...
static const int  | DefaultHeightInPoints
14 points More...
static const int  | MinimumHeightInPoints
3 points More...
static const ON_TextDot  | Unset
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
Detailed Description
A simple dot with text that doesn't rotate with the world axes
Constructor & Destructor Documentation
◆ ON_TextDot() [1/3]
 ON_TextDot::ON_TextDot  |  ( |   | )
◆ ~ON_TextDot()
 ON_TextDot::~ON_TextDot  |  ( |   | )
◆ ON_TextDot() [2/3]
 ON_TextDot::ON_TextDot  |  ( |  const ON_TextDot &  |   | )
default
◆ ON_TextDot() [3/3]
 ON_TextDot::ON_TextDot  |  ( |  ON_3dPoint  |  center_point,
|  const wchar_t *  |  primary_text,
|  const wchar_t *  |  secondary_text
)
Member Function Documentation
◆ AlwaysOnTop()
 bool ON_TextDot::AlwaysOnTop  |  ( |   | ) |   const
◆ Bold()
 bool ON_TextDot::Bold  |  ( |   | ) |   const
◆ CenterPoint()
 ON_3dPoint ON_TextDot::CenterPoint  |  ( |   | ) |   const
◆ CreateFromV2AnnotationTextDot()
 static ON_TextDot* ON_TextDot::CreateFromV2AnnotationTextDot  |  ( |  const class ON_OBSOLETE_V2_TextDot &  |  V2_text_dot,
|  const class ON_3dmAnnotationContext *  |  annotation_context,
|  ON_TextDot *  |  destination
)
static
◆ DataCRC()
 ON__UINT32 ON_TextDot::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Dimension()
 int ON_TextDot::Dimension  |  ( |   | ) |   const
overridevirtual
 ON_Geometry overrides Returns the geometric dimension of the object ( usually 3)
Reimplemented from ON_Geometry.
◆ Dump()
 void ON_TextDot::Dump  |  ( |  ON_TextLog &  |  log | ) |   const
overridevirtual
Description: Write data values to a text file for debugging
Reimplemented from ON_Object.
◆ EmergencyDestroy()
 void ON_TextDot::EmergencyDestroy  |  ( |   | )
◆ FontFace()
 const wchar_t* ON_TextDot::FontFace  |  ( |   | ) |   const
Returns: Primary text font face. Default = "Arial Bold"; Remarks: Never save the pointer value for future use. Save a copy in ON_wString if the text is needed beyond the scope of the call to FontFace().
◆ GetBBox()
 bool ON_TextDot::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ HeightInPoints()
 int ON_TextDot::HeightInPoints  |  ( |   | ) |   const
Returns: Text height in "points". Remarks: Default height = 14;
◆ IsDeformable()
 bool ON_TextDot::IsDeformable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry::IsDeformable() override
Reimplemented from ON_Geometry.
◆ IsMorphable()
 bool ON_TextDot::IsMorphable  |  ( |   | ) |   const
overridevirtual
virtual ON_Geometry override
Reimplemented from ON_Geometry.
◆ IsValid()
 bool ON_TextDot::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Object.
◆ Italic()
 bool ON_TextDot::Italic  |  ( |   | ) |   const
◆ MakeDeformable()
 bool ON_TextDot::MakeDeformable  |  ( |   | )
overridevirtual
virtual ON_Geometry::MakeDeformable() override
Reimplemented from ON_Geometry.
◆ Morph()
 bool ON_TextDot::Morph  |  ( |  const ON_SpaceMorph &  |  morph | )
override
virtual ON_Geometry override
◆ ObjectType()
 ON::object_type ON_TextDot::ObjectType  |  ( |   | ) |   const
overridevirtual
Returns: The Object Type of this object
Reimplemented from ON_Object.
◆ operator=()
 ON_TextDot& ON_TextDot::operator=  |  ( |  const ON_TextDot &  |   | )
default
◆ Point()
 const ON_3dPoint& ON_TextDot::Point  |  ( |   | ) |   const
Deprecated:
use CenterPoint
◆ PrimaryText()
 const wchar_t* ON_TextDot::PrimaryText  |  ( |   | ) |   const
Returns: Dot's primary text displayed in the model Typically a short and terse string. Default = empty string. Remarks: Additional information can be saved as secondary text.
Never save the pointer value for future use. Save a copy in ON_wString if the text is needed beyond the scope of the call to Text().
◆ Read()
 bool ON_TextDot::Read  |  ( |  ON_BinaryArchive &  |  ar | )
overridevirtual
Description: Reads the object from a file
Returns: @untitled Table true Success false Failure
Reimplemented from ON_Object.
◆ SecondaryText()
 const wchar_t* ON_TextDot::SecondaryText  |  ( |   | ) |   const
Returns: Dot's secondary text displayed when a user interface event like clicking or hovering occurs. Typically longer and more detailed than the primary text. Default = empty string. Remarks: Never save the pointer value for future use. Save a copy in ON_wString if the text is needed beyond the scope of the call to Text().
◆ SetAlwaysOnTop()
 void ON_TextDot::SetAlwaysOnTop  |  ( |  bool  |  bAlwaysOnTop | )
Description: Get or Set whether the dot is drawn "On Top" of other geometry Parameters: [in] bTop bool - It is or isn't on top Returns: @untitled table true - on top false - not on top
◆ SetBold()
 void ON_TextDot::SetBold  |  ( |  bool  |  bBold | )
Description: Get or Set whether the dot is drawn with Bold text Parameters: [in] bBold bool - It is or isn't Bold Returns: @untitled table true - Bold false - not Bold
◆ SetCenterPoint()
 void ON_TextDot::SetCenterPoint  |  ( |  ON_3dPoint  |  center_point | )
◆ SetFontFace()
 void ON_TextDot::SetFontFace  |  ( |  const wchar_t *  |  font_face | )
◆ SetHeightInPoints()
 void ON_TextDot::SetHeightInPoints  |  ( |  int  |  height_in_points | )
◆ SetItalic()
 void ON_TextDot::SetItalic  |  ( |  bool  |  bItalic | )
Description: Get or Set whether the dot is drawn with Italic text Parameters: [in] bItalic bool - It is or isn't Italic Returns: @untitled table true - Italic false - not Italic
◆ SetPoint()
 void ON_TextDot::SetPoint  |  ( |  const ON_3dPoint &  |  point | )
Deprecated:
use SetCenterPoint
◆ SetPrimaryText()
 void ON_TextDot::SetPrimaryText  |  ( |  const wchar_t *  |  primary_dot_text | )
◆ SetSecondaryText()
 void ON_TextDot::SetSecondaryText  |  ( |  const wchar_t *  |  secondary_dot_text | )
◆ SetTextString()
 void ON_TextDot::SetTextString  |  ( |  const wchar_t *  |  string | )
Deprecated:
use SetPrimaryText
◆ SetTransparent()
 void ON_TextDot::SetTransparent  |  ( |  bool  |  bTransparent | )
Description: Get or Set whether the dot is drawn with a transparent background Parameters: [in] bTransparent bool - It is or isn't transparent Returns: @untitled table true - transparent false - not transparent
◆ SizeOf()
 unsigned int ON_TextDot::SizeOf  |  ( |   | ) |   const
overridevirtual
virtual ON_Object::SizeOf override
 ON_Object overrides
Reimplemented from ON_Object.
◆ TextString()
 const wchar_t* ON_TextDot::TextString  |  ( |   | ) |   const
Deprecated:
use PrimaryText
◆ Transform()
 bool ON_TextDot::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: Transform the object by a 4x4 xform matrix Parameters: [in] xform - An ON_Xform with the transformation information Returns: true = Success false = Failure Remarks: The object has been transformed when the function returns
Reimplemented from ON_Geometry.
◆ Transparent()
 bool ON_TextDot::Transparent  |  ( |   | ) |   const
◆ Write()
 bool ON_TextDot::Write  |  ( |  ON_BinaryArchive &  |  ar | ) |   const
overridevirtual
Description: Writes the object to a file
Returns: @untitled Table true Success false Failure
Reimplemented from ON_Object.
Member Data Documentation
◆ DefaultFontFace
 const wchar_t* ON_TextDot::DefaultFontFace
static
Arial.
◆ DefaultHeightInPoints
 const int ON_TextDot::DefaultHeightInPoints
static
14 points
◆ MinimumHeightInPoints
 const int ON_TextDot::MinimumHeightInPoints
static
3 points
◆ Unset
 const ON_TextDot ON_TextDot::Unset
static