Public Member Functions | List of all members
CRhRdkBasicTwoColorTextureBaseCSI Class Reference
RDK
#include <RhRdkDeprecated.h>
 Inheritance diagram for CRhRdkBasicTwoColorTextureBaseCSI:
 Public Member Functions
CRhRdkBasicTwoColorTextureBaseCSI (const CRhRdkContent *p, CRhRdkContent::CSIContext c)
 Public Member Functions inherited from CRhRdkTwoColorTextureBaseCSI
CRhRdkTwoColorTextureBaseCSI (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CRhRdkTwoColorTextureBaseCSI ()
virtual bool  | NextChildSlot (ON_wString &sParamNameOut, ON_wString &sChildSlotNameOut, ON_wString &sDisplayNameOut)
 Public Member Functions inherited from CRhRdkOneColorTextureBaseCSI
CRhRdkOneColorTextureBaseCSI (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CRhRdkOneColorTextureBaseCSI ()
 Public Member Functions inherited from CRhRdkContent::CChildSlotIterator
CChildSlotIterator (const CRhRdkContent *pContent, CRhRdkContent::CSIContext context)
virtual  | ~CChildSlotIterator ()
virtual void *  | EVF (const wchar_t *wszFunc, void *pvData)
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkOneColorTextureBaseCSI
virtual void  | IncIndex (void)
virtual int  | Index (void) const
 Protected Attributes inherited from CRhRdkContent::CChildSlotIterator
CRhRdkContent::CSIContext  | m_Context
const CRhRdkContent *  | m_pContent
ON__UINT_PTR  | m_reserved
Constructor & Destructor Documentation
◆ CRhRdkBasicTwoColorTextureBaseCSI()
 CRhRdkBasicTwoColorTextureBaseCSI::CRhRdkBasicTwoColorTextureBaseCSI  |  ( |  const CRhRdkContent *  |  p,
|  CRhRdkContent::CSIContext  |  c
)
inline