Classes | Public Member Functions | List of all members
ON_ShutLining::Curve Class Referencefinal
#include <opennurbs_mesh_modifiers.h>
 Classes
class  | Defaults
 Public Member Functions
Curve (const Curve &)=delete
Curve (const ON_XMLNode &curve_node)
~Curve ()
bool  | Enabled (void) const
Specifies whether shut-line is created for the this curve. More...
ON_UUID  | Id (void) const
Specifies the id of the curve object to use for a shut-line. More...
bool  | IsBump (void) const
Specifies whether to create a bump instead of a dent for this curve. More...
bool  | operator!= (const Curve &c) const
const Curve &  | operator= (const Curve &c)
bool  | operator== (const Curve &c) const
int  | Profile (void) const
Specifies the profile of the shut-line for this curve. More...
bool  | Pull (void) const
Specifies whether this curve is pulled to the surface before creating the shut-line. More...
double  | Radius (void) const
Specifies the radius of the pipe used to create the shut-line for this curve. More...
void  | SetEnabled (bool b)
void  | SetId (const ON_UUID &id)
void  | SetIsBump (bool b)
void  | SetProfile (int p)
void  | SetPull (bool b)
void  | SetRadius (double d)
void  | ToXML (ON_XMLNode &node) const
For internal use only. More...
Constructor & Destructor Documentation
◆ Curve() [1/2]
 ON_ShutLining::Curve::Curve  |  ( |  const ON_XMLNode &  |  curve_node | )
◆ Curve() [2/2]
 ON_ShutLining::Curve::Curve  |  ( |  const Curve &  |   | )
delete
◆ ~Curve()
 ON_ShutLining::Curve::~Curve  |  ( |   | )
Member Function Documentation
◆ Enabled()
 bool ON_ShutLining::Curve::Enabled  |  ( |  void  |   | ) |   const
Specifies whether shut-line is created for the this curve.
◆ Id()
 ON_UUID ON_ShutLining::Curve::Id  |  ( |  void  |   | ) |   const
Specifies the id of the curve object to use for a shut-line.
◆ IsBump()
 bool ON_ShutLining::Curve::IsBump  |  ( |  void  |   | ) |   const
Specifies whether to create a bump instead of a dent for this curve.
◆ operator!=()
 bool ON_ShutLining::Curve::operator!=  |  ( |  const Curve &  |  c | ) |   const
◆ operator=()
 const Curve& ON_ShutLining::Curve::operator=  |  ( |  const Curve &  |  c | )
◆ operator==()
 bool ON_ShutLining::Curve::operator==  |  ( |  const Curve &  |  c | ) |   const
◆ Profile()
 int ON_ShutLining::Curve::Profile  |  ( |  void  |   | ) |   const
Specifies the profile of the shut-line for this curve.
◆ Pull()
 bool ON_ShutLining::Curve::Pull  |  ( |  void  |   | ) |   const
Specifies whether this curve is pulled to the surface before creating the shut-line.
◆ Radius()
 double ON_ShutLining::Curve::Radius  |  ( |  void  |   | ) |   const
Specifies the radius of the pipe used to create the shut-line for this curve.
◆ SetEnabled()
 void ON_ShutLining::Curve::SetEnabled  |  ( |  bool  |  b | )
◆ SetId()
 void ON_ShutLining::Curve::SetId  |  ( |  const ON_UUID &  |  id | )
◆ SetIsBump()
 void ON_ShutLining::Curve::SetIsBump  |  ( |  bool  |  b | )
◆ SetProfile()
 void ON_ShutLining::Curve::SetProfile  |  ( |  int  |  p | )
◆ SetPull()
 void ON_ShutLining::Curve::SetPull  |  ( |  bool  |  b | )
◆ SetRadius()
 void ON_ShutLining::Curve::SetRadius  |  ( |  double  |  d | )
◆ ToXML()
 void ON_ShutLining::Curve::ToXML  |  ( |  ON_XMLNode &  |  node | ) |   const
For internal use only.