Public Member Functions | List of all members
CRhRdkTwoColorEvaluator Class Reference
RDK
#include <RhRdkTwoColorTextureBase.h>
 Inheritance diagram for CRhRdkTwoColorEvaluator:
 Public Member Functions
CRhRdkTwoColorEvaluator (const class CRhRdkTwoColorTextureBase &texture, CEvalFlags ef, bool bCreateTexEvals=true)
virtual  | ~CRhRdkTwoColorEvaluator ()
virtual const CRhRdkColor &  | Color2 (void) const
virtual CRhRdkColor  | OutputColor (int colorNumber, const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, void *) const
virtual bool  | RegisterChildCallback (IChildCallback *pChildCallback, const CRhRdkTexture &texture, void *pvData)
virtual double  | TextureAmount2 (void) const
virtual bool  | TextureOn2 (void) const
 Public Member Functions inherited from CRhRdkOneColorEvaluator
CRhRdkOneColorEvaluator (const class CRhRdkOneColorTextureBase &texture, CEvalFlags ef, bool bCreateTexEvals=true)
virtual  | ~CRhRdkOneColorEvaluator ()
virtual const CRhRdkColor &  | Color1 (void) const
virtual void  | DeleteThis (void)
virtual void *  | EVF (const wchar_t *, void *)
virtual bool  | GetColor (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, CRhRdkColor &colOut, void *pvData=nullptr) const
virtual bool  | GetColor2 (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, CRhRdkColor &colOut, void *pvData=nullptr) const
virtual CRhRdkColor  | GetColorSample (const ON_3dPoint &uvw, const ON_3dVector &duvwdx, const ON_3dVector &duvwdy, void *) const =0
virtual const ON_Xform &  | LocalMappingTransform (void) const
virtual double  | TextureAmount1 (void) const
virtual bool  | TextureOn1 (void) const
 Public Member Functions inherited from CRhRdkTextureEvaluator
bool  | AdjustmentOn (void) const
virtual const IChildCallback *  | ChildCallback (void) const override
const CEvalFlags &  | EvaluatorFlags (void) const
bool  | FilteringOn (void) const
virtual bool  | Initialize (void) override
bool  | LocalMappingOn (void) const
bool  | ProjectionChangeOn (void) const
 Public Member Functions inherited from CRhRdkObject
CRhRdkObject ()
virtual  | ~CRhRdkObject ()
void  | operator delete (void *buf)
void  | operator delete[] (void *buf)
void *  | operator new (size_t size)
void *  | operator new[] (size_t size)
 Public Member Functions inherited from IRhRdkTextureEvaluator
bool  | WriteByteArray (const ON_2iSize &size, unsigned char *buffer) const
bool  | WriteFloatArray (const ON_2iSize &size, float *buffer) const
 Additional Inherited Members
 Static Public Member Functions inherited from CRhRdkObject
static void  | CheckMemory (void)
static void  | PopulateDebuggingInfo (void)
static void  | ReportLeaksSinceCheckpoint (void)
static void  | SetLeakCheckpoint (void)
 Protected Member Functions inherited from CRhRdkTextureEvaluator
CRhRdkTextureEvaluator (IRhRdkTextureEvaluator::CEvalFlags ef)
virtual  | ~CRhRdkTextureEvaluator ()
 Protected Member Functions inherited from IRhRdkTextureEvaluator
virtual  | ~IRhRdkTextureEvaluator ()
 Protected Attributes inherited from CRhRdkOneColorEvaluator
class CRhRdkOneColorEvaluatorImpl *  | m_pImpl1
Constructor & Destructor Documentation
◆ CRhRdkTwoColorEvaluator()
 CRhRdkTwoColorEvaluator::CRhRdkTwoColorEvaluator  |  ( |  const class CRhRdkTwoColorTextureBase &  |  texture,
|  CEvalFlags  |  ef,
|  bool  |  bCreateTexEvals = true
)
◆ ~CRhRdkTwoColorEvaluator()
 virtual CRhRdkTwoColorEvaluator::~CRhRdkTwoColorEvaluator  |  ( |   | )
virtual
Member Function Documentation
◆ Color2()
 virtual const CRhRdkColor& CRhRdkTwoColorEvaluator::Color2  |  ( |  void  |   | ) |   const
virtual
◆ OutputColor()
 virtual CRhRdkColor CRhRdkTwoColorEvaluator::OutputColor  |  ( |  int  |  colorNumber,
|  const ON_3dPoint &  |  uvw,
|  const ON_3dVector &  |  duvwdx,
|  const ON_3dVector &  |  duvwdy,
|  void *
) |   |  const
virtual
Reimplemented from CRhRdkOneColorEvaluator.
◆ RegisterChildCallback()
 virtual bool CRhRdkTwoColorEvaluator::RegisterChildCallback  |  ( |  IChildCallback *  |  pChildCallback,
|  const CRhRdkTexture &  |  texture,
|  void *  |  pvData
)
virtual
Implements IRhRdkTextureEvaluator::RegisterChildCallback().
Reimplemented from CRhRdkOneColorEvaluator.
◆ TextureAmount2()
 virtual double CRhRdkTwoColorEvaluator::TextureAmount2  |  ( |  void  |   | ) |   const
virtual
◆ TextureOn2()
 virtual bool CRhRdkTwoColorEvaluator::TextureOn2  |  ( |  void  |   | ) |   const
virtual