Public Member Functions | Friends | List of all members
CRhinoCommandManager Class Reference
Rhino
#include <rhinoSdkCommand.h>
 Public Member Functions
int  | GetCommandNames (ON_ClassArray< ON_wString > &names, bool english, bool loaded) const
CRhinoCommand *  | LookupCommand (const UUID &command_uuid) const
CRhinoCommand *  | LookupCommandName (const wchar_t *command_name) const
CRhinoCommand *  | LookupEnglishCommandName (const wchar_t *english_command_name) const
CRhinoCommand *  | LookupLocalCommandName (const wchar_t *local_command_name) const
 Friends
class  | CRhCommandManager
Detailed Description
Description: Public interface to lookup commands by name and uuid
Member Function Documentation
◆ GetCommandNames()
 int CRhinoCommandManager::GetCommandNames  |  ( |  ON_ClassArray< ON_wString > &  |  names,
|  bool  |  english,
|  bool  |  loaded
) |   |  const
Description: Get list of command names in Rhino. This list does not include Test, Alpha, or System commands Parameters: names - [out] names for every command are appended to this list english - [in] if true, retrieve the english name for every command if false, retrieve the local name for every command loaded - [in] if true, only get names of currently loaded commands if false, get names of all registered (may not be currently loaded) commands Returns: Number of commands appended to the list.
◆ LookupCommand()
 CRhinoCommand* CRhinoCommandManager::LookupCommand  |  ( |  const UUID &  |  command_uuid | ) |   const
Description: Lookup a command from it uuid. Parameters: command_uuid - [in] Returns: Pointer to the command or NULL if no command was found
◆ LookupCommandName()
 CRhinoCommand* CRhinoCommandManager::LookupCommandName  |  ( |  const wchar_t *  |  command_name | ) |   const
Description: Lookup a command from a command name using the same algorithm that is used when a user types thae command name. Parameters: command_name - [in] command name with optional RHINO_SCRIPT_COMMAND_PREFIX and/or RHINO_ENGLISH_COMMAND_PREFIX characters in any order. Returns: Pointer to the command or NULL if no command was found
◆ LookupEnglishCommandName()
 CRhinoCommand* CRhinoCommandManager::LookupEnglishCommandName  |  ( |  const wchar_t *  |  english_command_name | ) |   const
Description: Lookup a command from the english command name. Parameters: command_name - [in] english command name. Returns: Pointer to the command or NULL if no command was found
◆ LookupLocalCommandName()
 CRhinoCommand* CRhinoCommandManager::LookupLocalCommandName  |  ( |  const wchar_t *  |  local_command_name | ) |   const
Description: Lookup a command from the local command name. Parameters: command_name - [in] local command name. Returns: Pointer to the command or NULL if no command was found
Friends And Related Function Documentation
◆ CRhCommandManager
 friend class CRhCommandManager
friend