Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppMouseSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppMouseSettings ()
void  | Defaults ()
void  | LoadProfile (CRhinoProfileContext &pc)
load from registry More...
bool  | operator!= (const CRhinoAppMouseSettings &) const
bool  | operator== (const CRhinoAppMouseSettings &) const
void  | SaveProfile (CRhinoProfileContext &) const
save in registry More...
void  | Validate ()
 Public Attributes
bool  | m_bEnableSelectedGripDrag
true if mouse can drag selected grips More...
bool  | m_bEnableSelectedObjectDrag
true if mouse can drag selected objects More...
bool  | m_bEnableUnselectedGripDrag
true if mouse can drag unselected grips More...
bool  | m_bEnableUnselectedObjectDrag
true if mouse can drag unselected objects More...
int  | m_left_mouse_dblclk_remap
int  | m_left_mouse_down_remap
mouse event remap More...
int  | m_left_mouse_move_remap
int  | m_left_mouse_up_remap
int  | m_middle_mouse_dblclk_remap
int  | m_middle_mouse_down_remap
int  | m_middle_mouse_move_remap
int  | m_middle_mouse_up_remap
int  | m_mouse_move_grip_tol
int  | m_mouse_move_object_tol
int  | m_mouse_move_tol
int  | m_right_mouse_dblclk_remap
int  | m_right_mouse_down_remap
int  | m_right_mouse_move_remap
int  | m_right_mouse_up_remap
 Static Public Attributes
static const CRhinoAppMouseSettings  | Default
Detailed Description
Constructor & Destructor Documentation
◆ CRhinoAppMouseSettings()
 CRhinoAppMouseSettings::CRhinoAppMouseSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppMouseSettings::Defaults  |  ( |   | )
◆ LoadProfile()
 void CRhinoAppMouseSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
load from registry
◆ operator!=()
 bool CRhinoAppMouseSettings::operator!=  |  ( |  const CRhinoAppMouseSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppMouseSettings::operator==  |  ( |  const CRhinoAppMouseSettings &  |   | ) |   const
◆ SaveProfile()
 void CRhinoAppMouseSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
save in registry
◆ Validate()
 void CRhinoAppMouseSettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoAppMouseSettings CRhinoAppMouseSettings::Default
static
◆ m_bEnableSelectedGripDrag
 bool CRhinoAppMouseSettings::m_bEnableSelectedGripDrag
true if mouse can drag selected grips
◆ m_bEnableSelectedObjectDrag
 bool CRhinoAppMouseSettings::m_bEnableSelectedObjectDrag
true if mouse can drag selected objects
◆ m_bEnableUnselectedGripDrag
 bool CRhinoAppMouseSettings::m_bEnableUnselectedGripDrag
true if mouse can drag unselected grips
◆ m_bEnableUnselectedObjectDrag
 bool CRhinoAppMouseSettings::m_bEnableUnselectedObjectDrag
true if mouse can drag unselected objects
◆ m_left_mouse_dblclk_remap
 int CRhinoAppMouseSettings::m_left_mouse_dblclk_remap
◆ m_left_mouse_down_remap
 int CRhinoAppMouseSettings::m_left_mouse_down_remap
mouse event remap
◆ m_left_mouse_move_remap
 int CRhinoAppMouseSettings::m_left_mouse_move_remap
◆ m_left_mouse_up_remap
 int CRhinoAppMouseSettings::m_left_mouse_up_remap
◆ m_middle_mouse_dblclk_remap
 int CRhinoAppMouseSettings::m_middle_mouse_dblclk_remap
◆ m_middle_mouse_down_remap
 int CRhinoAppMouseSettings::m_middle_mouse_down_remap
◆ m_middle_mouse_move_remap
 int CRhinoAppMouseSettings::m_middle_mouse_move_remap
◆ m_middle_mouse_up_remap
 int CRhinoAppMouseSettings::m_middle_mouse_up_remap
◆ m_mouse_move_grip_tol
 int CRhinoAppMouseSettings::m_mouse_move_grip_tol
number of pixels the mouse must move to trigger a control point drag (>=m_mouse_move_tol)
◆ m_mouse_move_object_tol
 int CRhinoAppMouseSettings::m_mouse_move_object_tol
number of pixels the mouse must move to trigger an object drag event (>=m_mouse_move_tol)
◆ m_mouse_move_tol
 int CRhinoAppMouseSettings::m_mouse_move_tol
number of pixels the mouse must move to trigger any mouse move UI event
◆ m_right_mouse_dblclk_remap
 int CRhinoAppMouseSettings::m_right_mouse_dblclk_remap
◆ m_right_mouse_down_remap
 int CRhinoAppMouseSettings::m_right_mouse_down_remap
◆ m_right_mouse_move_remap
 int CRhinoAppMouseSettings::m_right_mouse_move_remap
◆ m_right_mouse_up_remap
 int CRhinoAppMouseSettings::m_right_mouse_up_remap