Public Member Functions | List of all members
ON_XMesh Class Reference
OpenNURBS
#include <opennurbs_plus_mesh_intersection.h>
 Public Member Functions
ON_XMesh ()
~ON_XMesh ()
ON_Mesh *  | ConvertToOnMesh ()
bool  | Create (const ON_Mesh &M)
bool  | Create (const ON_Mesh &M, ON_XMeshVertexPool &VPool, ON_XMeshEdgePool &EPool, ON_XMeshFacePool &FPool)
int  | EdgeCount () const
int  | FaceCount () const
const ON_XMeshEdge *  | FindEdge (const ON_XMeshVertex *pV0, const ON_XMeshVertex *pV1, bool &bRev) const
ON_XMeshEdge *  | FindEdge (ON_XMeshVertex *pV0, ON_XMeshVertex *pV1, bool &bRev)
bool  | IsValid () const
int  | VertexCount () const
Constructor & Destructor Documentation
◆ ON_XMesh()
 ON_XMesh::ON_XMesh  |  ( |   | )
◆ ~ON_XMesh()
 ON_XMesh::~ON_XMesh  |  ( |   | )
Member Function Documentation
◆ ConvertToOnMesh()
 ON_Mesh* ON_XMesh::ConvertToOnMesh  |  ( |   | )
◆ Create() [1/2]
 bool ON_XMesh::Create  |  ( |  const ON_Mesh &  |  M | )
◆ Create() [2/2]
 bool ON_XMesh::Create  |  ( |  const ON_Mesh &  |  M,
|  ON_XMeshVertexPool &  |  VPool,
|  ON_XMeshEdgePool &  |  EPool,
|  ON_XMeshFacePool &  |  FPool
)
◆ EdgeCount()
 int ON_XMesh::EdgeCount  |  ( |   | ) |   const
◆ FaceCount()
 int ON_XMesh::FaceCount  |  ( |   | ) |   const
◆ FindEdge() [1/2]
 const ON_XMeshEdge* ON_XMesh::FindEdge  |  ( |  const ON_XMeshVertex *  |  pV0,
|  const ON_XMeshVertex *  |  pV1,
|  bool &  |  bRev
) |   |  const
◆ FindEdge() [2/2]
 ON_XMeshEdge* ON_XMesh::FindEdge  |  ( |  ON_XMeshVertex *  |  pV0,
|  ON_XMeshVertex *  |  pV1,
|  bool &  |  bRev
)
◆ IsValid()
 bool ON_XMesh::IsValid  |  ( |   | ) |   const
◆ VertexCount()
 int ON_XMesh::VertexCount  |  ( |   | ) |   const