Public Member Functions | Public Attributes | Protected Attributes | List of all members
CRhinoUiDragBitmapWnd Class Reference
RhinoUI
CRhinoUiDragBitmapWnd. More...
#include <RhinoSdkUiDragBitmapWnd.h>
 Inheritance diagram for CRhinoUiDragBitmapWnd:
 Public Member Functions
CRhinoUiDragBitmapWnd ()
virtual  | ~CRhinoUiDragBitmapWnd ()
bool  | CreateBitmapDragWindow (const CRhinoDib &dib, CWnd *pWndParent=NULL)
bool  | OffsetLeft () const
afx_msg BOOL32  | OnEraseBkgnd (CDC *pDC)
afx_msg void  | OnPaint ()
void  | SetBasePoint (CPoint pt)
void  | SetBitapTransparentColor (COLORREF cr)
bool  | SetDragBitmap (const CRhinoDib &dib)
void  | SetOffset (CSize szOffset)
bool  | SetOffsetLeft (bool b)
bool  | ShowDragWindow (bool bShow, LPPOINT pPtScreen)
bool  | TrackDragWindow (CPoint ptScreen)
 Public Attributes
int  | m_dib_id
 Protected Attributes
bool  | m_bOffsetLeft
CRhinoDib  | m_dib
HWND  | m_hWndParent
CPoint  | m_ptBase
CString  | m_sWndCls
CSize  | m_szOffset
Detailed Description
CRhinoUiDragBitmapWnd.
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoUiDragBitmapWnd()
 CRhinoUiDragBitmapWnd::CRhinoUiDragBitmapWnd  |  ( |   | )
◆ ~CRhinoUiDragBitmapWnd()
 virtual CRhinoUiDragBitmapWnd::~CRhinoUiDragBitmapWnd  |  ( |   | )
virtual
Member Function Documentation
◆ CreateBitmapDragWindow()
 bool CRhinoUiDragBitmapWnd::CreateBitmapDragWindow  |  ( |  const CRhinoDib &  |  dib,
|  CWnd *  |  pWndParent = NULL
)
◆ OffsetLeft()
 bool CRhinoUiDragBitmapWnd::OffsetLeft  |  ( |   | ) |   const
◆ OnEraseBkgnd()
 afx_msg BOOL32 CRhinoUiDragBitmapWnd::OnEraseBkgnd  |  ( |  CDC *  |  pDC | )
◆ OnPaint()
 afx_msg void CRhinoUiDragBitmapWnd::OnPaint  |  ( |   | )
◆ SetBasePoint()
 void CRhinoUiDragBitmapWnd::SetBasePoint  |  ( |  CPoint  |  pt | )
◆ SetBitapTransparentColor()
 void CRhinoUiDragBitmapWnd::SetBitapTransparentColor  |  ( |  COLORREF  |  cr | )
◆ SetDragBitmap()
 bool CRhinoUiDragBitmapWnd::SetDragBitmap  |  ( |  const CRhinoDib &  |  dib | )
◆ SetOffset()
 void CRhinoUiDragBitmapWnd::SetOffset  |  ( |  CSize  |  szOffset | )
◆ SetOffsetLeft()
 bool CRhinoUiDragBitmapWnd::SetOffsetLeft  |  ( |  bool  |  b | )
◆ ShowDragWindow()
 bool CRhinoUiDragBitmapWnd::ShowDragWindow  |  ( |  bool  |  bShow,
|  LPPOINT  |  pPtScreen
)
◆ TrackDragWindow()
 bool CRhinoUiDragBitmapWnd::TrackDragWindow  |  ( |  CPoint  |  ptScreen | )
Member Data Documentation
◆ m_bOffsetLeft
 bool CRhinoUiDragBitmapWnd::m_bOffsetLeft
protected
◆ m_dib
 CRhinoDib CRhinoUiDragBitmapWnd::m_dib
protected
◆ m_dib_id
 int CRhinoUiDragBitmapWnd::m_dib_id
◆ m_hWndParent
 HWND CRhinoUiDragBitmapWnd::m_hWndParent
protected
◆ m_ptBase
 CPoint CRhinoUiDragBitmapWnd::m_ptBase
protected
◆ m_sWndCls
 CString CRhinoUiDragBitmapWnd::m_sWndCls
protected
◆ m_szOffset
 CSize CRhinoUiDragBitmapWnd::m_szOffset
protected