Public Member Functions | List of all members
CRhinoDocIterator Class Reference
Rhino
#include <rhinoSdkDoc.h>
 Public Member Functions
CRhinoDocIterator ()
class CRhinoDoc *  | CurrentDoc () const
unsigned int  | CurrentDocSerialNumber () const
class CRhinoDoc *  | First ()
bool  | IncludeHeadlessDocuments () const
void  | IncludeHeadlessDocuments (bool doInclude)
class CRhinoDoc *  | Next ()
Constructor & Destructor Documentation
◆ CRhinoDocIterator()
 CRhinoDocIterator::CRhinoDocIterator  |  ( |   | )
Example: Iterate all documents: CRhinoDocIterator doc_it; for ( CRhinoDoc* doc = doc_it.First(); 0 != doc; doc = doc_it.Next() ) { ... }
Member Function Documentation
◆ CurrentDoc()
 class CRhinoDoc* CRhinoDocIterator::CurrentDoc  |  ( |   | ) |   const
Returns: The most recent value returned by First() or Next(). Remarks:
If First() or Next() has not been called, then Current() will return null.
If the document returned by First() or Next() has been deleted since the call to First() or Next(), then CurrentDoc() will return a null pointer.
◆ CurrentDocSerialNumber()
 unsigned int CRhinoDocIterator::CurrentDocSerialNumber  |  ( |   | ) |   const
◆ First()
 class CRhinoDoc* CRhinoDocIterator::First  |  ( |   | )
Returns: The first document. Remarks: You may call First() multiple times on the same iterator.
◆ IncludeHeadlessDocuments() [1/2]
 bool CRhinoDocIterator::IncludeHeadlessDocuments  |  ( |   | ) |   const
◆ IncludeHeadlessDocuments() [2/2]
 void CRhinoDocIterator::IncludeHeadlessDocuments  |  ( |  bool  |  doInclude | )
◆ Next()
 class CRhinoDoc* CRhinoDocIterator::Next  |  ( |   | )
Returns: The next document. Remarks:
Once Next() returns null, it will continue to return null until First() is called.
If First() has not be called, the first call to Next() returns the first document in Rhino. This is done so that people can write while loops like CRhinoDocIterator it; while ( CRhinoDoc* rhino_doc = it.Next() ) { ... }