Public Member Functions | Public Attributes | List of all members
ON_NurbsCage Class Reference
OpenNURBS
#include <opennurbs_nurbssurface.h>
 Inheritance diagram for ON_NurbsCage:
 Public Member Functions
ON_NurbsCage ()
ON_NurbsCage (const ON_3dPoint *box_corners, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
ON_NurbsCage (const ON_BezierCage &src)
ON_NurbsCage (const ON_BoundingBox &bbox, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
ON_NurbsCage (const ON_NurbsCage &src)
ON_NurbsCage (int dim, bool is_rat, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
~ON_NurbsCage ()
bool  | ChangeDimension (int desired_dimension)
bool  | ClampEnd (int dir, int end)
bool  | Create (const ON_3dPoint *box_corners, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
bool  | Create (const ON_BoundingBox &bbox, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
bool  | Create (int dim, bool is_rat, int order0, int order1, int order2, int cv_count0, int cv_count1, int cv_count2)
double *  | CV (int i, int j, int k) const
int  | CVCount (int) const
int  | CVCount (void) const
int  | CVSize () const
ON::point_style  | CVStyle () const
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree (int dir) const
void  | Destroy ()
void  | DestroyRuntimeCache (bool bDelete=true) override
int  | Dimension () const override
ON_Interval  | Domain (int) const
void  | Dump (ON_TextLog &text_log) const override
void  | EmergencyDestroy ()
call if memory used by ON_NurbsCage becomes invalid More...
bool  | Evaluate (double r, double s, double t, int der_count, int v_stride, double *v, int side=0, int *hint=0) const
bool  | Extend (int dir, const ON_Interval &domain)
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override
 More...
bool  | GetCV (int i, int j, int k, ON::point_style, double *) const
bool  | GetCV (int i, int j, int k, ON_3dPoint &) const
bool  | GetCV (int i, int j, int k, ON_4dPoint &) const
bool  | GetSpanVector (int dir, double *span_vector) const
bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const override
virtual ON_Geometry GetTightBoundingBox override
 More...
double  | GrevilleAbcissa (int dir, int gindex) const
bool  | IncreaseDegree (int dir, int desired_degree)
bool  | InsertKnot (int dir, double knot_value, int knot_multiplicity=1)
bool  | IsClosed (int) const
bool  | IsDeformable () const override
bool  | IsMorphable () const override
ON_NurbsSurface *  | IsoSurface (int dir, double c, ON_NurbsSurface *srf=0) const
bool  | IsParallelogram (double tolerance) const
bool  | IsPeriodic (int) const
are duplicates of first degree many CVs.) More...
bool  | IsRational () const
bool  | IsSingular (int) const
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
double  | Knot (int dir, int knot_index) const
int  | KnotCount (int dir) const
bool  | MakeDeformable () override
bool  | MakeNonRational ()
bool  | MakeRational ()
bool  | Morph (const ON_SpaceMorph &morph) override
ON::object_type  | ObjectType () const override
ON_NurbsCage &  | operator= (const ON_BezierCage &src)
ON_NurbsCage &  | operator= (const ON_NurbsCage &src)
int  | Order (int dir) const
ON_3dPoint  | PointAt (double r, double s, double t) const
ON_3dPoint  | PointAt (ON_3dPoint rst) const
bool  | Read (ON_BinaryArchive &archive) override
bool  | ReserveCVCapacity (int cv_capacity)
Tools for managing CV and knot memory. More...
bool  | ReserveKnotCapacity (int dir, int cv_capacity)
bool  | Reverse (int dir)
bool  | SetCV (int i, int j, int k, const ON_3dPoint &point)
bool  | SetCV (int i, int j, int k, const ON_4dPoint &hpoint)
bool  | SetCV (int i, int j, int k, ON::point_style, const double *)
bool  | SetKnot (int dir, int knot_index, double knot_value)
bool  | SetWeight (int i, int j, int k, double w)
unsigned int  | SizeOf () const override
int  | SpanCount (int dir) const
bool  | Transform (const ON_Xform &xform) override
bool  | Transpose (int dir0, int dir1)
bool  | Trim (int dir, const ON_Interval &domain)
double  | Weight (int i, int j, int k) const
bool  | Write (ON_BinaryArchive &archive) const override
bool  | ZeroCVs ()
zeros control vertices and, if rational, sets weights to 1 More...
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual class ON_Brep *  | BrepForm (class ON_Brep *brep=nullptr) const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
virtual bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | HasBrepForm () const
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Public Attributes
double *  | m_cv
int  | m_cv_capacity
int  | m_cv_count [3]
int  | m_cv_stride [3]
int  | m_dim
Implementation. More...
bool  | m_is_rat
double *  | m_knot [3]
int  | m_knot_capacity [3]
int  | m_order [3]
 Additional Inherited Members
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
Constructor & Destructor Documentation
◆ ON_NurbsCage() [1/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |   | )
◆ ON_NurbsCage() [2/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |  int  |  dim,
|  bool  |  is_rat,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
◆ ON_NurbsCage() [3/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |  const ON_BoundingBox &  |  bbox,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
◆ ON_NurbsCage() [4/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |  const ON_3dPoint *  |  box_corners,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
Parameters
box_corners | array of 8 3d points
◆ ON_NurbsCage() [5/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |  const ON_BezierCage &  |  src | )
◆ ~ON_NurbsCage()
 ON_NurbsCage::~ON_NurbsCage  |  ( |   | )
◆ ON_NurbsCage() [6/6]
 ON_NurbsCage::ON_NurbsCage  |  ( |  const ON_NurbsCage &  |  src | )
Member Function Documentation
◆ ChangeDimension()
 bool ON_NurbsCage::ChangeDimension  |  ( |  int  |  desired_dimension | )
Parameters
desired_dimension | desired_dimension
◆ ClampEnd()
 bool ON_NurbsCage::ClampEnd  |  ( |  int  |  dir,
|  int  |  end
)
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
end | 0 = clamp start, 1 = clamp end, 2 = clamp start and end
◆ Create() [1/3]
 bool ON_NurbsCage::Create  |  ( |  const ON_3dPoint *  |  box_corners,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
Description: Create a nurbs volume from a 3d box Parameters: box_corners - [in] 8 points that define corners of the volume
    7______________6
\             |\
\            | \
\ _____________\
4          |   5
    3---|----------2
    \   |          \
     \  |t          \
    s \ |            \
       \0_____________\1
               r
◆ Create() [2/3]
 bool ON_NurbsCage::Create  |  ( |  const ON_BoundingBox &  |  bbox,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
Description: Create a Nurbs volume with corners defined by a bounding box. Parameters: box_corners - [in] 8 points that define corners of the volume
    7______________6
\             |\
\            | \
\ _____________\
4          |   5
    3---|----------2
    \   |          \
     \  |z          \
    y \ |            \
       \0_____________\1
               x
◆ Create() [3/3]
 bool ON_NurbsCage::Create  |  ( |  int  |  dim,
|  bool  |  is_rat,
|  int  |  order0,
|  int  |  order1,
|  int  |  order2,
|  int  |  cv_count0,
|  int  |  cv_count1,
|  int  |  cv_count2
)
◆ CV()
 double* ON_NurbsCage::CV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k
) |   |  const
Description: Expert user function to get a pointer to control vertex memory. If you are not an expert user, please use ON_NurbsCage::GetCV( ON_3dPoint& ) or ON_NurbsCage::GetCV( ON_4dPoint& ). Parameters: cv_index0 - [in] (0 <= cv_index0 < m_order[0]) cv_index1 - [in] (0 <= cv_index1 < m_order[1]) Returns: Pointer to control vertex. Remarks: If the Nurbs surface is rational, the format of the returned array is a homogeneous rational point with length m_dim+1. If the Nurbs surface is not rational, the format of the returned array is a nonrational euclidean point with length m_dim. See Also ON_NurbsCage::CVStyle ON_NurbsCage::GetCV ON_NurbsCage::Weight
◆ CVCount() [1/2]
 int ON_NurbsCage::CVCount  |  ( |  int  |   | ) |   const
◆ CVCount() [2/2]
 int ON_NurbsCage::CVCount  |  ( |  void  |   | ) |   const
◆ CVSize()
 int ON_NurbsCage::CVSize  |  ( |   | ) |   const
◆ CVStyle()
 ON::point_style ON_NurbsCage::CVStyle  |  ( |   | ) |   const
Description: Returns the style of control vertices in the m_cv array. Returns: @untitled table ON::not_rational m_is_rat is false ON::homogeneous_rational m_is_rat is true
◆ DataCRC()
 ON__UINT32 ON_NurbsCage::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_NurbsCage::Degree  |  ( |  int  |  dir | ) |   const
◆ Destroy()
 void ON_NurbsCage::Destroy  |  ( |   | )
◆ DestroyRuntimeCache()
 void ON_NurbsCage::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
Description: Overrides the pure virtual ON_Object::DestroyRuntimeCache function. Saves the definition of this class in serial binary form that can be read by ON_BezierVolue::Read. Parameters: bDelete - [in] if true, the cache is deleted. If false, the pointers to the cache are set to zero; this is done when the cache memory was allocated from a pool that has been destroyed and an attempt to free the memory would result in a crash. Returns: True if successful.
Reimplemented from ON_Object.
◆ Dimension()
 int ON_NurbsCage::Dimension  |  ( |   | ) |   const
overridevirtual
Description: Overrides virtual ON_Geometry::Dimension function. Gets a tight bounding box with respect to the coordinate system specified by the frame parameter. Parameters: bbox - [in/out] bGrowBox - [in] If true, the input bbox is grown to include this object's bounding box. frame - [in] if not null, this specifies the coordinate system frame. Returns: True if successful.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_NurbsCage::Domain  |  ( |  int  |   | ) |   const
◆ Dump()
 void ON_NurbsCage::Dump  |  ( |  ON_TextLog &  |  text_log | ) |   const
overridevirtual
Description: Overrides the pure virtual ON_Object::Dump function. Parameters: text_log - [in] A listing of the values of the members.
Reimplemented from ON_Object.
◆ EmergencyDestroy()
 void ON_NurbsCage::EmergencyDestroy  |  ( |   | )
call if memory used by ON_NurbsCage becomes invalid
◆ Evaluate()
 bool ON_NurbsCage::Evaluate  |  ( |  double  |  r,
|  double  |  s,
|  double  |  t,
|  int  |  der_count,
|  int  |  v_stride,
|  double *  |  v,
|  int  |  side = 0,
|  int *  |  hint = 0
) |   |  const
Description: Evaluate the NURBS cage Parameters: r - [in] s - [in] t - [in] (r,s,t) = evaluation parameters der_count - [in] (>= 0) v_stride - [in] (>= m_dim) v - [out] An array of length v_stride*(der_count+1)(der_count+2)*(der_count+3)/6. The evaluation results are stored in this array.
P = v[0],...,v[m_dim-1] Dr = v[v_stride],... Ds = v[2*v_stride],... Dt = v[3*v_stride],...
In general, Dr^i Ds^j Dt^k is returned in v[n],...,v[n+m_dim-1], where
d = (i+j+k) n = v_stride*( d*(d+1)*(d+2)/6 + (j+k)*(j+k+1)/2 + k)
side - [in] specifies the span to use for the evaluation when r, s, or t is at a knot value. 0 = default 1 = from upper NE quadrant 2 = from upper NW quadrant 3 = from upper SW quadrant 4 = from upper SE quadrant 5 = from lower NE quadrant 6 = from lower NW quadrant 7 = from lower SW quadrant 8 = from lower SE quadrant
 hint - [in/out] If a bunch of evaluations will be performed that tend to occur in the same region, then hint[3] can be used to speed the search for the evaluation span. The input value is used as a search hint and the output value records the span used for that evaluation. Example:
    int der_count = 2;
    int v_stride = dim;
    double v[v_stride*(der_count+1)*(der_count+2)*(der_count+3)/6];
    int side = 0;
    int hint[3]; hint[0] = 0; hint[1] = 0; hint[2] = 0;
    bool rc = cage.Evaluate(r,s,t,der_count,v_stride,v,side,hint);
    ON_3dPoint P = v;
/ first order partial derivatives ON_3dVector Dr = v + v_stride; ON_3dVector Ds = v + 2*v_stride; ON_3dVector Dt = v + 3*v_stride;
/ second order partial derivatives ON_3dVector Drr = v + 4*v_stride; ON_3dVector Drs = v + 5*v_stride; ON_3dVector Drt = v + 6*v_stride; ON_3dVector Dss = v + 7*v_stride; ON_3dVector Dst = v + 8*v_stride; ON_3dVector Dtt = v + 8*v_stride;
Returns: True if successful See Also: ON_NurbsCage::PointAt
◆ Extend()
 bool ON_NurbsCage::Extend  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
◆ GetBBox()
 bool ON_NurbsCage::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetCV() [1/3]
 bool ON_NurbsCage::GetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  ON::point_style  |  ,
|  double *
) |   |  const
Parameters
i | get a single control vertex
◆ GetCV() [2/3]
 bool ON_NurbsCage::GetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  ON_3dPoint &
) |   |  const
Parameters
i | get a single control vertex
◆ GetCV() [3/3]
 bool ON_NurbsCage::GetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  ON_4dPoint &
) |   |  const
Parameters
i | get a single control vertex
◆ GetSpanVector()
 bool ON_NurbsCage::GetSpanVector  |  ( |  int  |  dir,
|  double *  |  span_vector
) |   |  const
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
◆ GetTightBoundingBox()
 bool ON_NurbsCage::GetTightBoundingBox  |  ( |  class ON_BoundingBox &  |  tight_bbox,
|  bool  |  bGrowBox = false,
|  const class ON_Xform *  |  xform = nullptr
) |   |  const
overridevirtual
virtual ON_Geometry GetTightBoundingBox override
Reimplemented from ON_Geometry.
◆ GrevilleAbcissa()
 double ON_NurbsCage::GrevilleAbcissa  |  ( |  int  |  dir,
|  int  |  gindex
) |   |  const
Parameters
dir | dir
gindex | index (0 <= index < CVCount(dir)
◆ IncreaseDegree()
 bool ON_NurbsCage::IncreaseDegree  |  ( |  int  |  dir,
|  int  |  desired_degree
)
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
desired_degree | desired_degree
◆ InsertKnot()
 bool ON_NurbsCage::InsertKnot  |  ( |  int  |  dir,
|  double  |  knot_value,
|  int  |  knot_multiplicity = 1
)
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
knot_value | value of knot
knot_multiplicity | multiplicity of knot ( >= 1 and <= degree )
◆ IsClosed()
 bool ON_NurbsCage::IsClosed  |  ( |  int  |   | ) |   const
CV = euclidean location of end CV, or cage is periodic.)
◆ IsDeformable()
 bool ON_NurbsCage::IsDeformable  |  ( |   | ) |   const
overridevirtual
Description: Overrides virtual ON_Geometry::IsDeformable function. Returns: True because a NURBS volume can be accurately modified with "squishy" transformations like projections, shears, an non-uniform scaling.
Reimplemented from ON_Geometry.
◆ IsMorphable()
 bool ON_NurbsCage::IsMorphable  |  ( |   | ) |   const
overridevirtual
Description: Overrides virtual ON_Geometry::IsMorphable function. Returns: True because NURBS volumes can be morphed by calling Morph().
Reimplemented from ON_Geometry.
◆ IsoSurface()
 ON_NurbsSurface* ON_NurbsCage::IsoSurface  |  ( |  int  |  dir,
|  double  |  c,
|  ON_NurbsSurface *  |  srf = 0
) |   |  const
◆ IsParallelogram()
 bool ON_NurbsCage::IsParallelogram  |  ( |  double  |  tolerance | ) |   const
Returns: True if the cage is a parallelogram within the tolerance. This means the cage can be used as a starting point for cage deformations.
◆ IsPeriodic()
 bool ON_NurbsCage::IsPeriodic  |  ( |  int  |   | ) |   const
are duplicates of first degree many CVs.)
◆ IsRational()
 bool ON_NurbsCage::IsRational  |  ( |   | ) |   const
◆ IsSingular()
 bool ON_NurbsCage::IsSingular  |  ( |  int  |   | ) |   const
◆ IsValid()
 bool ON_NurbsCage::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ Knot()
 double ON_NurbsCage::Knot  |  ( |  int  |  dir,
|  int  |  knot_index
) |   |  const
Parameters: dir - [in] 0 = "r", 1 = "s", 2 = "t" knot_index - [in] 0 <= knot_index < KnotCount(dir) Returns: Value of knot or ON_UNSET_VALUE if input parameters are not valid.
◆ KnotCount()
 int ON_NurbsCage::KnotCount  |  ( |  int  |  dir | ) |   const
Parameters
dir | total number of knots in knot vector dir 0 = "r", 1 = "s", 2 = "t"
◆ MakeDeformable()
 bool ON_NurbsCage::MakeDeformable  |  ( |   | )
overridevirtual
Description: Overrides virtual ON_Geometry::MakeDeformable function. Returns: True because NURBS volumes are deformable.
Reimplemented from ON_Geometry.
◆ MakeNonRational()
 bool ON_NurbsCage::MakeNonRational  |  ( |   | )
◆ MakeRational()
 bool ON_NurbsCage::MakeRational  |  ( |   | )
◆ Morph()
 bool ON_NurbsCage::Morph  |  ( |  const ON_SpaceMorph &  |  morph | )
override
Description: Overrides virtual ON_Geometry::Morph function. Applies the space morph to the NURBS volume's control points. Parameters: morph - [in] Returns: True is successful.
◆ ObjectType()
 ON::object_type ON_NurbsCage::ObjectType  |  ( |   | ) |   const
overridevirtual
Description: Overrides the pure virtual ON_Object::ObjectType function. Saves the definition of this class in serial binary form that can be read by ON_BezierVolue::Read. Parameters: archive - [in] target archive Returns: True if successful.
Reimplemented from ON_Object.
◆ operator=() [1/2]
 ON_NurbsCage& ON_NurbsCage::operator=  |  ( |  const ON_BezierCage &  |  src | )
◆ operator=() [2/2]
 ON_NurbsCage& ON_NurbsCage::operator=  |  ( |  const ON_NurbsCage &  |  src | )
◆ Order()
 int ON_NurbsCage::Order  |  ( |  int  |  dir | ) |   const
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
◆ PointAt() [1/2]
 ON_3dPoint ON_NurbsCage::PointAt  |  ( |  double  |  r,
|  double  |  s,
|  double  |  t
) |   |  const
Description: Evaluates bezier volume map. Parameters: rst - [in] Returns: Value of the nurbs volume map at (r,s,t).
◆ PointAt() [2/2]
 ON_3dPoint ON_NurbsCage::PointAt  |  ( |  ON_3dPoint  |  rst | ) |   const
Description: Evaluates bezier volume map. Parameters: rst - [in] Returns: Value of the nurbs volume map at (rst.x,rst.y,rst.z).
◆ Read()
 bool ON_NurbsCage::Read  |  ( |  ON_BinaryArchive &  |  archive | )
overridevirtual
Description: Overrides the pure virtual ON_Object::Read function. Reads the definition of this class from an archive previously saved by ON_BezierVolue::Write. Parameters: archive - [in] target archive Returns: True if successful.
Reimplemented from ON_Object.
◆ ReserveCVCapacity()
 bool ON_NurbsCage::ReserveCVCapacity  |  ( |  int  |  cv_capacity | )
Tools for managing CV and knot memory.
Description: cv_capacity - [in] number of doubles to reserve
◆ ReserveKnotCapacity()
 bool ON_NurbsCage::ReserveKnotCapacity  |  ( |  int  |  dir,
|  int  |  cv_capacity
)
◆ Reverse()
 bool ON_NurbsCage::Reverse  |  ( |  int  |  dir | )
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
◆ SetCV() [1/3]
 bool ON_NurbsCage::SetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  const ON_3dPoint &  |  point
)
set a single control vertex If NURBS is rational, weight will be set to 1.
◆ SetCV() [2/3]
 bool ON_NurbsCage::SetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  const ON_4dPoint &  |  hpoint
)
set a single control vertex value of control vertex If NURBS is not rational, euclidean location of homogeneous point will be used.
◆ SetCV() [3/3]
 bool ON_NurbsCage::SetCV  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  ON::point_style  |  ,
|  const double *
)
Parameters
i | set a single control vertex
◆ SetKnot()
 bool ON_NurbsCage::SetKnot  |  ( |  int  |  dir,
|  int  |  knot_index,
|  double  |  knot_value
)
Parameters: dir - [in] 0 = "r", 1 = "s", 2 = "t" knot_index - [in] 0 <= knot_index < KnotCount(dir) knot_value - [in] Returns: True if dir and knot_index parameters were valid and knot value was set.
◆ SetWeight()
 bool ON_NurbsCage::SetWeight  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k,
|  double  |  w
)
Parameters
i | get value of control vertex weight
◆ SizeOf()
 unsigned int ON_NurbsCage::SizeOf  |  ( |   | ) |   const
overridevirtual
Description: Overrides the pure virtual ON_Object::SizeOf function. Returns: An estimate of the amount of memory used by the class and its members.
Reimplemented from ON_Object.
◆ SpanCount()
 int ON_NurbsCage::SpanCount  |  ( |  int  |  dir | ) |   const
Parameters
dir | dir 0 = "r", 1 = "s", 2 = "t"
◆ Transform()
 bool ON_NurbsCage::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: Overrides virtual ON_Geometry::Transform function. Transforms NURBS volume. Parameters: xform - [in] Returns: true if successful.
Reimplemented from ON_Geometry.
◆ Transpose()
 bool ON_NurbsCage::Transpose  |  ( |  int  |  dir0,
|  int  |  dir1
)
◆ Trim()
 bool ON_NurbsCage::Trim  |  ( |  int  |  dir,
|  const ON_Interval &  |  domain
)
◆ Weight()
 double ON_NurbsCage::Weight  |  ( |  int  |  i,
|  int  |  j,
|  int  |  k
) |   |  const
Parameters
i | get value of control vertex weight
◆ Write()
 bool ON_NurbsCage::Write  |  ( |  ON_BinaryArchive &  |  archive | ) |   const
overridevirtual
Description: Overrides the pure virtual ON_Object::Write function. Saves the definition of this class in serial binary form that can be read by ON_BezierVolue::Read. Parameters: archive - [in] target archive Returns: True if successful.
Reimplemented from ON_Object.
◆ ZeroCVs()
 bool ON_NurbsCage::ZeroCVs  |  ( |   | )
zeros control vertices and, if rational, sets weights to 1
Member Data Documentation
◆ m_cv
 double* ON_NurbsCage::m_cv
◆ m_cv_capacity
 int ON_NurbsCage::m_cv_capacity
◆ m_cv_count
 int ON_NurbsCage::m_cv_count[3]
◆ m_cv_stride
 int ON_NurbsCage::m_cv_stride[3]
◆ m_dim
 int ON_NurbsCage::m_dim
Implementation.
NOTE: These members are left "public" so that expert users may efficiently create nurbs curves using the default constructor and borrow the knot and CV arrays from their native NURBS representation. No technical support will be provided for users who access these members directly. If you can't get your stuff to work, then use the constructor with the arguments and the SetKnot() and SetCV() functions to fill in the arrays.
◆ m_is_rat
 bool ON_NurbsCage::m_is_rat
◆ m_knot
 double* ON_NurbsCage::m_knot[3]
◆ m_knot_capacity
 int ON_NurbsCage::m_knot_capacity[3]
◆ m_order
 int ON_NurbsCage::m_order[3]