Public Member Functions | Public Attributes | List of all members
CRhRdkContent::TextureChannelInfo Class Referencefinal
#include <RhRdkContent.h>
 Public Member Functions
TextureChannelInfo ()
 Public Attributes
CRhRdkColor  | color
ON__UINT_PTR  | m_reserved
double  | textureAmount
UUID  | textureInstanceId
bool  | textureOn
Constructor & Destructor Documentation
◆ TextureChannelInfo()
 CRhRdkContent::TextureChannelInfo::TextureChannelInfo  |  ( |   | )
Member Data Documentation
◆ color
 CRhRdkColor CRhRdkContent::TextureChannelInfo::color
◆ m_reserved
 ON__UINT_PTR CRhRdkContent::TextureChannelInfo::m_reserved
◆ textureAmount
 double CRhRdkContent::TextureChannelInfo::textureAmount
◆ textureInstanceId
 UUID CRhRdkContent::TextureChannelInfo::textureInstanceId
◆ textureOn
 bool CRhRdkContent::TextureChannelInfo::textureOn