Public Member Functions | Public Attributes | List of all members
ON_MeshXPointPoolIterator Class Reference
OpenNURBS
#include <opennurbs_mesh.h>
 Inheritance diagram for ON_MeshXPointPoolIterator:
 Public Member Functions
ON_MeshXPointPoolIterator (const class ON_MeshXPointPool &mxpointpool)
class ON_MeshXPoint *  | FirstPoint ()
class ON_MeshXPoint *  | NextPoint ()
 Public Attributes
const class ON_MeshXPointPool &  | m_mxpointpool
Constructor & Destructor Documentation
◆ ON_MeshXPointPoolIterator()
 ON_MeshXPointPoolIterator::ON_MeshXPointPoolIterator  |  ( |  const class ON_MeshXPointPool &  |  mxpointpool | )
Member Function Documentation
◆ FirstPoint()
 class ON_MeshXPoint* ON_MeshXPointPoolIterator::FirstPoint  |  ( |   | )
◆ NextPoint()
 class ON_MeshXPoint* ON_MeshXPointPoolIterator::NextPoint  |  ( |   | )
Member Data Documentation
◆ m_mxpointpool
 const class ON_MeshXPointPool& ON_MeshXPointPoolIterator::m_mxpointpool