Public Member Functions | List of all members
ON_RtfStringBuilder::TextRun Class Reference
#include <opennurbs_textiterator.h>
 Public Member Functions
TextRun ()
void  | AddChar (const wchar_t ch)
void  | AddControl (const wchar_t *str)
void  | AddText (const wchar_t *str)
const void  | ClearHasContent ()
void  | EmptyText ()
int  | FontIndex ()
const bool  | HasContent ()
void  | InitRun ()
bool  | IsBold () const
bool  | IsItalic () const
bool  | IsStrikeThrough () const
bool  | IsTerminated ()
bool  | IsUnderlined () const
void  | SetBold (bool b)
void  | SetFontIndex (int index)
void  | SetItalic (bool b)
void  | SetStrikeThrough (bool b)
void  | SetTerminated (bool terminated)
void  | SetType (ON_TextRun::RunType type)
void  | SetUnderlined (bool b)
const ON_wString &  | TextString ()
ON_TextRun::RunType  | Type () const
Constructor & Destructor Documentation
◆ TextRun()
 ON_RtfStringBuilder::TextRun::TextRun  |  ( |   | )
inline
Member Function Documentation
◆ AddChar()
 void ON_RtfStringBuilder::TextRun::AddChar  |  ( |  const wchar_t  |  ch | )
inline
◆ AddControl()
 void ON_RtfStringBuilder::TextRun::AddControl  |  ( |  const wchar_t *  |  str | )
inline
◆ AddText()
 void ON_RtfStringBuilder::TextRun::AddText  |  ( |  const wchar_t *  |  str | )
inline
◆ ClearHasContent()
 const void ON_RtfStringBuilder::TextRun::ClearHasContent  |  ( |   | )
inline
◆ EmptyText()
 void ON_RtfStringBuilder::TextRun::EmptyText  |  ( |   | )
inline
◆ FontIndex()
 int ON_RtfStringBuilder::TextRun::FontIndex  |  ( |   | )
inline
◆ HasContent()
 const bool ON_RtfStringBuilder::TextRun::HasContent  |  ( |   | )
inline
◆ InitRun()
 void ON_RtfStringBuilder::TextRun::InitRun  |  ( |   | )
inline
◆ IsBold()
 bool ON_RtfStringBuilder::TextRun::IsBold  |  ( |   | ) |   const
inline
◆ IsItalic()
 bool ON_RtfStringBuilder::TextRun::IsItalic  |  ( |   | ) |   const
inline
◆ IsStrikeThrough()
 bool ON_RtfStringBuilder::TextRun::IsStrikeThrough  |  ( |   | ) |   const
inline
◆ IsTerminated()
 bool ON_RtfStringBuilder::TextRun::IsTerminated  |  ( |   | )
inline
◆ IsUnderlined()
 bool ON_RtfStringBuilder::TextRun::IsUnderlined  |  ( |   | ) |   const
inline
◆ SetBold()
 void ON_RtfStringBuilder::TextRun::SetBold  |  ( |  bool  |  b | )
inline
◆ SetFontIndex()
 void ON_RtfStringBuilder::TextRun::SetFontIndex  |  ( |  int  |  index | )
inline
◆ SetItalic()
 void ON_RtfStringBuilder::TextRun::SetItalic  |  ( |  bool  |  b | )
inline
◆ SetStrikeThrough()
 void ON_RtfStringBuilder::TextRun::SetStrikeThrough  |  ( |  bool  |  b | )
inline
◆ SetTerminated()
 void ON_RtfStringBuilder::TextRun::SetTerminated  |  ( |  bool  |  terminated | )
inline
◆ SetType()
 void ON_RtfStringBuilder::TextRun::SetType  |  ( |  ON_TextRun::RunType  |  type | )
inline
◆ SetUnderlined()
 void ON_RtfStringBuilder::TextRun::SetUnderlined  |  ( |  bool  |  b | )
inline
◆ TextString()
 const ON_wString& ON_RtfStringBuilder::TextRun::TextString  |  ( |   | )
inline
◆ Type()
 ON_TextRun::RunType ON_RtfStringBuilder::TextRun::Type  |  ( |   | ) |   const
inline