Public Member Functions | List of all members
CRhinoObjRefArray Class Reference
Rhino
#include <rhinoSdkObject.h>
 Inheritance diagram for CRhinoObjRefArray:
 Public Member Functions
int  | AppendObjects (class CRhinoObjectIterator &it)
 Public Member Functions inherited from ON_ClassArray< CRhinoObjRef >
ON_ClassArray () ON_NOEXCEPT
construction //////////////////////////////////////////////////////// More...
ON_ClassArray (const ON_ClassArray< CRhinoObjRef > &)
Copy constructor. More...
ON_ClassArray (size_t)
size_t parameter = initial capacity More...
virtual  | ~ON_ClassArray ()
override for struct member deallocation, etc. More...
void  | Append (const CRhinoObjRef &)
void  | Append (int, const CRhinoObjRef *)
Append copy of an array T[count]. More...
CRhinoObjRef &  | AppendNew ()
array operations //////////////////////////////////////////////////// More...
CRhinoObjRef *  | Array ()
The Array() function return the. More...
const CRhinoObjRef *  | Array () const
m_a pointer value. More...
CRhinoObjRef *  | At (int)
At(index) returns nullptr if index < 0 or index >= count. More...
const CRhinoObjRef *  | At (int) const
CRhinoObjRef *  | At (ON__INT64)
const CRhinoObjRef *  | At (ON__INT64) const
CRhinoObjRef *  | At (ON__UINT64)
const CRhinoObjRef *  | At (ON__UINT64) const
CRhinoObjRef *  | At (unsigned int)
const CRhinoObjRef *  | At (unsigned int) const
CRhinoObjRef *  | begin ()
Support STL iterators and algorithms. More...
CRhinoObjRef const *  | begin () const
int  | BinarySearch (const CRhinoObjRef *, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *)) const
See Also: ON_CompareIncreasing<T> and ON_CompareDecreasing<T> More...
int  | BinarySearch (const CRhinoObjRef *, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *), int) const
int  | Capacity () const
capacity of array More...
CRhinoObjRef const *  | cbegin () const
CRhinoObjRef const *  | cend () const
int  | Count () const
query /////////////////////////////////////////////////////////////// More...
void  | Destroy ()
onfree any memory and set count and capacity to zero More...
void  | EmergencyDestroy (void)
emergency bailout /////////////////////////////////////////////////// More...
void  | Emplace (int i, _Val &&... val)
void  | Emplace (int, _Val &&...)
create a new item and insert it More...
void  | EmplaceBack (_Val &&... val)
void  | EmplaceBack (_Val &&...)
create a new item an append it More...
void  | Empty ()
Sets count to 0, leaves capacity untouched. More...
CRhinoObjRef *  | end ()
CRhinoObjRef const *  | end () const
CRhinoObjRef *  | First ()
const CRhinoObjRef *  | First () const
returns nullptr if count = 0 More...
virtual bool  | HeapSort (int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *))
QuickSort() is generally the better choice. More...
void  | Insert (int, const CRhinoObjRef &)
Insert called with a reference uses operator =. More...
int  | InsertInSortedList (const CRhinoObjRef &, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *))
int  | InsertInSortedList (const CRhinoObjRef &, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *), int)
CRhinoObjRef *  | KeepArray ()
CRhinoObjRef *  | Last ()
const CRhinoObjRef *  | Last () const
returns nullptr if count = 0 More...
int  | NewCapacity () const
operator const CRhinoObjRef * () const
operator CRhinoObjRef * ()
The cast operators return a pointer. More...
bool  | operator!= (const ON_ClassArray< CRhinoObjRef > &other) const=delete
ON_ClassArray< CRhinoObjRef > &  | operator= (const ON_ClassArray< CRhinoObjRef > &)
Assignment operator. More...
bool  | operator== (const ON_ClassArray< CRhinoObjRef > &other) const=delete
CRhinoObjRef &  | operator[] (int)
const CRhinoObjRef &  | operator[] (int) const
CRhinoObjRef &  | operator[] (ON__INT64)
const CRhinoObjRef &  | operator[] (ON__INT64) const
CRhinoObjRef &  | operator[] (ON__UINT64)
const CRhinoObjRef &  | operator[] (ON__UINT64) const
CRhinoObjRef &  | operator[] (unsigned int)
const CRhinoObjRef &  | operator[] (unsigned int) const
bool  | Permute (const int *)
virtual bool  | QuickSort (int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *))
Sorts the array using the heap sort algorithm. More...
virtual CRhinoObjRef *  | Realloc (CRhinoObjRef *, int)
low level memory management /////////////////////////////////////// More...
void  | Remove ()
void  | Remove (int)
CRhinoObjRef *  | Reserve (size_t)
memory management ///////////////////////////////////////////////// More...
void  | Reverse ()
reverse order More...
int  | Search (const CRhinoObjRef *, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *)) const
void  | SetArray (CRhinoObjRef *p)
void  | SetArray (CRhinoObjRef *p, int count, int capacity)
CRhinoObjRef *  | SetCapacity (size_t)
void  | SetCount (int)
low level memory management ////////////////////////////////////////// More...
void  | Shrink ()
remove unused capacity More...
unsigned int  | SizeOfArray () const
amount of memory in the m_a[] array More...
unsigned int  | SizeOfElement () const
amount of memory in an m_a[] array element More...
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *)) const
bool  | Sort (ON::sort_algorithm sort_algorithm, int *, int(*compar)(const CRhinoObjRef *, const CRhinoObjRef *, void *), void *) const
void  | Swap (int, int)
swap elements i and j More...
unsigned int  | UnsignedCount () const
void  | Zero ()
 Additional Inherited Members
 Protected Member Functions inherited from ON_ClassArray< CRhinoObjRef >
void  | ConstructDefaultElement (CRhinoObjRef *)
void  | DestroyElement (CRhinoObjRef &)
void  | Move (int, int, int)
implementation ////////////////////////////////////////////////////// More...
 Protected Attributes inherited from ON_ClassArray< CRhinoObjRef >
CRhinoObjRef *  | m_a
pointer to array memory More...
int  | m_capacity
actual length of m_a[] More...
int  | m_count
0 <= m_count <= m_capacity More...
Member Function Documentation
◆ AppendObjects()
 int CRhinoObjRefArray::AppendObjects  |  ( |  class CRhinoObjectIterator &  |  it | )
Description: Appends all selected objects to the array.
Parameters: it - [in] iterator for objects to append.
Returns: Number of objects appended to array.