Public Member Functions | Public Attributes | List of all members
ON_ColorStop Class Reference
OpenNURBS
#include <opennurbs_color.h>
 Public Member Functions
ON_ColorStop ()=default
ON_ColorStop (const ON_Color &color, double position)
bool  | Read (class ON_BinaryArchive &archive)
bool  | Write (class ON_BinaryArchive &archive) const
 Public Attributes
ON_Color  | m_color = ON_Color::UnsetColor
double  | m_position = 0
Detailed Description
Class ON_ColorStop
Combination of a color and a single value. Typically used for defining gradient fills over a series of colors.
Constructor & Destructor Documentation
◆ ON_ColorStop() [1/2]
 ON_ColorStop::ON_ColorStop  |  ( |   | )
default
◆ ON_ColorStop() [2/2]
 ON_ColorStop::ON_ColorStop  |  ( |  const ON_Color &  |  color,
|  double  |  position
)
Member Function Documentation
◆ Read()
 bool ON_ColorStop::Read  |  ( |  class ON_BinaryArchive &  |  archive | )
◆ Write()
 bool ON_ColorStop::Write  |  ( |  class ON_BinaryArchive &  |  archive | ) |   const
Member Data Documentation
◆ m_color
 ON_Color ON_ColorStop::m_color = ON_Color::UnsetColor
◆ m_position
 double ON_ColorStop::m_position = 0