Public Member Functions | List of all members
ON_SubDComponentRefList Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentRefList ()=default
ON_SubDComponentRefList (const ON_SubDComponentRefList &src)
ON_SubDComponentRefList (size_t size)
~ON_SubDComponentRefList ()
const ON_SubDComponentRef &  | Append (const ON_SubDComponentRef &src_ref)
const ON_SubDComponentRef &  | Append (const ON_SubDComponentRef *src_ref)
const ON_SubDComponentRef &  | Append (const ON_SubDRef &subd_ref, ON_COMPONENT_INDEX ci, ON_SubDComponentLocation component_location, ON__UINT_PTR reference_id)
const ON_SubDComponentRef &  | Append (const ON_SubDRef &subd_ref, ON_SubDComponentPtr component_ptr, ON_SubDComponentLocation component_location, ON__UINT_PTR reference_id)
const ON_SubDComponentRef &  | AppendForExperts (const ON_SubD &subd, ON_COMPONENT_INDEX ci, ON_SubDComponentLocation component_location, ON__UINT_PTR reference_id)
const ON_SubDComponentRef &  | AppendForExperts (const ON_SubD &subd, ON_SubDComponentPtr component_ptr, ON_SubDComponentLocation component_location, ON__UINT_PTR reference_id)
const ON_SubDComponentRef &  | AppendForExperts (ON_SubDComponentRef *&ref)
int  | Clean ()
int  | Clean (ON_SimpleArray< unsigned int > *sorted_index)
int  | ComponentCount () const
int  | Count () const
int  | EdgeCount () const
int  | EdgeCount (ON_SubDEdgeTag edge_tag) const
int  | FaceCount () const
const ON_SimpleArray< class ON_SubDComponentRef * >  | List () const
ON_SubDComponentRefList &  | operator= (const ON_SubDComponentRefList &src)
const ON_SubDComponentRef &  | operator[] (int) const
void  | Remove (int i)
int  | SubDCount () const
ON_SubDComponentRef *  | TransferForExperts (int i)
int  | VertexCount () const
int  | VertexCount (ON_SubDVertexTag vertex_tag) const
Constructor & Destructor Documentation
◆ ON_SubDComponentRefList() [1/3]
 ON_SubDComponentRefList::ON_SubDComponentRefList  |  ( |   | )
default
◆ ON_SubDComponentRefList() [2/3]
 ON_SubDComponentRefList::ON_SubDComponentRefList  |  ( |  size_t  |  size | )
◆ ~ON_SubDComponentRefList()
 ON_SubDComponentRefList::~ON_SubDComponentRefList  |  ( |   | )
◆ ON_SubDComponentRefList() [3/3]
 ON_SubDComponentRefList::ON_SubDComponentRefList  |  ( |  const ON_SubDComponentRefList &  |  src | )
Member Function Documentation
◆ Append() [1/4]
 const ON_SubDComponentRef& ON_SubDComponentRefList::Append  |  ( |  const ON_SubDComponentRef &  |  src_ref | )
Description: Appends a copy of src_ref and returns a pointer to the ON_SubDComponentRef managed by this class.
◆ Append() [2/4]
 const ON_SubDComponentRef& ON_SubDComponentRefList::Append  |  ( |  const ON_SubDComponentRef *  |  src_ref | )
◆ Append() [3/4]
 const ON_SubDComponentRef& ON_SubDComponentRefList::Append  |  ( |  const ON_SubDRef &  |  subd_ref,
|  ON_COMPONENT_INDEX  |  ci,
|  ON_SubDComponentLocation  |  component_location,
|  ON__UINT_PTR  |  reference_id
)
Description: Append a ON_SubDComponentRef to the identified component. Returns; A pointer to the ON_SubDComponentRef managed by this class or nullptr if the input is not valid.
◆ Append() [4/4]
 const ON_SubDComponentRef& ON_SubDComponentRefList::Append  |  ( |  const ON_SubDRef &  |  subd_ref,
|  ON_SubDComponentPtr  |  component_ptr,
|  ON_SubDComponentLocation  |  component_location,
|  ON__UINT_PTR  |  reference_id
)
◆ AppendForExperts() [1/3]
 const ON_SubDComponentRef& ON_SubDComponentRefList::AppendForExperts  |  ( |  const ON_SubD &  |  subd,
|  ON_COMPONENT_INDEX  |  ci,
|  ON_SubDComponentLocation  |  component_location,
|  ON__UINT_PTR  |  reference_id
)
Description: Expert user function to append a ON_SubDComponentRef to the identified component. The expert user is responsible for insuring subd exists fot the lifetime of this class.
◆ AppendForExperts() [2/3]
 const ON_SubDComponentRef& ON_SubDComponentRefList::AppendForExperts  |  ( |  const ON_SubD &  |  subd,
|  ON_SubDComponentPtr  |  component_ptr,
|  ON_SubDComponentLocation  |  component_location,
|  ON__UINT_PTR  |  reference_id
)
◆ AppendForExperts() [3/3]
 const ON_SubDComponentRef& ON_SubDComponentRefList::AppendForExperts  |  ( |  ON_SubDComponentRef *&  |  ref | )
Description: Expert user function to transfer management of an ON_SubDComponentRef on the heap to this class.
◆ Clean() [1/2]
 int ON_SubDComponentRefList::Clean  |  ( |   | )
Description: Sort by ON_SubDComponentRef::Compare2() and remove duplicates and empty elements. Returns: Length of clean list.
◆ Clean() [2/2]
 int ON_SubDComponentRefList::Clean  |  ( |  ON_SimpleArray< unsigned int > *  |  sorted_index | )
Description: Sort by ON_SubDComponentRef::Compare2() and remove duplicates and empty elements. Parameters: sorted_index - [out] If not empty, this array is filled with the indices that sort the original list. Returns: Length of clean list.
◆ ComponentCount()
 int ON_SubDComponentRefList::ComponentCount  |  ( |   | ) |   const
Returns: Number of components.
◆ Count()
 int ON_SubDComponentRefList::Count  |  ( |   | ) |   const
Returns: Number of refs in the list.
◆ EdgeCount() [1/2]
 int ON_SubDComponentRefList::EdgeCount  |  ( |   | ) |   const
Returns: Number of edges.
◆ EdgeCount() [2/2]
 int ON_SubDComponentRefList::EdgeCount  |  ( |  ON_SubDEdgeTag  |  edge_tag | ) |   const
Returns: Number of edges with the specified tag.
◆ FaceCount()
 int ON_SubDComponentRefList::FaceCount  |  ( |   | ) |   const
Returns: Number of faces.
◆ List()
 const ON_SimpleArray< class ON_SubDComponentRef* > ON_SubDComponentRefList::List  |  ( |   | ) |   const
◆ operator=()
 ON_SubDComponentRefList& ON_SubDComponentRefList::operator=  |  ( |  const ON_SubDComponentRefList &  |  src | )
◆ operator[]()
 const ON_SubDComponentRef& ON_SubDComponentRefList::operator[]  |  ( |  int  |   | ) |   const
◆ Remove()
 void ON_SubDComponentRefList::Remove  |  ( |  int  |  i | )
◆ SubDCount()
 int ON_SubDComponentRefList::SubDCount  |  ( |   | ) |   const
Returns: If the list is clean, the number of subd objects in the list. Multiple components can belong to the same SubD. If the list is not clean, 0. Remarks: Use Clean() to get a clean list.
◆ TransferForExperts()
 ON_SubDComponentRef* ON_SubDComponentRefList::TransferForExperts  |  ( |  int  |  i | )
Description: Transfers the ref to an expert user who is responsible for properly managing it.
◆ VertexCount() [1/2]
 int ON_SubDComponentRefList::VertexCount  |  ( |   | ) |   const
Returns: Number of vertices.
◆ VertexCount() [2/2]
 int ON_SubDComponentRefList::VertexCount  |  ( |  ON_SubDVertexTag  |  vertex_tag | ) |   const
Returns: Number of vertices with the specified tag.