Public Member Functions | List of all members
CRhinoGetCancel::Task Class Referenceabstract
#include <rhinoSdkGet.h>
 Public Member Functions
virtual void  | OnTaskCompleted (CRhinoDoc *doc)
virtual bool  | Run (ON_Terminator *terminator)=0
Member Function Documentation
◆ OnTaskCompleted()
 virtual void CRhinoGetCancel::Task::OnTaskCompleted  |  ( |  CRhinoDoc *  |  doc | )
inlinevirtual
Description: Called on the main thread after a Run for a given Task has completed
◆ Run()
 virtual bool CRhinoGetCancel::Task::Run  |  ( |  ON_Terminator *  |  terminator | )
pure virtual
Description: Each task is run using the overridden Run function. Override this function to do the actual work. Note that this function will be called on different threads than the main UI thread and it is likely that multiple Run calls will be occurring at the same time on different thread. Parameters: terminator [in] - It is advised to check TerminationRequested for the passed in terminator and gracefully exit Run as fast as possible. This is how you should check if a user has pressed the escape key. Returns: true if this task completed successfully and wants to have its OnTaskCompleted function called on the main thread