Public Member Functions | Static Public Member Functions | List of all members
CRhinoLeaseChangedEventArgs Class Reference
Rhino
#include <rhinoSdkPlugIn.h>
 Public Member Functions
~CRhinoLeaseChangedEventArgs ()
CRhinoLicenseLease *  | GetLease () const
 Static Public Member Functions
static CRhinoLeaseChangedEventArgs *  | Create (const CRhinoLicenseLease *lease)
Detailed Description
class CRhinoLeaseChangedEventArgs
Constructor & Destructor Documentation
◆ ~CRhinoLeaseChangedEventArgs()
 CRhinoLeaseChangedEventArgs::~CRhinoLeaseChangedEventArgs  |  ( |   | )
Member Function Documentation
◆ Create()
 static CRhinoLeaseChangedEventArgs* CRhinoLeaseChangedEventArgs::Create  |  ( |  const CRhinoLicenseLease *  |  lease | )
static
◆ GetLease()
 CRhinoLicenseLease* CRhinoLeaseChangedEventArgs::GetLease  |  ( |   | ) |   const