Public Types | Public Member Functions | Public Attributes | List of all members
CArgsRhinoSweep1 Class Reference
Rhino
#include <rhinoSdkSweep.h>
 Public Types
enum  | eSweep1Simplify { ess_Nothing = 0, ess_Rebuild = 1, ess_Refit = 2 }
enum  | eSweep1Style { ess_Freeform = 0, ess_Roadlike = 1, ess_SrfEdge = 2, ess_EndpointPivot = 3 }
 Public Member Functions
CArgsRhinoSweep1 ()
~CArgsRhinoSweep1 ()
bool  | AllShapesEndAtPoint (ON_3dPoint *pt=NULL)
Test function used for RailRevolve sweeps. More...
bool  | TestForSimpleSweep ()
See if inputs are perfect enough to do greville interpolate. More...
 Public Attributes
double  | m_angle_tolerance
tolerance to pass to TL sweeper as AngleTolerance More...
BOOL32  | m_bClosed
Open or closed sweep if the rail is closed. More...
bool  | m_bHaveRailPickPoint
true if the rail was selected with a point pick More...
bool  | m_bSimpleSweep
Make a simple surface by greville interpolation of shapes. More...
bool  | m_bUsePivotPoint
int  | m_bUsePoints [2]
flag for valid start and/or endpoint to use More...
int  | m_miter_attempts
number of kink miters attempted More...
int  | m_miter_count
number of kink miters successfully complered More...
int  | m_miter_type
ON_3dPoint  | m_pivot_point
ON_3dVector  | m_planar_up
Up direction for roadlike style. More...
CRhinoObjRef  | m_point_objrefs [2]
point objects picked for endpoints More...
ON_3dPoint  | m_points [2]
start and end points More...
const CRhinoPolyEdge *  | m_rail_curve
input rail curve More...
ON_SimpleArray< double >  | m_rail_params
params on the rail that correspond to each shape More...
ON_3dPoint  | m_RailPickPoint
point where the rail was picked More...
int  | m_rebuild_count
Sample point count for rebuilding shapes. More...
double  | m_refit_tolerance
tolerance to refit shape curves More...
ON_SimpleArray< ON_Curve * >  | m_shape_curves
array of input shapes More...
ON_ClassArray< CRhinoObjRef >  | m_shape_objrefs
Where the shapes came from. More...
int  | m_simplify
Simplify method for shape curves. More...
int  | m_style
how the frames get rotated around the rail More...
double  | m_sweep_tolerance
tolerance to pass to TL sweeper as SweepTolerance More...
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Enumeration Documentation
◆ eSweep1Simplify
 enum CArgsRhinoSweep1::eSweep1Simplify
Enumerator
ess_Nothing
Use the shapes as is.
ess_Rebuild
Rebuild interpolating equally spaced points.
ess_Refit
Refit to a tolerance.
◆ eSweep1Style
 enum CArgsRhinoSweep1::eSweep1Style
Enumerator
ess_Freeform
ess_Roadlike
ess_SrfEdge
ess_EndpointPivot
Constructor & Destructor Documentation
◆ CArgsRhinoSweep1()
 CArgsRhinoSweep1::CArgsRhinoSweep1  |  ( |   | )
◆ ~CArgsRhinoSweep1()
 CArgsRhinoSweep1::~CArgsRhinoSweep1  |  ( |   | )
Member Function Documentation
◆ AllShapesEndAtPoint()
 bool CArgsRhinoSweep1::AllShapesEndAtPoint  |  ( |  ON_3dPoint *  |  pt = NULL | )
Test function used for RailRevolve sweeps.
◆ TestForSimpleSweep()
 bool CArgsRhinoSweep1::TestForSimpleSweep  |  ( |   | )
See if inputs are perfect enough to do greville interpolate.
Member Data Documentation
◆ m_angle_tolerance
 double CArgsRhinoSweep1::m_angle_tolerance
tolerance to pass to TL sweeper as AngleTolerance
◆ m_bClosed
 BOOL32 CArgsRhinoSweep1::m_bClosed
Open or closed sweep if the rail is closed.
◆ m_bHaveRailPickPoint
 bool CArgsRhinoSweep1::m_bHaveRailPickPoint
true if the rail was selected with a point pick
◆ m_bSimpleSweep
 bool CArgsRhinoSweep1::m_bSimpleSweep
Make a simple surface by greville interpolation of shapes.
◆ m_bUsePivotPoint
 bool CArgsRhinoSweep1::m_bUsePivotPoint
◆ m_bUsePoints
 int CArgsRhinoSweep1::m_bUsePoints[2]
flag for valid start and/or endpoint to use
◆ m_miter_attempts
 int CArgsRhinoSweep1::m_miter_attempts
number of kink miters attempted
◆ m_miter_count
 int CArgsRhinoSweep1::m_miter_count
number of kink miters successfully complered
◆ m_miter_type
 int CArgsRhinoSweep1::m_miter_type
0: don't miter 1: intersect surfaces and trim sweeps 2: rotate shapes at kinks and don't trim
◆ m_pivot_point
 ON_3dPoint CArgsRhinoSweep1::m_pivot_point
◆ m_planar_up
 ON_3dVector CArgsRhinoSweep1::m_planar_up
Up direction for roadlike style.
◆ m_point_objrefs
 CRhinoObjRef CArgsRhinoSweep1::m_point_objrefs[2]
point objects picked for endpoints
◆ m_points
 ON_3dPoint CArgsRhinoSweep1::m_points[2]
start and end points
◆ m_rail_curve
 const CRhinoPolyEdge* CArgsRhinoSweep1::m_rail_curve
input rail curve
◆ m_rail_params
 ON_SimpleArray<double> CArgsRhinoSweep1::m_rail_params
params on the rail that correspond to each shape
◆ m_RailPickPoint
 ON_3dPoint CArgsRhinoSweep1::m_RailPickPoint
point where the rail was picked
◆ m_rebuild_count
 int CArgsRhinoSweep1::m_rebuild_count
Sample point count for rebuilding shapes.
◆ m_refit_tolerance
 double CArgsRhinoSweep1::m_refit_tolerance
tolerance to refit shape curves
◆ m_shape_curves
 ON_SimpleArray<ON_Curve*> CArgsRhinoSweep1::m_shape_curves
array of input shapes
◆ m_shape_objrefs
 ON_ClassArray<CRhinoObjRef> CArgsRhinoSweep1::m_shape_objrefs
Where the shapes came from.
◆ m_simplify
 int CArgsRhinoSweep1::m_simplify
Simplify method for shape curves.
◆ m_style
 int CArgsRhinoSweep1::m_style
how the frames get rotated around the rail
◆ m_sweep_tolerance
 double CArgsRhinoSweep1::m_sweep_tolerance
tolerance to pass to TL sweeper as SweepTolerance