Public Member Functions | Public Attributes | Static Public Attributes | List of all members
CRhinoAppSelectionFilterSettings Class Reference
Rhino
#include <rhinoSdkAppSettings.h>
 Public Member Functions
CRhinoAppSelectionFilterSettings ()
void  | Defaults ()
bool  | GetGlobalSelectionFilter (unsigned int *pFilter, const unsigned int rhino_doc_sn=0) const
void  | LoadProfile (CRhinoProfileContext &pc)
bool  | operator!= (const CRhinoAppSelectionFilterSettings &) const
bool  | operator== (const CRhinoAppSelectionFilterSettings &) const
bool  | PlainClickSubObjectSelect () const
void  | SaveProfile (CRhinoProfileContext &) const
void  | Validate ()
 Public Attributes
bool  | m_bEnableGlobalGeometryFilter
bool  | m_bPlainClickSubObjectSelect
unsigned int  | m_nGlobalGeometryFilter
unsigned int  | m_nOneShotGeometryFilter
unsigned char  | m_repeat_disable_count
 Static Public Attributes
static const CRhinoAppSelectionFilterSettings  | Default
Constructor & Destructor Documentation
◆ CRhinoAppSelectionFilterSettings()
 CRhinoAppSelectionFilterSettings::CRhinoAppSelectionFilterSettings  |  ( |   | )
Member Function Documentation
◆ Defaults()
 void CRhinoAppSelectionFilterSettings::Defaults  |  ( |   | )
◆ GetGlobalSelectionFilter()
 bool CRhinoAppSelectionFilterSettings::GetGlobalSelectionFilter  |  ( |  unsigned int *  |  pFilter,
|  const unsigned int  |  rhino_doc_sn = 0
) |   |  const
◆ LoadProfile()
 void CRhinoAppSelectionFilterSettings::LoadProfile  |  ( |  CRhinoProfileContext &  |  pc | )
◆ operator!=()
 bool CRhinoAppSelectionFilterSettings::operator!=  |  ( |  const CRhinoAppSelectionFilterSettings &  |   | ) |   const
◆ operator==()
 bool CRhinoAppSelectionFilterSettings::operator==  |  ( |  const CRhinoAppSelectionFilterSettings &  |   | ) |   const
◆ PlainClickSubObjectSelect()
 bool CRhinoAppSelectionFilterSettings::PlainClickSubObjectSelect  |  ( |   | ) |   const
◆ SaveProfile()
 void CRhinoAppSelectionFilterSettings::SaveProfile  |  ( |  CRhinoProfileContext &  |   | ) |   const
◆ Validate()
 void CRhinoAppSelectionFilterSettings::Validate  |  ( |   | )
Member Data Documentation
◆ Default
 const CRhinoAppSelectionFilterSettings CRhinoAppSelectionFilterSettings::Default
static
◆ m_bEnableGlobalGeometryFilter
 bool CRhinoAppSelectionFilterSettings::m_bEnableGlobalGeometryFilter
◆ m_bPlainClickSubObjectSelect
 bool CRhinoAppSelectionFilterSettings::m_bPlainClickSubObjectSelect
◆ m_nGlobalGeometryFilter
 unsigned int CRhinoAppSelectionFilterSettings::m_nGlobalGeometryFilter
◆ m_nOneShotGeometryFilter
 unsigned int CRhinoAppSelectionFilterSettings::m_nOneShotGeometryFilter
◆ m_repeat_disable_count
 unsigned char CRhinoAppSelectionFilterSettings::m_repeat_disable_count