Public Member Functions | Static Public Member Functions | Public Attributes | Static Public Attributes | List of all members
ON_SubDComponentAndNumber Class Reference
OpenNURBS
#include <opennurbs_subd.h>
 Public Member Functions
ON_SubDComponentAndNumber ()=default
ON_SubDComponentAndNumber (const ON_SubDComponentAndNumber &)=default
~ON_SubDComponentAndNumber ()=default
const ON_SubDComponentPtr  | Component () const
double  | Number () const
ON_SubDComponentAndNumber &  | operator= (const ON_SubDComponentAndNumber &)=default
void  | SetComponent (ON_SubDComponentPtr cptr)
void  | SetNumber (double x)
 Static Public Member Functions
static int  | CompareComponent (const ON_SubDComponentAndNumber *a, const ON_SubDComponentAndNumber *b)
static int  | CompareComponentAndDirection (const ON_SubDComponentAndNumber *a, const ON_SubDComponentAndNumber *b)
static int  | CompareComponentAndDirectionAndNumber (const ON_SubDComponentAndNumber *a, const ON_SubDComponentAndNumber *b)
static int  | CompareComponentAndNumber (const ON_SubDComponentAndNumber *a, const ON_SubDComponentAndNumber *b)
static int  | CompareNumber (const ON_SubDComponentAndNumber *a, const ON_SubDComponentAndNumber *b)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDEdge *e, double x)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDEdgePtr eptr, double x)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDFace *f, double x)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDFacePtr fptr, double x)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDVertex *v, double x)
static const ON_SubDComponentAndNumber  | Create (const ON_SubDVertexPtr vptr, double x)
static const ON_SubDComponentAndNumber  | Create (ON_SubDComponentPtr cptr, double x)
 Public Attributes
ON_SubDComponentPtr  | m_cptr = ON_SubDComponentPtr::Null
double  | m_x = ON_DBL_QNAN
 Static Public Attributes
static const ON_SubDComponentAndNumber  | NullAndNan
static const ON_SubDComponentAndNumber  | NullAndZero
Detailed Description
ON_SubDComponentPtrAndNumber
Constructor & Destructor Documentation
◆ ON_SubDComponentAndNumber() [1/2]
 ON_SubDComponentAndNumber::ON_SubDComponentAndNumber  |  ( |   | )
default
◆ ~ON_SubDComponentAndNumber()
 ON_SubDComponentAndNumber::~ON_SubDComponentAndNumber  |  ( |   | )
default
◆ ON_SubDComponentAndNumber() [2/2]
 ON_SubDComponentAndNumber::ON_SubDComponentAndNumber  |  ( |  const ON_SubDComponentAndNumber &  |   | )
default
Member Function Documentation
◆ CompareComponent()
 static int ON_SubDComponentAndNumber::CompareComponent  |  ( |  const ON_SubDComponentAndNumber *  |  a,
|  const ON_SubDComponentAndNumber *  |  b
)
static
Description: Compare Component() using ON_SubDComponentPtr::CompareComponent().
◆ CompareComponentAndDirection()
 static int ON_SubDComponentAndNumber::CompareComponentAndDirection  |  ( |  const ON_SubDComponentAndNumber *  |  a,
|  const ON_SubDComponentAndNumber *  |  b
)
static
Description: Compare Component() using ON_SubDComponentPtr::CompareComponentAndDirection().
◆ CompareComponentAndDirectionAndNumber()
 static int ON_SubDComponentAndNumber::CompareComponentAndDirectionAndNumber  |  ( |  const ON_SubDComponentAndNumber *  |  a,
|  const ON_SubDComponentAndNumber *  |  b
)
static
Description: Dictionary compare using ON_SubDComponentAndNumber::CompareComponentAndDirection() and ON_SubDComponentAndNumber::Number() in that order.
◆ CompareComponentAndNumber()
 static int ON_SubDComponentAndNumber::CompareComponentAndNumber  |  ( |  const ON_SubDComponentAndNumber *  |  a,
|  const ON_SubDComponentAndNumber *  |  b
)
static
Description: Dictionary compare Component() and Number() in that order.
◆ CompareNumber()
 static int ON_SubDComponentAndNumber::CompareNumber  |  ( |  const ON_SubDComponentAndNumber *  |  a,
|  const ON_SubDComponentAndNumber *  |  b
)
static
Description: Compare Number() nans are treated as equal and sort last.
◆ Component()
 const ON_SubDComponentPtr ON_SubDComponentAndNumber::Component  |  ( |   | ) |   const
◆ Create() [1/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDEdge *  |  e,
|  double  |  x
)
static
◆ Create() [2/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDEdgePtr  |  eptr,
|  double  |  x
)
static
◆ Create() [3/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDFace *  |  f,
|  double  |  x
)
static
◆ Create() [4/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDFacePtr  |  fptr,
|  double  |  x
)
static
◆ Create() [5/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDVertex *  |  v,
|  double  |  x
)
static
◆ Create() [6/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  const ON_SubDVertexPtr  |  vptr,
|  double  |  x
)
static
◆ Create() [7/7]
 static const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::Create  |  ( |  ON_SubDComponentPtr  |  cptr,
|  double  |  x
)
static
◆ Number()
 double ON_SubDComponentAndNumber::Number  |  ( |   | ) |   const
◆ operator=()
 ON_SubDComponentAndNumber& ON_SubDComponentAndNumber::operator=  |  ( |  const ON_SubDComponentAndNumber &  |   | )
default
◆ SetComponent()
 void ON_SubDComponentAndNumber::SetComponent  |  ( |  ON_SubDComponentPtr  |  cptr | )
◆ SetNumber()
 void ON_SubDComponentAndNumber::SetNumber  |  ( |  double  |  x | )
Member Data Documentation
◆ m_cptr
 ON_SubDComponentPtr ON_SubDComponentAndNumber::m_cptr = ON_SubDComponentPtr::Null
◆ m_x
 double ON_SubDComponentAndNumber::m_x = ON_DBL_QNAN
◆ NullAndNan
 const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::NullAndNan
static
◆ NullAndZero
 const ON_SubDComponentAndNumber ON_SubDComponentAndNumber::NullAndZero
static