Public Member Functions | Protected Attributes | List of all members
CRhinoDimStyleComboBox Class Reference
Rhino
CRhinoDimStyleComboBox window. More...
#include <RhinoSdkDimStyleComboBox.h>
 Inheritance diagram for CRhinoDimStyleComboBox:
 Public Member Functions
CRhinoDimStyleComboBox ()
virtual  | ~CRhinoDimStyleComboBox ()
Implementation. More...
int  | AddStyleToList (const CRhinoDimStyle &style)
const CRhinoDimStyle *  | DimStyle (int list_index)
CRhinoDoc *  | Document ()
int  | ListIndexFromStyleIndex (int style_index)
int  | LoadStyles (CRhinoDoc *doc, BOOL32 show_referenced=true, int set_current=-1)
BOOL32  | RemoveStyleFromList (int style_index)
int  | SelectedStyleIndex ()
int  | StyleIndexFromListIndex (int list_index)
 Protected Attributes
CRhinoDoc *  | m_doc
Detailed Description
CRhinoDimStyleComboBox window.
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Constructor & Destructor Documentation
◆ CRhinoDimStyleComboBox()
 CRhinoDimStyleComboBox::CRhinoDimStyleComboBox  |  ( |   | )
◆ ~CRhinoDimStyleComboBox()
 virtual CRhinoDimStyleComboBox::~CRhinoDimStyleComboBox  |  ( |   | )
virtual
Implementation.
Overrides ClassWizard generated virtual function overrides {{AFX_VIRTUAL(CRhinoDimStyleComboBox) }}AFX_VIRTUAL
Member Function Documentation
◆ AddStyleToList()
 int CRhinoDimStyleComboBox::AddStyleToList  |  ( |  const CRhinoDimStyle &  |  style | )
Description: Add style to combo box, called by LoadStyles Parameters: style [in] - style to add Returns: List index for new item or LB_ERR if not added Remarks: If a style is added to the style table after LoadStyles is called use this method to expand the list
◆ DimStyle()
 const CRhinoDimStyle* CRhinoDimStyleComboBox::DimStyle  |  ( |  int  |  list_index | )
◆ Document()
 CRhinoDoc* CRhinoDimStyleComboBox::Document  |  ( |   | )
◆ ListIndexFromStyleIndex()
 int CRhinoDimStyleComboBox::ListIndexFromStyleIndex  |  ( |  int  |  style_index | )
Description: Get combo box index from style index Parameters: style_index [in] - style index to scan for Returns: combo box index or -1 if not found in list
◆ LoadStyles()
 int CRhinoDimStyleComboBox::LoadStyles  |  ( |  CRhinoDoc *  |  doc,
|  BOOL32  |  show_referenced = true,
|  int  |  set_current = -1
)
Description: Populate combo box with dimension styles Parameters: doc [in] - document containing dimension style table set_current [in] - Style index of item to set as current Returns: Number of styles added to list
◆ RemoveStyleFromList()
 BOOL32 CRhinoDimStyleComboBox::RemoveStyleFromList  |  ( |  int  |  style_index | )
Description: Remove style from combo box. Parameters: style_index [in] - style to remove Returns: TRUE if style was removed from list FALSE if style was not in list
◆ SelectedStyleIndex()
 int CRhinoDimStyleComboBox::SelectedStyleIndex  |  ( |   | )
Description: Get style index associated with current combo box selection Returns: Style index or -1 if nothing selected
◆ StyleIndexFromListIndex()
 int CRhinoDimStyleComboBox::StyleIndexFromListIndex  |  ( |  int  |  list_index | )
Description: Get style index associated with a specific combo box item Parameters: list_index [in] - list item to check Returns: Style index or -1 on error
Member Data Documentation
◆ m_doc
 CRhinoDoc* CRhinoDimStyleComboBox::m_doc
protected