Public Attributes | List of all members
CRhinoIsIdle::CParameters Class Reference
#include <rhinoSdkEventWatcher.h>
 Public Attributes
int  | m_count
value of the CWinApp::OnIdle "lCount" parameter More...
Member Data Documentation
◆ m_count
 int CRhinoIsIdle::CParameters::m_count
value of the CWinApp::OnIdle "lCount" parameter