Public Member Functions | Protected Member Functions | List of all members
CRhinoSkinDLL Class Referenceabstract
Rhino
#include <rhinoSdkSkinDll.h>
 Inheritance diagram for CRhinoSkinDLL:
 Public Member Functions
CRhinoSkinDLL ()
virtual  | ~CRhinoSkinDLL ()
virtual const wchar_t *  | ApplicationName ()=0
virtual HICON  | MainRhinoIcon ()=0
virtual HMENU  | MainRhinoMenu ()
virtual void  | ShowSplash (bool bShow)=0
virtual UUID  | SkinPlugInID ()=0
 Protected Member Functions
CRhinoSkinDLL (const CRhinoSkinDLL &)
Not implemented, do not use. More...
const CRhinoSkinDLL &  | operator= (const CRhinoSkinDLL &)
Not implemented, do not use. More...
Detailed Description
/ / Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. / Rhinoceros is a registered trademark of Robert McNeel & Associates. / / THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. / ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF / MERCHANTABILITY ARE HEREBY DISCLAIMED. /
 / For complete Rhino SDK copyright information see http://www.rhino3d.com/developer. / //////////////////////////////////////////////////////////////
Constructor & Destructor Documentation
◆ CRhinoSkinDLL() [1/2]
 CRhinoSkinDLL::CRhinoSkinDLL  |  ( |   | )
Description: CRhinoSkinDLL constructor
◆ ~CRhinoSkinDLL()
 virtual CRhinoSkinDLL::~CRhinoSkinDLL  |  ( |   | )
virtual
Description: CRhinoSkinDLL destructor
◆ CRhinoSkinDLL() [2/2]
 CRhinoSkinDLL::CRhinoSkinDLL  |  ( |  const CRhinoSkinDLL &  |   | )
protected
Not implemented, do not use.
Member Function Documentation
◆ ApplicationName()
 virtual const wchar_t* CRhinoSkinDLL::ApplicationName  |  ( |   | )
pure virtual
Description: String to be placed in the main frame title bar and message boxes displayed by Rhino.
Returns: String to be placed in the main frame title bar and message boxes displayed by Rhino.
◆ MainRhinoIcon()
 virtual HICON CRhinoSkinDLL::MainRhinoIcon  |  ( |   | )
pure virtual
Begin - Required overrides
Description: This method is called by Rhino to get the skin icon to be associated with the Rhino main frame and dialog boxes.
Returns: The Skin DLL is responsible for loading and deleting the HICON. Make sure you use the AFX_MANAGE_STATE( AfxGetStaticModuleState()) prior to loading the icon.
See Also: AFX_MANAGE_STATE In Microsoft platform SDK help
◆ MainRhinoMenu()
 virtual HMENU CRhinoSkinDLL::MainRhinoMenu  |  ( |   | )
virtual
End- Required overrides
Optional overrides
Description: If this method returns a valid HMENU then it is used to replace the menu associated with the Rhino main frame window. If this method returns NULL then the default Rhino menu is used. Make sure you use the AFX_MANAGE_STATE( AfxGetStaticModuleState()) prior to loading the skin menu.
Returns: If this method returns a valid HMENU then it is used to replace the menu associated with the Rhino main frame window. If this method returns NULL then the default Rhino menu is used.
See Also: AFX_MANAGE_STATE In Microsoft platform SDK help
◆ operator=()
 const CRhinoSkinDLL& CRhinoSkinDLL::operator=  |  ( |  const CRhinoSkinDLL &  |   | )
protected
Not implemented, do not use.
◆ ShowSplash()
 virtual void CRhinoSkinDLL::ShowSplash  |  ( |  bool  |  bShow | )
pure virtual
Description: This method is called when Rhino is loading. Use this method to replace the Rhino splash screen with the skin version. The skin is responsible for destroying the splash window when this method is called with bShow=false.
Parameters: bShow [in] If true then display the skin splash screen if it is not already displayed otherwise destroy the splash window.
◆ SkinPlugInID()
 virtual UUID CRhinoSkinDLL::SkinPlugInID  |  ( |   | )
pure virtual
Description: A skin DLL is required to provide a valid Rhino plug-in UUID. This plug-in will be used to manage the MainRhinoMenu() and proides a place for the developer to add commands to Rhino.
Returns: Returns ID of plug-in associated with this skin.
See Also: CRhinoSkinDLL::MainRhinoMenu()