Public Member Functions | Static Public Member Functions | List of all members
CRhinoGumballPopUpMenu Class Reference
Rhino
#include <rhinoSdkGumball.h>
 Public Member Functions
CRhinoGumballPopUpMenu ()
 Static Public Member Functions
static bool  | GetCommandLineString (ON_wString &value)
static bool  | RespondToPopUpMenuItem (GUMBALL_POPUP_MENU_ITEM gb_popup_menu_item)
static GUMBALL_POPUP_MENU_ITEM  | ShowPopUpMenu (HWND wnd, const ON_2iPoint &point, unsigned int menu_items)
Constructor & Destructor Documentation
◆ CRhinoGumballPopUpMenu()
 CRhinoGumballPopUpMenu::CRhinoGumballPopUpMenu  |  ( |   | )
Member Function Documentation
◆ GetCommandLineString()
 static bool CRhinoGumballPopUpMenu::GetCommandLineString  |  ( |  ON_wString &  |  value | )
static
Description: Call this method to get the command line string to append to the top of the context menu. Parameters: value - [out] String to display. Returns: True if a string should be added and value is not empty.
◆ RespondToPopUpMenuItem()
 static bool CRhinoGumballPopUpMenu::RespondToPopUpMenuItem  |  ( |  GUMBALL_POPUP_MENU_ITEM  |  gb_popup_menu_item | )
static
Description: Handle the app settings menu items. Parameters: gb_menu_item - [in] gumball pop-up menu item to handle. Returns: True if gb_menu_item corresponds to an app settings item. In which case, the appropriate action is taken. False if gb_menu_item is a gumball specific item, like gb_menu_reposition, that applies to a single gumball.
◆ ShowPopUpMenu()
 static GUMBALL_POPUP_MENU_ITEM CRhinoGumballPopUpMenu::ShowPopUpMenu  |  ( |  HWND  |  wnd,
|  const ON_2iPoint &  |  point,
|  unsigned int  |  menu_items
)
static
Description: Show the gumball popup menu. Parameters: wnd - [in] Parent window. Typically a status bar or a CRhinoView. point - [in] window coordinates of the lower left corner of the pop-up CRhinoGumball::GetPopUpMenuPoint() can be used to get the screen location of a gumball's menu ball. menu_ites - [in] bitfield that determine what items should appear on the pop-up menu. Use GUMBALL_POPUP_MENU_ITEM to set the bits. Returns: Selected item. The caller is responsible for actually doing something. The function RespondToPopUpMenuItem() can be used to handle the app settings menu items.