Public Member Functions | List of all members
ON_SurfaceProxy Class Reference
OpenNURBS
#include <opennurbs_surfaceproxy.h>
 Inheritance diagram for ON_SurfaceProxy:
 Public Member Functions
ON_SurfaceProxy ()
ON_SurfaceProxy (const ON_Surface *)
ON_SurfaceProxy (const ON_SurfaceProxy &)
virtual  | ~ON_SurfaceProxy ()
ON_Mesh *  | CreateMesh (const ON_MeshParameters &mp, ON_Mesh *mesh=nullptr) const override
ON_Surface overrides. More...
ON__UINT32  | DataCRC (ON__UINT32 current_remainder) const override
virtual ON_Object::DataCRC override More...
int  | Degree (int) const override
void  | DestroyRuntimeCache (bool bDelete=true) override
virtual ON_Object::DestroyRuntimeCache override More...
int  | Dimension () const override
ON_Geometry overrides. More...
ON_Interval  | Domain (int) const override
void  | Dump (ON_TextLog &) const override
for debugging More...
ON_Surface *  | DuplicateSurface () const override
bool  | Evaluate (double, double, int, int, double *, int=0, int *=0) const override
work horse evaluator More...
bool  | GetBBox (double *boxmin, double *boxmax, bool bGrowBox=false) const override
virtual ON_Geometry GetBBox override
 More...
bool  | GetClosestPoint (const ON_3dPoint &P, double *s, double *t, double maximum_distance=0.0, const ON_Interval *sdomain=0, const ON_Interval *tdomain=0) const override
bool  | GetLocalClosestPoint (const ON_3dPoint &, double, double, double *, double *, const ON_Interval *=nullptr, const ON_Interval *=nullptr) const override
bool  | GetNextDiscontinuity (int dir, ON::continuity c, double t0, double t1, double *t, int *hint=nullptr, int *dtype=nullptr, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
int  | GetNurbForm (ON_NurbsSurface &, double=0.0) const override
bool  | GetNurbFormParameterFromSurfaceParameter (double surface_s, double surface_t, double *nurbs_s, double *nurbs_t) const override
bool  | GetParameterTolerance (int, double, double *, double *) const override
bool  | GetSpanVector (int, double *) const override
bool  | GetSurfaceParameterFromNurbFormParameter (double nurbs_s, double nurbs_t, double *surface_s, double *surface_t) const override
bool  | GetSurfaceSize (double *width, double *height) const override
int  | HasNurbForm () const override
bool  | IsClosed (int) const override
bool  | IsContinuous (ON::continuity c, double s, double t, int *hint=nullptr, double point_tolerance=ON_ZERO_TOLERANCE, double d1_tolerance=ON_ZERO_TOLERANCE, double d2_tolerance=ON_ZERO_TOLERANCE, double cos_angle_tolerance=ON_DEFAULT_ANGLE_TOLERANCE_COSINE, double curvature_tolerance=ON_SQRT_EPSILON) const override
ON_Surface::ISO  | IsIsoparametric (const ON_BoundingBox &bbox) const override
override virtual ON_Surface::IsIsoparametric More...
ON_Surface::ISO  | IsIsoparametric (const ON_Curve &curve, const ON_Interval *curve_domain=nullptr) const override
override virtual ON_Surface::IsIsoparametric More...
ON_Curve *  | IsoCurve (int dir, double c) const override
bool  | IsPeriodic (int) const override
bool  | IsPlanar (ON_Plane *plane=nullptr, double tolerance=ON_ZERO_TOLERANCE) const override
bool  | IsSingular (int) const override
bool  | IsValid (class ON_TextLog *text_log=nullptr) const override
ON_Surface *  | Offset (double offset_distance, double tolerance, double *max_deviation=nullptr) const override
ON_SurfaceProxy &  | operator= (const ON_SurfaceProxy &)
const ON_Surface *  | ProxySurface () const
bool  | ProxySurfaceIsTransposed () const
ON_Curve *  | Pullback (const ON_Curve &curve_3d, double tolerance, const ON_Interval *curve_3d_subdomain=nullptr, ON_3dPoint start_uv=ON_3dPoint::UnsetPoint, ON_3dPoint end_uv=ON_3dPoint::UnsetPoint, ON_FitResult *rc=0) const override
ON_Curve *  | Pushup (const ON_Curve &curve_2d, double tolerance, const ON_Interval *curve_2d_subdomain=nullptr, ON_FitResult *rc=0) const override
bool  | Read (ON_BinaryArchive &) override
bool  | Reverse (int) override
void  | SetProxySurface (const ON_Surface *proxy_surface)
unsigned int  | SizeOf () const override
ON_Object overrides. More...
int  | SpanCount (int) const override
number of smooth spans in curve More...
bool  | Transform (const ON_Xform &) override
bool  | Transpose () override
transpose surface parameterization (swap "s" and "t") More...
bool  | Write (ON_BinaryArchive &) const override
 Public Member Functions inherited from ON_Surface
ON_Surface ()
ON_Surface (const ON_Surface &)
virtual  | ~ON_Surface ()
bool  | AreaMassProperties (class ON_MassProperties &mp, bool bArea=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
ON_Brep *  | BrepForm (ON_Brep *brep=nullptr) const override
virtual ON_SurfaceTree *  | CreateSurfaceTree () const
ON_Curve *  | CurveIso (ON_Surface::ISO iso, double p=ON_UNSET_VALUE) const
void  | DestroySurfaceTree ()
bool  | Ev1Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, int quadrant=0, int *hint=0) const
bool  | Ev2Der (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &duu, ON_3dVector &duv, ON_3dVector &dvv, int quadrant=0, int *hint=0) const
bool  | EvaluatePoint (const class ON_ObjRef &objref, ON_3dPoint &P) const override
virtual ON_Geometry override More...
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &du, ON_3dVector &dv, ON_3dVector &normal, int=0, int *=0) const
bool  | EvNormal (double u, double v, ON_3dPoint &point, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvNormal (double u, double v, ON_3dVector &normal, int quadrant=0, int *hint=0) const
bool  | EvPoint (double u, double v, ON_3dPoint &point, int quadrant=0, int *hint=0) const
virtual bool  | Extend (int dir, const ON_Interval &domain)
bool  | FrameAt (double u, double v, ON_Plane &frame) const
bool  | GetDomain (int dir, double *t0, double *t1) const
int  | GetIsoPushupDirection (const ON_Curve &curve_2d, double tolerance, const ON_Interval *curve_2d_subdomain, double *c, ON_Interval *c3_dom) const
bool  | GetSilhouette (const ON_Interval *udom, const ON_Interval *vdom, const ON_SilhouetteParameters parameters, const ON_PlaneEquation *clipping_planes, size_t clipping_plane_count, ON_ClassArray< ON_SIL_EVENT > &silhouettes, ON_ProgressReporter *progress, ON_Terminator *terminator) const
virtual bool  | GetSpanVectorIndex (int dir, double t, int side, int *span_vector_index, ON_Interval *span_interval) const
ON_Curve *  | GetSurfaceParameterFromNurbFormParameter (const ON_Curve &curve3d, const ON_Curve &ns_curve2dX, double fit_tolerance) const
ON_Curve *  | GetSurfaceParameterFromNurbFormParameter (const ON_SurfaceTree *tree, const ON_Curve &curve3d, const ON_Curve &ns_curve2dX, double fit_tolerance) const
bool  | HasBrepForm () const override
bool  | HasSingularEdge () const
int  | IntersectPlane (ON_PlaneEquation plane_equation, ON_ClassArray< ON_SSX_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, double fitting_tolerance=0.0, const ON_Interval *surface_udomain=0, const ON_Interval *surface_vdomain=0) const
int  | IntersectSurface (const ON_Surface *surfaceB, ON_ClassArray< ON_SSX_EVENT > &x, double intersection_tolerance=0.0, double overlap_tolerance=0.0, double fitting_tolerance=0.0, const ON_Interval *surfaceA_udomain=0, const ON_Interval *surfaceA_vdomain=0, const ON_Interval *surfaceB_udomain=0, const ON_Interval *surfaceB_vdomain=0) const
int  | IsAtSeam (double s, double t) const
bool  | IsAtSingularity (double s, double t, bool bExact=true) const
bool  | IsCone (ON_Cone *cone=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsCylinder (ON_Cylinder *cylinder=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsExtrusion (ON_Extrusion *extrusion=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsSolid () const
bool  | IsSphere (ON_Sphere *sphere=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
bool  | IsTorus (ON_Torus *torus=nullptr, double tolerance=ON_ZERO_TOLERANCE) const
ON_3dVector  | NormalAt (double, double) const
ON_NurbsSurface *  | NurbsSurface (ON_NurbsSurface *pNurbsSurface=nullptr, double tolerance=0.0, const ON_Interval *s_subdomain=nullptr, const ON_Interval *t_subdomain=nullptr) const
ON::object_type  | ObjectType () const override
override ON_Object::ObjectType() - returns ON::surface_object More...
ON_Surface &  | operator= (const ON_Surface &)
ON_3dPoint  | PointAt (double, double) const
simple evaluation interface - no error handling More...
virtual bool  | SetDomain (int dir, double t0, double t1)
bool  | SetDomain (int dir, ON_Interval domain)
const ON_SimpleArray< double >  | SpanVector (int dir) const
The surface's span vectors are a stricltly monotone increasing lists of doubles that specify the rectangles in the domain where the surface is C-infinity. More...
virtual bool  | Split (int dir, double c, ON_Surface *&west_or_south_side, ON_Surface *&east_or_north_side) const
const ON_SurfaceTree *  | SurfaceTree () const
virtual bool  | Trim (int dir, const ON_Interval &domain)
bool  | VolumeMassProperties (class ON_MassProperties &mp, bool bVolume=true, bool bFirstMoments=true, bool bSecondMoments=true, bool bProductMoments=true, ON_3dPoint base_point=ON_3dPoint::UnsetPoint, double rel_tol=1.0e-6, double abs_tol=1.0e-6) const
 Public Member Functions inherited from ON_Geometry
ON_Geometry ()=default
ON_Geometry (const ON_Geometry &)=default
~ON_Geometry ()=default
ON_BoundingBox  | BoundingBox () const
virtual void  | ClearBoundingBox ()
virtual ON_COMPONENT_INDEX  | ComponentIndex () const
bool  | GetBoundingBox (ON_3dPoint &bbox_min, ON_3dPoint &bbox_max, bool bGrowBox=false) const
bool  | GetBoundingBox (ON_BoundingBox &bbox, bool bGrowBox=false) const
virtual bool  | GetTightBoundingBox (class ON_BoundingBox &tight_bbox, bool bGrowBox=false, const class ON_Xform *xform=nullptr) const
virtual bool  | IsDeformable () const
virtual bool  | IsMorphable () const
virtual bool  | MakeDeformable ()
virtual bool  | Morph (const class ON_SpaceMorph &morph)
ON_Geometry &  | operator= (const ON_Geometry &)=default
bool  | Rotate (double rotation_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Rotate (double sin_angle, double cos_angle, const ON_3dVector &rotation_axis, const ON_3dPoint &rotation_center)
bool  | Scale (double scale_factor)
virtual bool  | SwapCoordinates (int i, int j)
const ON_BoundingBox  | TightBoundingBox () const
bool  | Translate (const ON_3dVector &translation_vector)
 Public Member Functions inherited from ON_Object
ON_Object () ON_NOEXCEPT
ON_Object (const ON_Object &)
virtual  | ~ON_Object ()
virtual ON_AggregateComponentStatus  | AggregateComponentStatus () const
bool  | AttachUserData (class ON_UserData *pUserData)
unsigned int  | ClearAllComponentStates () const
virtual unsigned int  | ClearComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_clear) const
virtual unsigned int  | ClearComponentStates (ON_ComponentStatus states_to_clear) const
void  | CopyUserData (const ON_Object &source_object)
unsigned int  | CopyUserData (const ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution)
virtual bool  | DeleteComponents (const ON_COMPONENT_INDEX *ci_list, size_t ci_count)
bool  | DetachUserData (class ON_UserData *pUserData)
void  | DumpUserData (const wchar_t *description, ON_TextLog &text_log) const
Go through the linked list of ON_UserData attached to this and call the virtual Dump(text_log) function on each instance. More...
void  | EmergencyDestroy ()
class ON_UserData *  | FirstUserData () const
virtual unsigned int  | GetComponentsWithSetStates (ON_ComponentStatus states_filter, bool bAllEqualStates, ON_SimpleArray< ON_COMPONENT_INDEX > &components) const
class ON_UserData *  | GetUserData (const ON_UUID &userdata_uuid) const
bool  | GetUserString (const wchar_t *key, ON_wString &string_value) const
int  | GetUserStringKeys (ON_ClassArray< ON_wString > &user_string_keys) const
int  | GetUserStrings (ON_ClassArray< ON_UserString > &user_strings) const
bool  | IsCorrupt (bool bRepair, bool bSilentError, class ON_TextLog *text_log) const
bool  | IsKindOf (const ON_ClassId *pClassId) const
virtual void  | MarkAggregateComponentStatusAsNotCurrent () const
virtual void  | MemoryRelocate ()
virtual ON_UUID  | ModelObjectId () const
void  | MoveUserData (ON_Object &source_object)
unsigned int  | MoveUserData (ON_Object &source_object, ON_UUID source_userdata_item_id, ON_Object::UserDataConflictResolution userdata_conflict_resolution, bool bDeleteAllSourceItems)
ON_wString  | ObjectTypeStr () const
virtual More...
ON_Object &  | operator= (const ON_Object &)
void  | PurgeUserData ()
virtual unsigned int  | SetComponentStates (ON_COMPONENT_INDEX component_index, ON_ComponentStatus states_to_set) const
virtual unsigned int  | SetComponentStatus (ON_COMPONENT_INDEX component_index, ON_ComponentStatus status_to_copy) const
bool  | SetUserString (const wchar_t *key, const wchar_t *string_value)
int  | SetUserStrings (int count, const ON_UserString *user_strings, bool bReplace)
bool  | ThisIsNullptr (bool bSilentError) const
void  | TransformUserData (const class ON_Xform &xform)
virtual bool  | UpdateReferencedComponents (const class ON_ComponentManifest &source_manifest, const class ON_ComponentManifest &destination_manifest, const class ON_ManifestMap &manifest_map)
int  | UserStringCount () const
 Additional Inherited Members
 Public Types inherited from ON_Surface
enum  | ISO {
 not_iso = 0, x_iso = 1, y_iso = 2, W_iso = 3,
 S_iso = 4, E_iso = 5, N_iso = 6, iso_count = 7
 }
pure virtual class for surface objects More...
 Public Types inherited from ON_Object
enum  | UserDataConflictResolution : unsigned char {
 UserDataConflictResolution::destination_object = 0, UserDataConflictResolution::source_object = 1, UserDataConflictResolution::source_copycount_gt = 2, UserDataConflictResolution::source_copycount_ge = 3,
 UserDataConflictResolution::destination_copycount_gt = 4, UserDataConflictResolution::destination_copycount_ge = 5, UserDataConflictResolution::delete_item = 6
 }
 Static Public Member Functions inherited from ON_Surface
static class ON_NurbsSurface *  | CreateCubicLoft (int curve_count, const ON_Curve *const *curve_list, double k, int is_closed=0, ON::cubic_loft_end_condition start_shape=ON::cubic_loft_ec_quadratic, ON::cubic_loft_end_condition end_shape=ON::cubic_loft_ec_quadratic, class ON_NurbsSurface *nurbs_surface=0)
static class ON_NurbsSurface *  | CreateLinearLoft (int curve_count, const ON_Curve *const *curve_list, double k, int is_closed=0, class ON_NurbsSurface *nurbs_surface=0)
 Static Public Attributes inherited from ON_Geometry
const static ON_Geometry  | Unset
 Protected Member Functions inherited from ON_Surface
ON_Curve *  | PullbackCurveProxy (const ON_CurveProxy &curveproxy_3d, double tolerance, const ON_Interval *curve_3d_subdomain, ON_3dPoint start_uv, ON_3dPoint end_uv, ON_FitResult *rc) const
Helper for ON_Surface::Pullback overrides that handles "real" curve issues. More...
ON_Curve *  | PullbackPolyCurve (const ON_PolyCurve &polycurve_3d, double tolerance, const ON_Interval *curve_3d_subdomain, ON_3dPoint start_uv, ON_3dPoint end_uv, ON_FitResult *rc) const
ON_Curve *  | PushupCurveProxy (const ON_CurveProxy &curveproxy_2d, double tolerance, const ON_Interval *curve_2d_subdomain, ON_FitResult *rc) const
Helper for ON_Surface::Pushup overrides that handles "real" curve issues. More...
ON_Curve *  | PushupPolyCurve (const ON_PolyCurve &polycurve_2d, double tolerance, const ON_Interval *curve_2d_subdomain, ON_FitResult *rc) const
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. OpenNURBS, Rhinoceros, and Rhino3D are registered trademarks of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete openNURBS copyright information see http://www.opennurbs.org. Definition of surface proxy object
Constructor & Destructor Documentation
◆ ON_SurfaceProxy() [1/3]
 ON_SurfaceProxy::ON_SurfaceProxy  |  ( |   | )
◆ ON_SurfaceProxy() [2/3]
 ON_SurfaceProxy::ON_SurfaceProxy  |  ( |  const ON_Surface *  |   | )
◆ ON_SurfaceProxy() [3/3]
 ON_SurfaceProxy::ON_SurfaceProxy  |  ( |  const ON_SurfaceProxy &  |   | )
◆ ~ON_SurfaceProxy()
 virtual ON_SurfaceProxy::~ON_SurfaceProxy  |  ( |   | )
virtual
Member Function Documentation
◆ CreateMesh()
 ON_Mesh* ON_SurfaceProxy::CreateMesh  |  ( |  const ON_MeshParameters &  |  mp,
|  ON_Mesh *  |  mesh = nullptr
) |   |  const
overridevirtual
ON_Surface overrides.
Reimplemented from ON_Surface.
◆ DataCRC()
 ON__UINT32 ON_SurfaceProxy::DataCRC  |  ( |  ON__UINT32  |  current_remainder | ) |   const
overridevirtual
virtual ON_Object::DataCRC override
Reimplemented from ON_Object.
◆ Degree()
 int ON_SurfaceProxy::Degree  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ DestroyRuntimeCache()
 void ON_SurfaceProxy::DestroyRuntimeCache  |  ( |  bool  |  bDelete = true | )
overridevirtual
virtual ON_Object::DestroyRuntimeCache override
Reimplemented from ON_Surface.
◆ Dimension()
 int ON_SurfaceProxy::Dimension  |  ( |   | ) |   const
overridevirtual
ON_Geometry overrides.
Reimplemented from ON_Geometry.
◆ Domain()
 ON_Interval ON_SurfaceProxy::Domain  |  ( |  int  |   | ) |   const
overridevirtual
Implements ON_Surface.
◆ Dump()
 void ON_SurfaceProxy::Dump  |  ( |  ON_TextLog &  |   | ) |   const
overridevirtual
for debugging
Reimplemented from ON_Object.
◆ DuplicateSurface()
 ON_Surface* ON_SurfaceProxy::DuplicateSurface  |  ( |   | ) |   const
overridevirtual
Description: Get a duplicate of the surface. Returns: A duplicate of the surface.
 Remarks: The caller must delete the returned surface. For non-ON_SurfaceProxy objects, this simply duplicates the surface using ON_Object::Duplicate. For ON_SurfaceProxy objects, this duplicates the actual proxy surface geometry and, if necessary, transposes the result to that the returned surfaces's parameterization and locus match the proxy surface's.
Reimplemented from ON_Surface.
◆ Evaluate()
 bool ON_SurfaceProxy::Evaluate  |  ( |  double  |  ,
|  double  |  ,
|  int  |  ,
|  int  |  ,
|  double *  |  ,
|  int  |   = 0,
|  int *  |   = 0
) |   |  const
overridevirtual
work horse evaluator
Implements ON_Surface.
◆ GetBBox()
 bool ON_SurfaceProxy::GetBBox  |  ( |  double *  |  boxmin,
|  double *  |  boxmax,
|  bool  |  bGrowBox = false
) |   |  const
overridevirtual
virtual ON_Geometry GetBBox override
Reimplemented from ON_Geometry.
◆ GetClosestPoint()
 bool ON_SurfaceProxy::GetClosestPoint  |  ( |  const ON_3dPoint &  |  P,
|  double *  |  s,
|  double *  |  t,
|  double  |  maximum_distance = 0.0,
|  const ON_Interval *  |  sdomain = 0,
|  const ON_Interval *  |  tdomain = 0
) |   |  const
overridevirtual
Description: Get the parameters of the point on the surface that is closest to P. Parameters: P - [in] test point s - [out] t - [out] (*s,*t) = parameters of the surface point that is closest to P. maximum_distance = 0.0 - [in] optional upper bound on the distance from P to the surface. If you are only interested in finding a point Q on the surface when P.DistanceTo(Q) < maximum_distance, then set maximum_distance to that value. sdomain = 0 - [in] optional domain restriction tdomain = 0 - [in] optional domain restriction Returns: True if successful. If false, the values of *s and *t are undefined. See Also: ON_Surface::GetLocalClosestPoint.
Reimplemented from ON_Surface.
◆ GetLocalClosestPoint()
 bool ON_SurfaceProxy::GetLocalClosestPoint  |  ( |  const ON_3dPoint &  |  ,
|  double  |  ,
|  double  |  ,
|  double *  |  ,
|  double *  |  ,
|  const ON_Interval *  |   = nullptr,
|  const ON_Interval *  |   = nullptr
) |   |  const
overridevirtual
Find parameters of the point on a surface that is locally closest to the test_point. The search for a local close point starts at seed parameters. If a sub_domain parameter is not nullptr, then the search is restricted to the specified portion of the surface.
true if returned if the search is successful. false is returned if the search fails.
Reimplemented from ON_Surface.
◆ GetNextDiscontinuity()
 bool ON_SurfaceProxy::GetNextDiscontinuity  |  ( |  int  |  dir,
|  ON::continuity  |  c,
|  double  |  t0,
|  double  |  t1,
|  double *  |  t,
|  int *  |  hint = nullptr,
|  int *  |  dtype = nullptr,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Search for a derivative, tangent, or curvature discontinuity. Parameters: dir - [in] If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked. c - [in] type of continuity to test for. t0 - [in] Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities. t1 - [in] (t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity type and t1 is at the start or end of the curve. t - [out] if a discontinuity is found, then *t reports the parameter at the discontinuity. hint - [in/out] if GetNextDiscontinuity will be called repeatedly, passing a "hint" with initial value *hint=0 will increase the speed of the search.
 dtype - [out] if not nullptr, *dtype reports the kind of discontinuity found at *t. A value of 1 means the first derivative or unit tangent was discontinuous. A value of 2 means the second derivative or curvature was discontinuous. A value of 0 means the curve is not closed, a locus discontinuity test was applied, and t1 is at the start of end of the curve. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the ends of their domains. All closed curves (IsClosed()=true) are at least C0_locus_continuous at the ends of their domains.
Reimplemented from ON_Surface.
◆ GetNurbForm()
 int ON_SurfaceProxy::GetNurbForm  |  ( |  ON_NurbsSurface &  |  nurbs_surface,
|  double  |  tolerance = 0.0
) |   |  const
overridevirtual
Description: Get a NURBS surface representation of this surface. Parameters: nurbs_surface - [out] NURBS representation returned here tolerance - [in] tolerance to use when creating NURBS representation. s_subdomain - [in] if not nullptr, then the NURBS representation for this portion of the surface is returned. t_subdomain - [in] if not nullptr, then the NURBS representation for this portion of the surface is returned. Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - returned NURBS parameterization matches the surface's to the desired accuracy 2 success - returned NURBS point locus matches the surface's to the desired accuracy and the domain of the NURBS surface is correct. On However, This surface's parameterization and the NURBS surface parameterization may not match to the desired accuracy. This situation happens when getting NURBS representations of surfaces that have a transcendental parameterization like spheres, cylinders, and cones. Remarks: This is a low-level virtual function. If you do not need the parameterization information provided by the return code, then ON_Surface::NurbsSurface may be easier to use. See Also: ON_Surface::NurbsSurface
Reimplemented from ON_Surface.
◆ GetNurbFormParameterFromSurfaceParameter()
 bool ON_SurfaceProxy::GetNurbFormParameterFromSurfaceParameter  |  ( |  double  |  surface_s,
|  double  |  surface_t,
|  double *  |  nurbs_s,
|  double *  |  nurbs_t
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetParameterTolerance()
 bool ON_SurfaceProxy::GetParameterTolerance  |  ( |  int  |  ,
|  double  |  ,
|  double *  |  ,
|  double *
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetSpanVector()
 bool ON_SurfaceProxy::GetSpanVector  |  ( |  int  |  ,
|  double *
) |   |  const
overridevirtual
Implements ON_Surface.
◆ GetSurfaceParameterFromNurbFormParameter()
 bool ON_SurfaceProxy::GetSurfaceParameterFromNurbFormParameter  |  ( |  double  |  nurbs_s,
|  double  |  nurbs_t,
|  double *  |  surface_s,
|  double *  |  surface_t
) |   |  const
overridevirtual
Reimplemented from ON_Surface.
◆ GetSurfaceSize()
 bool ON_SurfaceProxy::GetSurfaceSize  |  ( |  double *  |  width,
|  double *  |  height
) |   |  const
overridevirtual
Description: Get an estimate of the size of the rectangle that would be created if the 3d surface where flattened into a rectangle. Parameters: width - [out] (corresponds to the first surface parameter) height - [out] (corresponds to the first surface parameter) Remarks: overrides virtual ON_Surface::GetSurfaceSize Returns: true if successful.
Reimplemented from ON_Surface.
◆ HasNurbForm()
 int ON_SurfaceProxy::HasNurbForm  |  ( |   | ) |   const
overridevirtual
Description: Is there a NURBS surface representation of this surface. Parameters: Returns: 0 unable to create NURBS representation with desired accuracy. 1 success - NURBS parameterization matches the surface's 2 success - NURBS point locus matches the surface's and the domain of the NURBS surface is correct.
 However, This surface's parameterization and the NURBS surface parameterization may not match. This situation happens when getting NURBS representations of surfaces that have a transcendental parameterization like spheres, cylinders, and cones. Remarks: This is a low-level virtual function. See Also: ON_Surface::GetNurbForm ON_Surface::NurbsSurface
Reimplemented from ON_Surface.
◆ IsClosed()
 bool ON_SurfaceProxy::IsClosed  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsContinuous()
 bool ON_SurfaceProxy::IsContinuous  |  ( |  ON::continuity  |  c,
|  double  |  s,
|  double  |  t,
|  int *  |  hint = nullptr,
|  double  |  point_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d1_tolerance = ON_ZERO_TOLERANCE,
|  double  |  d2_tolerance = ON_ZERO_TOLERANCE,
|  double  |  cos_angle_tolerance = ON_DEFAULT_ANGLE_TOLERANCE_COSINE,
|  double  |  curvature_tolerance = ON_SQRT_EPSILON
) |   |  const
overridevirtual
Description: Test continuity at a surface parameter value. Parameters: c - [in] continuity to test for s - [in] surface parameter to test t - [in] surface parameter to test hint - [in] evaluation hint point_tolerance - [in] if the distance between two points is greater than point_tolerance, then the surface is not C0. d1_tolerance - [in] if the difference between two first derivatives is greater than d1_tolerance, then the surface is not C1. d2_tolerance - [in] if the difference between two second derivatives is greater than d2_tolerance, then the surface is not C2. cos_angle_tolerance - [in] default = cos(1 degree) Used only when c is ON::continuity::G1_continuous or ON::continuity::G2_continuous. If the cosine of the angle between two normal vectors is <= cos_angle_tolerance, then a G1 discontinuity is reported. curvature_tolerance - [in] (default = ON_SQRT_EPSILON) Used only when c is ON::continuity::G2_continuous. If K0 and K1 are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then a curvature discontinuity is reported. Returns: true if the surface has at least the c type continuity at the parameter t. Remarks: Overrides virtual ON_Surface::IsContinuous
Reimplemented from ON_Surface.
◆ IsIsoparametric() [1/2]
 ON_Surface::ISO ON_SurfaceProxy::IsIsoparametric  |  ( |  const ON_BoundingBox &  |  bbox | ) |   const
overridevirtual
override virtual ON_Surface::IsIsoparametric
Reimplemented from ON_Surface.
◆ IsIsoparametric() [2/2]
 ON_Surface::ISO ON_SurfaceProxy::IsIsoparametric  |  ( |  const ON_Curve &  |  curve,
|  const ON_Interval *  |  curve_domain = nullptr
) |   |  const
overridevirtual
override virtual ON_Surface::IsIsoparametric
Reimplemented from ON_Surface.
◆ IsoCurve()
 ON_Curve* ON_SurfaceProxy::IsoCurve  |  ( |  int  |  dir,
|  double  |  c
) |   |  const
overridevirtual
Description: Get isoparametric curve. Parameters: dir - [in] 0 first parameter varies and second parameter is constant e.g., point on IsoCurve(0,c) at t is srf(t,c) This is a horizontal line from left to right 1 first parameter is constant and second parameter varies e.g., point on IsoCurve(1,c) at t is srf(c,t This is a vertical line from bottom to top
c - [in] value of constant parameter Returns: Isoparametric curve. Remarks: In this function "dir" indicates which direction the resulting curve runs. 0: horizontal, 1: vertical In the other ON_Surface functions that take a "dir" argument, "dir" indicates if "c" is a "u" or "v" parameter.
Reimplemented from ON_Surface.
◆ IsPeriodic()
 bool ON_SurfaceProxy::IsPeriodic  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsPlanar()
 bool ON_SurfaceProxy::IsPlanar  |  ( |  ON_Plane *  |  plane = nullptr,
|  double  |  tolerance = ON_ZERO_TOLERANCE
) |   |  const
overridevirtual
Description: Test a surface to see if it is planar. Parameters: plane - [out] if not nullptr and true is returned, the plane parameters are filled in. tolerance - [in] tolerance to use when checking Returns: true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance. Remarks: Overrides virtual ON_Surface::IsPlanar.
Reimplemented from ON_Surface.
◆ IsSingular()
 bool ON_SurfaceProxy::IsSingular  |  ( |  int  |   | ) |   const
overridevirtual
Reimplemented from ON_Surface.
◆ IsValid()
 bool ON_SurfaceProxy::IsValid  |  ( |  class ON_TextLog *  |  text_log = nullptr | ) |   const
overridevirtual
Description: Tests an object to see if its data members are correctly initialized. Parameters: text_log - [in] if the object is not valid and text_log is not nullptr, then a brief english description of the reason the object is not valid is appended to the log. The information appended to text_log is suitable for low-level debugging purposes by programmers and is not intended to be useful as a high level user interface tool. Returns: @untitled table true object is valid false object is invalid, uninitialized, etc.
Reimplemented from ON_Geometry.
◆ Offset()
 ON_Surface* ON_SurfaceProxy::Offset  |  ( |  double  |  offset_distance,
|  double  |  tolerance,
|  double *  |  max_deviation = nullptr
) |   |  const
overridevirtual
Description: Offset surface. Parameters: offset_distance - [in] offset distance tolerance - [in] Some surfaces do not have an exact offset that can be represented using the same class of surface definition. In that case, the tolerance specifies the desired accuracy. max_deviation - [out] If this parameter is not nullptr, the maximum deviation from the returned offset to the true offset is returned here. This deviation is zero except for cases where an exact offset cannot be computed using the same class of surface definition. Remarks: Overrides virtual ON_Surface::Offset. Returns: Offset surface.
Reimplemented from ON_Surface.
◆ operator=()
 ON_SurfaceProxy& ON_SurfaceProxy::operator=  |  ( |  const ON_SurfaceProxy &  |   | )
◆ ProxySurface()
 const ON_Surface* ON_SurfaceProxy::ProxySurface  |  ( |   | ) |   const
◆ ProxySurfaceIsTransposed()
 bool ON_SurfaceProxy::ProxySurfaceIsTransposed  |  ( |   | ) |   const
◆ Pullback()
 ON_Curve* ON_SurfaceProxy::Pullback  |  ( |  const ON_Curve &  |  curve_3d,
|  double  |  tolerance,
|  const ON_Interval *  |  curve_3d_subdomain = nullptr,
|  ON_3dPoint  |  start_uv = ON_3dPoint::UnsetPoint,
|  ON_3dPoint  |  end_uv = ON_3dPoint::UnsetPoint,
|  ON_FitResult *  |  rc = 0
) |   |  const
overridevirtual
Description: Pull a 3d curve back to the surface's parameter space. Parameters: curve_3d - [in] a 3d curve tolerance - [in] the maximum acceptable 3d distance between from surface(curve_2d(t)) to the locus of points on the surface that are closest to curve_3d. curve_3d_subdomain - [in] optional subdomain for curve_3d start_uv - [in] optional starting point (if known) end_uv - [in] optional ending point (if known) rc - [out] if not 0 on input, points to an ON_FitResult with the following value - ON_FitResult::in_tolerance if result is in tolerance ON_FitResult::not_in_tolerance if result is not in tolerance ON_FitResult::unknown if no result or it could not be determined if the result was in tolerance. Returns: 2d curve. See Also: ON_Surface::IsoCurve ON_Surface::Pushup
Reimplemented from ON_Surface.
◆ Pushup()
 ON_Curve* ON_SurfaceProxy::Pushup  |  ( |  const ON_Curve &  |  curve_2d,
|  double  |  tolerance,
|  const ON_Interval *  |  curve_2d_subdomain = nullptr,
|  ON_FitResult *  |  rc = 0
) |   |  const
overridevirtual
Description: Compute a 3d curve that is the composite of a 2d curve and the surface map. Parameters: curve_2d - [in] a 2d curve whose image is in the surface's domain. tolerance - [in] the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface. curve_2d_subdomain - [in] optional subdomain for curve_2d rc - [out] if not 0 on input, points to an ON_FitResult with the following value - ON_FitResult::in_tolerance if result is in tolerance ON_FitResult::not_in_tolerance if result is not in tolerance ON_FitResult::unknown if no result or it could not be determined if the result was in tolerance. Returns: 3d curve. See Also: ON_Surface::IsoCurve ON_Surface::Pullback
Reimplemented from ON_Surface.
◆ Read()
 bool ON_SurfaceProxy::Read  |  ( |  ON_BinaryArchive &  |  binary_archive | )
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::ReadObject(). Parameters: binary_archive - archive to read from Returns: Returns true if the read is successful. Remarks: Use ON_BinaryArchive::ReadObject() to read objects. This Read() function should read the objects definition back into its data members.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.
◆ Reverse()
 bool ON_SurfaceProxy::Reverse  |  ( |  int  |   | )
overridevirtual
Implements ON_Surface.
◆ SetProxySurface()
 void ON_SurfaceProxy::SetProxySurface  |  ( |  const ON_Surface *  |  proxy_surface | )
◆ SizeOf()
 unsigned int ON_SurfaceProxy::SizeOf  |  ( |   | ) |   const
overridevirtual
ON_Object overrides.
virtual ON_Object::SizeOf override
Reimplemented from ON_Surface.
◆ SpanCount()
 int ON_SurfaceProxy::SpanCount  |  ( |  int  |   | ) |   const
overridevirtual
number of smooth spans in curve
Implements ON_Surface.
◆ Transform()
 bool ON_SurfaceProxy::Transform  |  ( |  const ON_Xform &  |  xform | )
overridevirtual
Description: Transforms the object.
Parameters: xform - [in] transformation to apply to object. If xform.IsSimilarity() is zero, then you may want to call MakeSquishy() before calling Transform.
Remarks: When overriding this function, be sure to include a call to ON_Object::TransformUserData() which takes care of transforming any ON_UserData that may be attached to the object.
See Also: ON_Geometry::IsDeformable();
Remarks: Classes derived from ON_Geometry should call ON_Geometry::Transform() to handle user data transformations and then transform their definition.
Reimplemented from ON_Geometry.
◆ Transpose()
 bool ON_SurfaceProxy::Transpose  |  ( |   | )
overridevirtual
transpose surface parameterization (swap "s" and "t")
Implements ON_Surface.
◆ Write()
 bool ON_SurfaceProxy::Write  |  ( |  ON_BinaryArchive &  |  binary_archive | ) |   const
overridevirtual
Description: Low level archive writing tool used by ON_BinaryArchive::WriteObject(). Parameters: binary_archive - archive to write to Returns: Returns true if the write is successful. Remarks: Use ON_BinaryArchive::WriteObject() to write objects. This Write() function should just write the specific definition of this object. It should not write and any chunk typecode or length information.
The default implementation of this virtual function returns false and does nothing.
Reimplemented from ON_Object.