Public Attributes | List of all members
CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO Struct Reference
#include <RhinoSdkUiTabbedSheetCtrl.h>
 Public Attributes
bool  | m_bool
HWND  | m_hWnd
Event source. More...
int  | m_iItem
Zero based index for tab generating the message. More...
LPCTSTR  | m_lpsText
UINT  | m_nMsg
Event (selection change, item deleted, etc ) More...
int  | m_nPrevSel
POINT  | m_pt
Mouse event point. More...
Member Data Documentation
◆ m_bool
 bool CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_bool
Message dependent: mid_begin_tab_drag = If true then drag operation will continue as normal otherwise it will be aborted.
◆ m_hWnd
 HWND CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_hWnd
Event source.
◆ m_iItem
 int CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_iItem
Zero based index for tab generating the message.
◆ m_lpsText
 LPCTSTR CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_lpsText
Pointer to string used by mid_begin_label_edit and mid_end_label_edit messages.
◆ m_nMsg
 UINT CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_nMsg
Event (selection change, item deleted, etc )
◆ m_nPrevSel
 int CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_nPrevSel
Zero based index for previous current tab, only valid for mid_sel_changing and mid_sel_changed messages.
◆ m_pt
 POINT CRhinoUiTabbedSheetCtrlMsg::tagCUSTOMINFO::m_pt
Mouse event point.