Public Attributes | List of all members
CRhinoDisplayPipeline::DrawInterruptItem Struct Reference
#include <RhinoSdkDisplayPipeline.h>
 Public Attributes
UINT  | m_nFrameStartTime
UINT  | m_nFrameTimeEstimate
Member Data Documentation
◆ m_nFrameStartTime
 UINT CRhinoDisplayPipeline::DrawInterruptItem::m_nFrameStartTime
◆ m_nFrameTimeEstimate
 UINT CRhinoDisplayPipeline::DrawInterruptItem::m_nFrameTimeEstimate