Public Attributes | List of all members
CRhinoPickContext_MeshEdgeInfo Struct Reference
Rhino
#include <rhinoSdkPick.h>
 Public Attributes
const int *  | m_edge_ci_map
int  | m_edge_ci_map_stride
int  | m_edge_count
int  | m_edge_stride
const int *  | m_edges
const int *  | m_vertex_ci_map
int  | m_vertex_ci_map_stride
Detailed Description
Copyright (c) 1993-2026 Robert McNeel & Associates. All rights reserved. Rhinoceros is a registered trademark of Robert McNeel & Associates.
THIS SOFTWARE IS PROVIDED "AS IS" WITHOUT EXPRESS OR IMPLIED WARRANTY. ALL IMPLIED WARRANTIES OF FITNESS FOR ANY PARTICULAR PURPOSE AND OF MERCHANTABILITY ARE HEREBY DISCLAIMED.
For complete Rhino SDK copyright information see http://www.rhino3d.com/developer.
Member Data Documentation
◆ m_edge_ci_map
 const int* CRhinoPickContext_MeshEdgeInfo::m_edge_ci_map
◆ m_edge_ci_map_stride
 int CRhinoPickContext_MeshEdgeInfo::m_edge_ci_map_stride
edge component index map If m_ci_map is null, then m_edges[] is in component index order. If m_ci_map is not null, then the meshtop_edge component index for the i-th edge is m_ci_map[i*m_ci_map_stride].
◆ m_edge_count
 int CRhinoPickContext_MeshEdgeInfo::m_edge_count
edge list The i-th edge connects mesh vertices m_V[vi0] and m_V[vi1], where vi0 = m_edges[i*m_edge_stride] and vi1 = m_edges[i*m_edge_stride+1].
◆ m_edge_stride
 int CRhinoPickContext_MeshEdgeInfo::m_edge_stride
◆ m_edges
 const int* CRhinoPickContext_MeshEdgeInfo::m_edges
◆ m_vertex_ci_map
 const int* CRhinoPickContext_MeshEdgeInfo::m_vertex_ci_map
◆ m_vertex_ci_map_stride
 int CRhinoPickContext_MeshEdgeInfo::m_vertex_ci_map_stride
vertext component index map m_vertex_ci_map[i*m_vertex_ci_map_stride] is the meshtop_vertex component index for the vertex ON_Mesh.m_V[i].