Public Attributes | List of all members
CRhinoWidgetGeometry::CSweep::CAngles Struct Reference
< In radians. More...
#include <rhinoSdkWidget.h>
 Public Attributes
double  | dHorzSweepEnd
End of 'horizontal sweep'. More...
double  | dHorzSweepSta
Start of 'horizontal sweep'. More...
double  | dVertSweepEnd
End of 'vertical sweep'. More...
double  | dVertSweepSta
Start of 'vertical sweep'. More...
Detailed Description
< In radians.
Member Data Documentation
◆ dHorzSweepEnd
 double CRhinoWidgetGeometry::CSweep::CAngles::dHorzSweepEnd
End of 'horizontal sweep'.
◆ dHorzSweepSta
 double CRhinoWidgetGeometry::CSweep::CAngles::dHorzSweepSta
Start of 'horizontal sweep'.
◆ dVertSweepEnd
 double CRhinoWidgetGeometry::CSweep::CAngles::dVertSweepEnd
End of 'vertical sweep'.
◆ dVertSweepSta
 double CRhinoWidgetGeometry::CSweep::CAngles::dVertSweepSta
Start of 'vertical sweep'.